{
    "ID": "C98-1097",
    "citations": [
        {
            "Number": 1,
            "refer_ID": "C98-1097",
            "refer_sids": [
                45
            ],
            "refer_text": "To automatically detect lexical cohesion tics between pairwise words, three linguistic features were considered: word repetition, collocation and relation weights.",
            "cite_ID": "C02-1033",
            "cite_maker_sids": [
                15
            ],
            "cite_sids": [
                15
            ],
            "cite_text": "Hybrid systems that combine the approaches we have presented were also developed and illustrated the interest of such a combination: (Jobbins and Evett, 1998) combined word recurrence, collocations and a thesaurus; (Beeferman et al., 1999) relied on both collocations and linguistic cues.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 2,
            "refer_ID": "C98-1097",
            "refer_sids": [
                115
            ],
            "refer_text": "Both word repetition in combination with collocation and all three features in combination also achieved a precision rate of 0.80 but attained a lower recall rate of 0.62.",
            "cite_ID": "C02-1033",
            "cite_maker_sids": [
                136
            ],
            "cite_sids": [
                136
            ],
            "cite_text": "Thus, Table 1 confirms the fact reported in (Jobbins and Evett, 1998) that using collocations together with word recurrence is an interesting approach for text segmentation.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 3,
            "refer_ID": "C98-1097",
            "refer_sids": [
                45
            ],
            "refer_text": "To automatically detect lexical cohesion tics between pairwise words, three linguistic features were considered: word repetition, collocation and relation weights.",
            "cite_ID": "ICDAR99",
            "cite_maker_sids": [
                31
            ],
            "cite_sids": [
                31,
                32
            ],
            "cite_text": "In earlier work [11] a text segmentation algorithm was described that captured all types of lexical cohesion ties.To automatically find ties between pairwise words three features were developed: word repetition, collocation and relation weights.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 4,
            "refer_ID": "C98-1097",
            "refer_sids": [
                45
            ],
            "refer_text": "To automatically detect lexical cohesion tics between pairwise words, three linguistic features were considered: word repetition, collocation and relation weights.",
            "cite_ID": "P07-1061",
            "cite_maker_sids": [
                17
            ],
            "cite_sids": [
                17
            ],
            "cite_text": "Hybrid systems that combine the approaches we have presented were also developed and illustrated the interest of such a combination: (Job- bins and Evett, 1998) combined word recurrence, co-occurrences and a thesaurus; (Beeferman et al., 1999) relied on both lexical modeling and discourse cues; (Galley et al., 2003) made use of word reiteration through lexical chains and discourse cues.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 5,
            "refer_ID": "C98-1097",
            "refer_sids": [
                20,
                45
            ],
            "refer_text": "Another approach extracted semantic information from Roget's Thesaurus (RT).To automatically detect lexical cohesion tics between pairwise words, three linguistic features were considered: word repetition, collocation and relation weights.",
            "cite_ID": "P07-1061",
            "cite_maker_sids": [
                30
            ],
            "cite_sids": [
                30,
                31,
                32
            ],
            "cite_text": "When no external knowledge is used, this similarity is only based on the strict reiteration of words.But it can be enhanced by taking into account semantic relations between words.This was done for instance in (Jobbins and Evett, 1998) by taking semantic relations from Rogets Thesaurus.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 6,
            "refer_ID": "C98-1097",
            "refer_sids": [
                41,
                47,
                50
            ],
            "refer_text": "Reiteration is subdivided into four cohesive effects: word repetition (e.g. ascent and ascent), synonym (e.g. ascent and climb) which includes near-synonym and hyponym, superordinate (e.g. ascent and task) and general word (e.g. ascent and thing).Word repetition is a component of the lexical cohesion class of reiteration, and collocation is a lexical cohesion class in its entirety.Word repetition: Word repetition ties in lexical cohesion are identified by same word matches and matches on inflections derived from the same stem.",
            "cite_ID": "P07-1061",
            "cite_maker_sids": [
                90
            ],
            "cite_sids": [
                89,
                90
            ],
            "cite_text": "The cohesion in the part of text delimited by this window is evaluated by measuring the word reiteration between its two sides.This is done in our case by applying the Dice coefficient between the two sides of the focus window, following (Jobbins and Evett, 1998).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 7,
            "refer_ID": "C98-1097",
            "refer_sids": [
                123,
                124,
                125
            ],
            "refer_text": "The combination of features word repetition and relation weights produced the best precision and recall rates of 0.80 and 0.69.When used in isolation, the performance of each feature was inferior to a combined approach.This fact provides evidence that different lexical relations are detected by each linguistic feature considered.",
            "cite_ID": "P07-1061",
            "cite_maker_sids": [
                98
            ],
            "cite_sids": [
                97,
                98
            ],
            "cite_text": "This evaluation is also a weak point as card(Wl  Wr ) only relies on word reiteration.As a consequence, two different words that respectively belongs to Wl and Wr but also belong to the same text topic cannot contribute l r to the identification of a possible topical similarity This measure was adopted instead of the Cosine measure used in TextTiling because its definition in terms of sets makes it easier to extend for taking into account other types of relations, as in (Jobbins and Evett, 1998).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 8,
            "refer_ID": "C98-1097",
            "refer_sids": [
                45
            ],
            "refer_text": "To automatically detect lexical cohesion tics between pairwise words, three linguistic features were considered: word repetition, collocation and relation weights.",
            "cite_ID": "P07-1061",
            "cite_maker_sids": [
                203
            ],
            "cite_sids": [
                203,
                204
            ],
            "cite_text": "In fact, the way we use relations between words is closer to (Jobbins and Evett, 1998), even if the relations in this work come from a network of co-occurrences or a thesaurus rather than from text topics.In both cases the similarity of two text units is determined by the proportion of their words that are part of a relation across the two units.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 9,
            "refer_ID": "C98-1097",
            "refer_sids": [
                62
            ],
            "refer_text": "The proposed segmentation algorithm compares adjacent windows of sentences and determines their lexical similarity.",
            "cite_ID": "P07-1061",
            "cite_maker_sids": [
                216
            ],
            "cite_sids": [
                216
            ],
            "cite_text": "This network could also be used more directly for topic segmentation as in (Job- bins and Evett, 1998).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 10,
            "refer_ID": "C98-1097",
            "refer_sids": [
                45
            ],
            "refer_text": "To automatically detect lexical cohesion tics between pairwise words, three linguistic features were considered: word repetition, collocation and relation weights.",
            "cite_ID": "P04470",
            "cite_maker_sids": [
                27
            ],
            "cite_sids": [
                27
            ],
            "cite_text": "In other words, meaning of UW can be found generally through co- occurrence words [5].",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 11,
            "refer_ID": "C98-1097",
            "refer_sids": [
                7,
                8
            ],
            "refer_text": "The Wall Street Journal archives, for example, consist of a series of articles about different subject areas.Segmenting such data into distinct topics is useful for information retrieval, where only those segments relevant to a user's query can be retrieved.",
            "cite_ID": "P06128",
            "cite_maker_sids": [
                10
            ],
            "cite_sids": [
                10
            ],
            "cite_text": "In information retrieval, to segment a long document into distinct topics is useful because only the topical segments relevant to the users needs are retrieved [1].",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 12,
            "refer_ID": "C98-1097",
            "refer_sids": [
                36,
                37
            ],
            "refer_text": "Lexical cohesion is expressed through the vocabulary used in text and the semantic relations between those words.Identifying semantic relations in a text can be a useful indicator of its conceptual structure.",
            "cite_ID": "S0885",
            "cite_maker_sids": [
                110
            ],
            "cite_sids": [
                109,
                110
            ],
            "cite_text": "Indeed, the primary goal of semantic relations is obviously to ensure that two semantically related words, e.g., car and drive, contribute to the lexical cohesion, thus avoiding erroneous topic boundaries between two such words.These different methods can use semantic relations that are manually defined by experts, as in Morris and Hirst (1991), or extracted automatically from corpora (Ferret, 2006; Jobbins and Evett, 1998).",
            "label": [
                "Method_Citation"
            ]
        }
    ]
}