{
    "ID": "H89-2014",
    "citations": [
        {
            "Number": 1,
            "refer_ID": "H89-2014",
            "refer_sids": [
                27
            ],
            "refer_text": "The work described here also makes use of a hidden Markov model.",
            "cite_ID": "W93-0111",
            "cite_maker_sids": [
                178
            ],
            "cite_sids": [
                178
            ],
            "cite_text": "This approach is similar in spirit to the iterative computational approaches of the Hidden Markov Models (Kupiec, 1989",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 2,
            "refer_ID": "H89-2014",
            "refer_sids": [
                124,
                125
            ],
            "refer_text": "A model containing all of the refinements described, was tested using a magazine article containing 146 sentences (3,822 words).A 30,000 word dictionary was used, supplemented by inflectional analysis for words not found directly in the dictionary.",
            "cite_ID": "A92-1018",
            "cite_maker_sids": [
                47
            ],
            "cite_sids": [
                47
            ],
            "cite_text": "In [Kupiec, 1989a], networks are used to selectively augment the context in a basic first- order model, rather than using uniformly second-order dependencies.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 3,
            "refer_ID": "H89-2014",
            "refer_sids": [
                87,
                88,
                89
            ],
            "refer_text": "An alternative to uniformly increasing the order of the conditioning is to extend it selectively.Mixed higher- order context can be modeled by introducing explicit state sequences.In the arrangement the basic first-order network remains, permitting all possible category sequences, and modeling first-order dependency.",
            "cite_ID": "A92-1018",
            "cite_maker_sids": [
                108
            ],
            "cite_sids": [
                108
            ],
            "cite_text": "adequate training requires processing from tens of thousands to hundreds of thousands of tokens [Kupiec, 1989a].",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 4,
            "refer_ID": "H89-2014",
            "refer_sids": [
                1
            ],
            "refer_text": "The paper describes refinements that are currently being investigated in a model for part-of-speech assignment to words in unrestricted text.",
            "cite_ID": "J93-2006",
            "cite_maker_sids": [
                41
            ],
            "cite_sids": [
                40,
                41
            ],
            "cite_text": "We report in Section 2 on our experiments on the assignment of part of speech to words in text.The effectiveness of such models is well known (DeRose 1988; Church 1988; Kupiec 1989; Jelinek 1985)",
            "label": [
                "Aim_Citation"
            ]
        },
        {
            "Number": 5,
            "refer_ID": "H89-2014",
            "refer_sids": [
                88,
                90
            ],
            "refer_text": "Mixed higher- order context can be modeled by introducing explicit state sequences.The basic network is then augmented with the extra state sequences which model certain category sequences in more detail.",
            "cite_ID": "H91-1046",
            "cite_maker_sids": [
                21
            ],
            "cite_sids": [
                21
            ],
            "cite_text": "Kupiec (1989) has experimented with the inclusion of networks to model mixed-order dependencies.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 6,
            "refer_ID": "H89-2014",
            "refer_sids": [
                29,
                30
            ],
            "refer_text": "In this regard, word equivalence classes were used (Kupiec, 1989).There it is assumed that the distribution of the use of a word depends on the set of categories it can assume, and words are partitioned accordingly.",
            "cite_ID": "H91-1046",
            "cite_maker_sids": [
                60
            ],
            "cite_sids": [
                60
            ],
            "cite_text": "The vocabulary entry may be a word or an equivalence class based on categories (Kupiec, 1989).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 7,
            "refer_ID": "H89-2014",
            "refer_sids": [
                69,
                70
            ],
            "refer_text": "In a ranked list of words in the corpus the most frequent 100 words account for approximately 50% of the total tokens in the corpus, and thus data is available to estimate them reliably.The most frequent 100 words of the corpus were assigned individually in the model, thereby enabling them to have different distributions over their categories.",
            "cite_ID": "C00-1081",
            "cite_maker_sids": [
                85
            ],
            "cite_sids": [
                85
            ],
            "cite_text": "In a practical tagger (Kupiec, 1989), only the most frequent 100 words are lexicalized.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 8,
            "refer_ID": "H89-2014",
            "refer_sids": [
                2
            ],
            "refer_text": "The model has the advantage that a pre-tagged training corpus is not required.",
            "cite_ID": "H92-1022",
            "cite_maker_sids": [
                18
            ],
            "cite_sids": [
                18
            ],
            "cite_text": "The parameters of the model can be estimated from tagged (1, 3, 4, 6, 12] or untagged [2, 9, 11] text.",
            "label": [
                "Implication_Citation"
            ]
        },
        {
            "Number": 9,
            "refer_ID": "H89-2014",
            "refer_sids": [
                145
            ],
            "refer_text": "A stochastic method for assigning part-of-speech categories to unrestricted English text has been described.",
            "cite_ID": "H92-1022",
            "cite_maker_sids": [
                9
            ],
            "cite_sids": [
                9
            ],
            "cite_text": "One area in which the statistical approach has done par­ ticularly well is automatic part of speech tagging, as­ signing each word in an input sentence its proper part of speech (1, 2, 3, 4, 6, 9, 11, 12].",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 10,
            "refer_ID": "H89-2014",
            "refer_sids": [
                29,
                30
            ],
            "refer_text": "In this regard, word equivalence classes were used (Kupiec, 1989).There it is assumed that the distribution of the use of a word depends on the set of categories it can assume, and words are partitioned accordingly.",
            "cite_ID": "C92-1060",
            "cite_maker_sids": [
                124
            ],
            "cite_sids": [
                124
            ],
            "cite_text": "Instead, only common words are represented individually; the rest of the words in the dictionary are partitioned into word equivalence classes (Kupiec, 1989)",
            "label": [
                "Method_Citation"
            ]
        }
    ]
}