{
    "ID": "W03-0410",
    "citations": [
        {
            "Number": 1,
            "refer_ID": "W03-0410",
            "refer_sids": [
                11
            ],
            "refer_text": "We focus here on extending the applicability of unsupervised methods, as in (Schulte im Walde and Brew, 2002; Stevenson and Merlo, 1999), to the lexical semantic classification of verbs.",
            "cite_ID": "D07-1018",
            "cite_maker_sids": [
                9
            ],
            "cite_sids": [
                9
            ],
            "cite_text": "Stevenson and Joanis, 2003 for English semantic verb classes",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 2,
            "refer_ID": "W03-0410",
            "refer_sids": [
                15
            ],
            "refer_text": "Development of minimally supervised methods is of particular importance if we are to automatically classify verbs for languages other than English, where substantial amounts of labelled data are not available for training classifiers.",
            "cite_ID": "D09-1138",
            "cite_maker_sids": [
                25
            ],
            "cite_sids": [
                25
            ],
            "cite_text": "Supervised methods for automatic verb classification have been extensively investigated (Stevenson et al., 1999; Stevenson and Merlo, 1999; Merlo and Stevenson, 2001; Stevenson and Joanis, 2003; Joanis and Stevenson, 2003; Joanis et al., 2008).",
            "label": [
                "Implication_Citation"
            ]
        },
        {
            "Number": 3,
            "refer_ID": "W03-0410",
            "refer_sids": [
                17
            ],
            "refer_text": "We have previously shown that a broad set of 220 noisy features performs well in supervised verb classification (Joanis and Stevenson, 2003).",
            "cite_ID": "D09-1138",
            "cite_maker_sids": [
                70
            ],
            "cite_sids": [
                70
            ],
            "cite_text": "The present work inherits the spirit of the supervised approaches to verb classification (Stevenson et al., 1999; Stevenson and Merlo, 1999; Merlo and Stevenson, 2001; Stevenson and Joanis, 2003; Joanis and Stevenson, 2003; Joanis et al., 2008).",
            "label": [
                "Results_Citation"
            ]
        },
        {
            "Number": 4,
            "refer_ID": "W03-0410",
            "refer_sids": [
                131
            ],
            "refer_text": "We used the hierarchical clustering command in Matlab, which implements bottom-up agglomerative clustering, for all our unsupervised experiments.",
            "cite_ID": "D11-1095",
            "cite_maker_sids": [
                17
            ],
            "cite_sids": [
                17
            ],
            "cite_text": "We adopt as our baseline method a well-known hierarchical method – agglomerative clustering (AGG) – which has been previously used to acquire flat Levin-style classifications (Stevenson and Joanis, 2003)",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 5,
            "refer_ID": "W03-0410",
            "refer_sids": [
                34
            ],
            "refer_text": "Like others, we have assumed lexical semantic classes of verbs as defined in Levin (1993) (hereafter Levin), which have served as a gold standard in computational linguistics research",
            "cite_ID": "D11-1095",
            "cite_maker_sids": [
                38
            ],
            "cite_sids": [
                38
            ],
            "cite_text": "We used three gold standards (and corresponding test sets) extracted from these resources in our experiments: T1: The first gold standard is a flat gold standard which includes 13 classes appearing in Levin’s original taxonomy (Stevenson and Joanis, 2003).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 6,
            "refer_ID": "W03-0410",
            "refer_sids": [
                123
            ],
            "refer_text": "All experiments reported here were run on this same final set of 20 verbs per class (including a replication of our earlier supervised experiments).",
            "cite_ID": "D11-1095",
            "cite_maker_sids": [
                40
            ],
            "cite_sids": [
                40
            ],
            "cite_text": "Following Stevenson and Joanis (2003), we selected 20 verbs from each class which occur at least 100 times in our corpus.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 7,
            "refer_ID": "W03-0410",
            "refer_sids": [
                34,
                117
            ],
            "refer_text": "Like others, we have assumed lexical semantic classes of verbs as defined in Levin (1993) (hereafter Levin), which have served as a gold standard in computational linguistics researchWe started with a list of all the verbs in the given classes from Levin, removing any verb that did not occur at least 100 times in our corpus (the BNC, described below).",
            "cite_ID": "D11-1095",
            "cite_maker_sids": [
                54
            ],
            "cite_sids": [
                54
            ],
            "cite_text": "Previous works on Levin style verb classification have investigated optimal features for this task (Stevenson and Joanis, 2003; Li and Brew, 2008; Sun and Korhonen, 2009)).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 8,
            "refer_ID": "W03-0410",
            "refer_sids": [
                137
            ],
            "refer_text": "In the experiments here, however, we report only results for , since we found no principled way of automatically determining a good cutoff.",
            "cite_ID": "D11-1095",
            "cite_maker_sids": [
                82
            ],
            "cite_sids": [
                82,
                83
            ],
            "cite_text": "Although they can be removed using a cut-based method, this requires a predefined cutoff value which is difficult to set (Stevenson and Joanis, 2003).In addition, a significant amount of information is lost in pairwise clustering.",
            "label": [
                "Implication_Citation"
            ]
        },
        {
            "Number": 9,
            "refer_ID": "W03-0410",
            "refer_sids": [
                27
            ],
            "refer_text": "In this paper, we report results on several feature selection approaches to the problem: manual selection (based on linguistic knowledge), unsupervised selection (based on an entropy measure among the features, Dash et al., 1997), and a semi- supervised approach (in which seed verbs are used to train a supervised learner, from which we extract the useful features).",
            "cite_ID": "D11-1095",
            "cite_maker_sids": [
                167
            ],
            "cite_sids": [
                167
            ],
            "cite_text": "Table 1: Comparison against Stevenson and Joanis (2003)’s result on T1 (using similar features).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 10,
            "refer_ID": "W03-0410",
            "refer_sids": [
                28
            ],
            "refer_text": "Although our motivation is verb class discovery, we perform our experiments on English, for which we have an accepted classification to serve as a gold standard (Levin, 1993).",
            "cite_ID": "D11-1095",
            "cite_maker_sids": [
                168
            ],
            "cite_sids": [
                168
            ],
            "cite_text": "Table 1 shows our results and the results of Stevenson and Joanis (2003) on T1 when employing AGG using Ward as the linkage criterion.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 11,
            "refer_ID": "W03-0410",
            "refer_sids": [
                114
            ],
            "refer_text": "7 5 0 Table 1: Verb classes (see Section 3.1), their Levin class numbers, and the number of experimental verbs in each (see Section 3.2).",
            "cite_ID": "D11-1095",
            "cite_maker_sids": [
                169
            ],
            "cite_sids": [
                169
            ],
            "cite_text": "In this experiment, we used the same feature set as Stevenson and Joanis (2003) (set B, see section 3.1) and were therefore able to reproduce their AGG result with a difference smaller than 2%.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 12,
            "refer_ID": "W03-0410",
            "refer_sids": [
                144
            ],
            "refer_text": "Then accuracy has the standard definition:2 2 is equivalent to the weighted mean precision of the clusters, weighted according to cluster size.",
            "cite_ID": "J06-2001",
            "cite_maker_sids": [
                397
            ],
            "cite_sids": [
                397
            ],
            "cite_text": "For example, the accuracy/purity measure (Stevenson and Joanis 2003; Korhonen, Krymolowski, and Marx 2003) evaluates whether a verb is assigned to a correct cluster with respect to the gold standard class of the majority of cluster members.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 13,
            "refer_ID": "W03-0410",
            "refer_sids": [
                117,
                229,
                230
            ],
            "refer_text": "We started with a list of all the verbs in the given classes from Levin, removing any verb that did not occur at least 100 times in our corpus (the BNC, described below).This feature selection method is highly successful, outperforming the full feature set (Full) on and on most tasks, and performing the same or very close on the remainder.Moreover, the seed set of features outperforms the manually selected set (Ling) on over half the tasks.",
            "cite_ID": "J06-2001",
            "cite_maker_sids": [
                586
            ],
            "cite_sids": [
                586,
                587,
                588,
                589
            ],
            "cite_text": "In recent work, Stevenson and Joanis (2003) compared their supervised method for verb classification with semisupervised and unsupervised techniques.In these experiments, they enlarged the number of gold standard English verb classes to 14 classes related to Levin classes, with a total of 841 verbs.Low- frequency and ambiguous verbs were excluded from the classes.They found that a semisupervised approach where the classifier was trained with five seed verbs from each verb class outperformed both a manual selection of features and the unsupervised 186 approach of Dash, Liu, and Yao (1997), which used an entropy measure to organize data into a multidimensional space.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 15,
            "refer_ID": "W03-0410",
            "refer_sids": [
                144,
                157
            ],
            "refer_text": "Then accuracy has the standard definition:2 2 is equivalent to the weighted mean precision of the clusters, weighted according to cluster size.4.2.3 Mean Silhouette gives an average of the individual goodness of the clusters, and a measure of the overall goodness, both with respect to the gold standard classes.",
            "cite_ID": "P03-1009",
            "cite_maker_sids": [
                124
            ],
            "cite_sids": [
                124
            ],
            "cite_text": "Our second measure is derived from purity, a global measure which evaluates the mean precision of the clusters, weighted according to the cluster size (Stevenson and Joanis, 2003).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 16,
            "refer_ID": "W03-0410",
            "refer_sids": [
                195
            ],
            "refer_text": "All 13 Classes .58 .19 .29 .31 .29 .07 .08 .09 .05 .12 .16 Mean of multiway .67 .23 .30 .36 .38 .07 .10 .11 .08 .19 .23 Table 2: Experimental Results.",
            "cite_ID": "P03-1009",
            "cite_maker_sids": [
                143
            ],
            "cite_sids": [
                143
            ],
            "cite_text": "For example, Stevenson and Joanis (2003) report an accuracy of 29% (which implies mP U R ≤ 29%), but their task involves classifying 841 verbs to 14 classes based on differences in the predicate-argument structure.",
            "label": [
                "Results_Citation"
            ]
        },
        {
            "Number": 17,
            "refer_ID": "W03-0410",
            "refer_sids": [
                11
            ],
            "refer_text": "We focus here on extending the applicability of unsupervised methods, as in (Schulte im Walde and Brew, 2002; Stevenson and Merlo, 1999), to the lexical semantic classification of verbs.",
            "cite_ID": "P04-2007",
            "cite_maker_sids": [
                11
            ],
            "cite_sids": [
                11
            ],
            "cite_text": "For this reason, various methods for automatically classifying verbs using machine learning techniques have been attempted ((Merlo and Stevenson, 2001), (Stevenson and Joanis, 2003), (Schulte im Walde, 2003)).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 20,
            "refer_ID": "W03-0410",
            "refer_sids": [
                23
            ],
            "refer_text": "In an unsupervised (clustering) scenario of verb class discovery, can we maintain the benefit of only needing noisy features, without the generality of the feature space leading to “the curse of dimensionality”?",
            "cite_ID": "P07-3016",
            "cite_maker_sids": [
                39
            ],
            "cite_sids": [
                39
            ],
            "cite_text": "(Stevenson and Joanis, 2003) investigate the applicability of this general feature space to unsupervised verb clustering tasks.",
            "label": [
                "Hypothesis_Citation"
            ]
        },
        {
            "Number": 21,
            "refer_ID": "W03-0410",
            "refer_sids": [
                261
            ],
            "refer_text": "We have explored manual, unsupervised, and semi- supervised methods for feature selection in a clustering approach for verb class discovery.",
            "cite_ID": "W06-2910",
            "cite_maker_sids": [
                8
            ],
            "cite_sids": [
                7,
                8
            ],
            "cite_text": "As an alternative to the resource-intensive manual classifications, automatic methods such as classification and clustering are applied to induce verb classes from corpus data, e.g.(Merlo and Stevenson, 2001; Joanis and Stevenson, 2003; Korhonen et al., 2003; Stevenson and Joanis, 2003; Schulte im Walde, 2003; Fer- rer, 2004).",
            "label": [
                "Method_Citation",
                "Aim_Citation"
            ]
        },
        {
            "Number": 22,
            "refer_ID": "W03-0410",
            "refer_sids": [
                35,
                254
            ],
            "refer_text": "Levin’s classes form a hierarchy of verb groupings with shared meaning and syntax.Our feature set is essentially a generalization of theirs, but in scaling up the feature space to be useful across English verb classes in general, we necessarily face a dimensionality problem that did not arise in their research.",
            "cite_ID": "W06-2910",
            "cite_maker_sids": [
                13
            ],
            "cite_sids": [
                13
            ],
            "cite_text": "In larger-scale classifications such as (Korhonen et al., 2003; Stevenson and Joanis, 2003; Schulte im Walde, 2003), which model verb classes with similarity at the syntax-semantics interface, it is not clear which features are the most salient.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 23,
            "refer_ID": "W03-0410",
            "refer_sids": [
                144
            ],
            "refer_text": "Then accuracy has the standard definition:2 2 is equivalent to the weighted mean precision of the clusters, weighted according to cluster size.",
            "cite_ID": "W06-2910",
            "cite_maker_sids": [
                118
            ],
            "cite_sids": [
                118,
                119
            ],
            "cite_text": "For the evaluation of the clustering results, we calculated the accuracy of the clusters, a cluster similarity measure that has been applied before, cf.(Stevenson and Joanis, 2003; Korhonen et al., 2003)",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 24,
            "refer_ID": "W03-0410",
            "refer_sids": [
                17
            ],
            "refer_text": "We have previously shown that a broad set of 220 noisy features performs well in supervised verb classification (Joanis and Stevenson, 2003).",
            "cite_ID": "E09-1072",
            "cite_maker_sids": [
                80
            ],
            "cite_sids": [
                80
            ],
            "cite_text": "Following a strategy in line with work on verb classification (Merlo and Stevenson, 2001; Stevenson and Joanis, 2003), we set out to classify common noun lemmas based on their morphosyntactic distribution in a considerably larger corpus.",
            "label": [
                "Results_Citation"
            ]
        }
    ]
}