{
    "ID": "W11-0815",
    "citations": [
        {
            "Number": 1,
            "refer_ID": "W11-0815",
            "refer_sids": [
                217
            ],
            "refer_text": "This work consists in investigating the impact of Multiword Expressions on applications, focusing on compound nouns in Information Retrieval systems, and whether a more adequate treatment for these expressions can bring possible improvements in the indexing these expressions.",
            "cite_ID": "D13-1060",
            "cite_maker_sids": [
                7
            ],
            "cite_sids": [
                7
            ],
            "cite_text": "The task of identifying MWEs is relevant not only to lexical semantics applications, but also machine translation (Koehn et al., 2003; Ren et al., 2009; Pal et al., 2010), information retrieval (Xu et al., 2010; Acosta et al., 2011), and syntactic parsing (Sag et al., 2002).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 2,
            "refer_ID": "W11-0815",
            "refer_sids": [
                18
            ],
            "refer_text": "The selection of appropriate indexing terms is a key factor for the quality of IR systems.",
            "cite_ID": "P09207_w11",
            "cite_maker_sids": [
                625,
                626
            ],
            "cite_sids": [
                625,
                626
            ],
            "cite_text": "Joining the words of MWEs before indexation is a simple idea that was put in practice by Acosta et al. (2011).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 3,
            "refer_ID": "W11-0815",
            "refer_sids": [
                1
            ],
            "refer_text": "The extensive use of Multiword Expressions (MWE) in natural language texts prompts more detailed studies that aim for a more adequate treatment of these expressions.",
            "cite_ID": "Pproc9_w11",
            "cite_maker_sids": [
                15,
                16
            ],
            "cite_sids": [
                15,
                16
            ],
            "cite_text": "Our research in compositionality is motivated by the hypothesis that a special treatment of se­ mantically non-compositional expressions can im­ prove results in various Natural Language Process­ ing (NPL) tasks, as shown for example by Acosta et al. (2011), who utilized MWEs in Information Re­ trieval (IR).",
            "label": [
                "Method_CItation"
            ]
        },
        {
            "Number": 4,
            "refer_ID": "W11-0815",
            "refer_sids": [
                47
            ],
            "refer_text": "This task aimed to explore the contribution of the disambiguation of words to bilingual or monolingual IR.",
            "cite_ID": "Pproc14_w11",
            "cite_maker_sids": [
                16,
                17,
                18,
                19
            ],
            "cite_sids": [
                16,
                17,
                18,
                19
            ],
            "cite_text": "As an example, Carpuat and Diab (2010) proposed two strategies for integrating MWEs into statisti­ cal machine translation. They show that even a large scale bilingual corpus cannot capture all the necessary information to translate MWEs, and that in adding the facility to model the compositional­ ity ofMWEs into their system, they could improve translation quality. Acosta et al. (2011) showed that treating non-compositional MWEs as a sin­ gle unit in information retrieval improves retrieval effectiveness.",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 5,
            "refer_ID": "W11-0815",
            "refer_sids": [
                6
            ],
            "refer_text": "One of the motivations of this work is to investigate if the identification and appropriate treatment of Multiword Expressions (MWEs) in an application contributes to improve results and ultimately lead to more precise man-machine interaction.",
            "cite_ID": "S13-1039",
            "cite_maker_sids": [
                5
            ],
            "cite_sids": [
                5
            ],
            "cite_text": "Investigating the degree of MWE compositionality has been shown to have applications in information retrieval and machine translation (Acosta et al., 2011; Venkatapathy and Joshi, 2006).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 6,
            "refer_ID": "W11-0815",
            "refer_sids": [
                21
            ],
            "refer_text": "For example, if the query was pop star meaning celebrity, and the terms were indexed individually, the relevant documents may not be retrieved and the system would 101 Proceedings of the Workshop on Multiword Expressions: from Parsing and Generation to the Real World (MWE 2011), pages 101109, Portland, Oregon, USA, 23 June 2011.",
            "cite_ID": "W12-3311",
            "cite_maker_sids": [
                31
            ],
            "cite_sids": [
                31
            ],
            "cite_text": " Information retrieval: when MWEs like pop star are indexed as a unit, the accuracy of the system improves on multiword queries (Acosta et al., 2011).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 7,
            "refer_ID": "W11-0815",
            "refer_sids": [
                15
            ],
            "refer_text": "In this paper, we perform an application-oriented evaluation of the inclusion of MWE treatment into an Information Retrieval (IR) system.",
            "cite_ID": "W13-1006",
            "cite_maker_sids": [
                15,
                16
            ],
            "cite_sids": [
                15,
                16
            ],
            "cite_text": "Our research in compositionality is motivated by the hypothesis that a special treatment of semantically non-compositional expressions can improve results in various Natural Language Processing (NPL) tasks, as shown for example by Acosta et al. (2011), who utilized MWEs in Information Retrieval (IR).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 8,
            "refer_ID": "W11-0815",
            "refer_sids": [
                17
            ],
            "refer_text": "Although language processing is not vital to modern IR systems, it may be convenient (Sparck Jones, 1997) and in this scenario, NLP techniques may contribute in the selection of MWEs for indexing as single units in the IR system.",
            "cite_ID": "W13-3208",
            "cite_maker_sids": [
                16
            ],
            "cite_sids": [
                16
            ],
            "cite_text": "Biemanns idea and motivation is that non- compositional expressions could be treated as single units in many NLP applications such as Information Retrieval (Acosta et al., 2011) or Machine Translation (Carpuat and Diab, 2010).",
            "label": [
                "Result_Citation"
            ]
        },
        {
            "Number": 9,
            "refer_ID": "W11-0815",
            "refer_sids": [
                30
            ],
            "refer_text": "The automatic discovery of specific types of MWEs has attracted the attention of many researchers in NLP over the past years.",
            "cite_ID": "W15-0909",
            "cite_maker_sids": [
                4,
                5,
                6
            ],
            "cite_sids": [
                4,
                5,
                6
            ],
            "cite_text": "(2002), Baldwin and Kim (2009)) has been shown to be useful in various NLP applications (Ramisch, 2012), recent work has shown that automatic prediction of the degree of compositionality of MWEs also has utility, in applications including information retrieval (“IR”: Acosta et al. (2011)) and machine translation (“MT”: Weller et al. (2014), Carpuat and Diab (2010) and Venkatapathy and Joshi (2006)).",
            "label": [
                "Method_Citation"
            ]
        },
        {
            "Number": 10,
            "refer_ID": "W11-0815",
            "refer_sids": [
                62,
                64
            ],
            "refer_text": "We used Zettair to generate the ranked list of documents retrieved in response to each query.We used the cosine metric to calculate the scores and rank the documents.",
            "cite_ID": "W15-0909",
            "cite_maker_sids": [
                7,
                8
            ],
            "cite_sids": [
                7,
                8
            ],
            "cite_text": "For instance, Acosta et al.(2011) showed that by considering non-compositional MWEs as a single unit, the effectiveness of document ranking in an IR system improves, and Carpuat and Diab (2010) showed that by adding compositionality scores to the Moses SMT system (Koehn et al., 2007), they could improve translation quality.",
            "label": [
                "Result_Citation"
            ]
        }
    ]
}