{
    "ID": "A00-2034",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We propose a method for identifying diathesis alter­ nations where a particular argument type is seen in slots which have different grammatical roles in the alternating forms.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The method uses selectional pref­ erences acquired as probability distributions over WordNet.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preferences for the target slots are com­ pared using a measure of distributional similarity.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The method is evaluated on the causative and cona­ tive alternations, but is generally applicable and does not require a priori knowledge specific to the alternation.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Diathesis alternations are alternate ways in which the arguments of a verb are expressed syntactically.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The syntactic changes are sometimes accompanied by slight changes in the meaning of the verb.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An ex­ ample of the causative alternation is given in (1) be­ low.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this alternation, the object of the transitive variant can also appear as the subject of the intransi­ tive variant.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the conative alternation, the transi­ tive form alternates with a prepositional phrase con­ struction involving either at or on.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of the conative alternation is given in (2).",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The boy broke the window ......",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The window.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "broke.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the boy pulled at the rope ...... the boy pulled. ",
            "number": "2",
            "sents": [
                {
                    "text": "the rope.",
                    "sid": 15,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We refer to alternations where a particular seman­ tic role appears in different grammatical roles in al­ ternate realisations as \"role switching alternations\" (RsAs).",
                    "sid": 16,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is these alternations that our method ap­ plies to.",
                    "sid": 17,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently, there has been interest in corpus-based methods to identify alternations (McCarthy and Ko­ rhonen, 1998; Lapata, 1999), and associated verb classifications (Stevenson and Merlo, 1999).",
                    "sid": 18,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These have either relied on a priori knowledge specified for the alternations in advance, or are not suitable for a wide range of alternations.",
                    "sid": 19,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fully automatic method outlined here is applied to the causative and conative alternations, but is applicable to other RSAS.",
                    "sid": 20,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Motivation.",
                    "sid": 21,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Diathesis alternations have been proposed for a number of NLP tasks.",
                    "sid": 22,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several researchers have sug­ gested using them for improving lexical acquisition.",
                    "sid": 23,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Korhonen (1997) uses them in subcategorization frame (scF) acquisition to improve the performance of a statistical filter which determines whether a SCF observed for a particular verb is genuine or not.",
                    "sid": 24,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They have also been suggested for the recovery of predicate argument structure, necessary for SCF ac­ quisition (Briscoe and Carroll, 1997; Boguraev and Briscoe, 1987).",
                    "sid": 25,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And Ribas (1995) showed that selec­ tional preferences acquired using alternations per­ formed better on a word sense disambiguation task compared to preferences acquired without alterna­ tions.",
                    "sid": 26,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He used alternations to indicate where the argument head data.from different slots can be com­ bined since it occupies the same semantic relation­ ship with the predicate.",
                    "sid": 27,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different diathesis alternations give different em­ phasis and nuances of meaning to the same basic content.",
                    "sid": 28,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These subtle changes of meaning are impor­ tant in natural language generation (Stede, 1998).",
                    "sid": 29,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alternations provide a means of reducing redun­ dancy in the lexicon since the alternating SCFs need not be enumerated for each individual verb if a marker is used to specify which verbs the alterna­ tion applies to.",
                    "sid": 30,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alternations also provide a means of generalizing patterns of behaviour over groups of verbs, typically the group members are semantically related.",
                    "sid": 31,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Levin (1993) provides a classification of over 3000 verbs according to their participation in alter­ nations involving NP and PP constituents.",
                    "sid": 32,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Levin's classification is not intended to be exhaustive.",
                    "sid": 33,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Au­ tomatic identification of alternations would be a use­ ful tool for extending the classification with new participants.",
                    "sid": 34,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Levin's taxonomy might also be used alongside observed behaviour, to predict unseen be­ haviour.",
                    "sid": 35,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Levin's classification has been extended by other NLP researchers (Dorr and Jones, 1996; Dang et al., <Root> TCM war car migration meal drum time ceremonial migration week month afternoon s p e e c h y e l l i n g Figure 1: TCM for the object slot of the transitive frame of start.",
                    "sid": 36,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1998).",
                    "sid": 37,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dang et al.",
                    "sid": 38,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1998) modify it by adding new classes which remove the overlap between classes from the original scheme.",
                    "sid": 39,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dorr and Jones (1996) extend the classification by using grammatical in­ formation in LDOCE alongside semantic information in WordNet.",
                    "sid": 40,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What is missing is a way of classifying verbs when the relevant information is not available in a manmade resource.",
                    "sid": 41,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using corpora bypasses reliance on the availability and adequacy of MRDs.",
                    "sid": 42,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, the frequency information in corpora is helpful for estimating alternation productivity (La­ pata, 1999).",
                    "sid": 43,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Estimations of productivity have been suggested for controlling the application of alterna­ tions (Briscoe and Copestake, 1996).",
                    "sid": 44,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose a method to acquire knowledge of alternation partic­ ipation directly from corpora, with frequency infor­ mation available as a byproduct.",
                    "sid": 45,
                    "ssid": 31,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "method. ",
            "number": "3",
            "sents": [
                {
                    "text": "We use both syntactic and semantic information for identifying participants in RSAs.",
                    "sid": 46,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Firstly, syntactic processing is used to find candidates taking the alter­ nating SCFs.",
                    "sid": 47,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondly, selectional preference models are acquired for the argument heads associated with a specific slot in a specific SCF of a verb.",
                    "sid": 48,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the SCF acquisition system of Briscoe and Carroll (1997), with a probabilistic LR parser (Inui et al., 1997) for syntactic processing.",
                    "sid": 49,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus data is POS tagged and lemmatised before the LR parser is applied.",
                    "sid": 50,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subcategorization patterns are extracted from the parses, these include both the syntactic cat­ egories and the argument heads of the constituents.",
                    "sid": 51,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These subcategorization patterns are then classified according to a set of 161 SCF classes.",
                    "sid": 52,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The SCF en­ tries for each verb are then subjected to a statistical filter which removes SCFs that have occurred with a frequency less than would be expected by chance.",
                    "sid": 53,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting SCF lexicon lists each verb with the SCFs it takes.",
                    "sid": 54,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each SCF entry includes a frequency count and lists the argument heads at all slots.",
                    "sid": 55,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Selectional preferences are automatically acquired for the slots involved in the role switching.",
                    "sid": 56,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We refer to these as the target slots.",
                    "sid": 57,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the causative al­ ternation, the slots are the direct object slot of the transitive SCF and the subject slot of the intransi­ tive.",
                    "sid": 58,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the conative, the slots are the direct object of the transitive and the PP of the np v pp SCF.",
                    "sid": 59,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Selectional preferences are acquired using the method devised by Li and Abe (1995).",
                    "sid": 60,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pref­ erences for a slot are represented as a tree cut model (TcM).",
                    "sid": 61,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a set of disjoint classes that partition the leaves of the WordNet noun hypernym hierar­ chy.",
                    "sid": 62,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A conditional probability is attached to each of the classes in the set.",
                    "sid": 63,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To ensure the TCM covers all the word senses in WordNet, we modify Li and Abe's original scheme by creating hyponym leaf classes be­ low all WordNet's hypernym (internal) classes.",
                    "sid": 64,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each leaf holds the word senses previously held at the in­ ternal class.",
                    "sid": 65,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The nominal argument heads from a target slot are collected and used to populate the WordNet hierarchy with frequency information.",
                    "sid": 66,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The head lemmas are matched to the classes which con­ tain them as synonyms.",
                    "sid": 67,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Where a lemma appears as a synonym in more than one class, its frequency count is divided between all classes for which it has direct membership.",
                    "sid": 68,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The frequency counts from hyponym classes are added to the count for each hypernym class.",
                    "sid": 69,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A root node, created above all the WordNet roots, contains the total frequency count for all the argument head lemmas found within WordNet.",
                    "sid": 70,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The minimum description length principle (MDL) (Rissa­ nen, 1978) is used to find the best TCM by consid ering the cost (in bits) of describing both the model and the argument head data encoded in the model.",
                    "sid": 71,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cost (or description length) for a TCM is cal­ culated according to equation 1.",
                    "sid": 72,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of parameters of the model is given by k, this is the number of classes in the TCM minus one.",
                    "sid": 73,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "S is the sample size of the argument head data.",
                    "sid": 74,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cost of describing each argument head ( n) is calculated us­ ing the log of the probability estimate for the classes on the TCM that n belongs to (en)· description length=xlogiSI- L logp(cn) (1) nES A small portion of the TCM for the object slot of start in the transitive frame is displayed in figure 1.",
                    "sid": 75,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WordNet classes are displayed in boxes with a label which best reflects the sense of the class.",
                    "sid": 76,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The prob­ ability estimates are shown for the classes along the TCM.",
                    "sid": 77,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples of the argument head data are dis­ played below the WordNet classes with dotted lines indicating membership at a hyponym class beneath these classes.",
                    "sid": 78,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We assume that verbs which participate will show a higher degree of similarity between the preferences at the target slots compared with non-participating verbs.",
                    "sid": 79,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To compare the preferences we compare the probability distributions across WordNet using a measure of distributional similarity.",
                    "sid": 80,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the prob­ ability distributions may be at different levels of WordNet, we map the TCMs at the target slots to a common tree cut, a \"base cut\".",
                    "sid": 81,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We experiment with two different types of base cut.",
                    "sid": 82,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first is simply a base cut at the eleven root classes of WordNet.",
                    "sid": 83,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We refer to this as the \"root base cut\" (RBC).",
                    "sid": 84,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sec­ ond is termed the \"union base cut\" (usc).",
                    "sid": 85,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is obtained by taking all classes from the union of the two TCMs which are not subsumed by another class in this union.",
                    "sid": 86,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Duplicates are removed.",
                    "sid": 87,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Probabilities are assigned to the classes of a base cut using the estimates on the original TCM.",
                    "sid": 88,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability esti­ mate for a hypernym class is obtained by combining the probability estimates for all its hyponyms on the original cut.",
                    "sid": 89,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 exemplifies this process for two TCMs (TCMl and TCM2) in an imaginary hierarchy.",
                    "sid": 90,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The UBC is at the classes B, c and D. To quantify the similarity between the probability distributions for the target slots we use the o:-skew divergence (o:so) proposed by Lee (1999).",
                    "sid": 91,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 This measure, defined in equation 2, is a smoothed version of the KulbackLiebler divergence.",
                    "sid": 92,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "p1(x) and p2(x) are the two probability distributions which are being compared.",
                    "sid": 93,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The o: constant is a value between 0 and 1We also experimented with euclidian distance, the Ll norm, and cosine measures.",
                    "sid": 94,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The differences in performance of these measures were not statistically significant.",
                    "sid": 95,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 which smooths p1(x) with p2(x) so that o:so is always defined.",
                    "sid": 96,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the same value (0.99) for o: as Lee.",
                    "sid": 97,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If o: is set to 1 then this measure is equivalent to the KulbackLiebler divergence.",
                    "sid": 98,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "o:sd(p1(x),p2(x)) = D(p2(x)jl((o: x p1(x)) + ((1- o:) x p2(x)))) (2)",
                    "sid": 99,
                    "ssid": 54,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental evaluation. ",
            "number": "4",
            "sents": [
                {
                    "text": "We experiment with a SCF lexicon produced from 19.3 million words of parsed text from the BNC (Leech, 1992).",
                    "sid": 100,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the causative and conative alternations, since these have enough candidates in our lexicon for experimentation.",
                    "sid": 101,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation is per­ formed on verbs already filtered by the syntactic processing.",
                    "sid": 102,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The SCF acquisition system has been evaluated elsewhere (Briscoe and Carroll, 1997).",
                    "sid": 103,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We selected candidate verbs which occurred with 10 or more nominal argument heads at the target slots.",
                    "sid": 104,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The argument heads were restricted to those which can be classified in the WordNet hypernym hi­ erarchy.",
                    "sid": 105,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Candidates were selected by hand so as to obtain an even split between candidates which did participate in the alternation (positive candidates) and those which did not (negative candidates).",
                    "sid": 106,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Four human judges were used to determine the \"gold stan­ dard\".",
                    "sid": 107,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The judges were asked to specify a yes or no decision on participation for each verb.",
                    "sid": 108,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They were also permitted a don't know verdict.",
                    "sid": 109,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The kappa statistic (Siegel and Castellan, 1988) was calculated to ensure that there was significant agreement be­ tween judges for the initial set of candidates.",
                    "sid": 110,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From these, verbs were selected which had 75% or more agreement, i.e. three or more judges giving the same yes or no decision for the verb.",
                    "sid": 111,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the causative alternation we were left with 46 positives and 53 negatives.",
                    "sid": 112,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the conative alter­ nation we had 6 of each.",
                    "sid": 113,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In both cases, we used the Mann Whitney U test to see if there was a signifi­ cant relationship between the similarity measure and participation.",
                    "sid": 114,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then used a threshold on the sim­ ilarity scores as the decision point for participation to determine a level of accuracy.",
                    "sid": 115,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We experimented with both the mean and median of the scores as a threshold.",
                    "sid": 116,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Seven of the negative causative candi­ dates were randomly chosen and removed to ensure an even split between positive and negative candi­ dates for determining accuracy using the mean and median as thresholds.",
                    "sid": 117,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following subsection describes the results of the experiments using the method described in sec­ tion 3 above.",
                    "sid": 118,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subsection 4.2 describes an experiment on the same data to determine participation using a similarity measure based on the intersection of the lemmas at the target slots.",
                    "sid": 119,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NewTCM1 0.1 c l NewTCM2 A-1 E F G H I .J TCM2 Figure 2: New TCMs at the union base cut 4.1 Using Syntax and Selectional.",
                    "sid": 120,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preferences The results for the causative alternation are dis­ played in table 1 for both the RBC and the UBC.",
                    "sid": 121,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relationship between participation and asD is highly significant in both cases, with values of p well below 0.01.",
                    "sid": 122,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accuracy for the mean and median thresholds are displayed in the fourth and fifth columns.",
                    "sid": 123,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both thresholds outperform the random baseline of 50%.",
                    "sid": 124,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results for the UBC are slightly improved, com­ pared to those for the RBC, however the improve­ ment is not significant.",
                    "sid": 125,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The numbers of false negative (FN) and false posi­ tive (FP) errors for the mean and median thresholds are displayed in table 2, along with the threshold and accuracy.",
                    "sid": 126,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The outcomes for each individual verb for the experiment using the RBC and the mean thresh­ old are as follows: • True negatives: add admit answer believe borrow cost declare de­ mand expect feel imagine know notice pay per­ form practise proclaim read remember sing sur­ vive understand win write • True positives: accelerate bang bend boil break burn change close cook cool crack decrease drop dry end ex­ pand fly improve increase match melt open ring rip rock roll shatter shut slam smash snap spill split spread start stop stretch swing tilt turn wake • False negatives: flood land march repeat terminate • False positives: ask attack catch choose climb drink eat help kick knit miss outline pack paint plan prescribe pull remain steal suck warn wash The results for the UBC experiment are very similar.",
                    "sid": 127,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the median is used, the number of FPs and FNs are evenly balanced.",
                    "sid": 128,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because the median threshold is, by definition, taken midway between the test items arranged in order of their similarity scores.",
                    "sid": 129,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are an even number of items on either side of the decision point, and an even number of positive and negative candidates in our test sample.",
                    "sid": 130,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the errors on either side of the decision point are equal in number.",
                    "sid": 131,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For both base cuts, there are a larger number of false positives than false negatives when the mean is used.",
                    "sid": 132,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The mean produces a higher accuracy than the median, but gives an increase in false positives.",
                    "sid": 133,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many false positives arise where the preferences at both target slots are near neighbours in WordNet.",
                    "sid": 134,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, this occurred for eat and drink.",
                    "sid": 135,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There verbs have a high probability mass (around 0.7) un­ der the entity class in both target slots, since both people and types of food occur under this class.",
                    "sid": 136,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In cases like these, the probability distributions at the RBC, and frequently the UBC, are not sufficiently dis­ tinctive.",
                    "sid": 137,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The polysemy of the verbs may provide another explanation for the large quantity of false positives.",
                    "sid": 138,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The SCFs and data of different senses should not ideally be combined, at least not for coarse grained sense distinctions.",
                    "sid": 139,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We tested the false positive and true negative candidates to see if there was a re­ lationship between the polysemy of a verb and its misclassification.",
                    "sid": 140,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of senses (according to WordNet) was used to indicate the polysemy of a verb.",
                    "sid": 141,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Mann Whitney U test was performed on Mann Whitney z significance (p) mean median RBC4.03 0.0003 71 63 UBC4.3 0.00003 73 70 Table 1: Causative results base cut threshold type threshold accuracy% num FPs num FNs UBC mean 0.38 73 21 4 UBC median 0.20 70 14 14 RBC mean 0.32 71 22 5 RBC median 0.15 63 17 17 Table 2: Error analysis for the causative experiments the verbs found to be true negative and false positive using the RBC.",
                    "sid": 142,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A significant relationship was not found between participation and misclassification.",
                    "sid": 143,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both groups had an average of 5 senses per verb.",
                    "sid": 144,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not to say that distinguishing verb senses would not improve performance, provided that there was sufficient data.",
                    "sid": 145,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, verb polysemy does not appear to be a major source of error, from our preliminary analysis.",
                    "sid": 146,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In many cases, such as read which was classified both by the judges, and the sys­ tem as a negative candidate, the predominant sense of the verb provides the majority of the data.",
                    "sid": 147,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alter­ nate senses, for example, the book reads well, often do not contribute enough data so as to give rise to a large proportion of errors.",
                    "sid": 148,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finding an appropriate inventory of senses would be difficult, since we would not wish to separate related senses which occur as alternate variants of one another.",
                    "sid": 149,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The inventory would therefore require knowledge of the phenomena that we are endeavouring to acquire automatically.",
                    "sid": 150,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To show that our method will work for other RSAs, we use the conative.",
                    "sid": 151,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our sample size is rather small since we are limited by the number of positive can­ didates in the corpus having sufficient frequency for both SCFs.",
                    "sid": 152,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sparse data problem is acute when we look at alternations with specific prepositions.",
                    "sid": 153,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A sample of 12 verbs (6 positive and 6 negative) re­ mained after the selection process outlined above.",
                    "sid": 154,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this small sample we obtained a significant re­ sult (p = 0.02) with a mean accuracy of 67% and a median accuracy of 83%.",
                    "sid": 155,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On this occasion, the median performed better than the mean.",
                    "sid": 156,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More data is required to see if this difference is significant.",
                    "sid": 157,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Using Syntax and Lemmas.",
                    "sid": 158,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This experiment was conducted using the same data as that used in the previous subsection.",
                    "sid": 159,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this ex­ periment, we used a similarity score on the argument heads directly, instead of generalizing the argument heads to WordNet classes.",
                    "sid": 160,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The venn diagram in fig­ ure 3 shows a subset of the lemmas at the transitive and intransitive SCFs for the verb break.",
                    "sid": 161,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lemma based similarity measure is termed lemma overlap (10) and is given in equation 3, where A and B represent the target slots.",
                    "sid": 162,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10 is the size of the intersection of the multisets of argument heads at the target slots, divided by the size of the smaller of the two multisets.",
                    "sid": 163,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The intersection of two mul­ tisets includes duplicate items only as many times as the item is in both sets.",
                    "sid": 164,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if one slot contained the argument heads {person, person, person, child, man, spokeswoman}, and the other slot contained {person, person, child, chair, collec­ tion}, then the intersection would be {person, per­ son, child}, and 10 would be . This measure ranges between zero (no overlap) and I (where one set is a proper subset of that at the other slot).",
                    "sid": 165,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LO(A, B) = jmultiset intersection(A B)l !smallest set(A, B)I (3 Using the Mann Whitney U test on the 10 scores, we obtained a z score of 2.00.",
                    "sid": 166,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is significant to the 95% level, a lower level than that for the class­ based experiments.",
                    "sid": 167,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results using the mean and median of the 10 scores are shown in table 3.",
                    "sid": 168,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Perfor­ mance is lower than that for the class-based experi­ ments.",
                    "sid": 169,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The outcome for the individual verbs using the mean as a threshold was: • True negatives: add admit answer borrow choose climb cost de­ clare demand drink eat feel imagine notice out­ line pack paint perform plan practise prescribe proclaim read remain sing steal suck survive un­ derstand wash win write • True positives: bend boil burn change close cool dry end fly im­ prove increase match melt open ring roll shut slam smash start stop tilt wake • False negatives: accelerate bang break cook crack decrease drop expand flood land march repeat rip rock shatter silence storm jaw crisis neck wave someone tie leg cartel war back ground weather diet deadlock hell spell Figure 3: Lemmas at the causative target slots of break snap spill split spread stretch swing terminate turn • False positives: ask attack believe catch expect help kick knit know miss pay pull remember warn Interestingly, the errors for the LO measure tend to be false negatives, rather than false positives.",
                    "sid": 170,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The LO measure is much more conservative than the ap­ proach using the TCMs.",
                    "sid": 171,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case the median threshold produces better results.",
                    "sid": 172,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the conative alternation, the lemma based method does not show a significant relationship be­ tween participation and the LO scores.",
                    "sid": 173,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, there is no difference between the sums of the ranks of the two groups for the Mann Whitney U test.",
                    "sid": 174,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The mean produces an accuracy of 58% whilst the median produces an accuracy of 50%.",
                    "sid": 175,
                    "ssid": 76,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "5",
            "sents": [
                {
                    "text": "There has been some recent interest in observing alternations in corpora (McCarthy and Korhonen, 1998; Lapata, 1999) and predicting related verb classifications (Stevenson and Merlo, 1999).",
                    "sid": 176,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ear­ lier work by Resnik (1993) demonstrated a link be­ tween selectional preference strength and participa­ tion in alternations where the direct object is omit­ ted.",
                    "sid": 177,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Resnik used syntactic information from the bracketing within the Penn Treebank corpus.",
                    "sid": 178,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Re­ search into the identification of other diathesis al­ ternations has been advanced by the availability of automatic syntactic processing.",
                    "sid": 179,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most work us­ ing corpus evidence for verb classification has re­ lied on a priori knowledge in the form of linguistic cues specific to the phenomena being observed (La­ pata, 1999; Stevenson and Merlo, 1999).",
                    "sid": 180,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our ap proach, whilst being applicable only to RSAs, does not require human input specific to the alternation at hand.",
                    "sid": 181,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lapata (1999) identifies participation in the dative and benefactive alternations.",
                    "sid": 182,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lapata's strategy is to identify participants using a shallow parser and vari­ ous linguistic and semantic cues, which are specified manually for these two alternations.",
                    "sid": 183,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PP attachments are resolved using Hindle and Rooth's (1993) lexical association score.",
                    "sid": 184,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compound nouns, which could be mistaken for the double object construction, were filtered using the log-likelihood ratio test.",
                    "sid": 185,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The se­ mantic cues were obtained by manual analysis.",
                    "sid": 186,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relative frequency of a SCF for a verb, compared to the total frequency of the verb, was used for filtering out erroneous SCFs.",
                    "sid": 187,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lapata does not report recall and precision fig­ ures against a gold standard.",
                    "sid": 188,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The emphasis is on the phenomena actually evident in the corpus data.",
                    "sid": 189,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many of the verbs listed in Levin as taking the al­ ternation were not observed with this alternation in the corpus data.",
                    "sid": 190,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This amounted to 44% of the verbs for the benefactive, and 52% for the dative.",
                    "sid": 191,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These figures only take into account the verbs for which at least one of the scFs were observed.",
                    "sid": 192,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "54% of the verbs listed for the dative and benefactive by Levin were not acquired with either of the target SCFs.",
                    "sid": 193,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conversely, many verbs not listed in Levin were identified as taking the benefactive or dative alternation using Lapata's criteria.",
                    "sid": 194,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Manual analysis of these verbs revealed 18 false positives out of 52 candidates.",
                    "sid": 195,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Stevenson and Merlo (1999) use syntactic and lex­ ical cues for classifying 60 verbs in three verb classes: unergative, unaccusative and verbs with an optional direct object.",
                    "sid": 196,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These three classes were chosen be threshold type threshold accuracy '7o num FPs num FNs mean 0.26 60 14 23 median 0.23 63 17 17 Table 3: Accuracy and error analysis for lemma based experiments cause a few well defined features, specified a pri­ ori, can distinguish the three groups.",
                    "sid": 197,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Twenty verbs from Levin's classification were used in each class.",
                    "sid": 198,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They were selected by virtue of having sufficient fre­ quency in a combined corpus (from the Brown and the WSJ) of 65 million words.",
                    "sid": 199,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs were also chosen for having one predominant intended sense in the corpus.",
                    "sid": 200,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Stevenson and Merlo used four linguisti­ cally motivated features to distinguish these groups.",
                    "sid": 201,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Counts from the corpus data for each of the four fea­ tures were normalised to give a score on a scale of 1 to 100.",
                    "sid": 202,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One feature was the causative non-causative distinction.",
                    "sid": 203,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this feature, a measure similar to our LO measure was used.",
                    "sid": 204,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The four features were identified in the corpus using automatic POS tagging and parsing of the data.",
                    "sid": 205,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The data for half of the verbs in each class was subject to manual scrutiny, after initial automatic processing.",
                    "sid": 206,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of the data was produced fully automatically.",
                    "sid": 207,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs were classified automatically using the four features.",
                    "sid": 208,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The accuracy of automatic classification was 52% us­ ing all four features, compared to a baseline of 33%.",
                    "sid": 209,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best result was obtained using a combination of three features.",
                    "sid": 210,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This gave an accuracy of 66%.",
                    "sid": 211,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "McCarthy and Korhonen (1998) proposed a method for identifying RSAs using MDL.",
                    "sid": 212,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method relied on an estimation of the cost of us­ ing TCMs to encode the argument head data at a target slot.",
                    "sid": 213,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sum of the costs for the two target slots was compared to the cost of a TCM for encoding the union of the argument head data over the two slots.",
                    "sid": 214,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results are reported for the causative alterna­ tion with 15 verbs.",
                    "sid": 215,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method depends on there being similar quantities of data at the alternating slots, otherwise the data at the more frequent slot overwhelms the data at the less frequent slot.",
                    "sid": 216,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How­ ever, many alternations involve SCFs with substan­ tially different relative frequencies, especially when one SCF is specific to a particular preposition.",
                    "sid": 217,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We carried out some experiments using the MDL method and our TCMs.",
                    "sid": 218,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the causative, we used a sample of 110 verbs and obtained 63% accuracy.",
                    "sid": 219,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the conative, a sample of 16 verbs was used and this time accuracy was only 56%.",
                    "sid": 220,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notably, only one negative decision was made because of the disparate frame frequencies, which reduces the cost of combining the argument head data.",
                    "sid": 221,
                    "ssid": 46,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "6",
            "sents": [
                {
                    "text": "We have discovered a significant relationship be­ tween the similarity of selectional preferences at the target slots, and participation in the causative and conative alternations.",
                    "sid": 222,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A threshold, such as the mean or median can be used to obtain a level of accuracy well above the baseline.",
                    "sid": 223,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A lemma based similarity score does not always indicate a significant relation­ ship and generally produces a lower accuracy.",
                    "sid": 224,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are patterns of diathesis behaviour among verb groups (Levin, 1993).",
                    "sid": 225,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accuracy may be im­ proved by considering several alternations collec­ tively, rather than in isolation.",
                    "sid": 226,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Complementary techniques to identify alternations, for example (Resnik, 1993), might be combined with ours.",
                    "sid": 227,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although we have reported results on only two RSAs, our method is applicable to other such alter­ nations.",
                    "sid": 228,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, such application requires no human endeavour, apart from that required for eval­ uation.",
                    "sid": 229,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, a considerably larger corpus would be required to overcome the sparse data problem for other RSA alternations.",
                    "sid": 230,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements. ",
            "number": "7",
            "sents": [
                {
                    "text": "Some funding for this work was provided by UK EP­ SRC project GR/L53175 'PSET: Practical Simplifi­ cation of English Text'.",
                    "sid": 231,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also acknowledge Gerald Gazdar for his helpful comments on this paper.",
                    "sid": 232,
                    "ssid": 2,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}