{
    "ID": "A00-2019",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We present an unsupervised method for detecting grammatical errors by inferring negative evidence from edited textual corpora.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system was developed and tested using essay-length responses to prompts on the Test of English as a Foreign Language (TOEFL).",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The error­ recognition system, ALEK, performs with about 80% precision and 20% recall.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "A good indicator of whether a person knows the meaning of a word is the ability to use it appropriately in a sentence (Miller and Gildea, 1987).",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Much information about usage can be obtained from quite a limited context: Choueka and Lusignan (1985) found that people can typically recognize the intended sense of a polysemous word by looking at a narrow window of one or two words around it.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Statistically-based computer programs have been able to do the same with a high level of accuracy (Kilgarriff and Palmer, 2000).",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The goal of our work is to automatically identify inappropriate usage of specific vocabulary words in essays by looking at the local contextual cues around a target word.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have developed a statistical system, ALEK (Assessing Lexical Knowledge), that uses statistical analysis for this purpose.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A major objective of this research is to avoid the laborious and costly process of collecting errors (or negative evidence) for each word that we wish to evaluate.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, we train ALEK on a general corpus of English and on edited text containing example uses of the target word.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system identifies inappropriate usage based on differences between the word's local context cues in an essay and the models of context it has derived from the corpora of well-formed sentences.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Claudia Leacock Educational Testing Service Rosedale Road Princeton, NJ cleacock@ets.org A requirement for ALEK has been that all steps in the process be automated, beyond choosing the words to be tested and assessing the results.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once a target word is chosen, preprocessing, building a model ofthe word's appropriate usage, and identifying usage errors in essays is performed without manual intervention.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ALEK has been developed using the Test of English as a Foreign Language (TOEFL) administered by the Educational Testing Service.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TOEFL is taken by foreign students who are applying to US undergraduate and graduate-level programs.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 Background.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Approaches to detecting errors by non-native writers typically produce grammars that look for specific expected error types (Schneider and McCoy, 1998; Park, Palmer and Washburn, 1997).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Under this approach, essays written by ESL students are collected and examined for errors.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parsers are then adapted to identify those error types that were found in the essay collection.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We take a different approach, initially viewing error detection as an extension of the word sense disambiguation (WSD) problem.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Corpus-based WSD systems identify the intended sense of a polysemous word by (1) collecting a set of example sentences for each of its various senses and (2) extracting salient contextual cues from these sets to (3) build a statistical model for each sense.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They identify the intended sense of a word in a novel sentence by extracting its contextual cues and selecting the most similar word sense model (e.g., Leacock, Chodorow and Miller (1998), Yarowsky (1993)).",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Golding (1995) showed how methods used for WSD (decision lists and Bayesian classifiers) could be adapted to detect errors resulting from common spelling confusions among sets such as there, their, and they're.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He extracted contexts from correct usage of each confusable word in a training corpus and then identified a new occurrence as an error when it matched the wrong context.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, most grammatical errors are not the result of simple word confusions.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This complicates the task of building a model of incorrect usage.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One approach we considered was to proceed without such a model: represent appropriate word usage (across senses) in a single model and compare a novel example to that model.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most appealing part of this formulation was that we could bypass the knowledge acquisition bottleneck.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All occurrences ofthe word in a collection of edited text could be automatically assigned to a single training set representing appropriate usage.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inappropriate usage would be signaled by contextual cues that do not occur in training.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, this approach was not effective for error detection.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of a word usage error is often very similar to the model of appropriate usage.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An incorrect usage can contain two or three salient contextual elements as well as a single anomalous element.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The problem of error detection does not entail finding similarities to appropriate usage, rather it requires identifYing one element among the contextual cues that simply does not fit.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "alek architecture. ",
            "number": "2",
            "sents": [
                {
                    "text": "What kinds of anomalous elements does ALEK identify?",
                    "sid": 35,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Writers sometimes produce errors that violate basic principles of English syntax (e.g., a desks), while other mistakes show a lack of information about a specific vocabulary item (e.g., a knowledge).",
                    "sid": 36,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to detect these two types of problems, ALEK uses a 30-million word general corpus of English from the San Jose Mercury News (hereafter referred to as the general corpus) and, for each target word, a set of I 0,000 example sentences from North American newspaper text 1 (hereafter referred to as the word-specific corpus).",
                    "sid": 37,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 The corpora are extracted from the ACLDCI.",
                    "sid": 38,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "corpora.",
                    "sid": 39,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In selecting the sentences for the word ALEK infers negative evidence from the contextual cues that do not co-occur with the target word - either in the word specific corpus or in the general English one.",
                    "sid": 40,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It uses two kinds of contextual cues in a ±2 word window around the target word: function words (closed-class items) and part-of-speech tags (Brill, 1994).",
                    "sid": 41,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Brill tagger output is post-processed to \"enrich\" some closed class categories of its tag set, such as subject versus object pronoun and definite versus indefinite determiner.",
                    "sid": 42,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The enriched tags were adapted from Francis and Kucera (1982).",
                    "sid": 43,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After the sentences have been preprocessed, ALEK counts sequences of adjacent part-of­ speech tags and function words (such as determiners, prepositions, and conjunctions).",
                    "sid": 44,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the sequence a/AT full-time/JJ job/NN contributes one occurrence each to the bigrams AT+JJ, JJ+NN, a+JJ, and to the part-of-speech tag trigram AT+JJ+NN.",
                    "sid": 45,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each individual tag and function word also contributes to its own unigram count.",
                    "sid": 46,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These frequencies form the basis for the error detection measures.",
                    "sid": 47,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the general corpus, ALEK computes a mutual information measure to determine which sequences of part-of-speech tags and function words are unusually rare and are, therefore, likely to be ungrammatical in English (e.g., singular determiner preceding plural noun, as in *a desks).",
                    "sid": 48,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mutual information has often been used to detect combinations of words that occur more frequently than we would expect based on the assumption that the words are independent.",
                    "sid": 49,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here we use this measure for the opposite purpose - to find combinations that occur less often than expected.",
                    "sid": 50,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ALEK also looks for sequences that are common in general but unusual in the word specific corpus (e.g., the singular determiner a preceding a singular noun is common in English but rare when the noun is specific corpora, we tried to minimize the mismatch between the domains of newspapers and TOEFL essays.",
                    "sid": 51,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the newspaper domain, concentrate is usually used as a noun, as in orange juice concentrate but in TOEFL essays it is a verb 91% of the time.",
                    "sid": 52,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentence selection for the word specific corpora was constrained to reflect the distribution of part-of-speech tags for the target word in a random sample of TOEFL essays.",
                    "sid": 53,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "knowledge).",
                    "sid": 54,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These divergences between the two corpora reflect syntactic properties that are peculiar to the target word.",
                    "sid": 55,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Measures based on the general.",
                    "sid": 56,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "corpus: The system computes mutual information comparing the proportion of observed occurrences of bigrams in the general corpus to the proportion expected based on the assumption of independence, as shown below: word-specific corpus for knowledge than would be expected from the general corpus unigram probabilities of AT and NN.",
                    "sid": 57,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to bigram and trigram measures, ALEK compares the target word's part-of­ speech tag in the word-specific corpus and in the general corpus.",
                    "sid": 58,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, it looks at the conditional probability ofthe part-of-speech tag given the major syntactic category (e.g., plural noun given noun) in both distributions, by computing the following value.",
                    "sid": 59,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MI- ( P(AB) ) -logz P(A) x P(B) log 2 (Pspecific _corpus( tag Icategory)) Pgeneral_ corpus( tag Icategory) Here, P(AB) is the probability ofthe occurrence of the AB bigram, estimated from its frequency in the general corpus, and P(A) and P(B) are the probabilities of the first and second elements of the bigram, also estimated from the general corpus.",
                    "sid": 60,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ungrammatical sequences should produce bigram probabilities that are much smaller than the product of the unigram probabilities (the value ofMI will be negative).",
                    "sid": 61,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Trigram sequences are also used, but in this case the mutual information computation compares the co-occurrence of ABC to a model in which A and C are assumed to be conditionally independent given B (see Lin, 1998).",
                    "sid": 62,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MI-lo ( P(ABC) ) - g2 P(B)xP(AIB)xP(CIB) Once again, a negative value is often indicative of a sequence that violates a rule of English.",
                    "sid": 63,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Comparing the word-specific corpus.",
                    "sid": 64,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "to the general corpus: ALEK also uses mutual information to compare the distributions of tags and function words in the word-specific corpus to the distributions that are expected based on the general corpus.",
                    "sid": 65,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The measures for bigrams and trigrams are similar to those given above except that the probability in the numerator is estimated from the word­ specific corpus and the probabilities in the denominator come from the general corpus.",
                    "sid": 66,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To return to a previous example, the phrase a knowledge contains the tag bigram for singular determiner followed by singular noun (ATNN).",
                    "sid": 67,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This sequence is much less common in the For example, in the general corpus, about half of all noun tokens are plural, but in the training set for the noun knowledge, the plural know/edges occurs rarely, if at all.",
                    "sid": 68,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The mutual information measures provide candidate errors, but this approach overgenerates - it finds rare, but still quite grammatical, sequences.",
                    "sid": 69,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To reduce the number of false positives, no candidate found by the MI measures is considered an error if it appears in the word-specific corpus at least two times.",
                    "sid": 70,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This increases ALEK's precision at the price of reduced recall.",
                    "sid": 71,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, a knowledge will not be treated as an error because it appears in the training corpus as part ofthe longer a knowledge of sequence (as in a knowledge of mathematics).",
                    "sid": 72,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ALEK also uses another statistical technique for finding rare and possibly ungrammatical tag and function word bigrams by computing the x2 (chi square) statistic for the difference between the bigram proportions found in the word-specific and in the general corpus: 2 2 ( (Pword specific- eneral corp.J % = pgeneraLcorpuJJpgerneraf..corpuJ / N word_ specific The x2 measure faces the same problem of overgenerating errors.",
                    "sid": 73,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the large sample sizes, extreme values can be obtained even though effect size may be minuscule.",
                    "sid": 74,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To reduce false positives, ALEK requires that effect sizes be at least in the moderate-to-small range (Cohen and Cohen, 1983).",
                    "sid": 75,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Direct evidence from the word specific corpus can also be used to control the overgeneration of errors.",
                    "sid": 76,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each candidate error, ALEK compares the larger context in which the bigram appears to the contexts that have been analyzed in the word-specific corpus.",
                    "sid": 77,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the word­ specific corpus, ALEK forms templates, sequences of words and tags that represent the local context of the target.",
                    "sid": 78,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a test sentence contains a low probability bigram (as measured by the x2 test), the local context of the target is compared to all the templates of which it is a part.",
                    "sid": 79,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Exceptions to the error, that is longer grammatical sequences that contain rare sub­ sequences, are found by examining conditional probabilities.",
                    "sid": 80,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To illustrate this, consider the example of a knowledge and a knowledge of The conditional probability of of given a knowledge is high, as it accounts for almost all of the occurrences of a knowledge in the word­ specific corpus.",
                    "sid": 81,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on this high conditional probability, the system will use the template for a knowledge ofto keep it from being marked as an error.",
                    "sid": 82,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other function words and tags in the +1 position have much lower conditional probability, so for example, a knowledge is will not be treated as an exception to the error.",
                    "sid": 83,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Validity of the n-gram measures.",
                    "sid": 84,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TOEFL essays are graded on a 6 point scale, where 6 demonstrates \"clear competence\" in writing on rhetorical and syntactic levels and 1 demonstrates \"incompetence in writing\".",
                    "sid": 85,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If low probability n-grams signal grammatical errors, then we would expect TOEFL essays that received lower scores to have more of these n­ grams.",
                    "sid": 86,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To test this prediction, we randomly selected from the TOEFL pool 50 essays for each ofthe 6score values from 1.0 to 6.0.For each score value, all 50 essays were concatenated to form a super-essay.",
                    "sid": 87,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In every super-essay, for each adjacent pair and triple of tags containing a noun, verb, or adjective, the bigram and trigram mutual information values were computed based on the general corpus.",
                    "sid": 88,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 shows the proportions ofbigrams and trigrams with mutual information less than -3.60.",
                    "sid": 89,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As predicted, there is a significant negative correlation between the score and the proportion oflow probability bigrams (r5= -.94, n=6,p<.01, two-tailed) and trigrams (rs= -.84, n=6, p<.OS, two-tailed).",
                    "sid": 90,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4 System development.",
                    "sid": 91,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ALEK was developed using three target words that were extracted from TOEFL essays: concentrate, interest, and knowledge.",
                    "sid": 92,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These words were chosen because they represent different parts of speech and varying degrees of polysemy.",
                    "sid": 93,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each also occurred in at least 150 sentences in what was then a small pool of TOEFL essays.",
                    "sid": 94,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Before development began, each occurrence of these words was manually labeled as an appropriate or inappropriate usage - without taking into account grammatical errors that might have been present elsewhere in the sentence but which were not within the target word's scope.",
                    "sid": 95,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Critical values for the statistical measures were set during this development phase.",
                    "sid": 96,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The settings were based empirically on ALEK's performance so as to optimize precision and recall on the three development words.",
                    "sid": 97,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Candidate errors were those local context sequences that produced a mutual information value of less than -3.60 based on the general corpus; mutual information of less than -5.00for the specific/general comparisons; or a x2 value greater than 12.82 with an effect size greater than 0.30.",
                    "sid": 98,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Precision and recall for the three words are shown below.",
                    "sid": 99,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Target word n Precision Recall Concentrate 169 .875 .280 Interest 416 .840 .330 Knowledge 761 .918 .570 Table 1: Percent of n-grams with mutual information< -3.60, by score point Table 2: Development Words Test Word Precision Recall Total Recall (estimated) Test Word Precision Recall Total Recall (estimated) Affect .848 .762 .343 Energy .768 .666 .104 Area .752 .846 .205 Function .800 .714 .168 Aspect .792 .717 .217 Individual .576 .742 .302 Benefit .744 .709 .276 Job .728 .679 .103 Career .736 .671 .110 Period .832 .670 .102 Communicate .784 .867 .274 Pollution .912 .780 .310 Concentrate .848 .791 .415 Positive .784 .700 .091 Conclusion .944 .756 .119 Role .728 .674 .098 Culture .704 .656 .083 Stress .768 .578 .162 Economy .816 .666 .235 Technology .728 .674 .093 Mean .779 .716 .190 Table 3: Precision and recall for 20 test words",
                    "sid": 100,
                    "ssid": 66,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental design and results. ",
            "number": "3",
            "sents": [
                {
                    "text": "ALEK was tested on 20 words.",
                    "sid": 101,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These words were randomly selected from those which met two criteria: (1) They appear in a university word list (Nation, 1990) as words that a student in a US university will be expected to encounter and (2) there were at least 1,000 sentences containing the word in the TOEFL essay pool.",
                    "sid": 102,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To build the usage model for each target word, 10,000 sentences containing it were extracted from the North American News Corpus.",
                    "sid": 103,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preprocessing included detecting sentence boundaries and part-of-speech tagging.",
                    "sid": 104,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in the development system, the model of general English was based on bigram and trigram frequencies of function words and part-of­ speech tags from 30-million words of the San Jose Mercury News.",
                    "sid": 105,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each test word, all of the test sentences were marked by ALEK as either containing an error or not containing an error.",
                    "sid": 106,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The size of the test set for each word ranged from 1,400 to 20,000 with a mean of 8,000 sentences.",
                    "sid": 107,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Results.",
                    "sid": 108,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To evaluate the system, for each test word we randomly extracted 125 sentences that ALEK classified as containing no error (C-set) and 125 sentences which it labeled as containing an error (E-set).",
                    "sid": 109,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These 250 sentences were presented to a linguist in a random order for blind evaluation.",
                    "sid": 110,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The linguist, who had no part in ALEK's development, marked each usage of the target word as incorrect or correct and in the case of incorrect usage indicated how far from the target one would have to look in order to recognise that there was an error.",
                    "sid": 111,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the case of \"an period\" the error occurs at a distance of one word from period.",
                    "sid": 112,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When the error is an omission, as in \"lived in Victorian period\", the distance is where the missing word should have appeared.",
                    "sid": 113,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, the missing determiner is 2 positions away from the target.",
                    "sid": 114,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When more than one error occurred, the distance of the one closest to the target was marked.",
                    "sid": 115,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 lists the precision and recall for the 20 test words.",
                    "sid": 116,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The column labelled \"Recall\" is the proportion of human-judged errors in the 250- sentence sample that were detected by ALEK.",
                    "sid": 117,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"Total Recall\" is an estimate that extrapolates from the human judgements of the sample to the entire test set.",
                    "sid": 118,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We illustrate this with the results for pollution.",
                    "sid": 119,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The human judge marked as incorrect usage 91.2% of the sample from ALEK's E-set and 18.4% of the sample from its C-set.",
                    "sid": 120,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To estimate overall incorrect usage, we computed a weighted mean of these two rates, where the weights reflected the proportion of sentences that were in the E-set and C-set.",
                    "sid": 121,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The E-set contained 8.3% of the pollution sentences and the C-set had the remaining 91.7%.",
                    "sid": 122,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the human judgements as the gold standard, the estimated overall rate of incorrect usage is (.083 x .912 + .917 x .184) = .245.",
                    "sid": 123,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ALEK's estimated recall is the proportion of sentences in the E-set times its precision, divided by the overall estimated error rate (.083 x .912) I .245 = .310.",
                    "sid": 124,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The precision results vary from word to word.",
                    "sid": 125,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conclusion and pollution have precision in the low to middle 90's while individual's precision is 57%.",
                    "sid": 126,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall, ALEK's predictions are about 78% accurate.",
                    "sid": 127,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The recall is limited in part by the fact that the system only looks at syntactic information, while many of the errors are semantic.",
                    "sid": 128,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Analysis of Hits and Misses.",
                    "sid": 129,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nicholls (1999) identifies four error types: an unnecessary word (*affect to their emotions), a missing word (*opportunity of job.), a word or phrase that needs replacing (*every jobs), a word used in the wrong form (*pollutions).",
                    "sid": 130,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ALEK recognizes all of these types of errors.",
                    "sid": 131,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For closed class words, ALEK identified whether a word was missing, the wrong word was used (choice), and when an extra word was used.",
                    "sid": 132,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Open class words have a fourth error category,form, including inappropriate compounding and verb agreement.",
                    "sid": 133,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During the development stage, we found it useful to add additional error categories.",
                    "sid": 134,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since TEOFL graders are not supposed to take punctuation into account, punctuation errors were only marked when they caused the judge to \"garden path\" or initially misinterpret the sentence.",
                    "sid": 135,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Spelling was marked either when a function word was misspelled, causing part-of­ speech tagging errors, or when the writer's intent was unclear.",
                    "sid": 136,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distributions of categories for hits and misses, shown in Table 4, are not strikingly different.",
                    "sid": 137,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the hits are primarily syntactic in nature while the misses are both semantic (as in open-class:choice) and syntactic (as in closed-class:missing).",
                    "sid": 138,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ALEK is sensitive to open-class word confusions (affect vs effect) where the part of speech differs or where the target word is confused with another word (*In this aspect,... instead of In this respect,...).",
                    "sid": 139,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In both cases, the system recognizes that the target is in the wrong syntactic environment.",
                    "sid": 140,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Misses can also be syntactic - when the target word is confused with another word but the syntactic environment fails to trigger an error.",
                    "sid": 141,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, ALEK does not recognize semantic errors when the error involves the misuse of an open-class word in Category %Hits %Misses Closed-class- choice 22.5 15.5 -extra 15.5 13.0 -missing 8.0 8.5 Open-class -choice 12.0 19.0 -extra .5 1.0 -missing .5 1.5 -form 28.0 28.5 Punctuation 5.5 1.5 Sentence fragment 1.5 2.0 Spelling/typing error 5.5 8.5 Word order .5 1.0 Table 4: Hits and misses based on a random sample of200 hits and 200 misses combination with the target (for example, make in \"*they make benefits\").",
                    "sid": 142,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Closed class words typically are either selected by or agree with a head word.",
                    "sid": 143,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So why are there so many misses, especially with prepositions?",
                    "sid": 144,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The problem is caused in part by polysemy­ when one sense of the word selects a preposition that another sense does not.",
                    "sid": 145,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When concentrate is used spatially, it selects the preposition in, as \"the stores were concentrated in the downtown area\".",
                    "sid": 146,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When it denotes mental activity, it selects the preposition on, as in \"Susan concentrated on her studies\".",
                    "sid": 147,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since ALEK trains on all senses of concentrate, it does not detect the error in \"*Susan concentrated in her studies\".",
                    "sid": 148,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another cause is that adjuncts, especially temporal and locative adverbials, distribute freely in the word­ specific corpora, as in \"Susan concentrated in her room.\"",
                    "sid": 149,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This second problem is more tractable than the polysemy problem - and would involve training the system to recognize certain types of adjuncts.",
                    "sid": 150,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Analysis of False Positives.",
                    "sid": 151,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "False positives, when ALEK \"identifies\" an error where none exists, fall into six major categories.",
                    "sid": 152,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The percentage of each false positive type in a random sample of 200 false positives is shown in Table 5.",
                    "sid": 153,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Domain mismatch: Mismatch of the newspaper-domain word-specific corpora and essay-domain test corpus.",
                    "sid": 154,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One notable difference is that some TOEFL essay prompts call for the writer's opinion.",
                    "sid": 155,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, Error Type % Occurrence Domain mismatch 12.5 Tagger 17.0 Syntactic 14.5 Free distribution 16.5 Punctuation 12.0 Infrequent tags 9.0 Other 18.5 Table 5.",
                    "sid": 156,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Distribution of false positive types TOEFL essays often contain first person references, whereas newspaper articles are written in the third person.",
                    "sid": 157,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We need to supplement the word-specific corpora with material that more closely resembles the test corpus.",
                    "sid": 158,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tagger: Incorrect analysis by the part-of-speech tagger.",
                    "sid": 159,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When the part-of-speech tag is wrong, ALEK often recognizes the resulting n-gram as anomalous.",
                    "sid": 160,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many of these errors are caused by training on the Brown corpus instead of a corpus of essays.",
                    "sid": 161,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic analysis: Errors resulting from using part-of-speech tags instead of supertags or a full parse, which would give syntactic relations between constituents.",
                    "sid": 162,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, ALEK false alarms on arguments of ditransitive verbs such as offer and flags as an error \"you benefits\" in \"offers you benefits\".",
                    "sid": 163,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Free distribution: Elements that distribute freely, such as adverbs and conjunctions, as well as temporal and locative adverbial phrases, tend to be identified as errors when they occur in some positions.",
                    "sid": 164,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Punctuation: Most notably omission of periods and commas.",
                    "sid": 165,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since these errors are not indicative of one's ability to use the target word, they were not considered as errors unless they caused the judge to misanalyze the sentence.",
                    "sid": 166,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Infrequent tags.",
                    "sid": 167,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An undesirable result of our \"enriched\" tag set is that some tags, e.g., the post-determiner last, occur too infrequently in the corpora to provide reliable statistics.",
                    "sid": 168,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Solutions to some of these problems will clearly be more tractable than to others.",
                    "sid": 169,
                    "ssid": 69,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "comparison of results. ",
            "number": "4",
            "sents": [
                {
                    "text": "Comparison of these results to those of other systems is difficult because there is no generally accepted test set or performance baseline.",
                    "sid": 170,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given this limitation, we compared ALEK's performance to a widely used grammar checker, the one incorporated in Microsoft's Word97.",
                    "sid": 171,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We created files of sentences used for the three development words concentrate, interest, and knowledge, and manually corrected any errors outside the local context around the target before checking them with Word97.",
                    "sid": 172,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance for concentrate showed overall precision of0.89 and recall of 0.07.",
                    "sid": 173,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For interest, precision was 0.85 with recall of 0.11.",
                    "sid": 174,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In sentences containing knowledge, precision was 0.99 and recall was 0.30.",
                    "sid": 175,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word97 correctly detected the ungrammaticality of know/edges as well as a knowledge, while it avoided flagging a knowledge of In summary, Word97's precision in error detection is impressive, but the lower recall values indicate that it is responding to fewer error types than does ALEK.",
                    "sid": 176,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, Word97 is not sensitive to inappropriate selection of prepositions for these three words (e.g., *have knowledge on history, *to concentrate at science).",
                    "sid": 177,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of course, Word97 detects many kinds of errors that ALEK does not.",
                    "sid": 178,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Research has been reported on grammar checkers specifically designed for an ESL population.",
                    "sid": 179,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These have been developed by hand, based on small training and test sets.",
                    "sid": 180,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Schneider and McCoy (1998) developed a system tailored to the error productions of American Sign Language signers.",
                    "sid": 181,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This system was tested on 79 sentences containing determiner and agreement errors, and 101 grammatical sentences.",
                    "sid": 182,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We calculate that their precision was 78% with 54% recall.",
                    "sid": 183,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Park, Palmer and Washburn (1997) adapted a categorial grammar to recognize \"classes of errors [that] dominate\" in the nine essays they inspected.",
                    "sid": 184,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This system was tested on eight essays, but precision and recall figures are not reported.",
                    "sid": 185,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "5",
            "sents": [
                {
                    "text": "The unsupervised techniques that we have presented for inferring negative evidence are effective in recognizing grammatical errors in written text.",
                    "sid": 186,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preliminary results indicate that ALEK's error detection is predictive of TOEFL scores.",
                    "sid": 187,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If ALEK accurately detects usage errors, then it should report more errors in essays with lower scores than in those with higher scores.",
                    "sid": 188,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have already seen in Table 1 that there is a negative correlation between essay score and two of ALEK's component measures, the general corpus n-grams.",
                    "sid": 189,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the data in Table I were not based on specific vocabulary items and do not reflect overall system performance, which includes the other measures as well.",
                    "sid": 190,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6 shows the proportion of test word occurrences that were classified by ALEK as containing errors within two positions of the target at each of 6 TOEFL score points.",
                    "sid": 191,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As predicted, the correlation is negative (rs = -1.00, n = 6,p < .001, two-tailed).",
                    "sid": 192,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These data support the validity of the system as a detector of inappropriate usage, even when only a limited number of words are targeted and only the immediate context of each target 1·s examined.",
                    "sid": 193,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Score ALEK Human I .091-- 2 .085 .375 3 .067 .268 4 .057 .293 5 .048 .232 6 .041 .164 Table 6: Proportion of test word occurrences, by score point, classified as containing an error by ALEK and by a human judge For comparison, Table 6 also gives the estimated proportions of inappropriate usage by score point based on the human judge's classification.",
                    "sid": 194,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, too, there is a negative correlation: rs = -.90, n = 5, p < .05, two-tailed.",
                    "sid": 195,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the system recognizes a wide range of error types, as Table 6 shows, it detects only about one-fifth as many errors as a human judge does.",
                    "sid": 196,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To improve recall, research needs to focus on the areas identified in section 3.2 and, to improve precision, efforts should be directed at reducing the false positives described in 3.3.",
                    "sid": 197,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ALEK is being developed as a diagnostic tool for students who are learning English as a foreign language.",
                    "sid": 198,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, its techniques could be incorporated into a grammar checker for native speakers.",
                    "sid": 199,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "We thank Susanne Wolff for evaluating the test sentences, and Robert Kantor, Ken Sheppard and 3 anonymous reviewers for their helpful suggestions.",
                    "sid": 200,
                    "ssid": 15,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}