{
    "ID": "C02-1080",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Chinese NE (Named Entity) recognition is a difficult problem because of the uncertainty in word segmentation and flexibility in language structure.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper proposes the use of a rationality model in a multi-agent framework to tackle this problem.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We employ a greedy strategy and use the NE rationality model to evaluate and detect all possible NEs in the text.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then treat the process of selecting the best possible NEs as a multi-agent negotiation problem.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting system is robust and is able to handle different types of NE effectively.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our test on the MET-2 test corpus indicates that our system is able to achieve high F1 values of above 92% on all NE types.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Named entity (NE) recognition is a fundamental step to many language processing tasks.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It was a basic task of the Message Understanding Conference (MUC) and has been studied intensively.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Palma & Day (97) reported that person (PER), location (LOC) and organization (ORG) names are the most difficult sub-tasks as compared to other entities as defined in MUC.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper thus focuses only on the recognition of PER, LOC and ORG entities.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recent research on NE recognition has been focused on the machine learning approach, such as the transformation-based learning (Aberdeen 95), hidden Markov model (Bikel et al. 97), decision tree (Sekin et al. 98), collocation statistics (Lin 98), maximum entropy model (Borthwick 99), and EM bootstrapping (Cucerzan & Yarowsky 99).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other than English, several recent works examined the extraction of information from Spanish, Chinese, and Japanese (Isozaki 01).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most approaches for Chinese NE recognition used handcrafted rules, supplemented by word or character frequency statistics.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These methods require a lot of resources to model the NEs.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chen et al.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(98) used 1-billion person name dictionary and employed mainly internal word statistics with no generalization.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yu et al.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(98) employed a common framework to model both the context and information residing within the entities, and performed rule generalization using POS (part-of-speech) and some semantic tags.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A similar system is also reported in Luo & Song (01).",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chinese NE recognition is much more difficult than that in English due to two major problems.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first is the word segmentation problem (Sproat et al. 96, Palmer 97).",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Chinese, there is no white space to delimit the words, where a word is defined as consisting of one or more characters representing a linguistic token.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word is a vague concept in Chinese, and Palmer (97) showed that even native speakers could only achieve about 75% agreement on “correct” segmentation.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As word segmentation is the basic initial step to almost all linguistic analysis tasks, many techniques developed in English NLP cannot be applied to Chinese.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, there is no exterior feature (such as the capitalization) to help identify the NEs, which share many common characters with non-NE (or common words).",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, while 中 is normally associated with the country China, it could also mean the concepts in, at or hit; and张 normally refers to the surname Zhang, but it also means the concepts open, sheet or spread.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, proper names in Chinese may contain common words and vice versa.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of the above problems, the use of statistical and heuristic rules commonly adopted in most existing systems is inadequate to tackle the Chinese NE recognition problem.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we consider a new approach of employing a rationality model in a multi-agent framework.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main ideas of our approach are as follows.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we use an NE rationality measure to evaluate the probability of a sequence of tokens being a specific NE type, and adopt a greedy approach to detect all possible NEs.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, we treat the process of selecting the best NEs among a large set of possibilities as a multi-agent negotiation problem.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We test our overall approach on the MET-2 test set and the system is able to achieve high F1 values of over 92% on all NE types.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are significantly better than most reported systems on MET-2 test set.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of the paper describes the details of our rationality-based and multi-agent negotiation approach to detect and refine NEs.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "rationality model for ne detection. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Named Entity and Its tokens Feature.",
                    "sid": 36,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For clarity and without lost of generality, we focus our discussion mainly on PER entity.",
                    "sid": 37,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The problems and techniques discussed are applicable to LOC and ORG entities.",
                    "sid": 38,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We consider a simple PER name model comprising the surname followed by the first-name.",
                    "sid": 39,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the presence of a surname (as cue-word) in a token sequence, we compute the likelihood of this token playing the role of surname and the next token as the first-name.",
                    "sid": 40,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pair could be recognized as PER only if both tokens are labeled as positive (or of the right types) as shown in Table 1.",
                    "sid": 41,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If either one of both of the tokens are evaluated negatively, then the pair will not be recognized as PER based on the model defined above.",
                    "sid": 42,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of tokens in a NE may vary from 2 in PER to about 20 for ORG.",
                    "sid": 43,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One constraint is that the sequencing of tokens and their labels must be consistent with the respective NE type.",
                    "sid": 44,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, there are grammatical rules governing the composition of different NE type.",
                    "sid": 45,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, LOC may consist of a sequence of LOCs; and ORG may include PER and/or LOC on its left.",
                    "sid": 46,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus by considering one pair of tokens at a time, and by extending the token sequence to the adjacent token one at a time, we can draw similar conclusion as that depicted in Table 1 for complex NE types.",
                    "sid": 47,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 The Rationality Computation.",
                    "sid": 48,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we know the probability distribution of each type of token in a window, NE recognition is then the procedure of evaluating the rationality or certainty of a sequence of tokens with respect to a NE type.",
                    "sid": 49,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Motivated by the results in Table 1 we view NE recognition as a special coloring problem.",
                    "sid": 50,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initially, all the tokens in the corpus are considered as a sequence of White balls.",
                    "sid": 51,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a chain of tokens appears in a NE window, we want to use the probability distribution of these tokens to repaint some of the white balls to different colors.",
                    "sid": 52,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A sequence of appropriately colored balls would induce an appropriate NE.",
                    "sid": 53,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For simplicity, we again focus on PER NE type with 2 tokens.",
                    "sid": 54,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The surname token will be colored red and first-name blue.",
                    "sid": 55,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We assume that the number of PER names in the corpus is N, and the rest of tokens is M. Because there are N surname and N first-name tokens in the corpus, the total number of tokens is M+2N.",
                    "sid": 56,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence the marginal probability of PER name is Pr(PER)=N/(2N+M) . R R R B R W * Strictly, 张将军 and Mr. Zhang are not really person names.",
                    "sid": 57,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are references to person names and should be detected via co-reference.",
                    "sid": 58,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1: An example of NE and non-NE Although the example depicted in Table 1 is very simple, the same idea can be extended to the more complex NE Types for ORG and LOCs.",
                    "sid": 59,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note: Red – Surname; Blue – First-name; White - Others Table 2: Possibility combination of neighboring tokens within the corpus for PER Table 2 shows the possible relationships between the red and blue balls for the PER NE type by considering the grammer that the surname must be followed by a first-name in a formal PER.",
                    "sid": 60,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we only permit the token pair for PER to be labeled as a red ball followed by a the ratio of the probability and converse probability in the Prospector system, namely: blue ball, the following sequences are not P(h) P(h) possible under our model: (a) a red (or blue) ball follows by itself; (b) a red ball follows by white O(h) = = P(-h) 1 - P(h) (5) ball; and (c) a white ball follows by the blue ball.",
                    "sid": 61,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus aRbR (a red follows by a red), aRbW, aBbB, and aWbB are illegal combinations.",
                    "sid": 62,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a pair of tokens a and b in the corpus, they are labeled as surname |aR| and |bR| times, as first-name |aB| and |bB| times, and as non-PER |aW| and |bW| times respectively.",
                    "sid": 63,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The expected value of a token sequence ab representing a PER when a is red and b is blue is: Eq.",
                    "sid": 64,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5) is used in a modified version of the Bayes theorem to solve the uncertainty reasoning problems.",
                    "sid": 65,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Surprisingly, our approach of rationality ℜ for NE with two tokens can be deduced as the product of their odds-likelihood.",
                    "sid": 66,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By linking the concept of odds-likelihood and rationality, we can compute the probability of a sequence of tokens being a specific NE type.",
                    "sid": 67,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the rationality values of tokens could ∞, it may incur overflow or | aR bB |=| aR | ⋅ | bB | = | aR | ⋅ | bB | N N (1) vary from 0 to underflow during the rationality evaluation.",
                    "sid": 68,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is especially so for unknown tokens where their The expected value of the cases when the token pair ab is not a PER name is the sum of expected values of four cases: aBbR, aBbW, aWbR, aWbW (see Table 2), which after simplification, is given by: | a b |=| a b | + | a b | + | a b | + | a b | = | aB | ⋅ | bR | + | aB | ⋅ | bW | + | aW | ⋅ | bR | + | aW | ⋅ | bR | N + M N + M N + M N + M rationality values will be zero.",
                    "sid": 69,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To resolve this problem, we construct a piecewise function to map the rationality values from the range [0, ∞] to [ℜmin,ℜmax].",
                    "sid": 70,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here we set the parameters ℜmin=0.05 and ℜmax=50, and ensure that most rationality values will retain their original values after transformation.",
                    "sid": 71,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 The Context of NEs.",
                    "sid": 72,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "= (| a | + | a |) ⋅ (| b | + | b |) In a dditio n t o i dentif ying t he st ructur al B W R W N + M (2) information within the NEs, it is equally The ratio between the cases when ab is a PER versus when ab is not a PER is: C | aR bB | R B important to model the context around the NEs.",
                    "sid": 73,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Context is especially pivotal to language such as the Chinese or Korean where there is no white ℜ ab = = λ ⋅ ℜa ⋅ ℜb | a b | (3) space and capital characters among the tokens.",
                    "sid": 74,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For PER type, the context tokens are likely to be where ℜR = (| a | aR | | + | a ; ℜB = |) (| b | bB | ; | + | b |) person titles and action words.",
                    "sid": 75,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "B W R W Boundary of a possible and λ = N + M . We call c N a b ℜ R , and ℜ R Prefix Suffix the rationality values of tokens ab, a and b of being a PER, red ball or blue ball respectively.",
                    "sid": 76,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, the probabilities of a as a surname (red ball) and b as a first-name (blue ball) are: …… 请 张飞 讲话 …… NE Window P R = | aR | , P B = | bB | Figure 1: A NE detecti on windo w a | a | +(| a | + | a |) b | b | +(| b | + | b |) Thus after we have compute d the rationalit y R B W B R W values of possible NEs, we enlarge the analysis Thus, ℜR = R a 1 − P R ; ℜB = B b 1 − P B (4) wind ow to cover both the NE candi date and its conte xt.",
                    "sid": 77,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As show n in Figur e 1, the wind ow a b The form of Equation (4) is similar to the concept of odds likelihood O(h), first introduced in Duda et al.",
                    "sid": 78,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(79) as a generic term to denote consists of three components: prefix, suffix and the NE candidate.",
                    "sid": 79,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the NE is at the beginning or end of a paragraph, then the corresponding prefix or suffix is set to void.",
                    "sid": 80,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can extend the rationality computation for an NE to the context window by incorporating both the prefix and suffix tokens separately.",
                    "sid": 81,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4 The Overall Procedure.",
                    "sid": 82,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall procedure for estimating the likelihood of an NE among a sequence of tokens is as follows.",
                    "sid": 83,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a) Convert prior probability Pr(e) of each token e to rationality ℜ(e).",
                    "sid": 84,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A token e may have multiple Pr(e) values, each is dependent on reasonable ORGs if considered separately.",
                    "sid": 85,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, only one of them can be true.",
                    "sid": 86,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "b. Repetition: Some possible NEs may repeat themselves with same or similar tokens.",
                    "sid": 87,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the NE “中国卫星发射代理公司” is similar to “中国卫星发射代理（香港）有 限公司” in different part of the text.",
                    "sid": 88,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It means that these NEs have same beliefs and could cooperate to enhance each other’s belief.",
                    "sid": 89,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "中国卫星发射代理公司在港开业承揽卫星发射、搭载、回收 the role token e plays in a possible NE, such as the probability of being a surname, first-name, prefix, suffix, general token or cue-word.",
                    "sid": 90,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "b) At each cue-word position, compute the rationality of a possible NE by considering one pair of tokens at a time, and extending to the next token on the left or right depending on the NE type.",
                    "sid": 91,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The boundaries of PERs are extended forward; while that of ORGs and LOCs are extended backward.",
                    "sid": 92,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each extension will produce a new NE candidate.",
                    "sid": 93,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The scope of the extension is also determined by the type of NE.",
                    "sid": 94,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The process terminates when the rationality value of the next token falls below a minimum threshold.",
                    "sid": 95,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "c) For all possible NEs, construct the context window and compute its final rationality value within the context window.",
                    "sid": 96,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The process will result in multiple possible NEs, with most NEs overlapping with one another.",
                    "sid": 97,
                    "ssid": 62,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "multi-agent framework for ne. ",
            "number": "3",
            "sents": [
                {
                    "text": "Confirmation 3.1 Relationships between possible NEs.",
                    "sid": 98,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our greedy approach of identifying all possible NEs using the rationality model results in over segmentation of NEs.",
                    "sid": 99,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows a list of 80 possible NEs detected from a test article in the MET-2 test corpus.",
                    "sid": 100,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of correct NEs in this case is only 13.",
                    "sid": 101,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These possible NEs relate to each other in a complex way.",
                    "sid": 102,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The possible relationships between them are: a. Overlapping: This is the most common case when the tokens of multiple NEs overlap each other.",
                    "sid": 103,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples include “长城工业总公司” and “中国长城工业总公司”.",
                    "sid": 104,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are both 和轨道测控等服务 张健 新华社香港７月９日电（记者张健） 由中国远望（集团）总公司、中国长城工业总公司和 香港星光传讯（集团）有限公司董事长黄金富及 董事侯伯文合作组建的中国卫星发射代理（香港）有限公司， ８日在中国香港正式开业。 a team Figure 2: All possible NEs identified in a test article c. Unification: When the tokens of two NEs are adjacent to each other in a sentence, they may be unified to become a new NE by combining their tokens.",
                    "sid": 105,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the NEs “中国” and “香港” may be combined to form a new NE “ 中国香港 ”.",
                    "sid": 106,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By the way, not all neighboring NEs can be unified because the unification must satisfy the syntactic and semantic specifications of the language.",
                    "sid": 107,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, two adjoining PERs cannot be unified, while it is possible for LOCs.",
                    "sid": 108,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "d. Enumerated name list: This is a common language construct to present a list of names.",
                    "sid": 109,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of such construct is: “中国远望 (集团)总公司, 中国长城工业总公司, and 香港星光传讯（集团）有限公司”.",
                    "sid": 110,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we knew the relationships between possible NEs, we can use this knowledge to modify the rationality values of possible NEs.",
                    "sid": 111,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first relationship (overlapping) is of type competition while the other three are of type supporting.",
                    "sid": 112,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a competition relationship, the rationality values of losing NEs are decremented, whereas in a supporting relationship, the rationality of the winning NE can be used to reinforce other NEs.",
                    "sid": 113,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Agent-based Reasoning & Negotiation.",
                    "sid": 114,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is a need to modify the rationality values of possible NEs in order to identify the best possible NEs.",
                    "sid": 115,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One way to achieve this is to employ a decision tree (Sekine 98) to select the best possible candidates.",
                    "sid": 116,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it is difficult to use the decision tree to handle multiple relationships between conflicting NEs, and to perform incremental updates of rationality values in situations where the number, distribution and relationships in possible NEs are uncertain.",
                    "sid": 117,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, we adopt a multi-agent approach to refine the rationality of possible NEs and vote the best potential NEs.",
                    "sid": 118,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Agents are software entities that perform some operations on behalf of their users or another programs with some degree of autonomy, and in so doing, employ some knowledge or representation of the user’s goals or desires (Don et al. 96).",
                    "sid": 119,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our system, we map every possible NE detected to an agent, which acts as the deputy of the NE and depicts all its attributes.",
                    "sid": 120,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following the approach taken in the DBI system, we use the rationality of the NE as the belief, denoted by Br(A), of agent A. Agents are divided into Teams (Decker & Lesser 95) according to their contents and positions in the corpus.",
                    "sid": 121,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The division of agents into teams facilitates the negotiation of agents’ beliefs.",
                    "sid": 122,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The negotiation between agents aims to eliminate underlying conflicts and uncertainty among them.",
                    "sid": 123,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The process of multi-agent negotiation is carried out as follows.",
                    "sid": 124,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a. We identify agents involved in an unification relationship.",
                    "sid": 125,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These agents will be unified if the constraints of unification are fulfilled.",
                    "sid": 126,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The new agents would inherit the evidences, including the rationality values, of its child agents.",
                    "sid": 127,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "b. We divide the resulting agents into teams.",
                    "sid": 128,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Agents with overlapping tokens will be grouped into same teams, while independent agents will be assigned to different teams.",
                    "sid": 129,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "c. We perform negotiation between agents based on the type of their relationship.",
                    "sid": 130,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For agents that are in competition relationship (i.e. those overlapping agents within the same team), we select the agent with the maximal belief (said ai) as the winner, and decrement the beliefs of the rest of Nt agents in the same team by ∆(ai), i.e. Br(aj) = Br(aj) - ∆(ai), for j=1,..",
                    "sid": 131,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nt, and j≠i For agents involved in the supporting relations, we again select the agent with the maximal belief (of say ak) as the winner, but increment the rest of agents in the same set Sk by ∆(ak), i.e. Br(aj) = Br(aj) + ∆(ak), for all j in Sk & j≠k d. Repeat step c until the predefined rounds of negotiations have been reached.",
                    "sid": 132,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to ensure fairness in the negotiation process, we limit the amount of belief adjustment, ∆(ai), during each round of negotiation.",
                    "sid": 133,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the desired rounds of negotiation is NR, then the amount of adjustment in each round should be limited to ∆(ai)/NR.",
                    "sid": 134,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NR should be set to allow all agents to have a fair chance to participate in the negotiation process.",
                    "sid": 135,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here we set NR to 10.",
                    "sid": 136,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the end of negotiation, only agents whose beliefs are greater than the threshold are selected.",
                    "sid": 137,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 shows the resulting set of NEs derived from the list given in Figure 2.",
                    "sid": 138,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "中国卫星发射代理公司在港开业承揽卫星发射、搭载、 回收和轨道测控等服务 张健 新华社香港７月９日电 （记者张健）由中国远望（集团）总公司、中国长城 工业总公司和香港星光传讯（集团）有限公司董事长 黄金富及董事侯伯文合作组建的 中国卫星发射代理 （香港）有限公司，８日在中国香港正式开业。 Fig.",
                    "sid": 139,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3: NEs after agents-based modification",
                    "sid": 140,
                    "ssid": 43,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the overall process of ne recognition. ",
            "number": "4",
            "sents": [
                {
                    "text": "Since there is no white space between words in Chinese, the first essential step is to perform preliminary segmentation.",
                    "sid": 141,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we adopt a greedy approach of generating all possible segmentation from the input text by performing the dictionary-based look-up using a common word dictionary.",
                    "sid": 142,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The common word dictionary is generated from the PKU corpus (Yu 99) (see Section 5.1).",
                    "sid": 143,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, we compute the rationality value of each token in the context of being a keyword, general word, or as boundary (prefix or suffix) of a specific NE type.",
                    "sid": 144,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Third, we identify all possible NE cue-words and use them as seeds of NE candidates.",
                    "sid": 145,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We construct all possible NEs from the cue-word positions through boundary extension and context inclusion.",
                    "sid": 146,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Forth, we modify the rationality values of all possible NEs using the agent-based negotiation methodology.",
                    "sid": 147,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The conflicts between possible NEs will disappear.",
                    "sid": 148,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fifth, we select NEs with the labels of its corresponding seed if their rationality values are above a predefined limit θ.",
                    "sid": 149,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The value θ affects the balance between recall and precision.",
                    "sid": 150,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental results and discussions. ",
            "number": "5",
            "sents": [
                {
                    "text": "5.1 The Datasets Used in Our Experiments.",
                    "sid": 151,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use a number of openly available datasets for our training and testing, including the PKU-corpus (Yu 99), Hownet (Dong & Dong 00), MET2 Chinese resources (Chinchor 02), and two name lists (for foreign and ORG names) collected from the web by using a bootstrapping approach.",
                    "sid": 152,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The PKU is a manually tagged corpus containing one-month of news report from China’s People Daily.",
                    "sid": 153,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It uses over 30 POS tags including separate tags for surname and first-name.",
                    "sid": 154,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It contains about 37,000 sentences with over 106 tokens.",
                    "sid": 155,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From these resources, we generate the following dictionaries and statistics.",
                    "sid": 156,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a. We use the PKU corpus to build a common word dictionary by removing all words that are tagged as NE.",
                    "sid": 157,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting dictionary contains 37,025 common words.",
                    "sid": 158,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "b. From the PKU corpus, we compute each token’s distribution information based on its POS tags, and if it is an NE, its NE type and its role with respect to the NE.",
                    "sid": 159,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Altogether, we obtain the distribution information of about 37,000 different tokens.",
                    "sid": 160,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "c. We maintain a list of LOCs found in the MET-2 test corpus.",
                    "sid": 161,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do not maintain the PER and ORG lists, because their re-occurrence probabilities are low.",
                    "sid": 162,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "d. We supplement the distribution information derived in step (b) by incorporating tokens obtained from other resources stated above.",
                    "sid": 163,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resources we derived are available for down loading at http://www.pris.nus.edu.sg/ie.html 5.2 The Experiment and.",
                    "sid": 164,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results We test our resulting model on the MET-2 test corpus.",
                    "sid": 165,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 tabulates the results of our system in terms of recall (Rc), precision (Pr) and F1 measures.",
                    "sid": 166,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to demonstrate the effectiveness of our approach, we perform the tests under 3 different test configurations.",
                    "sid": 167,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a. We perform the baseline test by simply performing name-dictionary look-up.",
                    "sid": 168,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice that we do not use PER dictionary, and hence the performance under PER is left blank (*).",
                    "sid": 169,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "b. We extract all possible NEs by using only the rationality-based approach where the threshold ℜ is set to 1.1.",
                    "sid": 170,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If there are conflicts between possible NEs, we simply select the NE with the maximal rationality.",
                    "sid": 171,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "c. We employ the agent-based modification in conjunction with the rationality based approach to select the best possible NEs.",
                    "sid": 172,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For comparison purpose, we also list in Table 3 the corresponding results reported in Yu et al.",
                    "sid": 173,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(98) and Chen et al.",
                    "sid": 174,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(98) for the MUC7 tests.",
                    "sid": 175,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typ e NC NP NW NM NS Rc Pr F1 Ba selin e tes t (a) OR G P E R L O C 79 3 0 295 0 * * * * * 363 84 0 303 26 21 98 35.",
                    "sid": 176,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 * * * 54 86 66.",
                    "sid": 177,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 Con fig (b) OR G P E R L O C 309 5 28 35 47 154 2 7 11 87 618 0 29 103 112 83 79 81.",
                    "sid": 178,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 89 62 73.",
                    "sid": 179,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 82 81 81.",
                    "sid": 180,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 Con fig (c) OR G P E R L O C 356 2 5 14 21 167 1 2 4 9 703 0 18 29 52 95 93 93.",
                    "sid": 181,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 96 93 94.",
                    "sid": 182,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 94 91 92.",
                    "sid": 183,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 Re sul ts of Ch en et (9 8) O R G P E R L O C 393 0 7 77 44 159 0 0 25 56 583 0 65 102 194 78 83 81.",
                    "sid": 184,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 91 74 81.",
                    "sid": 185,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 78 69 73.",
                    "sid": 186,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Re sul ts of Yu et al.",
                    "sid": 187,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(98 ) OR G P E R L O C 331 0 14 32 25 160 0 7 7 74 682 0 1 67 83 88 89 88.",
                    "sid": 188,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 92 66 76.",
                    "sid": 189,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 91 89 0.0 where Pr = (NC + 0.5*NP)/(NC + NW + NP + NS); Rc = (NC + 0.5*NP)/(NC + NW + NP + NM); F1 = 2*Pr*Rc/(Pr+Rc).",
                    "sid": 190,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and NC gives the number of NEs correctly recognized; NP denotes the number of NEs partially recognized; NW gives the number of NEs incorrectly recognized; NM denotes the number of NEs missed; and finally NS gives the number of NEs found by the system but not in the tagged list.",
                    "sid": 191,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3: Results of MET2 under different configurations Table 3 shows that as we apply the rationality model (Config.",
                    "sid": 192,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "b) followed by multi-agent framework (Config.",
                    "sid": 193,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "c), the performance of the system improves steadily until it reaches a high performance of over 92% in F1 value.",
                    "sid": 194,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact Config c results in significant improvements over Conig b in both precision and recall forall NE types.",
                    "sid": 195,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This shows that the agent-based modification could significantly reduce spurious and missing NEs.",
                    "sid": 196,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of our overall system is significantly better than both reported systems as listed in Table 3.",
                    "sid": 197,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To demonstrate the effectiveness of our approach on general web-based documents, we perform another informal test to recognize NEs on the 100 randomly collected headline news articles from the well-known Chinese web sites (www.sina.com.cn, www.sohu.com, www.",
                    "sid": 198,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "to Named Entity Recognition.",
                    "sid": 199,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ph.D. Thesis, New York Univ. Chen H. H., Ding Y. W. Tsai S.C. & Bian, G.W.",
                    "sid": 200,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1998) Description of the NTU System used for MET-2.",
                    "sid": 201,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In MUC7 Proc.",
                    "sid": 202,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chinchor N. A.",
                    "sid": 203,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2002), http://www.itl.nist.gov/iaui/ 894.02/related_projects/muc/.",
                    "sid": 204,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cucerzan S. & Yarowsky D. D.",
                    "sid": 205,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1999) Language Independent Named Entity Recognition Combining Morphological and Contextual Evidence.",
                    "sid": 206,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Proc of 1999 Joint SIGDAT Conference on Empirical Methods in NLP & Very Large Corpora, 9099.",
                    "sid": 207,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Decker K., & Lesser V.",
                    "sid": 208,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1995) Designing a Family of st zaobao.com, www.Chinese times.com).",
                    "sid": 209,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Coordination Algorithm, In Proc Of 1 Int’l Conf.",
                    "sid": 210,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "topics covered in these articles ranging from politic, economic, society to sports.",
                    "sid": 211,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The informal test shows that our approach could perform well on general web-based articles with F1 measures of over 90%.",
                    "sid": 212,
                    "ssid": 62,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "6",
            "sents": [
                {
                    "text": "Chinese NE recognition is a difficult problem because of the uncertainty in word segmentation.",
                    "sid": 213,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many existing techniques that require knowledge of word segmentation, and syntactic and semantic tagging of text cannot be applied.",
                    "sid": 214,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we propose a new approach of employing a rationality model in a multi-agent framework.",
                    "sid": 215,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We employ a greedy strategy and use the NE rationality measures to detect all possible NEs in the text.",
                    "sid": 216,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then treat the process of selecting the best possible NEs as the multi-agent negotiation problem.",
                    "sid": 217,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting system is robust and is able to handle different NE models.",
                    "sid": 218,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our test on the MET-2 test corpus indicates that we could achieve high F1 values of above 92% on all NE types.",
                    "sid": 219,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We plan to further test our system on a large-scale test corpus.",
                    "sid": 220,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will refine our techniques on a wide variety of text corpuses, and apply the bootstrapping technique to tackle the data sparseness problem.",
                    "sid": 221,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we will extend our research to perform relation and information extraction in multilingual text.",
                    "sid": 222,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}