{
    "ID": "C02-1033",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We present in this paper a method for achieving in an integrated way two tasks of topic analysis: segmentation and link detection.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method combines word repetition and the lexical cohesion stated by a collocation network to compensate for the respective weaknesses of the two approaches.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We report an evaluation of our method for segmentation on two corpora, one in French and one in English, and we propose an evaluation measure that specifically suits that kind of systems.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Topic analysis, which aims at identifying the topics of a text, delimiting their extend and finding the relations between the resulting segments, has recently raised an important interest.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The largest part of it was dedicated to topic segmentation, also called linear text segmentation, and to the TDT (Topic Detection and Tracking) initiative (Fiscus et al., 1999), which addresses all the tasks we have mentioned but from a domain-dependent viewpoint and not necessarily in an integrated way.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Systems that implement this work can be categorized according to what kind of knowledge they use.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of those that achieve text segmentation only rely on the intrinsic characteristics of texts: word distribution, as in (Hearst, 1997), (Choi, 2000) and (Utiyama and Isahara, 2001), or linguistic cues as in (Passonneau and Litman, 1997).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They can be applied without restriction about domains but have low results when a text doesn’t characterize its topical structure by surface clues.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some systems exploit domain-independent knowl edge about lexical cohesion: a network of words built from a dictionary in (Kozima, 1993); a large set of collocations collected from a corpus in (Fer ret, 1998), (Kaufmann, 1999) and (Choi, 2001).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To some extend, this knowledge permits these systems to discard some false topical shifts without losing their independence with regard to domains.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last main type of systems relies on knowledge about the topics they may encounter in the texts they process.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is typically the kind of approach developed in TDT where this knowledge is automatically built from a set of reference texts.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The work of Bigi (Bigi et al., 1998) stands in the same perspective but focuses on much larger topics than TDT.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These systems have a limited scope due to their topic representations but they are also more precise for the same reason.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hybrid systems that combine the approaches we have presented were also developed and illustrated the interest of such a combination: (Jobbins and Evett, 1998) combined word recurrence, collocations and a thesaurus; (Beeferman et al., 1999) relied on both collocations and linguistic cues.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The topic analysis we propose implements such a hybrid approach: it relies on a general language resource, a collocation network, but exploits it together with word recurrence in texts.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, it simultaneously achieves topic segmentation and link detection, i.e. determining whether two segments discuss the same topic.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We detail in this paper the implementation of this analysis by the TOPICOLL system, we reportevaluations of its capabilities concerning segmen tation for two languages, French and English, and finally, we propose an evaluation measure that integrates both segmentation and link detection.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "overview of topicoll. ",
            "number": "2",
            "sents": [
                {
                    "text": "In accordance with much work about discourse analysis, TOPICOLL processes texts linearly: it detects topic shifts and finds links between segments without delaying its decision, i.e., by only taking into account the part of text that has been already analyzed.",
                    "sid": 19,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A window that delimits the current focus of the analysis is moved over each text to be processed.",
                    "sid": 20,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This window contains the lemmatized content words of the text, resulting from its pre-processing.",
                    "sid": 21,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A topic context is associated to this focus window.",
                    "sid": 22,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is made up of both the words of the window and the words that are selected from a collocation network1 as strongly linked to the words of the window.",
                    "sid": 23,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The current segment is also given a topic context.",
                    "sid": 24,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This context results from the fusion of the contexts associated to the focus window when this window was in the segment space.",
                    "sid": 25,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A topic shift is then detected when the context of the focus window and the context of the current segment are not similar any more for several successive positions of the focus window.",
                    "sid": 26,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This process also performs link detection by comparing the topic context of each new segment to the context of the already delimited segments.",
                    "sid": 27,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of a collocation network permits TOPICOLL to find relations beyond word recurrence and to associate a richer topical representa tion to segments, which facilitates tasks such as link detection or topic identification.",
                    "sid": 28,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But work such as (Kozima, 1993), (Ferret, 1998) or (Kaufmann, 1999) showed that using a domain- independent source of knowledge for text segmentation doesn’t necessarily lead to get better results than work that is only based on word distribution in texts.",
                    "sid": 29,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the reasons of this fact is that these methods don’t precisely control the relations they select or don’t take into account the sparseness of their knowledge.",
                    "sid": 30,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, while they discard some incorrect topic shifts found by methods based on word recurrence, they also find incorrect shifts when the relevant relations are not present in their knowledge or don’t find some correct shifts because of the selection of non relevant relations from a topical viewpoint.",
                    "sid": 31,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By combining word recurrence and relations selected from a collocation network, TOPICOLL aims at exploiting a domain-independent source of knowledge for text segmentation in a more accurate way.",
                    "sid": 32,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "collocation networks. ",
            "number": "3",
            "sents": [
                {
                    "text": "TOPICOLL depends on a resource, a collocation network, that is language-dependent.",
                    "sid": 33,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two collocation networks were built for it: one for French, 1 A collocation network is a set of collocations between words.",
                    "sid": 34,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This set can be viewed as a network whose nodes are words and edges are collocations.",
                    "sid": 35,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "from the Le Monde newspaper (24 months between 1990 and 1994), and one for English, from the L.A. Times newspaper (2 years, part of the TREC corpus).",
                    "sid": 36,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The size of each corpus was around 40 million words.",
                    "sid": 37,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The building process was the same for the two networks.",
                    "sid": 38,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the initial corpus was pre- processed in order to characterize texts by their topically significant words.",
                    "sid": 39,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we retained only the lemmatized form of plain words, that is, nouns, verbs and adjectives.",
                    "sid": 40,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Collocations were extracted according to the method described in (Church and Hanks, 1990) by moving a window on texts.",
                    "sid": 41,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parameters were chosen in order to catch topical relations: the window was rather large, 20-word wide, and took into account the boundaries of texts; moreover, collocations were indifferent to word order.",
                    "sid": 42,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also adopted an evaluation of mutual information as a cohesion measure of each collocation.",
                    "sid": 43,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This measure was normalized according to the maximal mutual information relative to the considered corpus.",
                    "sid": 44,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After filtering the less significant collocations (collocations with less than 10 occurrences and cohesion lower than 0.1), we got a network with approximately 23,000 words and 5.2 million collocations for French, 30,000 words and 4.8 million collocations for English.",
                    "sid": 45,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "description of topicoll. ",
            "number": "4",
            "sents": [
                {
                    "text": "TOPICOLL is based on the creation, the update and the use of a topical representation of both the segments it delimits and the content of its focus window at each position of a text.",
                    "sid": 46,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These topical representations are called topic contexts.",
                    "sid": 47,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Topic shifts are found by detecting that the topic context of the focus window is not similar anymore to the topic context of the current segment.",
                    "sid": 48,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Link detection is performed by comparing the context of a new segment to the context of the previous segments.",
                    "sid": 49,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Topic contexts.",
                    "sid": 50,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A topic context characterizes the topical dimension of the entity it is associated to by two vectors of weighted words.",
                    "sid": 51,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of these vectors, called text vector, is made up of words coming from the text that is analyzed.",
                    "sid": 52,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other one, called collocation vector, contains words selected from a collocation network and strongly linked to the words of the processed text.",
                    "sid": 53,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For both vectors, the weight of a word expresses its importance with regard to the other words of the vector.",
                    "sid": 54,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1.1 Topic context of the focus window The text vector of the context associated to the focus window is made up of the content words of the window.",
                    "sid": 55,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their weight is given by: lected if it is linked to at least wst (3 in our experiments) words of the window.",
                    "sid": 56,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A collocation vector may also contain some words of the window as they are generally part of the collocation network and may be selected as its other words.",
                    "sid": 57,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each selected word from the network is then assigned a weight.",
                    "sid": 58,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This weight is equal to the sum of the contributions of the window words to which it wght txt (w) occNb(w) signif (w) (1) is linked to.",
                    "sid": 59,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The contribution of a word of the window to the weight of a selected word is equal where occNb(w) is the number of occurrences of the word w in the window and signif(w) is the significance of w. The weight given by (1) combines the importance of w in the part of text delimited by the window and its general significance.",
                    "sid": 60,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This significance is defined as in (Kozima, 1993) as its normalized information in a reference corpus2: to its weight in the window, given by (1), modulated by the cohesion measure between these two words in the network (see Figure 1).",
                    "sid": 61,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More precisely, the combination of these two factors is achieved by a geometric mean: signif (w) log 2 ( f w S c ) (2) wghtcoll (w) wgthtxt (wi ) i coh(w, wi ) (3) log 2 (1 S c ) where fw is the number of occurrences of the word w in the corpus and Sc, the size of the corpus.",
                    "sid": 62,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0.48 = pw3x0.18+p w4x0.13 where coh(w,wi) is the measure of the cohesion between w and wi in the collocation network.",
                    "sid": 63,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1.2 Topic context of a segment The topic context of a segment results from the fusion of the contexts associated to the focus win n1 n2 0.21 0.10 +pw5x0.17 0.17 dow when it was inside the segment.",
                    "sid": 64,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fusion is achieved as the segment is extended: the context associated to each new position of the segment is 0.14 0.18 0.13 combined with the current context of the segment.",
                    "sid": 65,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This combination, which is done separately for 1.0 1.0 1.0 1.0 1.0 w1 0.48 w2 w3 w4 w5 text vectors and collocation vectors, consists in merging two lists of weighted words.",
                    "sid": 66,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the 1.0 selected word from the collocati on network (with its weight) word from text (with p wi, its weight in the window, equal to 1.0 for all words of the window in this example ) wor ds of the win dow cont ext that are not in the seg men t cont ext are adde d to it.",
                    "sid": 67,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The n, the weig ht of each wor d of the resul ting list is com pute d ac 0.21 link in the collocation network (with its cohesion value) Figure 1 – Selection and weighting of words from cording to its weight in the window context and its previous weight in the segment context: the collocation network wght x (w, Cs, t ) wght x (w, Cs, t 1) (4) The building of the collocation vector for the window’s context comes from the procedure presented (signif (w) wght x (w, Cw, t ))in (Ferret, 1998) for evaluating the lexical cohe sion of a text.",
                    "sid": 68,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It consists in selecting words of the collocation network that are topically close to those in the window.",
                    "sid": 69,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We assume that this closeness is related to the number of links that exist between a word of the network and the words of the window.",
                    "sid": 70,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, a word of the network is se 2 In our case, this is the corpus used for building the.",
                    "sid": 71,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "collocation network.with Cw, the context of the window, Cs, the con text of the segment and wghtx(w,C{s,w},t), the weight of the word w in the vector x (txt or coll) of the context C{s,w} for the position t. For the words from the window context that are not part of the segment context, wghtx(w,Cs,t-1) is equal to 0.The revaluation of the weight of a word in a seg ment context given by (4) is a solution halfway between a fast and a slow evolution of the content of segment contexts.",
                    "sid": 72,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The context of a segment has to be stable because if it follows too narrowly the topical evolution of the window context, topic shifts could not be detected.",
                    "sid": 73,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it must also adapt itself to small variations in the way a topic is expressed when progressing in the text in order not to detect false topic shifts.",
                    "sid": 74,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1.3 Similarity between contexts In order to determine if the content of the focus window is topically coherent or not with the current segment, the topic context of the window is compared to the topic context of the segment.",
                    "sid": 75,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This comparison is performed in two stages: first, a similarity measure is computed between the vectors of the two contexts; then, the resulting values are exploited by a decision procedure that states if the two contexts are similar.",
                    "sid": 76,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As (Choi, 2000) or (Kaufmann, 1999), we use the cosine measure for evaluating the similarity be tween a vector of the context window (Vw) and the equivalent vector in the segment context (Vs): sim(Vs x ,Vwx ) tive vote in favor of the similarity of the two contexts is decided if the value exceeds this threshold.",
                    "sid": 77,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, the global similarity of the two contexts is rejected only if the votes for the two vectors are negative.",
                    "sid": 78,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Topic segmentation.",
                    "sid": 79,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm for detecting topic shifts is taken from (Ferret and Grau, 2000) and basically relies on the following principle: at each text position, if the similarity between the topic context of the focus window and the topic context of the current segment is rejected (see 4.1.3), a topic shift is assumed and a new segment is opened.",
                    "sid": 80,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise, the active segment is extended up to the current position.",
                    "sid": 81,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This algorithm assumes that the transition between two segments is punctual.",
                    "sid": 82,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As TOPICOLL only oper ates at word level, its precision is limited.",
                    "sid": 83,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This imprecision makes necessary to set a short delay before deciding that the active segment really ends and similarly, before deciding that a new segment with a stable topic begins.",
                    "sid": 84,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, the algorithm wg x (wi , Cs) i 2 wg x (wi , Cw) 2 (5) for detecting topic shifts distinguishes four states: – the NewTopicDetection state takes place when a wg x (wi , Cs) i wg x (wi , Cw) i new segment is going to be opened.",
                    "sid": 85,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This opening is then confirmed provided that the content of the where wgx(wi,C{s,w}) is the weight of the word wi in the vector x (txt or coll) of the context C{s,w}.",
                    "sid": 86,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we assume that the most significant words of a segment context are the most recurrent ones, the similarity measure takes into account only the words of a segment context whose the recurrence3 is above a fixed threshold.",
                    "sid": 87,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This one is higher for text vectors than for collocation vectors.",
                    "sid": 88,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This filtering is applied only when the context of a segment is considered as stable (see 4.2).",
                    "sid": 89,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The decision stage takes root in work about combining results of several systems that achieve thesame task.",
                    "sid": 90,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our case, the evaluation of the simi larity between Cs and Cw at each position is based on a vote that synthesizes the viewpoint of the text vector and the viewpoint of the collocation vector.",
                    "sid": 91,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the value of the similarity measure for each vector is compared to a fixed threshold and a posi 3 The recurrence of a word in a segment context is gi-.",
                    "sid": 92,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ven by the ratio between the number of window contexts in which the word was present and the number of window contexts gathered by the segment context.",
                    "sid": 93,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "focus window context doesn’t change for several positions.",
                    "sid": 94,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, the core of the segment con text is defined when TOPICOLL is in this state; – the InTopic state is active when the focus window is inside a segment with a stable topic; – the EndTopicDetection state occurs when the focus window is inside a segment but a difference between the context of the window and the context of the current segment suggests that this segment could end soon.",
                    "sid": 95,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As for the NewTopicDetection state, this difference has to be confirmed for several positions before a change of state is decided; – the OutOfTopic state is active between two segments.",
                    "sid": 96,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generally, TOPICOLL stays in this state no longer than 1 or 2 positions but when neither the words from text nor the words selected from the collocation network are recurrent, i.e. no stable topic can be detected according to these features, this number of positions may be equal to the size of a segment.",
                    "sid": 97,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The transition from one state to another follows the automaton of Figure 2 according to three parameters: – its current state; – the similarity between the context of the focus window and the context of the current segment: Sim or no Sim; – the number of successive positions of the focus window for which the current state doesn’t change: confirmNb.",
                    "sid": 98,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It must exceed the Tconfirm threshold (equal to 3 in our experiments) for leaving the NewTopicDetection or the EndTopicDe tection state.",
                    "sid": 99,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Link detection.",
                    "sid": 100,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm of TOPICOLL for detecting identity links between segments is closely associated to its algorithm for delimiting segments.",
                    "sid": 101,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When TO- PICOLL goes from the NewTopicDetection state to the InTopic state, it first checks whether the current context of the new segment is similar to one of the contexts of the previous segments.",
                    "sid": 102,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, the similarity between contexts only relies on the similarity measure (see (5)) between their collocation vectors.",
                    "sid": 103,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A specific threshold is used for Sim & confirmNb = Tconfirm InTopic Sim Sim no Sim no Sim & confirmNb < Tconfirm the decision.",
                    "sid": 104,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the similarity value exceeds this threshold, the new segment is linked to the corresponding segment and takes the context of this one as its own context.",
                    "sid": 105,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, TOPICOLL assumes NewTopic Detection Sim & confirmNb < Tconfirm Sim no Sim OutOfTopic no Sim EndTopic Detection no Sim & confirmNb = Tconfirm that the new segment continues to develop a previous topic.",
                    "sid": 106,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When several segments fulfills the condition for link detection, TOPICOLL selects the one with the highest similarity value.",
                    "sid": 107,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Experime nts Figure 2 – Automaton for topic shift detection The processing of a segment starts with the OutOfTopic state, after the end of the previous segment or at the beginning of the text.",
                    "sid": 108,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As soon as the context of the focus window is stable enough between two successive positions, TOPICOLL enters into the NewTopicDetection state.",
                    "sid": 109,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The InTopic state can then be reached only if the window context is found stable for the next confirmNb1 positions.",
                    "sid": 110,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise, TOPICOLL assumes that it is a false alarm and returns to the OutOfTopic state.",
                    "sid": 111,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The detection of the end of a segment is symmetrical to the detection of its beginning.",
                    "sid": 112,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TOPICOLL goes into the EndTopicDetection state as soon as the content of the window context begins to change significantly between two successive positions but the transition towards the OutOfTopic state is done only if this change is confirmed for the next confirmNb1 next positions.",
                    "sid": 113,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This algorithm is completed by a specific mechanism related to the OutOfTopic state.",
                    "sid": 114,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When TOPICOLL stays in this state for a too long time (this time is defined as 10 positions of the focus window in our experiments), it assumes that the topic of the current part of text is difficult to characterize by using word recurrence or selection from a collocation network and it creates a new segment that covers all the concerned positions.",
                    "sid": 115,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For evaluating TOPICOLL about segmentation, we applied it to the “classical” task of discovering boundaries between concatenated texts.",
                    "sid": 116,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TOPICOLL was adapted for aligning boundaries with ends of sentences.",
                    "sid": 117,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the probabilistic error metric Pk proposed in (Beeferman et al., 1999) for measuring segmentation accuracy4.",
                    "sid": 118,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recall and precision was computed for the Le Monde corpus to compare TOPICOLL with older systems5.",
                    "sid": 119,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, the match between a boundary from TOPICOLL and a document break was accepted if the boundary was not farther than 9 plain words.",
                    "sid": 120,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "pair of words, separated by k words, is wrongly classified, i.e. they are found in the same segment by TOPICOLL while they are actually in different ones (miss of a document break) or they are found in different segments by TOPICOLL while they are actually in the same one (false alarm).",
                    "sid": 121,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "D the number of document breaks, Nb the number of boundaries found by TOPICOLL and Nt the number of boundaries that are document breaks.",
                    "sid": 122,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Monde newspaper.",
                    "sid": 123,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results in Tables 1 and 2 are average values computed from 10 different sequences of them.",
                    "sid": 124,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline procedure consisted in randomly choosing a fixed number of sentence ends as boundaries.",
                    "sid": 125,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its results in Tables 1 and 2 are average values from 1,000 draws.",
                    "sid": 126,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Systems Recall Precision F1-measure baseline 0.51 0.28 0.36 SEGCOHLEX SEGAPSITH TextTiling 0.68 0.92 0.72 0.37 0.52 0.81 0.48 0.67 0.76 TOPICOLL1 TOPICOLL2 TOPICOLL3 0.86 0.86 0.66 0.74 0.78 0.60 0.80 0.81 0.63 Table 1 – Precision/recall for Le Monde corpus TOPICOLL1 is the system described in section 4.",
                    "sid": 127,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TOPICOLL2 is the same system but without its link detection part.",
                    "sid": 128,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of these two variants show that the search for links between segments doesn’t significantly debase TOPICOLL’s capabilities for segmentation.",
                    "sid": 129,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TOPICOLL3 is a version of TOPICOLL that only relies on word recurrence.",
                    "sid": 130,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SEGCOHLEX and SEGAPSITH are the systems described in (Ferret, 1998) and (Ferret and Grau, 2000).",
                    "sid": 131,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TextTiling is our implementation of Hearst’s algorithm with its standard parameters.",
                    "sid": 132,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Systems Miss False alarm Error baseline 0.46 0.55 0.50 TOPICOLL1 TOPICOLL2 0.17 0.17 0.24 0.22 0.21 0.20 Table 2 – Pk for Le Monde corpus First, Table 1 shows that TOPICOLL is more accurate when its uses both word recurrence and collocations.",
                    "sid": 133,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, it shows that TOPICOLL gets better results than a system that only relies on a collocation network such as SEGCOHLEX.",
                    "sid": 134,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also gets better results than a system such as TextTiling that is based on word recurrence and as TOPICOLL, works with a local context.",
                    "sid": 135,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, Table 1 confirms the fact reported in (Jobbins and Evett, 1998) that using collocations together with word recurrence is an interesting approach for text segmentation.",
                    "sid": 136,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, TOPICOLL is more accurate than a system such as SEGAPSITH that depends on topic rep resentations.",
                    "sid": 137,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its accuracy is also slightly higher than the one reported in (Bigi et al., 1998) for a system that uses topic representations in a probabilistic way: 0.75 as precision, 0.80 as recall and 0.77 as f1-measure got on a corpus made of Le Monde’s articles too.",
                    "sid": 138,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This corpus is made up of 700 samples defined as follows: “A sample is a concatenation of ten text segments.",
                    "sid": 139,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A segment is the first n sentences of a randomly selected document for the Brown corpus”.",
                    "sid": 140,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each column of Table 3 states for an interval of values for n. Systems 311 35 68 911 baseline 0.45 0.38 0.39 0.36 CWM U00 C99 DotPlot Segmenter TextTiling 0.09 0.10 0.12 0.18 0.36 0.46 0.10 0.09 0.11 0.20 0.23 0.44 0.07 0.07 0.09 0.15 0.33 0.43 0.05 0.05 0.09 0.12 0.43 0.48 TOPICOLL1 TOPICOLL2 0.30 0.31 0.28 0.28 0.27 0.28 0.34 0.34 Table 3 – Pk for C99 corpus The first seven lines of Table 3 results from Choi’s experiments (Choi, 2001).",
                    "sid": 141,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline is a procedure that partitions a document into 10 segments of equal length.",
                    "sid": 142,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CWM is described in (Choi, 2001), U00 in (Utiyama and Isahara, 2001), C99 in (Choi, 2000), DotPlot in (Reynar, 1998) and Segmenter in (Kan et al., 1998).",
                    "sid": 143,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 confirms first that the link detection part of TOPICOLL doesn’t debase its segmentation capabilities.",
                    "sid": 144,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also shows that TOPICOLL’s results on this corpus are significantly lower than its results on the Le Monde corpus.",
                    "sid": 145,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is partially due to our collocation network for English: its density, i.e. the ratio between the size of its vocabulary and its number of collocations, is 30% lower than the density of the network for French, which has certainly a significant effect.",
                    "sid": 146,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 also shows that TOPICOLL has worse results than systems such as CWM, U00, C99 or DotPlot.",
                    "sid": 147,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be explained by the fact that TOPICOLL only works with a local context whereas these systems rely on the whole text they process.",
                    "sid": 148,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a consequence, they have a global view on texts but are more costly than TOPICOLL from an algorithmic viewpoint.",
                    "sid": 149,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, link detection makes TOPICOLL functionally richer than they are.",
                    "sid": 150,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The global evaluation of a system such as TOPICOLL faces a problem: a reference for link detection is relative to a reference for segmentation.",
                    "sid": 151,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, mapping it onto the segments delimited by a system to evaluate is not straightforward.",
                    "sid": 152,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To bypass this problem, we chose an approach close the one adopted in TDT for the link detection task: we evaluated the probability of an error in classifying each couple of positions in a text as being part of the same topic (Cpsame) or belonging to different topics (Cpdiff).",
                    "sid": 153,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A miss is detected if a couple is found about different topics while they are about the same topic and a false alarm corresponds to the complementary case.",
                    "sid": 154,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Systems Miss False alarm Error baseline TOPICOLL 0.85 0.73 0.06 0.01 0.45 0.37 Table 4 – Error rates for Le Monde corpus As the number of Cpdiff couples is generally much larger than the number of Cpsame couples, we randomly selected a number of Cpdiff couples equal to the number of Cpsame couples in order to have a large range of possible values.",
                    "sid": 155,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 shows the results of TOPICOLL for the considered measure and compares them to a baseline procedure that randomly set a fixed number of boundaries and a fixed number of links between the delimited segments.",
                    "sid": 156,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This measure is a first proposition that should certainly be improved, especially for balancing more soundly misses and false alarms.",
                    "sid": 157,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 Conclusion.",
                    "sid": 158,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have proposed a method for achieving both topic segmentation and link detection by using collocations together with word recurrence in texts.",
                    "sid": 159,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its evaluation showed the soundness of this approach for working with a local context.",
                    "sid": 160,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We plan to extend it to methods that rely on the whole text they process.",
                    "sid": 161,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also aim at extending the evaluation part of this work by improving the global measure we have proposed and by comparing our results to human judgments.",
                    "sid": 162,
                    "ssid": 117,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}