{
    "ID": "C02-1025",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Named Entity Recognition: A Maximum Entropy Approach Using Global Information",
                    "sid": 0,
                    "ssid": null,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper presents a maximum entropy-based named entity recognizer (NER).",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It differs from previous machine learning-based NERs in that it uses information from the whole document to classify each word, with just one classifier.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous work that involves the gathering of information from the whole document often uses a secondary classifier, which corrects the mistakes of a primary sentence- based classifier.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we show that the maximum entropy framework is able to make use of global information directly, and achieves performance that is comparable to the best previous machine learning-based NERs on MUC6 and MUC7 test data.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Considerable amount of work has been done in recent years on the named entity recognition task, partly due to the Message Understanding Conferences (MUC).",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A named entity recognizer (NER) is useful in many NLP applications such as information extraction, question answering, etc. On its own, a NER can also provide users who are looking for person or organization names with quick information.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In MUC6 and MUC7, the named entity task is defined as finding the following classes of names: person, organization, location, date, time, money, and percent (Chinchor, 1998; Sundheim, 1995) Machine learning systems in MUC6 and MUC 7 achieved accuracy comparable to rule-based systems on the named entity task.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Statistical NERs usually find the sequence of tags that maximizes the probability , where is the sequence of words in a sentence, and is the sequence of named-entity tags assigned to the words in . Attempts have been made to use global information (e.g., the same named entity occurring in different sentences of the same document), but they usually consist of incorporating an additional classifier, which tries to correct the errors in the output of a first NER (Mikheev et al., 1998; Borthwick, 1999).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose maximizing , where is the sequence of named- entity tags assigned to the words in the sentence , and is the information that can be extracted from the whole document containing . Our system is built on a maximum entropy classifier.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By making use of global context, it has achieved excellent results on both MUC6 and MUC7 official test data.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will refer to our system as MENERGI (Maximum Entropy Named Entity Recognizer using Global Information).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As far as we know, no other NERs have used information from the whole document (global) as well as information within the same sentence (local) in one framework.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of global features has improved the performance on MUC6 test data from 90.75% to 93.27% (27% reduction in errors), and the performance on MUC7 test data from 85.22% to 87.24% (14% reduction in errors).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results are achieved by training on the official MUC6 and MUC7 training data, which is much less training data than is used by other machine learning systems that worked on the MUC6 or MUC7 named entity task (Bikel et al., 1997; Bikel et al., 1999; Borth- wick, 1999).",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe it is natural for authors to use abbreviations in subsequent mentions of a named entity (i.e., first “President George Bush” then “Bush”).",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As such, global information from the whole context of a document is important to more accurately recognize named entities.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although we have not done any experiments on other languages, this way of using global features from a whole document should be applicable to other languages.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Recently, statistical NERs have achieved results that are comparable to hand-coded systems.",
                    "sid": 18,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since MUC6, BBN' s Hidden Markov Model (HMM) based IdentiFinder (Bikel et al., 1997) has achieved remarkably good performance.",
                    "sid": 19,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MUC7 has also seen hybrids of statistical NERs and hand-coded systems (Mikheev et al., 1998; Borthwick, 1999), notably Mikheev' s system, which achieved the best performance of 93.39% on the official NE test data.",
                    "sid": 20,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MENE (Maximum Entropy Named Entity) (Borth- wick, 1999) was combined with Proteus (a hand- coded system), and came in fourth among all MUC 7 participants.",
                    "sid": 21,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MENE without Proteus, however, did not do very well and only achieved an F measure of 84.22% (Borthwick, 1999).",
                    "sid": 22,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among machine learning-based NERs, Identi- Finder has proven to be the best on the official MUC6 and MUC7 test data.",
                    "sid": 23,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MENE (without the help of hand-coded systems) has been shown to be somewhat inferior in performance.",
                    "sid": 24,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By using the output of a hand-coded system such as Proteus, MENE can improve its performance, and can even outperform IdentiFinder (Borthwick, 1999).",
                    "sid": 25,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mikheev et al.",
                    "sid": 26,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1998) did make use of information from the whole document.",
                    "sid": 27,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, their system is a hybrid of hand-coded rules and machine learning methods.",
                    "sid": 28,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another attempt at using global information can be found in (Borthwick, 1999).",
                    "sid": 29,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He used an additional maximum entropy classifier that tries to correct mistakes by using reference resolution.",
                    "sid": 30,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reference resolution involves finding words that co-refer to the same entity.",
                    "sid": 31,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to train this error-correction model, he divided his training corpus into 5 portions of 20% each.",
                    "sid": 32,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MENE is then trained on 80% of the training corpus, and tested on the remaining 20%.",
                    "sid": 33,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This process is repeated 5 times by rotating the data appropriately.",
                    "sid": 34,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the concatenated 5 * 20% output is used to train the reference resolution component.",
                    "sid": 35,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will show that by giving the first model some global features, MENERGI outperforms Borthwick' s reference resolution classifier.",
                    "sid": 36,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On MUC6 data, MENERGI also achieves performance comparable to IdentiFinder when trained on similar amount of training data.",
                    "sid": 37,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "both MENE and IdentiFinder used more training data than we did (we used only the official MUC 6 and MUC7 training data).",
                    "sid": 38,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the MUC6 data, Bikel et al.",
                    "sid": 39,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1997; 1999) do have some statistics that show how IdentiFinder performs when the training data is reduced.",
                    "sid": 40,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our results show that MENERGI performs as well as IdentiFinder when trained on comparable amount of training data.",
                    "sid": 41,
                    "ssid": 24,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "system description. ",
            "number": "3",
            "sents": [
                {
                    "text": "The system described in this paper is similar to the MENE system of (Borthwick, 1999).",
                    "sid": 42,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It uses a maximum entropy framework and classifies each word given its features.",
                    "sid": 43,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each name class is subdivided into 4 sub-classes, i.e., N begin, N continue, N end, and N unique.",
                    "sid": 44,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, there is a total of 29 classes (7 name classes 4 sub-classes 1 not-a-name class).",
                    "sid": 45,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Maximum Entropy.",
                    "sid": 46,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The maximum entropy framework estimates probabilities based on the principle of making as few assumptions as possible, other than the constraints imposed.",
                    "sid": 47,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such constraints are derived from training data, expressing some relationship between features and outcome.",
                    "sid": 48,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability distribution that satisfies the above property is the one with the highest entropy.",
                    "sid": 49,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is unique, agrees with the maximum-likelihood distribution, and has the exponential form (Della Pietra et al., 1997): where refers to the outcome, the history (or context), and is a normalization function.",
                    "sid": 50,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, each feature function is a binary function.",
                    "sid": 51,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in predicting if a word belongs to a word class, is either true or false, and refers to the surrounding context: if = true, previous word = the otherwise The parameters are estimated by a procedure called Generalized Iterative Scaling (GIS) (Darroch and Ratcliff, 1972).",
                    "sid": 52,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is an iterative method that improves the estimation of the parameters at each iteration.",
                    "sid": 53,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have used the Java-based opennlp maximum entropy package1.",
                    "sid": 54,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 5, we try to compare results of MENE, IdentiFinder, and MENERGI.",
                    "sid": 55,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, 1 http://maxent.sourceforge.net 3.2 Testing.",
                    "sid": 56,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During testing, it is possible that the classifier produces a sequence of inadmissible classes (e.g., person begin followed by location unique).",
                    "sid": 57,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To eliminate such sequences, we define a transition probability between word classes to be equal to 1 if the sequence is admissible, and 0 otherwise.",
                    "sid": 58,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability of the classes assigned to the words in a sentence in a document is defined as follows: where is determined by the maximum entropy classifier.",
                    "sid": 59,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A dynamic programming algorithm is then used to select the sequence of word classes with the highest probability.",
                    "sid": 60,
                    "ssid": 19,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "feature description. ",
            "number": "4",
            "sents": [
                {
                    "text": "The features we used can be divided into 2 classes: local and global.",
                    "sid": 61,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Local features are features that are based on neighboring tokens, as well as the token itself.",
                    "sid": 62,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Global features are extracted from other occurrences of the same token in the whole document.",
                    "sid": 63,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The local features used are similar to those used in BBN' s IdentiFinder (Bikel et al., 1999) or MENE (Borthwick, 1999).",
                    "sid": 64,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, to classify a token , while Borthwick uses tokens from to (from two tokens before to two tokens after ), we used only the tokens , , and . Even with local features alone, MENERGI outperforms MENE (Borthwick, 1999).",
                    "sid": 65,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This might be because our features are more comprehensive than those used by Borthwick.",
                    "sid": 66,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In IdentiFinder, there is a priority in the feature assignment, such that if one feature is used for a token, another feature lower in priority will not be used.",
                    "sid": 67,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the maximum entropy framework, there is no such constraint.",
                    "sid": 68,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Multiple features can be used for the same token.",
                    "sid": 69,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feature selection is implemented using a feature cutoff: features seen less than a small count during training will not be used.",
                    "sid": 70,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We group the features used into feature groups.",
                    "sid": 71,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each feature group can be made up of many binary features.",
                    "sid": 72,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each token , zero, one, or more of the features in each feature group are set to 1.",
                    "sid": 73,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Local Features.",
                    "sid": 74,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The local feature groups are: Non-Contextual Feature: This feature is set to 1 for all tokens.",
                    "sid": 75,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This feature imposes constraints Table 1: Features based on the token string that are based on the probability of each name class during training.",
                    "sid": 76,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zone: MUC data contains SGML tags, and a document is divided into zones (e.g., headlines and text zones).",
                    "sid": 77,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The zone to which a token belongs is used as a feature.",
                    "sid": 78,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in MUC6, there are four zones (TXT, HL, DATELINE, DD).",
                    "sid": 79,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, for each token, one of the four features zone-TXT, zone- HL, zone-DATELINE, or zone-DD is set to 1, and the other 3 are set to 0.",
                    "sid": 80,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Case and Zone: If the token starts with a capital letter (initCaps), then an additional feature (init- Caps, zone) is set to 1.",
                    "sid": 81,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If it is made up of all capital letters, then (allCaps, zone) is set to 1.",
                    "sid": 82,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If it starts with a lower case letter, and contains both upper and lower case letters, then (mixedCaps, zone) is set to 1.",
                    "sid": 83,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A token that is allCaps will also be initCaps.",
                    "sid": 84,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This group consists of (3 total number of possible zones) features.",
                    "sid": 85,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Case and Zone of and : Similarly, if (or ) is initCaps, a feature (initCaps, zone) (or (initCaps, zone) ) is set to 1, etc. Token Information: This group consists of 10 features based on the string , as listed in Table 1.",
                    "sid": 86,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if a token starts with a capital letter and ends with a period (such as Mr.), then the feature InitCapPeriod is set to 1, etc. First Word: This feature group contains only one feature firstword.",
                    "sid": 87,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the token is the first word of a sentence, then this feature is set to 1.",
                    "sid": 88,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise, it is set to 0.",
                    "sid": 89,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexicon Feature: The string of the token is used as a feature.",
                    "sid": 90,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This group contains a large number of features (one for each token string present in the training data).",
                    "sid": 91,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At most one feature in this group will be set to 1.",
                    "sid": 92,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If is seen infrequently during training (less than a small count), then will not be selected as a feature and all features in this group are set to 0.",
                    "sid": 93,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexicon Feature of Previous and Next Token: The string of the previous token and the next token is used with the initCaps information of . If has initCaps, then a feature (initCaps, ) is set to 1.",
                    "sid": 94,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If is not initCaps, then (not-initCaps, ) is set to 1.",
                    "sid": 95,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Same for . In the case where the next token is a hyphen, then is also used as a feature: (init- Caps, ) is set to 1.",
                    "sid": 96,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because in many cases, the use of hyphens can be considered to be optional (e.g., third-quarter or third quarter).",
                    "sid": 97,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Out-of-Vocabulary: We derived a lexicon list from WordNet 1.6, and words that are not found in this list have a feature out-of-vocabulary set to 1.",
                    "sid": 98,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dictionaries: Due to the limited amount of training material, name dictionaries have been found to be useful in the named entity task.",
                    "sid": 99,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The importance of dictionaries in NERs has been investigated in the literature (Mikheev et al., 1999).",
                    "sid": 100,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sources of our dictionaries are listed in Table 2.",
                    "sid": 101,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For all lists except locations, the lists are processed into a list of tokens (unigrams).",
                    "sid": 102,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Location list is processed into a list of unigrams and bigrams (e.g., New York).",
                    "sid": 103,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For locations, tokens are matched against unigrams, and sequences of two consecutive tokens are matched against bigrams.",
                    "sid": 104,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A list of words occurring more than 10 times in the training data is also collected (commonWords).",
                    "sid": 105,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only tokens with initCaps not found in commonWords are tested against each list in Table 2.",
                    "sid": 106,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If they are found in a list, then a feature for that list will be set to 1.",
                    "sid": 107,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if Barry is not in commonWords and is found in the list of person first names, then the feature PersonFirstName will be set to 1.",
                    "sid": 108,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, the tokens and are tested against each list, and if found, a corresponding feature will be set to 1.",
                    "sid": 109,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if is found in the list of person first names, the feature PersonFirstName is set to 1.",
                    "sid": 110,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Month Names, Days of the Week, and Numbers: If is initCaps and is one of January, February, . . .",
                    "sid": 111,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", December, then the feature MonthName is set to 1.",
                    "sid": 112,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If is one of Monday, Tuesday, . . .",
                    "sid": 113,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", Sun day, then the feature DayOfTheWeek is set to 1.",
                    "sid": 114,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If is a number string (such as one, two, etc), then the feature NumberString is set to 1.",
                    "sid": 115,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suffixes and Prefixes: This group contains only two features: Corporate-Suffix and Person-Prefix.",
                    "sid": 116,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two lists, Corporate-Suffix-List (for corporate suffixes) and Person-Prefix-List (for person prefixes), are collected from the training data.",
                    "sid": 117,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For corporate suffixes, a list of tokens cslist that occur frequently as the last token of an organization name is collected from the training data.",
                    "sid": 118,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Frequency is calculated by counting the number of distinct previous tokens that each token has (e.g., if Electric Corp. is seen 3 times, and Manufacturing Corp. is seen 5 times during training, and Corp. is not seen with any other preceding tokens, then the “frequency” of Corp. is 2).",
                    "sid": 119,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most frequently occurring last words of organization names in cslist are compiled into a list of corporate suffixes, Corporate-Suffix- List.",
                    "sid": 120,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Person-Prefix-List is compiled in an analogous way.",
                    "sid": 121,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For MUC6, for example, Corporate- Suffix-List is made up of ltd., associates, inc., co, corp, ltd, inc, committee, institute, commission, university, plc, airlines, co., corp. and Person-Prefix- List is made up of succeeding, mr., rep., mrs., secretary, sen., says, minister, dr., chairman, ms. . For a token that is in a consecutive sequence of init then a feature Corporate-Suffix is set to 1.",
                    "sid": 122,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If any of the tokens from to is in Person-Prefix- List, then another feature Person-Prefix is set to 1.",
                    "sid": 123,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that we check for , the word preceding the consecutive sequence of initCaps tokens, since person prefixes like Mr., Dr., etc are not part of person names, whereas corporate suffixes like Corp., Inc., etc are part of corporate names.",
                    "sid": 124,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Global Features.",
                    "sid": 125,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Context from the whole document can be important in classifying a named entity.",
                    "sid": 126,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A name already mentioned previously in a document may appear in abbreviated form when it is mentioned again later.",
                    "sid": 127,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous work deals with this problem by correcting inconsistencies between the named entity classes assigned to different occurrences of the same entity (Borthwick, 1999; Mikheev et al., 1998).",
                    "sid": 128,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We often encounter sentences that are highly ambiguous in themselves, without some prior knowledge of the entities concerned.",
                    "sid": 129,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example: McCann initiated a new global system.",
                    "sid": 130,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) CEO of McCann . . .",
                    "sid": 131,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Description Source Location Names http://www.timeanddate.com http://www.cityguide.travel-guides.com http://www.worldtravelguide.net Corporate Names http://www.fmlx.com Person First Names http://www.census.gov/genealogy/names Person Last Names Table 2: Sources of Dictionaries The McCann family . . .",
                    "sid": 132,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3)In sentence (1), McCann can be a person or an orga nization.",
                    "sid": 133,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentence (2) and (3) help to disambiguate one way or the other.",
                    "sid": 134,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If all three sentences are in the same document, then even a human will find it difficult to classify McCann in (1) into either person or organization, unless there is some other information provided.",
                    "sid": 135,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The global feature groups are: InitCaps of Other Occurrences (ICOC): There are 2 features in this group, checking for whether the first occurrence of the same word in an unambiguous position (non first-words in the TXT or TEXT zones) in the same document is initCaps or not-initCaps.",
                    "sid": 136,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a word whose initCaps might be due to its position rather than its meaning (in headlines, first word of a sentence, etc), the case information of other occurrences might be more accurate than its own.",
                    "sid": 137,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the sentence that starts with “Bush put a freeze on . . .",
                    "sid": 138,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "”, because Bush is the first word, the initial caps might be due to its position (as in “They put a freeze on . . .",
                    "sid": 139,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "”).",
                    "sid": 140,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If somewhere else in the document we see “restrictions put in place by President Bush”, then we can be surer that Bush is a name.",
                    "sid": 141,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Corporate Suffixes and Person Prefixes of Other Occurrences (CSPP): If McCann has been seen as Mr. McCann somewhere else in the document, then one would like to give person a higher probability than organization.",
                    "sid": 142,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, if it is seen as McCann Pte.",
                    "sid": 143,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ltd., then organization will be more probable.",
                    "sid": 144,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the same Corporate- Suffix-List and Person-Prefix-List used in local features, for a token seen elsewhere in the same document with one of these suffixes (or prefixes), another feature Other-CS (or Other-PP) is set to 1.",
                    "sid": 145,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Acronyms (ACRO): Words made up of all capitalized letters in the text zone will be stored as acronyms (e.g., IBM).",
                    "sid": 146,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system will then look for sequences of initial capitalized words that match the acronyms found in the whole document.",
                    "sid": 147,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such sequences are given additional features of A begin, A continue, or A end, and the acronym is given a feature A unique.",
                    "sid": 148,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if FCC and Federal Communications Commission are both found in a document, then Federal has A begin set to 1, Communications has A continue set to 1, Commission has A end set to 1, and FCC has A unique set to 1.",
                    "sid": 149,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sequence of Initial Caps (SOIC): In the sentence Even News Broadcasting Corp., noted for its accurate reporting, made the erroneous announcement., a NER may mistake Even News Broadcasting Corp. as an organization name.",
                    "sid": 150,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it is unlikely that other occurrences of News Broadcasting Corp. in the same document also co-occur with Even.",
                    "sid": 151,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This group of features attempts to capture such information.",
                    "sid": 152,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For every sequence of initial capitalized words, its longest substring that occurs in the same document as a sequence of initCaps is identified.",
                    "sid": 153,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this example, since the sequence Even News Broadcasting Corp. only appears once in the document, its longest substring that occurs in the same document is News Broadcasting Corp. In this case, News has an additional feature of I begin set to 1, Broadcasting has an additional feature of I continue set to 1, and Corp. has an additional feature of I end set to 1.",
                    "sid": 154,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unique Occurrences and Zone (UNIQ): This group of features indicates whether the word is unique in the whole document.",
                    "sid": 155,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "needs to be in initCaps to be considered for this feature.",
                    "sid": 156,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If is unique, then a feature (Unique, Zone) is set to 1, where Zone is the document zone where appears.",
                    "sid": 157,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we will see from Table 3, not much improvement is derived from this feature.",
                    "sid": 158,
                    "ssid": 98,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental results. ",
            "number": "5",
            "sents": [
                {
                    "text": "The baseline system in Table 3 refers to the maximum entropy system that uses only local features.",
                    "sid": 159,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As each global feature group is added to the list of features, we see improvements to both MUC6 and MUC6 MUC7 Baseline 90.75% 85.22% + ICOC 91.50% 86.24% + CSPP 92.89% 86.96% + ACRO 93.04% 86.99% + SOIC 93.25% 87.22% + UNIQ 93.27% 87.24% Table 3: F-measure after successive addition of each global feature group Table 5: Comparison of results for MUC6 Systems MUC6 MUC7 No.",
                    "sid": 160,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of Articles No.",
                    "sid": 161,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of Tokens No.",
                    "sid": 162,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of Articles No.",
                    "sid": 163,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of Tokens MENERGI 318 160,000 200 180,000 IdentiFinder – 650,000 – 790,000 MENE – – 350 321,000 Table 4: Training Data MUC7 test accuracy.2 For MUC6, the reduction in error due to global features is 27%, and for MUC7,14%.",
                    "sid": 164,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ICOC and CSPP contributed the greatest im provements.",
                    "sid": 165,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The effect of UNIQ is very small on both data sets.",
                    "sid": 166,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All our results are obtained by using only the official training data provided by the MUC conferences.",
                    "sid": 167,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason why we did not train with both MUC6 and MUC7 training data at the same time is because the task specifications for the two tasks are not identical.",
                    "sid": 168,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As can be seen in Table 4, our training data is a lot less than those used by MENE and IdentiFinder3.",
                    "sid": 169,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we try to compare our results with those obtained by IdentiFinder ' 97 (Bikel et al., 1997), IdentiFinder ' 99 (Bikel et al., 1999), and MENE (Borthwick, 1999).",
                    "sid": 170,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "IdentiFinder ' 99' s results are considerably better than IdentiFinder ' 97' s. IdentiFinder' s performance in MUC7 is published in (Miller et al., 1998).",
                    "sid": 171,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MENE has only been tested on MUC7.",
                    "sid": 172,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For fair comparison, we have tabulated all results with the size of training data used (Table 5 and Table 6).",
                    "sid": 173,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides size of training data, the use of dictionaries is another factor that might affect performance.",
                    "sid": 174,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bikel et al.",
                    "sid": 175,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1999) did not report using any dictionaries, but mentioned in a footnote that they have added list membership features, which have helped marginally in certain domains.",
                    "sid": 176,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Borth 2MUC data can be obtained from the Linguistic Data Consortium: http://www.ldc.upenn.edu 3Training data for IdentiFinder is actually given in words (i.e., 650K & 790K words), rather than tokens Table 6: Comparison of results for MUC7 wick (1999) reported using dictionaries of person first names, corporate names and suffixes, colleges and universities, dates and times, state abbreviations, and world regions.",
                    "sid": 177,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In MUC6, the best result is achieved by SRA (Krupka, 1995).",
                    "sid": 178,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (Bikel et al., 1997) and (Bikel et al., 1999), performance was plotted against training data size to show how performance improves with training data size.",
                    "sid": 179,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have estimated the performance of IdentiFinder ' 99 at 200K words of training data from the graphs.",
                    "sid": 180,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For MUC7, there are also no published results on systems trained on only the official training data of 200 aviation disaster articles.",
                    "sid": 181,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, training on the official training data is not suitable as the articles in this data set are entirely about aviation disasters, and the test data is about air vehicle launching.",
                    "sid": 182,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both BBN and NYU have tagged their own data to supplement the official training data.",
                    "sid": 183,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even with less training data, MENERGI outperforms Borthwick' s MENE + reference resolution (Borthwick, 1999).",
                    "sid": 184,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Except our own and MENE + reference resolution, the results in Table 6 are all official MUC7 results.",
                    "sid": 185,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The effect of a second reference resolution classifier is not entirely the same as that of global features.",
                    "sid": 186,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A secondary reference resolution classifier has information on the class assigned by the primary classifier.",
                    "sid": 187,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such a classification can be seen as a not-always-correct summary of global features.",
                    "sid": 188,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The secondary classifier in (Borthwick, 1999) uses information not just from the current article, but also from the whole test corpus, with an additional feature that indicates if the information comes from the same document or from another document.",
                    "sid": 189,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We feel that information from a whole corpus might turn out to be noisy if the documents in the corpus are not of the same genre.",
                    "sid": 190,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, if we want to test on a huge test corpus, indexing the whole corpus might prove computationally expensive.",
                    "sid": 191,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence we decided to restrict ourselves to only information from the same document.",
                    "sid": 192,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mikheev et al.",
                    "sid": 193,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1998) have also used a maximum entropy classifier that uses already tagged entities to help tag other entities.",
                    "sid": 194,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall performance of the LTG system was outstanding, but the system consists of a sequence of many hand-coded rules and machine-learning modules.",
                    "sid": 195,
                    "ssid": 37,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "6",
            "sents": [
                {
                    "text": "We have shown that the maximum entropy framework is able to use global information directly.",
                    "sid": 196,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This enables us to build a high performance NER without using separate classifiers to take care of global consistency or complex formulation on smoothing and backoff models (Bikel et al., 1997).",
                    "sid": 197,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using less training data than other systems, our NER is able to perform as well as other state-of-the-art NERs.",
                    "sid": 198,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Information from a sentence is sometimes insufficient to classify a name correctly.",
                    "sid": 199,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Global context from the whole document is available and can be exploited in a natural manner with a maximum entropy classifier.",
                    "sid": 200,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe that the underlying principles of the maximum entropy framework are suitable for exploiting information from diverse sources.",
                    "sid": 201,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Borth- wick (1999) successfully made use of other hand- coded systems as input for his MENE system, and achieved excellent results.",
                    "sid": 202,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, such an approach requires a number of hand-coded systems, which may not be available in languages other than English.",
                    "sid": 203,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe that global context is useful in most languages, as it is a natural tendency for authors to use abbreviations on entities already mentioned previously.",
                    "sid": 204,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}