{
    "ID": "C02-1049",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "There is no blank to mark word boundaries in Chinese text.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, identifying words is difficult, because of segmentation ambiguities and occurrences of unknown words.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conventionally unknown words were extracted by statistical methods because statistical methods are simple and efficient.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However the statistical methods without using linguistic knowledge suffer the drawbacks of low precision and low recall, since character strings with statistical significance might be phrases or partial phrases instead of words and low frequency new words are hardly identifiable by statistical methods.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to statistical information, we try to use as much information as possible, such as morphology, syntax, semantics, and world knowledge.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The identification system fully utilizes the context and content information of unknown words in the steps of detection process, extraction process, and verification process.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A practical unknown word extraction system was implemented which online identifies new words, including low frequency new words, with high precision and high recall rates.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "One of the most prominent problems in computer processing of Chinese language is identification of the word sequences of input sentences.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is no blank to mark word boundaries in Chinese text.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, identifying words is difficult, because of segmentation ambiguities and occurrences of unknown words (i.e. out-of-vocabulary words).",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most papers dealing with the problem of word segmentation focus their attention only on the resolution of ambiguous segmentation.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The problem of unknown word identification is considered more difficult and needs to be further investigated.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to an inspection on the Sinica corpus (Chen etc., 1996), a 5 million word Chinese corpus with word segmented, it shows that 3.51% of words are not listed in the CKIP lexicon, a Chinese lexicon with more than 80,000 entries.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Identifying Chinese unknown words from a document is difficult; since 1.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is no blank to mark word boundaries;.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "almost all chinese characters and words are also. ",
            "number": "2",
            "sents": [
                {
                    "text": "morphemes;",
                    "sid": 16,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "morphemes are syntactic ambiguous and semantic. ",
            "number": "3",
            "sents": [
                {
                    "text": "ambiguous;",
                    "sid": 17,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "words with same morpho-syntactic structure might. ",
            "number": "4",
            "sents": [
                {
                    "text": "have different syntactic categories;",
                    "sid": 18,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "no simple rules can enumerate all types of unknown. ",
            "number": "5",
            "sents": [
                {
                    "text": "words;",
                    "sid": 19,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "online identification from a short text is even harder,. ",
            "number": "6",
            "sents": [
                {
                    "text": "since low frequency unknown words are not identifiable by naive statistical methods.",
                    "sid": 20,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is difficult to identify unknown words in a text since all Chinese characters can either be a morpheme or a word and there are no blank to mark word boundaries.",
                    "sid": 21,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore without (or even with) syntactic or semantic checking, it is difficult to tell whether a character in a particular context is a part of an unknown word or whether it stands alone as a word.",
                    "sid": 22,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compound words and proper names are two major types of unknown words.",
                    "sid": 23,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not possible to list all of the proper names and compounds neither in a lexicon nor enumeration by morphological rules.",
                    "sid": 24,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conventionally unknown words were extracted by statistical methods for statistical methods are simple and efficient.",
                    "sid": 25,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However the statistical methods without using linguistic knowledge suffer the drawbacks of low precision and low recall.",
                    "sid": 26,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because character strings with statistical significance might be phrases or partial phrases instead of words and low frequency new words are hardly identifiable by statistical methods.",
                    "sid": 27,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Common statistical features for unknown word extraction are mutual information (Church 90), entropy (Tung 94), association strength (Smadja 93, Wang 95) and dice coefficients (Smadja 96) etc. Chang etc.",
                    "sid": 28,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Chang etc. 97) iteratively apply the joint character association metric, which is derived by integrating above statistical features.",
                    "sid": 29,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their performance is recall rate:81%, precision rate: 72% in disyllabic unknown word, recall rate:88%, precision rate: 39% in trisyllabic unknown word, and recall rate:94%, precision rate: 56% in four-syllabic unknown word.",
                    "sid": 30,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chang etc.",
                    "sid": 31,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1994) used statistical methods to identify personal names in Chinese text which achieved a recall rate of 80% and a precision rate of 90%.",
                    "sid": 32,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chen & Lee (1994) used morphological rules and contextual information to identify the names of organizations.",
                    "sid": 33,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since organizational names are much more irregular than personal names in Chinese, they achieved a recall rate of 54.50% and a precision rate of 61.79%.",
                    "sid": 34,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lin etc.",
                    "sid": 35,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1993) made a preliminary study of the problem of unknown word identification.",
                    "sid": 36,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They used 17 morphological rules to recognize regular compounds and a statistical model to deal with irregular unknown words, such as proper names etc..",
                    "sid": 37,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With this unknown word resolution procedure, an error reduction rate of 78.34% was obtained for the word segmentation process.",
                    "sid": 38,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since there is no standard reference data, the claimed accuracy rates of different papers vary due to different segmentation standards.",
                    "sid": 39,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we use the Sinica corpus as a standard reference data.",
                    "sid": 40,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As mentioned before, the Sinica corpus is a word-segmented corpus based on the Chinese word segmentation standard for information processing proposed by ROCLING (Huang et al, 1997).",
                    "sid": 41,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore it contains both known words and unknown words, which are properly segmented.",
                    "sid": 42,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus was utilized for the purposes of training and testing.",
                    "sid": 43,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the above discussion, it is known that identification of unknown words is difficult and need to adopt different methods in identifying different types of unknown words.",
                    "sid": 44,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The objective of this research is to find methods to extract unknown words from a document and identify their syntactic and semantic categories.",
                    "sid": 45,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although both processing are interrelated, for limiting scope of this paper, we will focus our discussion on the extraction process only and leave the topics of syntactic and semantic category predictions to other papers.",
                    "sid": 46,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Steps to Identify Unknown Words.",
                    "sid": 47,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to statistical information, we try to use as much information as possible, such as morphology, syntax, semantics, and world knowledge, to identify unknown words.",
                    "sid": 48,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The identification system fully utilizes the context and content information of unknown words in each three steps of processes, i.e. detection process, extraction process, and verification process.",
                    "sid": 49,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The detection process detects the occurrences of unknown words for better focusing, so that on the next step extraction process, it needs only focus on the places where unknown were detected.",
                    "sid": 50,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, it also helps in identifying low frequency unknown words, which hardly can be identified by conventional statistical extraction methods.",
                    "sid": 51,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extraction process extracts unknown words by applying morphological rules and statistical rules to match for different types of unknown words.",
                    "sid": 52,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As usual, tradeoff would occur between recall and precision.",
                    "sid": 53,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Enriching the extraction rules might increase recall rates, but it also increases the ambiguous and false extractions and thus lowers the precision.",
                    "sid": 54,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final verification process comes to rescue.",
                    "sid": 55,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It resolves ambiguous and false extractions based on the morphological validity, syntactic validity, and statistical validity.",
                    "sid": 56,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 Unknown Word Detection.",
                    "sid": 57,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conventionally a word segmentation process identifies the words in input text by matching lexical entries and resolving the ambiguous matching (Chen & Liu, 1992, Sproat et al, 1996).",
                    "sid": 58,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence after segmentation process the unknown words in the text would be incorrectly segmented into pieces of single character word or shorter words.",
                    "sid": 59,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If all occurrences of monosyllabic words are considered as morphemes of unknown words, the recall rate of the detection will be about 99%, but the precision is as low as 13.4% (Chen & Bai, 1998).",
                    "sid": 60,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence the complementary problem of unknown word detection is the problem of monosyllabic known-word detection, i.e. to remove the monosyllabic known-words as the candidates of unknown morphemes.",
                    "sid": 61,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A corpus-based learning method is proposed to derive a set of syntactic discriminators for monosyllabic words and monosyllabic morphemes (Chen & Bai, 1998).",
                    "sid": 62,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following types of rule patterns were generated from the training corpus.",
                    "sid": 63,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each rule contains a key token within curly brackets and its contextual tokens without brackets.",
                    "sid": 64,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For some rules there may be no contextual dependencies.",
                    "sid": 65,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The function of each rule means that in a sentence, if a character and its context match the key token and the contextual tokens of the rule respectively, this character is a proper word (i.e. not a morpheme of an unknown word).",
                    "sid": 66,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the rule “{Dfa} Vh“ says that a character with syntactic category Dfa is a proper word, if it follows a word of syntactic category Vh.",
                    "sid": 67,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rule type Example ================================= char {的} word char 不 {願} char word {全} 世界 category {T} {category} category {Dfa} Vh category {category} Na {Vcl} char category {就} VH category char Na {上} category category char Na Dfa {高} char category category {極} Vh T =================================== Table1.",
                    "sid": 68,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rule types and Examples Rules of the 10 different types of patterns above were generated automatically by extracting each instance of monosyllabic words in the training corpus.",
                    "sid": 69,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Every generated rule pattern was checked for applicability and accuracy.",
                    "sid": 70,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the initial stage, 1455633 rules were found.",
                    "sid": 71,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After eliminating the low applicability rules, i.e. frequency less than 3, there are 215817 rules remained.",
                    "sid": 72,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At next stage, the rules with accuracy greater than 98% are selected for better recall rate.",
                    "sid": 73,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However the selected rules may subsume each other.",
                    "sid": 74,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Shorter rule patterns are usually more general than the longer rules.",
                    "sid": 75,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A further screening process is applied to remove the redundant rules.",
                    "sid": 76,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final rule sets contain 45839 rules and were used to detect unknown words in the experiment.",
                    "sid": 77,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It achieves the detection rate of 96% and the precision rates of 60%.",
                    "sid": 78,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Where detection rate 96% means that for 96% of unknown words in the testing data, at least one of its morpheme was detected as part of unknown word.",
                    "sid": 79,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However the boundaries of unknown words are still not known.",
                    "sid": 80,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For more detail discussion, see (Chen & Bai 1998).",
                    "sid": 81,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For convenience, hereafter we use (?)",
                    "sid": 82,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "to mark detected morphemes of unknown words and () to mark the words which are not detected as morphemes of unknown words.",
                    "sid": 83,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 Unknown Word Extraction.",
                    "sid": 84,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At detection stages, the contextual rules were applied to detect fragments of unknown words, i.e. monosyllabic morphemes.",
                    "sid": 85,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extraction rules will be triggered by the detected morphemes only.",
                    "sid": 86,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extraction rules are context, content, and statistically constrained.",
                    "sid": 87,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rule-design targets for high recall rate and try to maintain high precision at the mean time.",
                    "sid": 88,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is hard to derive a set of morphological rules, which exactly cover all types of unknown words.",
                    "sid": 89,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach is that if morphological structures of certain types of unknown words are well established, their fine-grain morphological rules will be designed.",
                    "sid": 90,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise statistical rules are designed without differentiate their extracted word types.",
                    "sid": 91,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Redundancy is allowed to achieve better coverage.",
                    "sid": 92,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both morphological rules and statistical rules use context, content and statistical information in their extraction.",
                    "sid": 93,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Morphological rules.",
                    "sid": 94,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since there are too many different types of unknown words, we cannot go through the detail extraction processes for each different type.",
                    "sid": 95,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It will be exemplified by the personal name extraction to illustrate the idea of using different clues in the extraction process.",
                    "sid": 96,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First of all the content information is used, each different type of unknown words has its own morphological structure.",
                    "sid": 97,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, a typical Chinese personal name starts with a last name and followed by a given name.",
                    "sid": 98,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The set of last names is about one hundred.",
                    "sid": 99,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of them are common characters.",
                    "sid": 100,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given names are usually one or two characters and seldom with bad meaning.",
                    "sid": 101,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on the above structure information of Chinese personal names, the name extraction rules are designed as shown in Table 2.",
                    "sid": 102,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Context information is used for verification and determining the boundary of the extracted word.",
                    "sid": 103,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, in the last rule of Table 2, it uses context information and statistical information to frequently reoccurred in the text.",
                    "sid": 104,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The statistical information is used here for verification.",
                    "sid": 105,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, if an another sentence which is like 張 (?)",
                    "sid": 106,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "明 (?)",
                    "sid": 107,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "來 () 了 () occurs in the same document, it suggests 張明 is the correct extraction, since the statistical constraint resolve ambiguity of the word boundary.",
                    "sid": 108,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is illustrated by the following examples.",
                    "sid": 109,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "prob document (正 | 張明 ) < 1 rejects 張明正.",
                    "sid": 110,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1) after detection : 張(?)",
                    "sid": 111,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "明(?)",
                    "sid": 112,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "正() 要() 殺() 人()。 extractnion : 張明正 要 殺 人。 MingZheng Zhang want kill somebody.",
                    "sid": 113,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "or 張明 正 要 殺 人。 Ming Zhang just want kill somebody.",
                    "sid": 114,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rule type Constraints & Procedure ========================================== 4.2 Statistical Rules.",
                    "sid": 115,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is well known that keywords often reoccur in a document (Church, 2000) and very possible the keywords are also unknown words.",
                    "sid": 116,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore statistical extraction methods utilize the locality of unknown words.",
                    "sid": 117,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idea is that if two consecutive morphemes are highly msi (?)",
                    "sid": 118,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "msi +1 (?)",
                    "sid": 119,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "msi + 2 (?)",
                    "sid": 120,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "combine(i, i + 1, i + 2) associated then combine them to form a new msi () msi +1 (?)",
                    "sid": 121,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "msi + 2 (?)",
                    "sid": 122,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "combin e(i, i + 1, i + 2) word.",
                    "sid": 123,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mutu al infor matio n-like statist ics are very often adopt ed in meas uring assoc iation stren gth msi (?)",
                    "sid": 124,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "msi +1 () msi + 2 (?)",
                    "sid": 125,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "combine(i, i + 1, i + 2) between two morphemes (Church & Merser, msi (?)",
                    "sid": 126,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "dsi +1 () combine (i, i + 1) 1993, Sproat et al, 1996).",
                    "sid": 127,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Howe ver such kind of msi (?)",
                    "sid": 128,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "msi +1 (?)",
                    "sid": 129,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "psi + 2 () msi (?)",
                    "sid": 130,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "msi +1 (?)",
                    "sid": 131,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "msi + 2 () combine(i, i + 1) as follows: statistic does not work well when the sample size is very limited.",
                    "sid": 132,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore we propose to use reoccurrence frequency and fan out numbers to if probdocument (msi + 2 | msi msi +1 ) < 1 combine(i, i + 1) as a disyllabic name characterize words and their boundaries (Chien, 1999).",
                    "sid": 133,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "12 statistical rules are derived to extract elsif freqco upus (NA ME, msi + 2 , wordi + 3 ) ≥ 1 combi ne(i, i + 1) as a disylla bic name unk no wn wor ds.",
                    "sid": 134,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Eac h rule is trig ger ed by dete cted mor phe mes and exe cute d in iter atio n. elsif freqcoupus (NAME, wordi + 3 ) ≥ freqcoupus (NAME, msi + 2 ) combine (i,i + 1,i + 2) as a trisyllabi c name The bound aries of unkno wn words might exten d durin g iterati on until no rule could be applie d. else combine(i, i + 1) as a disyllabic name Followin g are two example s of statistica l rules.",
                    "sid": 135,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notes: ms denotes monosyllable.",
                    "sid": 136,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ds denotes disyllable.",
                    "sid": 137,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ps denotes polysyllable which consists of more than one syllable.",
                    "sid": 138,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "word denotes a word which could consist of any number of syllable.",
                    "sid": 139,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "msi must belong to Common Chinese Last Name Set, such as 陳, 王…etc. ========================================= Table 2.",
                    "sid": 140,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rule types of Chinese personal name In the examples 1), there are two possible candidates of personal names, 張明 and 張明正.",
                    "sid": 141,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By context information, the bi-gram (NAME, 正) is less freguent than (NAME, 要) in the corpus, so without considering statistical constraints, it would suggest that 張明正 is a correct extraction instead of 張明. However, the locality of the keywords is very important clue for identification, since the keywords of a text are usually unknown words and they are very Rule id Pattern Statistical constraint ========================================== S1: P(Lm | Rm) ≥ 0.8 and P(Rm | Lm) ≥ 0.8 and Freq(LmRm) ≥ 2 S2 : ((P(Lm | Rm) ≥ 0.8 or P(Rm | Lm) ≥ 0.8) and Freq(LmRm) ≥ 2) or (P(Lm | Rm) ≥ 0.8 and P(Rm | Lm) ≥ 0.8) ========================================== Table 3.",
                    "sid": 142,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two examples of statistical rules The rule R1 says that Lm and Rm will be combined, if both conditional probability P(Lm|Rm)>=0.8 and P(Rm|Lm)>=0.8 hold and the string LmRm occurred more than once in the processed document.",
                    "sid": 143,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conditional probabilities constrain the fan-out number on each side of morpheme, i.e. the preceding morpheme of Rm should almost be limited to Lm only and vice versa.",
                    "sid": 144,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The threshold value 0.8 is adjusted according to the experimental results, which means at least four out of five times the preceding morpheme of Rm is Lm and vice versa.",
                    "sid": 145,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However the statistical constraints are much loose when the right morpheme Rm is also a detected morpheme, as exemplified in R2.",
                    "sid": 146,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "You may notice that it also accepts the unknown words occurred only once in the document.",
                    "sid": 147,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conventional statistical extraction methods are simple and efficient.",
                    "sid": 148,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However if without supporting linguistic evidences the precision of extraction is still not satisfactory, since a high frequency character string might be a phrase or a partial phrase instead of a word.",
                    "sid": 149,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to statistical constraint, our proposed statistical method requires that a candidate string must contain detected morphemes.",
                    "sid": 150,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, the statistical rules are triggered by detected morphemes only.",
                    "sid": 151,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore the morphological structure of extracted unknown word must be valid.",
                    "sid": 152,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A validation process will be carried out at the different stages for all extracted unknown words.",
                    "sid": 153,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Verification.",
                    "sid": 154,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To verify a correct extraction depends on the following information.",
                    "sid": 155,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 156,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Structure validity: the morphological structure of a. word should be valid.",
                    "sid": 157,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 158,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic validity: the syntactic context of an.",
                    "sid": 159,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "identified new word should be valid.",
                    "sid": 160,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 161,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Local consistency: the identified unknown words.",
                    "sid": 162,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "should satisfy the local statistical constraints, i.e. no inconsistent extension on the morphological structures.",
                    "sid": 163,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, a new word was identified by the pattern rules, but if it violates the statistical constraints, as exemplified in 1), will be rejected.",
                    "sid": 164,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each extracted candidate will be evaluated according to the validity of above three criteria.",
                    "sid": 165,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the candidates extracted by the statistical rules, their structure validity and syntactic validity are checked after extraction.",
                    "sid": 166,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, for the unknown words extracted according to the morphological rules, their structure validity and syntactic validity are checked at extraction stage and their local statistical consistency is checked after extraction.",
                    "sid": 167,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To verify the structure validity and syntactic validity of the unknown words extracted by statistical methods, their syntactic categories are predicted first, since statistical rules do not classify unknown word types.",
                    "sid": 168,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The prediction method is adopted from (Chen, Bai & Chen, 1997).",
                    "sid": 169,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They use the association strength between morpheme and syntactic category to predict the category of a word.",
                    "sid": 170,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The accuracy rate is about 80%.",
                    "sid": 171,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once the syntactic category of an unknown word is known its contextual bi-gram will be checked.",
                    "sid": 172,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the bi-grams of (preceding word/category, unknown word category) and (unknown word category, following word/category) are syntactically valid, i.e. the bi-gram patterns are commonly occurred in the corpus, the extracted word is considered to be a valid word.",
                    "sid": 173,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise this candidate will be rejected.",
                    "sid": 174,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Final Selection.",
                    "sid": 175,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is possible that the extracted candidates conflict each other.",
                    "sid": 176,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, in the following example, both candidates are valid.",
                    "sid": 177,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“班乃特, Bennet” is extracted by name rules and “律師班, lawyer-class” is extracted by suffix rules.",
                    "sid": 178,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "name ==> 安然 公司 律師 班乃特 說 ， An-jan company lawyer Bennett said, suffix ==> 安然 公司 律師班 乃 特 說 ， An-jan company lawyer-class is special said, The extracted new words will form a word lattice.",
                    "sid": 179,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The selection process finds the most probable word sequence among word lattice as the final result.",
                    "sid": 180,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the current implementation, we used a very simple heuristics of maximizing the total weights of words to pick the most probable word sequence.",
                    "sid": 181,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The weight of a word w is defined to be freq(w)*length(w), where freq(w) is the occurrence frequency of w in the document and length is the number of characters in w. For the above example, “班乃特, Bennett” occurred 5 times and “律師班, lawyer-class” occurred twice only in the document.",
                    "sid": 182,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore the final result is 安然 公司 律師 班乃特 說 ， An-jan company lawyer Bennett said , “Bennett, the lawyer of An-jan company, said…” 6 Experimental Results.",
                    "sid": 183,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the current implementation, the morphological rules include the rules for Chinese personal names, foreign transliteration names, and compound nouns.",
                    "sid": 184,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the morphological rules, twelve constrained statistical rules were implemented to patch the under coverage of the morphological rules.",
                    "sid": 185,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the current implementation is not complete, morphological rules of many other types of unknown words were not included, such as rules for compound verbs.",
                    "sid": 186,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiment results still show that the proposed methods work well and the morphological rules and the statistical rules complement each other in the extraction and verification.",
                    "sid": 187,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Sinica balanced corpus provides the major training and testing data.",
                    "sid": 188,
                    "ssid": 169,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training data contains 8268 documents with 4.6 million words.",
                    "sid": 189,
                    "ssid": 170,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use it to train the detection rules and morphological rules.",
                    "sid": 190,
                    "ssid": 171,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We randomly pick 100 documents from rest of the corpus as the testing data, which contain 17585 words and 1160 unknown word types.",
                    "sid": 191,
                    "ssid": 172,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A word is considered as an unknown word, if neither it is in the CKIP lexicon nor it is identified as foreign word (for instance English) or a number.",
                    "sid": 192,
                    "ssid": 173,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CKIP lexicon contains about 80000 entries.",
                    "sid": 193,
                    "ssid": 174,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The precision and recall rates are provided.",
                    "sid": 194,
                    "ssid": 175,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The target of our approach is to extract unknown words from a document, so we define “correct extractions” as unknown word types correctly identified in the document.",
                    "sid": 195,
                    "ssid": 176,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The precision and recall rate formulas are as follows: NCi = number of correct extractions in document i NEi = number of extracted unknown word types in document i NR i = number of reference unknown word types in document i identifications are also provided at Table 5 & 6.",
                    "sid": 196,
                    "ssid": 177,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A word occurs more than or equal to 3 times in a document is considered a high frequency word.",
                    "sid": 197,
                    "ssid": 178,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are only 66 high frequency unknown words in our testing data.",
                    "sid": 198,
                    "ssid": 179,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It counts less than 6% of the total unknown words.",
                    "sid": 199,
                    "ssid": 180,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Corr ect# Extr act# Prec isio n Rec all Mor phol ogic al rules 5 4 1 5 9 0 9 2 % 47 % St at is ti ca l ru le s 4 5 5 5 8 3 7 8 % 39 % T o t a l s y s t e m 7 9 1 8 9 0 8 9 % 68 % Table 4.",
                    "sid": 200,
                    "ssid": 181,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experimental result of total unknown word types Table 5.",
                    "sid": 201,
                    "ssid": 182,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance on the set of unknown words with frequency >= 3 in a document Corr ect# Extr act# Prec isio n Rec all Mor phol ogic al rules 5 1 0 5 6 4 9 0 % 47 % St at is ti ca l ru le s 4 0 0 5 2 3 7 6 % 37 % T o t a l s y s t e m 7 3 1 8 2 6 8 8 % 67 % Table 6.",
                    "sid": 202,
                    "ssid": 183,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance on the set of unknown words with frequency <3 in a document Recall rate of total unknown word types is not very high, because not all of the morphological rules were implemented and some of the word tokens in the testing data are arguable.",
                    "sid": 203,
                    "ssid": 184,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The i =100 ∑ NCi Precision rate = i =1 ∑ NEi i =1 i =100 ∑ NCi Recall rate = i =1 ∑ NR i i =1 experiment results in Table 6 show that the proposed methods work well on low frequency unknown word identification.",
                    "sid": 204,
                    "ssid": 185,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To observe the frequency impact on our system, the performance evaluation on both high frequency and low frequency unknown word",
                    "sid": 205,
                    "ssid": 186,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions and future works. ",
            "number": "7",
            "sents": [
                {
                    "text": "Unknown word extraction is a very hard task.",
                    "sid": 206,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to statistical information, it requires supporting knowledge of morphological, syntactic, semantic, word type specific and common sense.",
                    "sid": 207,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One important trend is to look harder for sources of knowledge and managing knowledge that can support unknown word identification.",
                    "sid": 208,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A word segmented and tagged corpus is essential for the success of the whole research.",
                    "sid": 209,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus provides the major training and testing data.",
                    "sid": 210,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also supports plenty of unknown words and their contextual data to derive extraction rules.",
                    "sid": 211,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work we are managing to use the structure information, the context environment, and statistical consistency of the unknown words and to increase the recall and precision of the extraction process.",
                    "sid": 212,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The syntactic and semantic classifications for unknown words are executed in parallel with the extraction process.",
                    "sid": 213,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both classification processes are very hard and need further researches.",
                    "sid": 214,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}