{
    "ID": "C04-1074",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "The paper aims at a deeper understanding of several well-known algorithms and proposes ways to optimize them.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It describes and discusses factors and strategies of factor interaction used in the algorithms.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The factors used in the algorithms and the algorithms themselves are evaluated on a German corpus annotated with syntactic and coreference information (Negra) (Skut et al., 1997).",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A common format for pronoun resolution algorithms with several open parameters is proposed, and the parameter settings optimal on the evaluation data are given.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "In recent years, a variety of approaches to pronoun resolution have been proposed.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of them are based on centering theory (Strube, 1998; Strube and Hahn, 1999; Tetreault, 2001), others on Machine Learning (Aone and Bennett, 1995; Ge et al., 1998; Soon et al., 2001; Ng and Cardie, 2002; Yang et al., 2003).",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They supplement older heuristic approaches (Hobbs, 1978; Lappin and Leass, 1994).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, most of these approaches were evaluated on different corpora making different assumptions so that direct comparison is not possible.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Appreciation of the new insights is quite hard.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation differs not only with regard to size and genre of corpora but also along the following lines.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Scope of application: Some approaches only deal with personal and possessive pronouns (centering and heuristic), while others consider coreference links in general (Soon et al., 2001; Ng and Cardie, 2002; Yang et al., 2003).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A drawback of this latter view is that it mixes problems on different lev els of difficulty.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It remains unclear how much of the success is due to the virtues of the approach and how much is due to the distribution of hard and easy problems in the corpus.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we will only deal with coreferential pronouns (i.e. possessive, demonstrative, and third person pronouns).",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "My thanks go to Melvin Wurster for help in annotation and to Ciprian Gerstenberger for discussion.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Quality of linguistic input: Some proposals were evaluated on hand annotated (Strube and Hahn, 1999) or tree bank input (Ge et al., 1998; Tetreault, 2001).",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other proposals provide a more realistic picture in that they work as a backend to a parser (Lappin and Leass, 1994) or noun chunker (Mitkov, 1998; Soon et al., 2001; Ng and Cardie, 2002)).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In evaluation of applications presupposing parsing, it is helpful to separate errors due to parsing from intrinsic errors.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, one would also like to gauge the end-to-end performance of a system.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus we will provide performance figures for both ideal (hand-annotated) input and realistic (automatically generated) input.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Language: Most approaches were evaluated on English where large resources are available, both in terms of pre-annotated data (MUC6 and MUC7 data) and lexical information (WordNet).",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper deals with German.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Arguably, the free word-order of German arguably leads to a clearer distinction between grammatical function, surface order, and information status (Strube and Hahn, 1999).",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The paper is organized as follows.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2 describes the evaluation corpus.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 describes several factors relevant to pronoun resolution.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It assesses these factors against the corpus, measuring their precision and restrictiveness.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 describes and evaluates six algorithms on the basis of these factors.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also captures the algorithms as para- metric systems and proposes parameter settings optimal on the evaluation data.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 5 concludes.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "evaluation corpus. ",
            "number": "2",
            "sents": [
                {
                    "text": "We chose as an evaluation base the NEGRA tree bank, which contains about 350,000 tokens of German newspaper text.",
                    "sid": 31,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same corpus was also processed with a finite-state parser, performing at 80% dependency f-score (Schiehlen, 2003).",
                    "sid": 32,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All personal pronouns (PPER), possessive pronouns (PPOSAT), and demonstrative pronouns (PDS) in Negra were annotated in a format geared to the MUC7 guidelines (MUC7, 1997).",
                    "sid": 33,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Proper names were annotated automatically by a named entity recognizer.",
                    "sid": 34,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a small portion of the corpus (6.7%), all coreference links were annotated.",
                    "sid": 35,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the size of the annotated data (3,115 personal pronouns1 , 2,198 possessive pronouns, 928 demonstrative pronouns) compares favourably with the size of evaluation data in other proposals (619 German pronouns in (Strube and Hahn, 1999), 2,477 English pronouns in (Ge et al., 1998), about 5,400 English coreferential expressions in (Ng and Cardie, 2002)).",
                    "sid": 36,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the experiments, systems only looked for single NP antecedents.",
                    "sid": 37,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, propositional or predicative antecedents (8.4% of the pronouns annotated) and split antecedents (0.2%) were inaccessible, which reduced optimal success rate to 91.4%.",
                    "sid": 38,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "factors in pronoun resolution. ",
            "number": "3",
            "sents": [
                {
                    "text": "Pronoun resolution is conditioned by a wide range of factors.",
                    "sid": 39,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two questions arise: Which factors are the most effective?",
                    "sid": 40,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How is interaction of the factors modelled?",
                    "sid": 41,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The present section deals with the first question, while the second question is postponed to section 4.",
                    "sid": 42,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many approaches distinguish two classes of resolution factors: filters and preferences.",
                    "sid": 43,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Filters express linguistic rules, while preferences are merely tendencies in interpretation.",
                    "sid": 44,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Logically, filters are monotonic inferences that select a certain subset of possible antecedents, while preferences are non- monotonic inferences that partition the set of antecedents and impose an order on the cells.",
                    "sid": 45,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the sequel, factors proposed in the literature are discussed and their value is appraised on evaluation data.",
                    "sid": 46,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Every factor narrows the set of antecedents and potentially discards correct antecedents.",
                    "sid": 47,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 lists both the success rate maximally achievable (broken down according to different types of pronouns) and the average number of antecedents remaining after applying each factor.",
                    "sid": 48,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figures are also given for parsed input.",
                    "sid": 49,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preferences are evaluated on filtered sets of antecedents.",
                    "sid": 50,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Filters.",
                    "sid": 51,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Agreement.",
                    "sid": 52,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An important filter comes from morphology: Agreement in gender and number is generally regarded as a prerequisite for coreference.",
                    "sid": 53,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Exceptions are existant but few (2.5%): abstract pronouns (such as that in English) referring to non- neuter or plural NPs, plural pronouns co-referring with singular collective NPs (Ge et al., 1998), antecedent and anaphor matching in natural gender 1 Here, we only count anaphoric pronouns, i.e. third person pronouns not used expletively.",
                    "sid": 54,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "rather than grammatical gender.",
                    "sid": 55,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All in all, a maximal performance of 88.9% is maintained.",
                    "sid": 56,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The filter is very restrictive, and cuts the set of possible antecedents in half.",
                    "sid": 57,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "See Table 1 for details.",
                    "sid": 58,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Binding.",
                    "sid": 59,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Binding constraints have been in the focus of linguistic research for more than thirty years.",
                    "sid": 60,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They provide restrictions on coindexation of pronouns with clause siblings, and therefore can only be applied with systems that determine clause boundaries, i.e. parsers (Mitkov, 1998).",
                    "sid": 61,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Empirically, binding constraints are rules without exceptions, hence they do not lead to any loss in achievable performance.",
                    "sid": 62,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The downside is that their restrictive power is quite bad as well (0.3% in our corpus, cf.",
                    "sid": 63,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1).",
                    "sid": 64,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sortal Constraints.",
                    "sid": 65,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More controversial are sortal constraints.",
                    "sid": 66,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intuitively, they also provide a hard filter: The correct antecedent must fit into the environment of the pronoun (Carbonell and Brown, 1988).",
                    "sid": 67,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, however, the required knowledge sources are lacking, so they must be hand-coded and can only be applied in restricted domains (Strube and Hahn, 1999).",
                    "sid": 68,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Selectional restrictions can also be modelled by collocational data extracted by a parser, which have, however, only a very small impact on overall performance (Kehler et al., 2004).",
                    "sid": 69,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will neglect sortal constraints in this paper.",
                    "sid": 70,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Preferences.",
                    "sid": 71,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preferences can be classified according to their requirements on linguistic processing.",
                    "sid": 72,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentence Re- cency and Surface Order can be read directly off the surface.",
                    "sid": 73,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NP Form presupposes at least tagging.",
                    "sid": 74,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A range of preferences (Grammatical Roles, Role Parallelism, Depth of Embedding, Common Path), as well as all filters, presuppose full syntactic analysis.",
                    "sid": 75,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mention Count and Information Status are based on previous decisions of the anaphora resolution module.",
                    "sid": 76,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentence Recency (SR).",
                    "sid": 77,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most important criterion in pronoun resolution (Lappin and Leass, 1994) is the textual distance between anaphor and antecedent measured in sentences.",
                    "sid": 78,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lappin and Le ass (1994) motivate this preference as a dynamic expression of the attentional state of the human hearer:Memory capability for storage of discourse refer ents degrades rapidly.",
                    "sid": 79,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several implementations are possible.",
                    "sid": 80,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Perhaps most obvious is the strategy implicit in Lappin and Leass (1994)’s algorithm: The antecedent issearched in a sentence that is as recent as possi ble, beginning with the already uttered part of the current sentence, continuing in the last sentence, in the one but last sentence, and so forth.",
                    "sid": 81,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In case no Co nst rai nt Uppe r Boun d n u m b e r o f a nt e c. P a r s e r tot al PP E R PP O S A T P D S U pp er B an tec . no V P 91 .6 9 8 . 4 1 0 0 . 0 48 .5 1 2 3 . 2 8 5 . 5 12 8.",
                    "sid": 82,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 no spl it 91 .4 9 8 . 3 1 0 0 . 0 47 .8 1 2 3 . 2 ag re e m en t 88 .9 9 6 . 8 9 9 . 5 37 .6 5 3 . 0 7 9 . 1 6 1 . 8 bi nd in g 88 .9 5 2 . 7 7 8 . 7 6 1 . 4 se nt en ce re ce nc y SR 78 .8 8 4 . 6 9 0 . 2 32 .3 2 . 4 6 6 . 2 2 . 7 gr a m m ati cal rol e GR 74 .0 82 .3 2 8 7 . 9 13 .0 1 4 . 5 5 1 . 2 9 . 0 rol e pa ral lel is m RP 64 .3 7 7 . 4 – 20 .0 1 2 . 5 4 7 . 0 1 0 . 3 su rfa ce or de r LR 53 .5 6 2 . 8 5 6 . 6 15 .3 1 4 2 . 6 1 su rfa ce or de r RL 45 .9 4 5 . 9 5 5 . 7 22 .7 1 3 5 . 2 1 de pt h of e m be dd in g DE 51 .6 5 1 . 3 6 7 . 7 14 .1 2 . 4 4 1 . 7 4 . 0 co m m on pa th CP 51 .7 5 2 . 3 6 4 . 2 19 .9 5 . 3 4 6 . 8 1 1 . 3 eq ui va le nc e cla ss es EQ 63 .6 6 7 . 5 7 8 . 4 15 .7 1 . 3 5 1 . 3 1 . 5 m en tio n co un t MC 32 .9 4 0 . 3 3 4 . 0 4 . 6 5 . 5 3 5 . 7 7 . 1 inf or m ati on sta tus IS 65 .3 7 1 . 1 7 7 . 4 16 .7 1 6 . 6 4 9 . 7 1 6 . 3 N P for m NF 42 .4 4 9 . 9 4 4 . 4 12 .8 7 . 4 2 0 . 6 8 . 3 N P for m (pr on ou n) NP 73 .7 8 2 . 4 7 9 . 8 30 .2 2 9 . 7 5 9 . 7 3 6 . 6 Table 1: Effect of Factors antecedent is found in the previous context, subsequent sentences are inspected (cataphora), also ordered by proximity to the pronoun.",
                    "sid": 83,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10000 all PPER age only 2.4 such antecedents.",
                    "sid": 84,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the benefit also comes at a cost: The upper ceiling of performance is lowered to 82.0% in our corpus: In many cases an incorrect antecedent is found in a more recent sentence.Similarly, we can assess other strategies of sen 1000 100 10 1 P P O S A T P D S -2-1 0 1 2 3 4 5 6 7 8 9 12 19 Fi gu re 1: Se nte nc e Re ce nc y tence orderi ng that have been propo sed in the litera ture.",
                    "sid": 85,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hard core center ing appro aches only deal with the last senten ce (Bren nan et al., 1987).",
                    "sid": 86,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Negra, these appro aches can conse quentl y have at most a succes s rate of 44.2% . Perfor mance is partic ularly low with posses sive prono uns which often only have antece dents in the curren t senten ce.",
                    "sid": 87,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Strube (1998) ’s centeri ng appro ach (whos e senten ce orderi ng is designate d as SR2 in Table 2) also deals with and even prefer s intrase ntenti al anaph ora, which raises the upper limit to a more accept able 80.2% . Strube and Hahn (1999) extend the contex t to more than the last senten ce, but switch prefer ence order betwe en the last and the curren t senten ce so that an antece dent is deter mined in the last senten ce, whene ver possiFigure 1 shows the absolute frequencies of sen tence recency values when only the most recent antecedent (in the order just stated) is considered.",
                    "sid": 88,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Negra, 55.3% of all pronominal anaphora can be resolved intrasententially, and 97.6% within the last three sentences.",
                    "sid": 89,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since only 1.6% of all pronouns are cataphoric, it seems reasonable to neglect cat- aphora, as is mostly done (Strube and Hahn, 1999; Hobbs, 1978).",
                    "sid": 90,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 underscores the virtues of Sentence Recency: In the most recent sentence with antecedents satisfying the filters, there are on aver ble.",
                    "sid": 91,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Negra, this ordering imposes an upper limit of 51.2%.",
                    "sid": 92,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Grammatical Roles (GR).",
                    "sid": 93,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another important factor in pronoun resolution is the grammatical role of the antecedent.",
                    "sid": 94,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The role hierarchy used in centering (Brennan et al., 1987; Grosz et al., 1995) ranks subjects over direct objects over indirect objects over others.",
                    "sid": 95,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lappin and Leass (1994) provide a more elaborate model which ranks NP complements and NP adjuncts lowest.",
                    "sid": 96,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two other distinctions in their model express a preference of rhematic2 over thematic arguments: Existential subjects, which follow the verb, rank very high, between subjects and direct objects.",
                    "sid": 97,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Topic adjuncts in pre-subject position separated by a comma rank very low, between adjuncts and NP complements.",
                    "sid": 98,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both positions are not clearly demarcated in German.",
                    "sid": 99,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When the Lap- pin&Leass hierarchy is adopted to German without changes, a small drop in performance results as compared with the obliqueness hierarchy used in centering.",
                    "sid": 100,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So we will use the centering hierarchy.",
                    "sid": 101,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 shows the effect of the role-based preference on our data.",
                    "sid": 102,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The factor is both less restrictive and less precise than sentence recency.",
                    "sid": 103,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The definition of a grammatical role hierarchy is more involved in case of automatically derived input, as the parser cannot always decide on the grammatical role (determining grammatical roles in German may require world knowledge).",
                    "sid": 104,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It proposes a syntactically preferred role, however, which we will adopt.",
                    "sid": 105,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Role Parallelism (RP).",
                    "sid": 106,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Carbonell and Brown (1988) argue that pronouns prefer antecedents in the same grammatical roles.",
                    "sid": 107,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lappin and Leass (1994) also adopt such a principle.",
                    "sid": 108,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The factor is, however, not applicable to possessive pronouns.",
                    "sid": 109,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Again, role ambiguities make this factor slightly problematic.",
                    "sid": 110,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several approaches are conceivable: Antecedent and pronoun are required to have a common role in one reading (weak match).",
                    "sid": 111,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Antecedent and pronoun are required to have the same role in the reading preferred by surface order (strong match).",
                    "sid": 112,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Antecedent and pronoun must display the same role ambiguity (strongest match).",
                    "sid": 113,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Weak match restricted performance to 49.9% with 12.1 antecedents on average.",
                    "sid": 114,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Strong match gave an upper limit of 47.0% but with only 10.3 antecedents on average.",
                    "sid": 115,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Strongest match lowered the upper limit to 43.1% but yielded only 9.3 antecedents.",
                    "sid": 116,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In interaction, strong match performed best, so we adopt it.",
                    "sid": 117,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Surface Order (LR, RL).",
                    "sid": 118,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Surface Order is usually used to bring down the number of available antecedents to one, since it is the only factor that produces a unique discourse referent.",
                    "sid": 119,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is less consensus on the preference order: (sentence-wise) left-to-right (Hobbs, 1978; Strube, 1998; Strube and Hahn, 1999; Tetreault, 1999) or right-to-left (recency) (Lappin and Leass, 1994).",
                    "sid": 120,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, something has to be said about antecedents which embed other antecedents (e.g. conjoined NPs and their conjuncts).",
                    "sid": 121,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We registered performance gains 2 Carbonell and Brown (1988) also argue that clefted or fronted arguments should be preferred.",
                    "sid": 122,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(of up to 3%) by ranking embedding antecedents higher than embedded ones (Tetreault, 2001).",
                    "sid": 123,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Left-to-right order is often used as a surrogate for grammatical role hierarchy in English.",
                    "sid": 124,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most notable exception to this equivalence are fronting constructions, where grammatical roles outperform surface order (Tetreault, 2001).",
                    "sid": 125,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A comparison of the lines for grammatical roles and for surface order in Table 1 shows that the same is true in German.",
                    "sid": 126,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Left-to-right order performs better (upper limit 56.8%) than right-to-left order (upper limit 49.2%).",
                    "sid": 127,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The gain is largely due to personal pronouns; demonstrative pronouns are better modelled by right-to-left order.",
                    "sid": 128,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is well-known that German demonstrative pronouns contrast with personal pronouns in that they function as topic-shifting devices.",
                    "sid": 129,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another effect of this phenomenon is the poor performance of the role preferences in connection with demonstrative pronouns.",
                    "sid": 130,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Depth of Embedding (DE).",
                    "sid": 131,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A prominent factor in Hobbs (1978)’s algorithm is the level of phrasal embedding: Hobbs’s algorithm performs a breadth- first search, so antecedents at higher levels of embedding are preferred.",
                    "sid": 132,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Common Path (CP).",
                    "sid": 133,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The syntactic version of Hobbs (1978)’s algorithm also assumes maximization of the common path between antecedents and anaphors as measured in NP and S nodes.",
                    "sid": 134,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accordingly, intrasentential antecedents that are syntactically nearer to the pronoun are preferred.",
                    "sid": 135,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The factor only applies to intrasentential anaphora.",
                    "sid": 136,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The anaphora resolution module itself generates potentially useful information when processing a text.",
                    "sid": 137,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Arguably, discourse entities that have been often referred to in the previous context are topical and more likely to serve as antecedents again.",
                    "sid": 138,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This principle can be captured in different ways.",
                    "sid": 139,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Equivalence Classes (EQ).",
                    "sid": 140,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lappin and Leass (1994) make use of a mechanism based on equivalence classes of discourse referents which manages the attentional properties of the individual entities referred to.",
                    "sid": 141,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The mechanism stores and provides information on how recently and in which grammatical role the entities were realized in the discourse.",
                    "sid": 142,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The net effect of the storage mechanism is that discourse entities are preferred as antecedents if they recently came up in the discourse.",
                    "sid": 143,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But the mechanism also integrates the preferences Role Hierarchy and Role Parallelism.",
                    "sid": 144,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, it is one of the best- performing factors on our data.",
                    "sid": 145,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the equivalence class scheme is tightly integrated in the parser, the problem of ideal anaphora resolution data does not arise.",
                    "sid": 146,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mention Count (MC).",
                    "sid": 147,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ge et al.",
                    "sid": 148,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1998) try to factorize the same principle by counting the number of times a discourse entities has been mentioned in the discourse already.",
                    "sid": 149,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, they do not only train but also test on the manually annotated counts, and hence presuppose an optimal anaphora resolution system.",
                    "sid": 150,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our implementation, we did not bother with intrasentential mention count, which depends on the exact traversal.",
                    "sid": 151,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rather, mention count was computed only from previous sentences.",
                    "sid": 152,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Information Status (IS).",
                    "sid": 153,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Strube (1998) and Strube and Hahn (1999) argue that the information status of an antecedent is more important than the grammatical role in which it occurs.",
                    "sid": 154,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They distinguish three levels of information status: entities known to the hearer (as expressed by coreferential NPs, unmodified proper names, appositions, relative pronouns, and NPs in titles), entities related to such hearer-old entities (either overtly via modifiers or by bridging), and entities new to the hearer.",
                    "sid": 155,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Like (Ge et al., 1998), Strube (1998) evaluates on ideal hand annotated data.",
                    "sid": 156,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NP Form (NF, NP).",
                    "sid": 157,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A cheap way to model information status is to consider the form of an antecedent (Tetreault, 2001; Soon et al., 2001; Strube and Müller, 2003).",
                    "sid": 158,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Personal and demonstrative pronouns are necessarily context-dependent, and proper nouns are nearly always known to the hearer.",
                    "sid": 159,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Definite NPs may be coreferential or interpreted by bridging, while indefinite NPs are in their vast majority new to the hearer.",
                    "sid": 160,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We considered two proposals for orderings of form: preferring pronouns and proper names over other NPs over indefinite NPs (Tetreault, 2001) (NF) or preferring pronouns over all other NPs (Tetreault, 2001) (NP).",
                    "sid": 161,
                    "ssid": 123,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "algorithms and evaluation. ",
            "number": "4",
            "sents": [
                {
                    "text": "In this section, we consider the individual approaches in more detail, in particular we will look at their choice of factors and their strategy to model factor interaction.",
                    "sid": 162,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to interaction potential, we distinguish three classes of approaches: Serialization, Weighting, and Machine Learning.",
                    "sid": 163,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We re-implemented some of the algorithms described in the literature and evaluated them on syntactically ideal and realistic German3 input.",
                    "sid": 164,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation results are listed in Table 2.",
                    "sid": 165,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the ideal treebank input, we also assumed ideal input for the factors dependent on previous 3 A reviewer points out that most of the algorithms were proposed for English, where they most likely perform better.",
                    "sid": 166,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the algorithms also incorporate a theory of saliency, which should be language-independent.",
                    "sid": 167,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "anaphora resolution results.",
                    "sid": 168,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With realistic parsed input, we fed the results of the actual system back into the computation of such factors.",
                    "sid": 169,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Serialization Approaches.",
                    "sid": 170,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Algorithmical approaches first apply filters unconditionally; possible exceptions are deemed non- existant or negligible.",
                    "sid": 171,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With regard to interaction of preferences, many algorithms (Hobbs, 1978; Strube, 1998; Tetreault, 2001) subscribe to a scheme, which, though completely rigid, performs surprisingly well: The chosen preferences are applied one after the other in a certain predefined order.",
                    "sid": 172,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Application of a preference consists in selecting those of the antecedents still available that are ranked highest in the preference order.",
                    "sid": 173,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hobbs (1978)’s algorithm essentially is a concatenation of the preferences Sentence Recency (without cataphora), Common Path, Depth of Embedding, and left-to-right Surface Order.",
                    "sid": 174,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also implements the binding constraints by disallowing sibling to the anaphor in a clause or NP as antecedents.",
                    "sid": 175,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Like Lappin and Leass (1994), we replaced this implementation by our own mechanism to check binding constraints, which raised the success rate.",
                    "sid": 176,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Left-Right Centering algorithm of Tetreault (1999) is similar to Hobbs’s algorithm, and is composed of the preferences Sentence Recency (without cataphora), Depth of Embedding, and left-to-right Surface Order.",
                    "sid": 177,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since it is a centering approach, it only inspects the current and last sentence.",
                    "sid": 178,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Strube (1998)’s S-list algorithm is also restricted to the current and last sentence.",
                    "sid": 179,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Predicative complements and NPs in direct speech are excluded as antecedents.",
                    "sid": 180,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The primary ordering criterion is Information Status, followed by Sentence Recency (without cataphora) and left-to-right Surface Order.",
                    "sid": 181,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since serialization provides a quite rigid frame, we conducted an experiment to find the best performing combination of pronoun resolution factors on the treebank and the best combination on the parsed input.",
                    "sid": 182,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this purpose, we checked all permutations of preferences and subtracted preferences from the best-performing combinations until performance degraded (greedy descent).",
                    "sid": 183,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Greedy descent outperformed hill-climbing.",
                    "sid": 184,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The completely annotated 6.7% of the corpus were used as development set, the rest as test set.",
                    "sid": 185,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Weighting Approaches.",
                    "sid": 186,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared with the serialization approaches, the algorithm of Lappin and Leass (1994) is more sophisticated: It uses a system of hand-selected weights to control interaction among preferences, so that in principle the order of preference application can Al go rit h m D e f i n i t i o n F-Scores – treebankF Sc or e P ar se r tot al PP ER PP OS AT P D S (H ob bs, 19 78 ) ( T e t r e a u l t , 1 9 9 9 ) ( S t r u b e , 1 9 9 8 ) op ti m al al go r.",
                    "sid": 187,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(tr ee ba nk ) op ti m al al go r.",
                    "sid": 188,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(p ars ed ) S R C P D E L R S R 2 D E L R I S S R 2 L R S R C P I S D E M C R P G R R L S R C P G R I S D E L R 59 .9 57 .0 57 .9 70 .4 67 .7 6 5.",
                    "sid": 189,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 6 4.",
                    "sid": 190,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 6 5.",
                    "sid": 191,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 7 5.",
                    "sid": 192,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 7 4.",
                    "sid": 193,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 7 0 . 5 6 1 . 9 6 3 . 7 8 2 . 0 8 2 . 0 17 .4 17 .2 12 .0 22 .7 10 .6 4 5 . 4 4 3 . 3 3 9 . 1 4 3 . 7 5 0 . 6 (L ap pi n an d Le as s, 19 94 ) E Q S R R L 65 .4 7 1.",
                    "sid": 194,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 7 8 . 0 16 .6 5 0 . 8 (G e et al. , 19 98 ) (S oo n et al. , 20 01 ) op ti m al al go r.",
                    "sid": 195,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(C 4.",
                    "sid": 196,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5) H ob bs +M C (S R+ N P) R L (S R/ R L+ G R+ N F/ I S) R L 43 .4 24 .8 71 .1 4 5.",
                    "sid": 197,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 3 0.",
                    "sid": 198,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 7 8.",
                    "sid": 199,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 5 3 . 6 2 3 . 6 7 9 . 0 1 2.",
                    "sid": 200,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 0 . 0 9 . 8 3 6 . 3 2 6 . 8 5 1 . 7 Table 2: Performance of Algorithms switch under different input data.",
                    "sid": 201,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the actual realization, however, the weights of factors lie so much apart that in the majority of cases interaction boils down to serialization.",
                    "sid": 202,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The weighting scheme includes Sentence Recency, Grammatical Roles, Role Parallelism, on the basis of the equivalence class approach described in section 3.2.",
                    "sid": 203,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Final choice of antecedents is relegated to right-to-left Surface Order.",
                    "sid": 204,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Interestingly, the Lappin&Leass algorithm outperforms even the best serialization algorithm on parsed input.",
                    "sid": 205,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Machine Learning Approaches.",
                    "sid": 206,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Machine Learning approaches (Ge et al., 1998; Soon et al., 2001; Ng and Cardie, 2002) do not distinguish between filters and preferences.",
                    "sid": 207,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They submit all factors as features to the learner.",
                    "sid": 208,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For every combination of feature values the learner has the freedom to choose different factors and to assign different strength to them.",
                    "sid": 209,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the main problem is not choice and interaction of factors, but rather the formulation of anaphora resolution as a classification problem.",
                    "sid": 210,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two proposals emerge from the literature.",
                    "sid": 211,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) Given an anaphor and an antecedent, decide if the antecedent is the correct one (Ge et al., 1998; Soon et al., 2001; Ng and Cardie, 2002).",
                    "sid": 212,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Given an anaphor and two antecedents, decide which antecedent is more likely to be the correct one (Yang et al., 2003).",
                    "sid": 213,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In case (1), the lopsidedness of the distribution is problematic: There are much more negative than positive training examples.",
                    "sid": 214,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Machine Learning tools have to surpass a very high baseline: The strategy of never proposing an antecedent typically already yields an f-score of over 90%.",
                    "sid": 215,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In case (2), many more correct decisions have to be made before a correct antecedent is found.",
                    "sid": 216,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus it is important in this scenario, that the set of antecedents is subjected to a strict filtering process in advance so that the system only has to choose among the best candidates and errors are less dangerous.",
                    "sid": 217,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ge et al.",
                    "sid": 218,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1998)’s probabilistic approach combines three factors (aside from the agreement filter): the result of the Hobbs algorithm, Mention Count dependent on the position of the sentence in the article, and the probability of the antecedent occurring in the local context of the pronoun.",
                    "sid": 219,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our re-implementation, we neglected the last factor (see section 3.1).",
                    "sid": 220,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation was performed using 10- fold cross validation.",
                    "sid": 221,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other Machine Learning approaches (Soon et al., 2001; Ng and Cardie, 2002; Yang et al., 2003) make use of decision tree learning4 ; we used C4.5 (Quinlan, 1993).",
                    "sid": 222,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To construct the training set, Soon et al.",
                    "sid": 223,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2001) take the nearest correct antecedent in the previous context as a positive example, while all possible antecedents between this antecedent and the pronoun serve as negative examples.",
                    "sid": 224,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For testing, potential antecedents are presented to the classifier in Right-to-Left order; the first one classified positive is chosen.",
                    "sid": 225,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Apart from agreement, only two of Soon et al.",
                    "sid": 226,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2001)’s features apply to pronominal anaphora: Sentence Recency, and NP Form (with personal pronouns only).",
                    "sid": 227,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used every 10th sentence in Negra for testing, all other sentences for training.",
                    "sid": 228,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On parsed input, a very simple decision tree is generated: For every personal and possessive pronoun, the nearest agreeing pronoun is chosen as antecedent; demonstrative pronouns never get an antecedent.",
                    "sid": 229,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This tree performs better than the more complicated tree generated from treebank input, where also non-pronouns in previous sentences can serve as antecedents to a personal pronoun.",
                    "sid": 230,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Soon et al.",
                    "sid": 231,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2001)’s algorithm performs below its potential.",
                    "sid": 232,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We modified it somewhat to get better results.",
                    "sid": 233,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For one, we used every possible antecedent 4 On our data, Maximum Entropy (Kehler et al., 2004) had problems with the high baseline, i.e. proposed no antecedents.",
                    "sid": 234,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "in the training set, which improved performance on the treebank set (by 1.8%) but degraded performance on the parsed data (by 2%).",
                    "sid": 235,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we used additional features, viz.",
                    "sid": 236,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the grammatical role of antecedent and pronoun, the NP form of the antecedent, and its information status.",
                    "sid": 237,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The latter two features were combined to a single feature with very many values, so that they were always chosen first in the decision tree.",
                    "sid": 238,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also used fractional numbers to express intrasentential word distance in addition to Soon et al.",
                    "sid": 239,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2001)’s sentential distance.",
                    "sid": 240,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Role Parallelism (Ng and Cardie, 2002) degraded performance (by 0.3% F-value).",
                    "sid": 241,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Introducing agreement as a feature had no effect, since the learner always determined that mismatches in agreement preclude coreference.",
                    "sid": 242,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mention Count, Depth of Embedding, and Common Path did not affect performance either.",
                    "sid": 243,
                    "ssid": 82,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "5",
            "sents": [
                {
                    "text": "The paper has presented a survey of pronoun resolution factors and algorithms.",
                    "sid": 244,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two questions were investigated: Which factors should be chosen, and how should they interact?",
                    "sid": 245,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two types of factors, ‘filters’ and ‘preferences’, were discussed in detail.",
                    "sid": 246,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, their restrictive potential and effect on success rate were assessed on the evaluation corpus.",
                    "sid": 247,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To address the second question, several well-known algorithms were grouped into three classes according to their solution to factor interaction: Serialization, Weighting, and Machine Learning.",
                    "sid": 248,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Six algorithms were evaluated against a common evaluation set so as to facilitate direct comparison.",
                    "sid": 249,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different algorithms have different strengths, in particular as regards their robustness to parsing errors.",
                    "sid": 250,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two of the interaction strategies (Serialization and Machine Learning) allow data-driven optimization.",
                    "sid": 251,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Optimal algorithms could be proposed for these strategies.",
                    "sid": 252,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}