{
    "ID": "C04-1131",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This article describes the results of a systematic in- depth study of the criteria used for word sense disambiguation.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our study is based on 60 target words: 20 nouns, 20 adjectives and 20 verbs.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our results are not always in line with some practices in the field.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, we show that omitting non- content words decreases performance and that bigrams yield better results than unigrams.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The task of word sense disambiguation (WSD) is to identify the correct sense of a word in context.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WSD is usually performed by matching information from the context in which the word occurs with disambiguation knowledge source.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach uses supervised machine-learning techniques to automatically acquire such disambiguation knowledge from sense-tagged corpora.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At present, this type of approach is widely used and seems to yield the best results (Kilgarriff, Rosenzweig, 2000; Ng, 1997b).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Information conveyed by context words (morphological form) is enriched with further annotations: part-of-speech tag, lemma, etc. Each individual piece of information is called a feature.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A good feature should capture an important source of knowledge that is critical in determining the sense of the word to be disambiguated.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The choice of the appropriate set of features is an important issue for WSD (Bruce, Wiebe, Perdersen, 1996; Ng, Zelle, 1997; Pedersen, 2001).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, this paper describes the results of a systematic and in-depth study of homogenous criteria (i.e. set of features) that can be used for WSD.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "methodology. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Corpus.",
                    "sid": 13,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus we worked on is composed of different types of texts and comprises 6 468 522 words.",
                    "sid": 14,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It was put together within the framework of lexical tagging of 60 target words selected for their strongly polysemous nature (Véronis, 1998)1.",
                    "sid": 15,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These 60 target words are evenly divided into 20 nouns, 20 adjectives and 20 verbs, having a total of 53 796 occurrences in the corpus.",
                    "sid": 16,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The inadequacy of standard dictionaries (Véronis, 2001) and computational lexicons (Palmer, 1998) for natural language processing is presently one of the major difficulties encountered in word sense disambiguation.",
                    "sid": 17,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, by using these dictionaries, the inter-annotator agreement may sometimes reach only 57% (Ng, Lee, 1996) or may simply be equivalent to random sense allocation (Véronis, 1998).",
                    "sid": 18,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To overcome this weakness, a dictionary more specific to natural language processing is being developed in our team (Reymond, 2002).",
                    "sid": 19,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has been used to tag the occurrences of the 60 target words of the SyntSem corpus.",
                    "sid": 20,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 8 in the appendix gives quantitative information for each target word.",
                    "sid": 21,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of senses per word may be very large for it includes idioms and phrasal verbs such as: « mettre sur pied », « mettre à pied », « pied de nez », etc. A general agreement seems to emerge according to which morphosyntatic disambiguation and sense disambiguation can be disentangled (Kilgarriff, 1997; Ng, Zelle, 1997).",
                    "sid": 22,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have entrusted the part-of-speech tagging of our corpus to the Cordial software (developed by Synapse Développement company) as it offers lemmatisation and part-of-speech tagging of a satisfactory accuracy (Valli, Véronis, 1999).",
                    "sid": 23,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "mform lemma ems cgems sense mettre mettre VINF VINF 1.12.7 fin fin NCFS NCOM à à PREP PREP la le DETDFS DET pratique pratique NCFS NCOM des de DETDPIG DET détentions détention NCFP NCOM 1 Table 1: SyntSem tagged corpus extract.",
                    "sid": 24,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the SyntSem project that aims at producing a French corpus which is morphologically and syntactically tagged, lemmatised and that comprises a light syntactical tagging as well as a 1 These words are those used in the French part of the.",
                    "sid": 25,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Senseval1 evaluation exercice (Segond, 2000) but the corpus and dictionary are different in the present study.",
                    "sid": 26,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 displays an extract of the SyntSem corpus.",
                    "sid": 27,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows all the tags of each word.",
                    "sid": 28,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the information provided by these tags in our lexical disambiguation criteria.",
                    "sid": 29,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Criteria.",
                    "sid": 30,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The aim of our study is to evaluate a large variety of homogenous criteria (i.e. set of features).",
                    "sid": 31,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The name of each criterion specifies its nature and takes the following form [par1|par2|par3|par4].",
                    "sid": 32,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parameter par1 indicates whether the criterion takes into account unigrams (par1=1gr), bigrams (par1=2gr) or trigrams (par1=3gr), knowing that an n-gram represents the juxtaposition of n words.",
                    "sid": 33,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parameter par2 indicates which word tag is considered: morphological form (par2=mform), lemma (par2=lemma), part-of-speech (par2=ems) or coarse-grained part-of-speech (par2=cgems).",
                    "sid": 34,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parameter par3 indicates if we take into account word positions (par3=position), if we only distinguish left from right context (par3=leftright), or if we simply consider unordered set of surrounding words (par3=unordered).",
                    "sid": 35,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lastly, parameter par4 shows whether the criterion takes into account all the words (par4=all) or content words only (par3=content).",
                    "sid": 36,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We call these criteria “homogeneous criteria” as the four parameters together determine the nature of all pieces of contextual evidence selected by the criterion.",
                    "sid": 37,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For contexts within a range of ±1 to ± 8 words, the combination of all parameters generates 576 (3¯4¯3¯2¯8) distinct criteria.",
                    "sid": 38,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have systematically evaluated each one of these criteria as well as other criteria in order to answer specific questions and to validate or invalidate certain hypothesis.",
                    "sid": 39,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Within the framework of this study, we have developed an application used to model these criteria and to further apply them to the corpus in order to generate feature vectors used by our classifiers (Audibert, 2001).",
                    "sid": 40,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Classifiers.",
                    "sid": 41,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have selected two complementary classifiers.",
                    "sid": 42,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have chosen the NaïveBayes classifier (NB) for its simplicity and widespread use, as well as for its well-known state-of-the-art accuracy on supervised WSD (Domingos, Pazzani, 1997; Mooney, 1996; Ng, 1997a).",
                    "sid": 43,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NB classifier assumes the features are independent given the sense.",
                    "sid": 44,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During classification, it chooses the sense with the highest posterior probability.",
                    "sid": 45,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have also selected a decision list classifier (DL) which is similar to the classifier used by (Yarowsky, 1994) for words having two senses, and extended for more senses by (Golding, 1995).",
                    "sid": 46,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DL classifier is further developed in (Audibert, 2003).",
                    "sid": 47,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In DL, features are sorted in order of decreasing strength, where strength reflects feature reliability for decision-making.",
                    "sid": 48,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The DL classifier distinguishes itself clearly from the NB classifier as it does not combine the features, but bases its classifications solely on the single most reliable feature identified in the target context selected by the criteria.",
                    "sid": 49,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will make a use of this decision-making transparency several times in this article.",
                    "sid": 50,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some other advantages of DL classifier are its significant simplicity and its ease of implementation.",
                    "sid": 51,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both of the classifiers we used require probability estimates.",
                    "sid": 52,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the data-sparseness, we have to deal with zero or low frequency counts.",
                    "sid": 53,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this reason, we have decided to use m- estimation (Cussens, 1993) rather than classical estimations of probabilities or Laplace (“add one”) smoothing.",
                    "sid": 54,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When a classifier is not able to disambiguate a target word, which is very rare, it selects the most frequent sense from the training data.",
                    "sid": 55,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, all occurrences are tagged.",
                    "sid": 56,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in this case precision equals the recall, the present article speaks in terms of precision only.",
                    "sid": 57,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To evaluate a criterion in the corpus, we use a k- fold cross-validation method (in accordance with the common use, in our experiment, k=10).",
                    "sid": 58,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Despite the fact that this method takes much computing time, it enables the evaluation of the criterion in the whole corpus.",
                    "sid": 59,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Throughout the tests, the two classifiers have generally obtained comparable accuracy, although the NB classifier has almost systematically outperformed the DL classifier.",
                    "sid": 60,
                    "ssid": 48,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results. ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 Best criteria precision.",
                    "sid": 61,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 displays for each of the target words studied the optimal context size and the disambiguation precision obtained by the best unigram, bigram and trigram-based criteria.",
                    "sid": 62,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This table points out that best criteria take into account all words in the context.",
                    "sid": 63,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3.2 will concentrate on feature reliability according to their part-of-speech.",
                    "sid": 64,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, section 3.2 will deal with the impact of different feature selections based on Nouns Adjectives Verbs Criterion P% S P% S P% S [1gr|lemma| ordered|all] 81.9 ±2 76.8 ±1 71.8 ±3 [2gr|lemma| leftright|all] 83.6 ±4 77.9 ±3 74.0 ±4 [3gr|lemma| leftright|all] 82.3 ±5 72.7 ±3 71.2 ±5 Table 2: Optimal context size (S) and criteria precision (P%) using NB classifier.",
                    "sid": 65,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "features part-of-speech.",
                    "sid": 66,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to the Table 2, the optimal context size comprises ±1 to ±5 words.",
                    "sid": 67,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further developments of the context optimality will be made in section 3.4.",
                    "sid": 68,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Surprisingly, Table 2 outlines the fact that the criterion that obtains the best precision is based on bigrams and not on unigrams.",
                    "sid": 69,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This subject is dealt with in section 3.5.",
                    "sid": 70,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 The most reliable parts-of-speech.",
                    "sid": 71,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we aim at learning the part-of- speech and the space distribution of all pieces of contextual evidence used for disambiguation.",
                    "sid": 72,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To this end, we use the DL classifier because it bases its classifications solely on the most reliable piece of evidence identified by the criteria.",
                    "sid": 73,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, DL classifier enables us to learn which is the part- of-speech and the space distribution of this indicator by using the criterion [1gr|mform|ordered|all].",
                    "sid": 74,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 and graphics presented in Figure 1 synthesize this study results.",
                    "sid": 75,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 enables to bring out the following results (we quote between brackets and in order the main results obtained for the nouns, the adjectives and the verbs): • common nouns (NCOM) obtain one of the best precisions (93.0%; 93.7%; 87.8%) and represent one of the most used indicators (12.7%; 25.3%; 26%) for the three term categories; • adjectives (ADJ) represent good indicators for nouns (p=94.9%) and adjectives (p=80.3%), but they are especially useful for nouns since they are used in 13.7% of the cases against 2.2% only for the adjectives; • adverbs (ADV) are mainly useful for adjectives; their precision reaches 79.2% and they are used in 9.6% of the cases; • verbs in the infinitive (VINF) are very reliable indicators for the three parts-of-speech (90.2%; 80.6%; 87.2%), but they are rarely used as they are not very often encountered in the context (0.9%; 0.7%; 2.9%); • conjugated verbs (VCON) obtain poor precision (67.9%; 53.9%; 54.4%).",
                    "sid": 76,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 graphics show the space distribution of the main parts-of-speech of the indicators used to disambiguate each one of the three term categories.",
                    "sid": 77,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The dissymmetric shape of verbs, and more precisely, the strong prevalence of indicators located in position +1, +2, +3, makes us believe that disambiguating verbs is done more accordingly to their object than to their subject since as a rule the main form encountered is subject–verb–object.",
                    "sid": 78,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun s Adjecti ves Verb s P % U % P % U % P % U % NC OM 93.",
                    "sid": 79,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 12.",
                    "sid": 80,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 93.",
                    "sid": 81,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 25 .3 87.",
                    "sid": 82,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 26.",
                    "sid": 83,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 DE T 73.",
                    "sid": 84,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 30.",
                    "sid": 85,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 69.",
                    "sid": 86,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 21 .3 48.",
                    "sid": 87,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 12.",
                    "sid": 88,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 PR EP 78.",
                    "sid": 89,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 24.",
                    "sid": 90,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 61.",
                    "sid": 91,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 15 .2 62.",
                    "sid": 92,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 17.",
                    "sid": 93,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 AD J 94.",
                    "sid": 94,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 13.",
                    "sid": 95,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 80.",
                    "sid": 96,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 2 . 2 65.",
                    "sid": 97,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 3.",
                    "sid": 98,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 AD V 57.",
                    "sid": 99,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 1.",
                    "sid": 100,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 79.",
                    "sid": 101,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 9 . 6 60.",
                    "sid": 102,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 5.",
                    "sid": 103,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 PR OP E 63.",
                    "sid": 104,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 0.",
                    "sid": 105,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 67.",
                    "sid": 106,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 2 . 6 65.",
                    "sid": 107,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 11.",
                    "sid": 108,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 PC TF OR TE 72.",
                    "sid": 109,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 3.0 0 69.",
                    "sid": 110,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 4 . 2 80.",
                    "sid": 111,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 2.",
                    "sid": 112,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 VC ON 67.",
                    "sid": 113,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 1.",
                    "sid": 114,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 53.",
                    "sid": 115,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 2 . 4 54.",
                    "sid": 116,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 3.",
                    "sid": 117,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 SU B 78.",
                    "sid": 118,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 0.",
                    "sid": 119,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 58.",
                    "sid": 120,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 1 . 8 79.",
                    "sid": 121,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 2.",
                    "sid": 122,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 VI NF 90.",
                    "sid": 123,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 0.",
                    "sid": 124,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 80.",
                    "sid": 125,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 0 . 7 87.",
                    "sid": 126,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 2.",
                    "sid": 127,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 NP RO 86.",
                    "sid": 128,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 0.",
                    "sid": 129,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 92.",
                    "sid": 130,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0 . 6 81.",
                    "sid": 131,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 1.",
                    "sid": 132,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 VP AR 89.",
                    "sid": 133,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 0.",
                    "sid": 134,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 50.",
                    "sid": 135,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0 . 2 81.",
                    "sid": 136,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0.",
                    "sid": 137,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 PR OD E 10 0 0.",
                    "sid": 138,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 35.",
                    "sid": 139,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0 . 2 68.",
                    "sid": 140,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 0.",
                    "sid": 141,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 Table 3: Precision (P%) and usage proportion (U%) by coarse-grained part-of-speech of most reliable contextual evidences using DL classifier.",
                    "sid": 142,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1: space distribution by part-of-speech of most reliable pieces of contextual evidence used for disambiguation with DL classifier.",
                    "sid": 143,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No uns Ad j. Ve rbs [1gr |mfo rm|o rder ed|a ll] 81 .5 75.",
                    "sid": 144,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 71 .0 [1gr |mfo rm|o rder ed|c onte nt] 78 .9 71.",
                    "sid": 145,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 59 .5 [1gr |mfo rm|o rder ed|s elec ted] 79 .2 71.",
                    "sid": 146,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 66 .3 Table 4: space distribution of most reliable pieces of contextual evidence used for disambiguation with DL classifier.",
                    "sid": 147,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 summarizes these graphs.",
                    "sid": 148,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our results and those of (Yarowsky, 1993) agree in many respects, although his study applies only to pseudo- words having only two “senses”: • “Adjectives derive almost all of their disambiguating information from the nouns they modify”; • “Nouns are best disambiguated by directly adjacent adjectives or nouns”; • “Verbs derive more disambiguating information from their objects than from their subjects”.",
                    "sid": 149,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 The importance of stop-words.",
                    "sid": 150,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No un s Ad jec tiv es Ve rb s Un igr am s 0 . 3 % 2 . 5 % 6 . 9 % Big ra ms 2 . 7 % 3 . 4 % 13 .5 % Tri gra ms 1 2.",
                    "sid": 151,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 % 1 5 . 9 % 20 .2 % Table 5: precision decrease when omitting non- content words using DL classifier.",
                    "sid": 152,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many studies do not consider all the words of the context (El-Bèze, Loupy, Marteau, 1998; Mooney, 1996; Ng, Lee, 2002).",
                    "sid": 153,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The assumption according to which content words represent the most reliable indicators underlies the choice to use only content words based criteria.",
                    "sid": 154,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This seems to be obvious, but it is not confirmed in Table 2.",
                    "sid": 155,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 shows the average decrease of the precision of the content words based criteria ([par1|par2|par3|content]) compared to the same criteria based on all words ([par1|par2|par3|all]).",
                    "sid": 156,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This table shows that the decrease is low when the criteria are based on unigrams and are used to disambiguate nouns, but it can become very high in the other cases, and in particular for verbs disambiguation.",
                    "sid": 157,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 informs us about the disambiguation precision according to the coarse-grained part-of- speech tag.",
                    "sid": 158,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This table shows that using content words only is probably not the most appropriate feature selection (for example inflected verbs are not relevant).",
                    "sid": 159,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have therefore chosen to try out a more subtle selection (we refer to it by par4=selected) by restraining to the most reliable parts-of-speech according to Table 3: • For nouns, we use indicators having the following coarse-grained part-of-speech tagging: Table 6: precision with and without feature selections using NB classifier.",
                    "sid": 160,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NCOM, PREP, ADJ, SUB, VINF, NPRO, VPAR or PRODE; • For adjectives, we use indicators having the following coarse-grained part-of-speech tagging: NCOM, DET, ADJ, ADV, VINF or NPRO; • For verbs, we use indicators having the following coarse-grained part-of-speech tagging: NCOM, ADJ, PROPE, PCTFORTE, SUB, VINF, NPRO, VPAR or PRODE.",
                    "sid": 161,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6 gives a comparison of the precision reached by the following 3 criteria: • [1gr|mform|ordered|all], • [1gr|mform|ordered|content], • [1gr|mform|ordered|selected].",
                    "sid": 162,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We observe that this subtler selection lowers the disambiguation precision too.",
                    "sid": 163,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We assume then that all words, whatever their part-of-speech, contribute to the disambiguation.",
                    "sid": 164,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Optimal context.",
                    "sid": 165,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4.1 Size and symmetry We tested up to ±10 000 word contexts.",
                    "sid": 166,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the best precision is always obtained for short contexts ranging from ±1 to ±5 words.",
                    "sid": 167,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results are similar to those obtained by many other researches (El-Bèze, et al., 1998; Yarowsky, 1993; 2000).",
                    "sid": 168,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Optimal context size is criteria, target part-of- speech and n-gram size dependent.",
                    "sid": 169,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, it increases with the n-gram size.",
                    "sid": 170,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 7 shows, for all the criteria we examined, the average size of the optimal context by the n- gram size and by the part-of-speech.",
                    "sid": 171,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main indicators used to disambiguate nouns and adjectives surround roughly symmetrically the word we want to disambiguate.",
                    "sid": 172,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the contrary, indicators for verbs tend to be mainly situated after the verb.",
                    "sid": 173,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, a non-symmetrical context shifted forward by a word proves to be more appropriate.",
                    "sid": 174,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our experiments show that the use of this shifted context improves the precision of the verbs disambiguation by 0.75% in average.",
                    "sid": 175,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No un s Ad jec tiv es Ve rb s Un igr am s 1 . 5 1 . 1 1 . 8 Big ra ms 2 . 4 2 2 . 8 Tri gra ms 3 . 1 3 . 4 3 . 8 Table 7: optimal context size using both classifiers.",
                    "sid": 176,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4.2 Do n-grams have to contain the target word?",
                    "sid": 177,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lemma being unique for a given word, if only lemmas are considered, an n-gram which is adjacent to the target word contains precisely the same information as the same n-gram to which the target word is added in order to compose a (n+1)- gram.",
                    "sid": 178,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The n-gram that is situated next to the word to disambiguate can thus be assimilated to the (n+1)-gram which contains it.",
                    "sid": 179,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, the question becomes: do n-grams have to contain the word to disambiguate or at least to be adjacent to it?",
                    "sid": 180,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several studies set themselves this constraint probably because n-grams are used to capture fixed constructions containing the word to disambiguate.",
                    "sid": 181,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows that the optimal context size for best bigram or trigram-based criteria does not fit this constraint.",
                    "sid": 182,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relevant n-grams do not necessarily contain the target word and are not necessarily adjacent to it.",
                    "sid": 183,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, for nouns and verbs, the ±4 words context is the optimal context size of the bigram-based criteria which obtains the best disambiguation precision.",
                    "sid": 184,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This criterion produces some bigrams separated from the target word by one or two words.",
                    "sid": 185,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, this single observation cannot enable us to abandon the constraint in terms of containing or being adjacent to the target word.",
                    "sid": 186,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, the bigram increasing distance may help locating an information which could be captured by the joint use of one or several larger n-grams.",
                    "sid": 187,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have thus evaluated a combination of criteria in which all n- grams contain the target word in a context up to ±4 words: • [2gr|lemma|leftright|all] with context size of ±1 words; • [3gr|lemma|leftright|all] with context size of ±2 words; • [4gr|lemma|leftright|all] with context size of ±3 words; • [5gr|lemma|leftright|all] with context size of ±4 words.",
                    "sid": 188,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This combination leads to a disambiguating precision of 74.3%, which is lower than the one obtained using the criteria [2gr|lemma|leftright|all] alone with a ±4 words context.",
                    "sid": 189,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This experiment confirms that constraining the context to contain the word to disambiguate, or at least to be adjacent to it, decreases disambiguation accuracy.",
                    "sid": 190,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, nothing justifies this constraint on criteria.",
                    "sid": 191,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.5 Surprising bigrams accuracy.",
                    "sid": 192,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Contrary to all expectations, Table 2 shows that the best unigram-based criterion ([1gr|lemma|ordered|all]) is definitely less accurate than the best bigram-based criterion ([2gr|lemma|leftright|all]).",
                    "sid": 193,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, in practice, bigrams and trigrams are seldom used alone.",
                    "sid": 194,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When used, they are taken in conjunction with unigrams which are supposed to convey the most reliable piece of information.",
                    "sid": 195,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Why does the criterion [2gr|lemma|leftright|all] work so well?",
                    "sid": 196,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, since this criterion is a juxtaposition of lemmas, among the features generated by this criterion, the left and the right unigrams are to be found, even if these unigrams are disguised as bigrams (cf.",
                    "sid": 197,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "section 3.4.2).",
                    "sid": 198,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As these pieces of contextual evidence are certainly the most important ones (cf.",
                    "sid": 199,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "section 3.4), it makes sense that this bigram-based criterion obtains good results.",
                    "sid": 200,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, in a context of a higher size, the juxtaposition of two words seems more relevant than one isolated word.",
                    "sid": 201,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, to disambiguate the word utile, the bigram pour_le is relevant, whereas the single unigrams pour and le are not of much help.",
                    "sid": 202,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lastly, sometimes, the presence of a unigram noncontiguous to the target word can be sufficient to solve the ambiguity.",
                    "sid": 203,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But using bigram-based criteria does not necessarily lose the piece of information conveyed by unigram-based criteria.",
                    "sid": 204,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, a determiner, a preposition or an apostrophe often precedes a common noun.",
                    "sid": 205,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lemmatisation variability of this determiner, this preposition or this apostrophe is low for a given common noun located at a given distance from a given target word.",
                    "sid": 206,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the piece of information brought out by the juxtaposition of the noun and the preceding word is often very similar to the piece of information provided by the noun alone.",
                    "sid": 207,
                    "ssid": 147,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "4",
            "sents": [
                {
                    "text": "We have described here the results of a systematic and in-depth research on WSD criteria.",
                    "sid": 208,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This may be the first research of this extent carried out within a unified framework.",
                    "sid": 209,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This study enabled us to confirm certain results stated in the field literature such as: • importance of short contexts; • importance of adjacent noun or adverb for adjective disambiguation; • importance of adjacent adjective, or noun in a very short context for noun disambiguation; • importance of the noun in the area after the verb and use of dissymmetrical contexts for verb disambiguation.",
                    "sid": 210,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have also obtained more original results, not always in line with some practices in the field such as: • importance of stop-words whose withdrawal decreases the performance almost systematically; • better results obtained by bigrams taken alone than unigrams alone; • unnecessary constraint of including or be adjacent to the target word.",
                    "sid": 211,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Disambiguation accuracy could probably be improved by the study of other sources of information useful in disambiguation, such as: • criteria based on binary syntactic relations (noun- noun, noun-verb, adjective-noun, etc.) to capture information which can be absent from short contexts; • the use of thesauri or other sources of information to carry out generalizations on context words to overcome data sparseness problem; • topical text information; • selectional restrictions.",
                    "sid": 212,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This preliminary study focuses on homogenous criteria (for example: lemmas located from –2 to +2 position).",
                    "sid": 213,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To improve the disambiguation accuracy, we have to look for heterogeneous criteria by gathering the most relevant pieces of contextual evidence not necessarily of the sametype (for example: lemma in position –2, part-of speech in position –1, morphological form of target word and lemma in position +2).",
                    "sid": 214,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This feature selection leads to a combinatorial explosion that can be solved by genetic algorithms (Daelemans, Hoste, Meulder, Naudts, 2003).",
                    "sid": 215,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}