{
    "ID": "C04-1075",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper presents a constraint-based multi- agent strategy to coreference resolution of general noun phrases in unrestricted English text.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a given anaphor and all the preceding referring expressions as the antecedent candidates, a common constraint agent is first presented to filter out invalid antecedent candidates using various kinds of general knowledge.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, according to the type of the anaphor, a special constraint agent is proposed to filter out more invalid antecedent candidates using constraints which are derived from various kinds of special knowledge.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, a simple preference agent is used to choose an antecedent for the anaphor form the remaining antecedent candidates, based on the proximity principle.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One interesting observation is that the most recent antecedent of an anaphor in the coreferential chain is sometimes indirectly linked to the anaphor via some other antecedents in the chain.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, we find that the most recent antecedent always contains little information to directly determine the coreference relationship with the anaphor.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, for a given anaphor, the corresponding special constraint agent can always safely filter out these less informative antecedent candidates.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, rather than finding the most recent antecedent for an anaphor, our system tries to find the most direct and informative antecedent.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation shows that our system achieves Precision / Recall / F-measures of 84.7% /65.8% / 73.9 and 82.8% / 55.7% / 66.5 on MUC6 and MUC7 English coreference tasks respectively.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that our system achieves significantly better precision rates by about 8 percent over the best-reported systems while keeping recall rates.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Coreference accounts for cohesion in texts.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Especially, a coreference denotes an identity of reference and holds between two expressions, which can be named entities, definite noun phrases, pronouns and so on.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Coreference resolution is the process of determining whether two referring expressions refer to the same entity in the world.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ability to link referring expressions both within and across the sentence is critical to discourse and language understanding in general.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, coreference resolution is a key task in natural language interfaces, machine translation, text summarization, information extraction and question answering.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, information extraction systems like those built in the DARPA Message Understanding Conferences (MUC) have revealed that coreference resolution is such a crucial component of an information extraction system that a separate coreference task has been defined and evaluated in MUC6 (1995) and MUC7 (1998).",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is a long tradition of work on coreference resolution within computational linguistics.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many of the earlier works in coreference resolution heavily exploited domain and linguistic knowledge (Carter 1987; Rich and LuperFoy 1988; Carbonell and Brown 1988).",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the pressing need for the development of robust and inexpensive solutions encouraged the drive toward knowledge-poor strategies (Dagan and Itai 1990; Lappin and Leass 1994; Mitkov 1998; Soon, Ng and Lim 2001; Ng and Cardie 2002), which was further motivated by the emergence of cheaper and more reliable corpus- based NLP tools such as part-of-speech taggers and shallow parsers alongside the increasing availability of corpora and other resources (e.g. ontology).",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Approaches to coreference resolution usually rely on a set of factors which include gender and number agreements, c-command constraints, semantic consistency, syntactic parallelism, semantic parallelism, salience, proximity, etc. These factors can be either “constraints” which discard invalid ones from the set of possible candidates (such as gender and number agreements, c-command constraints, semantic consistency), or “preferences” which gives more preference to certain candidates and less to others (such as syntactic parallelism, semantic parallelism, salience, proximity).",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While a number of approaches use a similar set of factors, the computational strategies (the way antecedents are determined, i.e. the algorithm and formula for assigning antecedents) may differ, i.e. from simple co-occurrence rules (Dagan and Itai 1990) to decision trees (Soon, Ng and Lim 2001; Ng and Cardie 2002) to pattern induced rules (Ng and Cardie 2002) to centering algorithms (Grosz and Sidner 1986; Brennan, Friedman and Pollard 1987; Strube 1998; Tetreault 2001).",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper proposes a simple constraint-based multi-agent system to coreference resolution of general noun phrases in unrestricted English text.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a given anaphor and all the preceding referring expressions as the antecedent candidates, a common constraint agent is first presented to filter out invalid antecedent candidates using various kinds of general knowledge.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, according to the type of the anaphor, a special constraint agent is proposed to filter out more invalid antecedent candidates using constraints which are derived from various kinds of special knowledge.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, a simple preference agent is used to choose an antecedent for the anaphor form the remaining antecedent candidates, based on the proximity principle.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One interesting observation is that the most recent antecedent of an anaphor in the coreferential chain is sometimes indirectly linked to the anaphor via some other antecedents in the chain.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, we find that the most recent antecedent always contains little information to directly determine the coreference relationship with the anaphor.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, for a given anaphor, the corresponding special constraint agent can always safely filter out these less informative antecedent candidates.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, rather than finding the most recent antecedent for an anaphor, our system tries to find the most direct and informative antecedent.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we focus on the task of determining coreference relations as defined in MUC6 (1995) and MUC7 (1998).",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to evaluate the performance of our approach on coreference resolution, we utilize the annotated corpus and the scoring programs from MUC6 and MUC7.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For MUC6, 30 dry-run documents annotated with coreference information are used as the training data.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are also 30 annotated training documents from MUC7.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The total size of 30 training documents is close 12,400 words for MUC6 and 19,000 for MUC7.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For testing, we utilize the 30 standard test documents from MUC 6 and the 20 standard test documents from MUC7.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The layout of this paper is as follows: in Section 2, we briefly describe the preprocessing: determination of referring expressions.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 3, we differentiate coreference types and discuss how to restrict possible types of direct and informative antecedent candidates according to anaphor types.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 4, we describe the constraint-based multi-agent system.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 5, we evaluate the multi-agent algorithm.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we present our conclusions.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "preprocessing: determination of. ",
            "number": "2",
            "sents": [
                {
                    "text": "Referring Expressions The prerequisite for automatic coreference resolution is to obtain possible referring expressions in an input document.",
                    "sid": 41,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our system, the possible referring expressions are determined by a pipeline of NLP components: • Tokenization and sentence segmentation • Named entity recognition • Part-of-speech tagging • Noun phrase chunking Among them, named entity recognition, part- of-speech tagging and noun phrase chunking apply the same Hidden Markov Model (HMM) based engine with error-driven learning capability (Zhou and Su 2000).",
                    "sid": 42,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The named entity recognition component (Zhou and Su 2002) recognizes various types of MUC-style named entities, that is, organization, location, person, date, time, money and percentage.",
                    "sid": 43,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The HMM-based noun phrase chunking component (Zhou and Su 2000) determines various noun phrases based on the results of named entity recognition and part-of- speech tagging.",
                    "sid": 44,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "coreference types. ",
            "number": "3",
            "sents": [
                {
                    "text": "Since coreference is a symmetrical and transitive relation, it leads to a simple partitioning of a set of referring expressions and each partition forms a coreference chain.",
                    "sid": 45,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although any two referring expressions in the coreference chain is coreferential, some of conference pairs may be direct while others may be indirect since they only become conferential via other referring expressions in the same coreference chain.",
                    "sid": 46,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This indicates that the most recent antecedent of an anaphor in the coreferential chain is sometimes indirectly linked to the anaphor via some other antecedents in the chain.",
                    "sid": 47,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In these indirect cases, we find that the most recent antecedent always contains little information to directly determine the coreference relationship with the anaphor.",
                    "sid": 48,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generally, direct and informative coreference pairs are much easier to resolve than indirect and less informative ones.",
                    "sid": 49,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following example1, Microsoft Corp.",
                    "sid": 50,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(i) announced its (i) new CEO yesterday.",
                    "sid": 51,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Microsoft (i) said … 1 The italic markables with the same identification.",
                    "sid": 52,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "symbol are coreferential.",
                    "sid": 53,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“Microsoft Corp.”, “its” and “Microsoft” form a coreference chain.",
                    "sid": 54,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among the three coreference pairs in the chain, 1) The coreference pair between “Microsoft Corp.” and “Microsoft” is direct.",
                    "sid": 55,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2) The coreference pair between “Microsoft Corp.” and “its” is direct.",
                    "sid": 56,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3) The coreference pair between “its” and “Microsoft” is indirect.",
                    "sid": 57,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This coreference pair only becomes coreferential via another referring expression “Microsoft Corp.” Direct resolution of this coreference pair is error- prone and not necessary since it can be indirectly linked by the other two coreference pairs in the coreference chain.",
                    "sid": 58,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, for a given anaphor, we can always safely filter out these less informative antecedent candidates.",
                    "sid": 59,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, rather than finding the most recent antecedent for an anaphor, our system tries to find the most direct and informative antecedent.",
                    "sid": 60,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This also suggests that we can classify coreference types according to the types of anaphors and restrict the possible types of antecedent candidates for a given anaphor type as follows: • Name alias coreference This is the most widespread type of coreference which is realised by the name alias phenomenon.",
                    "sid": 61,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The success of name alias coreference resolution is largely conditional on success at determining when one referring expression is a name alias of another referring expression.",
                    "sid": 62,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, the direct antecedent candidate of a named entity anaphor can only be the type of named entity.",
                    "sid": 63,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Microsoft Corp.",
                    "sid": 64,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(i) announced its new CEO yesterday.",
                    "sid": 65,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Microsoft (i) said … • Apposition coreference This is the easiest type of coreference.",
                    "sid": 66,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A typical use of an appositional noun phrase is to provide an alternative description for a named entity.",
                    "sid": 67,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example Julius Caesar (i), the well-known emperor (i), was born in 100 BC.",
                    "sid": 68,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Predicate nominal coreference Predicate nominal is typically coreferential with the subject.",
                    "sid": 69,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, George W. Bush (i) is the president of the United States (i).",
                    "sid": 70,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Pronominal coreference This is the second widespread type of coreference which is realised by pronouns.",
                    "sid": 71,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pronominal coreference has been widely studied in literature of traditional anaphora resolution.",
                    "sid": 72,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The direct antecedent candidate of a pronoun anaphor can be any type of referring expressions.",
                    "sid": 73,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Computational linguistics (i) from different countries attended the tutorial.",
                    "sid": 74,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They (i) took extensive note.",
                    "sid": 75,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Definite noun phrase coreference This is the third widespread type of coreference which is realised by definite noun phrases.",
                    "sid": 76,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has also been widely studied in the literature of traditional anaphora resolution.",
                    "sid": 77,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A typical case of definite noun phrase coreference is when the antecedent is referred by a definite noun phrase anaphor representing either same concept (repetition) or semantically close concept (e.g. synonyms, super-ordinates).",
                    "sid": 78,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The direct antecedent candidate of a definite noun phrase anaphor can be any type of referring expressions except pronouns.",
                    "sid": 79,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Computational linguistics (i) from different countries attended the tutorial.",
                    "sid": 80,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The participants (i) took extensive note.",
                    "sid": 81,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Demonstrative noun phrase coreference This type of coreference is not widespread.",
                    "sid": 82,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar to that of definite noun phrase coreference, the direct antecedent candidate of a demonstrative noun phrase anaphor can be any type of referring expressions except pronouns.",
                    "sid": 83,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Boorda wants to limit the total number of sailors on the arsenal ship (i) to between 50 and 60.",
                    "sid": 84,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Currently, this ship (i) has about 90 sailors.",
                    "sid": 85,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Bare noun phrase coreference The direct antecedent candidate of a bare noun phrase anaphor can be any type of referring expressions except pronouns.",
                    "sid": 86,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, The price of aluminium (i) siding has steadily increased, as the market for aluminium (i) reacts to the strike in Chile.",
                    "sid": 87,
                    "ssid": 43,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "constraint-based multi-agent system. ",
            "number": "4",
            "sents": [
                {
                    "text": "for Coreference Resolution In accordance with the above differentiation of coreference types according to the anaphor types, a constraint-based multi-agent system is developed.",
                    "sid": 88,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Common Constraint Agent.",
                    "sid": 89,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For all coreference types described in Section 3, a common constraint agent is applied first using following constraints: Morphological agreements These constraints require that an anaphor and its antecedent candidate should agree in gender and number.",
                    "sid": 90,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These kinds of morphological agreements has been widely used in the literature of anaphora resolution Semantic consistency This constraint stipulates that the anaphor and its antecedent candidate must be consistent in semantics.",
                    "sid": 91,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the anaphor and its antecedent candidate should contain the same sense or the anaphor contains a sense which is parental to the antecedent candidate.",
                    "sid": 92,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, WordNet (Miller 1990) is used for semantic consistency check.",
                    "sid": 93,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, IBM (i) announced its new CEO yesterday.",
                    "sid": 94,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The company (i) said … 4.2 Special Constraint Agents.",
                    "sid": 95,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each coreference type described in Section 3, a special constraint agent is applied next using some heuristic rules mainly based on the accessibility space, which is learnt from the training data as follows: For a given coreference type and a given valid antecedent type, all the anaphors of the given coreference type are identified first from left to right as they appear in the sentences.",
                    "sid": 96,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each anaphor, its antecedent is then determined using the principle of proximity.",
                    "sid": 97,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the most recent antecedent candidate has the given antecedent type, meet the morphological agreements and semantic consistency and is in the same coreference chain as the anaphor, this coreference pair is counted as a correct instance for the given conference type and the given antecedent type.",
                    "sid": 98,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise, it is counted as an error instance.",
                    "sid": 99,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, the precision rates of the coreference type over different valid antecedent types and different accessibility spaces are computed as the percentage of the correct instances among all the correct and error instances.",
                    "sid": 100,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the accessibility space for a given coreference type and a given antecedent type is decided using a precision rate threshold (e.g. 95%).",
                    "sid": 101,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Agent for name alias coreference A named entity is co-referred with another named entity when the formal is a name alias of the latter.",
                    "sid": 102,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This type of coreference has an accessibility space of the whole document.",
                    "sid": 103,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, it is tackled by a named entity recognition component, as in Zhou and Su (2002), using the following name alias algorithm in the ascending order of complexity: 1) The simplest case is to recognize full identity of strings.",
                    "sid": 104,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This applies to all types of entity names.",
                    "sid": 105,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2) The next simplest case is to recognize the various forms of location names.",
                    "sid": 106,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normally, various acronyms are applied, e.g. “NY” vs. “New York” and “N.Y.” vs. “New York”.",
                    "sid": 107,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sometime, partial mention is also applied, e.g. “Washington” vs. “Washington D.C.”.",
                    "sid": 108,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3) The third case is to recognize the various forms of personal proper names.",
                    "sid": 109,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus an article on Microsoft may include “Bill Gates”, “Bill” and “Mr.",
                    "sid": 110,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gates”.",
                    "sid": 111,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normally, the full personal name is mentioned first in a document and later mention of the same person is replaced by various short forms such as acronym, the last name and, to a less extent, the first name, of the full person name.",
                    "sid": 112,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4) The most difficult case is to recognize the various forms of organizational names.",
                    "sid": 113,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For various forms of company names, consider a) “International Business Machines Corp.”, “International Business Machines” and “IBM”; b) “Atlantic Richfield Company” and “ARCO”.",
                    "sid": 114,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normally, various abbreviation forms (e.g. contractions and acronym) and dropping of company suffix are applied.",
                    "sid": 115,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For various forms of other organizational names, consider a) “National University of Singapore”, “National Univ. of Singapore” and “NUS”; b) “Ministry of Education” and “MOE”.",
                    "sid": 116,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normally, acronyms and abbreviations are applied.",
                    "sid": 117,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Agent for apposition coreference If the anaphor is in apposition to the antecedent candidate, they are coreferential.",
                    "sid": 118,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The MUC6 and MUC7 coreference task definitions are slightly different.",
                    "sid": 119,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In MUC6, the appositive should be a definite noun phrase while both indefinite and definite noun phrases are acceptable in MUC7.",
                    "sid": 120,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Agent for predicate nominal coreference If the anaphor is the predicate nominal and the antecedent candidate is the subject, they are coreferential.",
                    "sid": 121,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This agent is still under construction.",
                    "sid": 122,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Agent for pronominal coreference This agent is applied to the most widely studied coreference: pronominal coreference.",
                    "sid": 123,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 heuristic rules are learnt and applied depending on the accessibility space and the types of the antecedent candidates: 1) If the anaphor is a person pronoun and the antecedent candidate is a person named entity, they are coreferential over the whole document.",
                    "sid": 124,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2) If the anaphor is a neuter pronoun and the antecedent candidate is an organization named entity, they are coreferential when they are in the same sentence.",
                    "sid": 125,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3) If the anaphor is a neuter plural pronoun and the antecedent candidate is a plural noun phrase, they are coreferential over the whole document.",
                    "sid": 126,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4) If both the anaphor and the antecedent candidate are third person pronouns, they are coreferential over the whole document.",
                    "sid": 127,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5) If both the anaphor and the antecedent candidate are first or second person pronouns, they are coreferential when they are in the same paragraph.",
                    "sid": 128,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6) If both the anaphor and the antecedent candidate are neuter pronouns, they are coreferential when they are in the same paragraph or the antecedent candidate is in the previous paragraph of the anaphor.",
                    "sid": 129,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Agent for definite noun phrase coreference The agent for definite noun phrase coreference is mainly based on the accessibility space.",
                    "sid": 130,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This agent is based on the following 3 heuristic rules: 1) The definite noun phrase will be coreferential with a named entity if they are in same paragraph or the entity name is in the previous paragraph of the definite noun phrase.",
                    "sid": 131,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2) The definite noun phrase will be coreferential with a named entity if the head word of the definite noun phrase is only modified by the determiner “the”.",
                    "sid": 132,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, the definite noun phrase is of type “the HEADWORD”, e.g. “the company”.",
                    "sid": 133,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3) The definite noun phrase will be coreferential with a definite/demonstrative/indefinite noun phrase if they string-match2.",
                    "sid": 134,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "coreference is similar to the agent for definite noun phrase coreference except that the anaphor is a demonstrative noun phrase.",
                    "sid": 135,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Agent for base noun phrase coreference This is the most complicated and confusing coreference in MUC coreference task definitions.",
                    "sid": 136,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although this type of coreference occupies a large portion, it is hard to find heuristic rules to deal with it.",
                    "sid": 137,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our system, only one heuristic rule is applied: If the anaphor and the antecedent candidate string-match and include at least two words except the determiner, they are coreferential over the whole document.",
                    "sid": 138,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 The determiners, e.g. “a”, “an” and “the”, are removed.",
                    "sid": 139,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "from the strings before comparison.",
                    "sid": 140,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, “the company” string-matches “a company”.",
                    "sid": 141,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Common Preference Agent.",
                    "sid": 142,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a given anaphor, invalid antecedents are first filtered out using the above common constraint agent and the special constraint agent.",
                    "sid": 143,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, the strategy has to choose which of the remaining candidates, if any, is the most likely antecedent candidate.",
                    "sid": 144,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our strategy, this is done through a common preference agent based on the principle of proximity.",
                    "sid": 145,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, our common preference agent takes advantages of the relative locations of the remaining antecedent candidates in the text.",
                    "sid": 146,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among the antecedent candidates: 1) First it looks for those occurring earlier in the current sentence, preferring the one that occurs earliest in the natural left-to-right order.",
                    "sid": 147,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2) If there are no antecedent candidates occurring earlier in the current sentence, look to those occurring in the immediately preceding sentence of the same paragraph, again preferring the one that occurs earliest in that sentence in left-to-right order.",
                    "sid": 148,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3) If nothing comes up, look back at those occurring in the earlier sentences of the same paragraph, moving back a sentence at a time, but now, within a given sentence preferring the most rightward candidate that occurs later in the sentence.",
                    "sid": 149,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4) Finally, if the scope extends back beyond a paragraph boundary, it looks to those that occur in the sentences of the preceding paragraph, again preferring later to earlier occurrences.",
                    "sid": 150,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.4 Multi-Agent Algorithm.",
                    "sid": 151,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The coreference resolution algorithm is implemented based on the previous multi-agents.",
                    "sid": 152,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, all the anaphors are identified from left to right as they appear in the sentences.",
                    "sid": 153,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, for a given anaphor, 1) All the referring expressions occurred before the anaphor are identified as antecedent candidates.",
                    "sid": 154,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2) The common constraint agent is applied to filter out the invalid antecedent candidates using various general constraints, such as morphological agreements and semantic consistency constraints.",
                    "sid": 155,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3) The corresponding special constraint agent (if exists) is recalled to first filter out indirect and less informative antecedent candidates and then check the validity of the remaining antecedent candidates by using some heuristic rules.",
                    "sid": 156,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, more invalid antecedent candidates are discarded using various special constraints, such as the accessibility space.",
                    "sid": 157,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4) The antecedent is chosen from the remaining antecedent candidates, if any, using the principle of proximity.",
                    "sid": 158,
                    "ssid": 71,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimentation. ",
            "number": "5",
            "sents": [
                {
                    "text": "Table 1 shows the performance of our constraint- based multi-agent system on MUC6 and MUC7 standard test data using the standard MUC file over the total number of coreference pairs in the answer file and the recall (R) measures the number of correct coreference pairs in the answer file over the total number of coreference pairs in the key file while F-measure is the weighted harmonic mean of precision and recall: 2 evaluation programs while Table 2 gives the F = (β + 1)RP with β 2 =1.",
                    "sid": 159,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "comparisons of our system with others using the same MUC test data and the same MUC evaluation programs.",
                    "sid": 160,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, the precision (P) measures the β 2 R + P Table 1: Results of our baseline multi-agent coreference resolution system on MUC6 and MUC7 P e r f o r m a n c e M U C 6 M U C 7 R P F R P F O ve ral l 6 5 . 8 84 .7 73 .9 5 5 . 7 82 .8 6 6.",
                    "sid": 161,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 • A ge nt for na m e ali as co ref er en ce 3 2.",
                    "sid": 162,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 (3 5) 92 .3 3 3.",
                    "sid": 163,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 (3 6) 89 .0 • A ge nt for ap po sit io n co ref er en ce 4 . 3 ( 5 ) 95 .5 2 . 6 ( 3 ) 84 .6 • A ge nt for pr ed ica te no mi na l co ref er en ce 3 ( 2 ) ( 3 ) • A ge nt for pr on o mi na l co ref er en ce 1 8.",
                    "sid": 164,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 (2 2) 77 .5 1 0.",
                    "sid": 165,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 (1 6) 72 .3 • A ge nt for de fin ite no un ph ras e co ref er en ce 9 . 4 ( 1 5 ) 80 .0 7 . 0 ( 2 0 ) 85 .0 • A ge nt for de m on str ati ve no un ph ras e co ref er en ce 0 . 1 ( 2 ) 50 .0 0 . 2 ( 2 ) 66 .7 • A ge nt for ba re no un ph ras e co ref er en ce 1 . 9 ( 1 9 ) 63 .0 1 . 7 ( 2 0 ) 61 .1 Table 2: Comparison of our system with the best-reported systems on MUC6 and MUC7 P e r f o r m a n c e C o m p a r i s o n M U C 6 M U C 7 R P F R P F O ur s 6 5 . 8 8 4.",
                    "sid": 166,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 7 3 . 9 5 5 . 7 8 2 . 8 6 6 . 5 N g an d Ca rdi e 20 02 (C 4.",
                    "sid": 167,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5) 6 4 . 1 7 4.",
                    "sid": 168,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 6 9 . 1 5 7 . 4 7 0 . 8 6 3 . 4 N g an d Ca rdi e 20 02 (R IP PE R) 6 4 . 2 7 8.",
                    "sid": 169,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 7 0 . 4 5 5 . 7 7 2 . 8 6 3 . 1 Table 1 shows that our system achieves F- measures of 73.9 and 66.5 on MUC6 and MUC7 standard test data, respectively.",
                    "sid": 170,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The figures outside the parentheses show the contributions of various agents to the overall recall while the figures inside the parentheses show the frequency distribution of various coreference types in the answer file.",
                    "sid": 171,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that the performance difference between MUC6 and MUC7 mainly comes from the significant distribution variation of pronominal coreference.",
                    "sid": 172,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also shows that there are much room for improvement, especially for the types of pronominal coreference and definite noun pronoun resolution.",
                    "sid": 173,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows that our system achieves significantly better F-measures by 3.1~4.8 percent over the best-reported systems (Ng and Cardie 2002).",
                    "sid": 174,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of the contributions come form precision gains.",
                    "sid": 175,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our system achieves significantly better precision rates by 6.7~10.0 percent over the best-reported systems (Ng and Cardie 2002) while keeping recall rates.",
                    "sid": 176,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One reason behind such high performance is the restriction of indirect and less informative antecedent candidates according to the type of the anaphor.",
                    "sid": 177,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another reason is differentiation of various types of coreference and the use of multi agents.",
                    "sid": 178,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, various types of coreference are dealt with effectively by different agents according to their characteristics.",
                    "sid": 179,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The recall difference between our system and the RIPPER system in (Ng and Cardie 2002) maybe come from the predicate nominal coreference, which can be easily resolved using a machine learning algorithm, e.g.",
                    "sid": 180,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Cohen 1995).",
                    "sid": 181,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Completion of the agent for predicate nominal coreference can easily fill the difference.",
                    "sid": 182,
                    "ssid": 24,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "6",
            "sents": [
                {
                    "text": "This paper presents a constraint-based multi-agent strategy to coreference resolution of general noun phrases in unrestricted English text.",
                    "sid": 183,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first contribution of this paper comes from the high performance of our system and its easy 3 The agent for predicate nominal coreference is still under construction..",
                    "sid": 184,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "filter out indirect and less informative antecedent candidates according to the anaphor type.",
                    "sid": 185,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third contribution is the differentiation of various coreference types according to the anaphor types and the use of multi-agents.",
                    "sid": 186,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Future work includes: • The exploration of new constraints to improve the precision and new coreference types to increase the recall.",
                    "sid": 187,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• The problem of type coercion or metonymy which is a general problem and accounts for much of the overall missing recall.",
                    "sid": 188,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• The problem of cataphora, which is not handled in the current mechanism.",
                    "sid": 189,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}