{
    "ID": "C04-1089",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Mining New Word Translations from Comparable Corpora",
                    "sid": 0,
                    "ssid": null,
                    "kind_of_tag": "s"
                },
                {
                    "text": "New words such as names, technical terms, etc appear frequently.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As such, the bilingual lexicon of a machine translation system has to be constantly updated with these new word translations.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparable corpora such as news documents of the same period from different news agencies are readily available.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we present a new approach to mining new word translations from comparable corpora, by using context information to complement transliteration information.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluated our approach on six months of Chinese and English Gigaword corpora, with encouraging results.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "New words such as person names, organization names, technical terms, etc. appear frequently.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order for a machine translation system to translate these new words correctly, its bilingual lexicon needs to be constantly updated with new word translations.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Much research has been done on using parallel corpora to learn bilingual lexicons (Melamed, 1997; Moore, 2003).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But parallel corpora are scarce resources, especially for uncommon lan guage pairs.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparable corpora refer to texts that are not direct translation but are about the same topic.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, various news agencies report major world events in different languages, and such news documents form a readily available source of comparable corpora.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Being more readily available, comparable corpora are thus more suitable than parallel corpora for the task of acquiring new word translations, although relatively less research has been done in the past on comparable corpora.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous research efforts on acquiring translations from comparable corpora include (Fung and Yee, 1998; Rapp, 1995; Rapp, 1999).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When translating a word w, two sources of information can be used to determine its translation: the word w itself and the surrounding words in the neighborhood (i.e., the context) of w. Most previous research only considers one of the two sources of information, but not both.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the work of (AlOnaizan and Knight, 2002a; AlOnaizan and Knight, 2002b; Knight and Graehl, 1998) used the pronunciation of w in translation.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, the work of (Cao and Li, 2002; Fung and Yee, 1998; Koehn and Knight, 2002; Rapp, 1995; Rapp, 1999) used the context of w to locate its translation in a second language.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we propose a new approach for the task of mining new word translations from comparable corpora, by combining both context and transliteration information.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since both sources of information are complementary, the accuracy of our combined approach is better than the accuracy of using just context or transliteration information alone.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We fully implemented our method and tested it on ChineseEnglish comparable corpora.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We translated Chinese words into English.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, Chinese is the source language and English is the target language.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We achieved encouraging results.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While we have only tested our method on Chinese-English comparable corpora, our method is general and applicable to other language pairs.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "our approach. ",
            "number": "2",
            "sents": [
                {
                    "text": "The work of (Fung and Yee, 1998; Rapp, 1995; Rapp, 1999) noted that if an English word e is the translation of a Chinese word c , then the contexts of the two words are similar.",
                    "sid": 24,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We could view this as a document retrieval problem.",
                    "sid": 25,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The context (i.e., the surrounding words) of c is viewed as a query.",
                    "sid": 26,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The context of each candidate translation e' is viewed as a document.",
                    "sid": 27,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the context of the correct translation e is similar to e , is considered as a document in IR.",
                    "sid": 28,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If an English word e is the translation of a Chinese word c , they will have similar contexts.",
                    "sid": 29,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So we use the the context of c , we are likely to retrieve the context of e when we use the context of c as query C(c) to retrieve a document C (e* ) that * the query and try to retrieve the most similar best matches the query.",
                    "sid": 30,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The English word e document.",
                    "sid": 31,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We employ the language modeling approach (Ng, 2000; Ponte and Croft, 1998) for corresponding to that document translation of c . C (e* ) is the this retrieval problem.",
                    "sid": 32,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More details are given in Section 3.",
                    "sid": 33,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, when we only look at the word w itself, we can rely on the pronunciation of w to locate its translation.",
                    "sid": 34,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use a variant of Within IR, there is a new approach to document retrieval called the language modeling approach (Ponte & Croft, 98).",
                    "sid": 35,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this approach, a language model is derived from each document D . Then the probability of generating the query the machine transliteration method proposed by Q according to that language model, P(Q | D) , (Knight and Graehl, 1998).",
                    "sid": 36,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More details are is estimated.",
                    "sid": 37,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The document with the highest given in Section 4.",
                    "sid": 38,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each of the two individual methods provides a P(Q | D) is the one that best matches the query.",
                    "sid": 39,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ranked list of candidate words, associating with each candidate a score estimated by the particular method.",
                    "sid": 40,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a word e in English is indeed the translation of a word c in Chinese, then we would expect e to be ranked very high in both lists in general.",
                    "sid": 41,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, our combination method is as follows: we examine the top M The language modeling approach to IR has been shown to give superior retrieval performance (Ponte & Croft, 98; Ng, 2000), compared with traditional vector space model, and we adopt this approach in our current work.",
                    "sid": 42,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To estimate P(Q | D) , we use the approach of (Ng, 2000).",
                    "sid": 43,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We view the document D as a multinomial distribution of terms and assume that words in both lists and finde1 , e2 ,..., ek that ap query Q is generated by this model: pear in top M positions in both lists.",
                    "sid": 44,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then n!",
                    "sid": 45,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "rank these words e1 , e2 ,..., ek according to the P (Q | D ) = ∏ P (t | D ) c t average of their rank positions in the two lists.",
                    "sid": 46,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "∏ t c t ! t The candidate ei that is ranked the highest according to the average rank is taken to be the cor where t is a term in the corpus, ct is the number rect translation and is output.",
                    "sid": 47,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If no words appear within the top M positions in both lists, then no translation is output.",
                    "sid": 48,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since we are using comparable corpora, it is possible that the translation of a new word does not exist in the target corpus.",
                    "sid": 49,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, our experiment was conducted on comparable corpora that are not very closely related and as such, most of the Chinese words have no translations of times term t occurs in the query Q , n = ∑t ct is the total number of terms in query Q . For ranking purpose, the first fraction n!",
                    "sid": 50,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "/ ∏t ct ! can be omitted as this part depends on the query only and thus is the same for all the documents.",
                    "sid": 51,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "in the English target corpus.",
                    "sid": 52,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our translation problem, C(c) is viewed as the query and C(e) is viewed as a document.",
                    "sid": 53,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So",
                    "sid": 54,
                    "ssid": 31,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "translation by context. ",
            "number": "3",
            "sents": [
                {
                    "text": "our task is to compute P(C (c) | C (e)) for each In a typical information retrieval (IR) problem, a query is given and a ranked list of documents English word e and find the e that gives the highest P(C (c) | C (e)) , estimated as: most relevant to the query is returned from a document collection.",
                    "sid": 55,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "∏ P(tc tc∈C ( c ) | T (C (e)))q (tc ) For our task, the query is C (c) , the context Term tc is a Chinese word.",
                    "sid": 56,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "q(tc ) is the number (i.e., the surrounding words) of a Chinese word c . Each C (e) , the context of an English word of occurrenc es of tc in C (c) . Tc (C (e)) is the bag of Chinese words obtained by translating the First, each Chinese character in a Chinese English words in C(e) , as determined by a bi word c is converted to pinyin form.",
                    "sid": 57,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we sum lingual dictionary.",
                    "sid": 58,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If an English word is ambiguous and has K translated Chinese words listed in the bilingual dictionary, then each of the K trans over all the alignments that this pinyin form of c can map to an English word e. For each possible alignment, we calculate the probability by taking lated Chinese words is counted as occurring 1/K times in Tc (C (e)) for the purpose of probability the product of each mapping.",
                    "sid": 59,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ble of pinyin, api is the ith sylla li is the English letter sequence estimation.",
                    "sid": 60,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use backoff and linear interpolation for probability estimation: P(tc | Tc (C (e))) = α ⋅ Pml (tc | Tc (C (e))) + (1 −α ) ⋅ Pml (tc ) that the ith pinyin syllable maps to in the particular alignment a. Since most Chinese characters have only one pronunciation and hence one pinyin form, we assume that Chinese character-to-pinyin mapping is one-to-one to simplify the problem.",
                    "sid": 61,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the Pml (tc | Tc (C (e))) = dT (C (e )) (tc ) ∑dT (C ( e )) (t ) expect ation maxi mizati on (EM) algorit hm to genera te mappi ng proba bilitie s from pinyin syl c t∈Tc (C ( e )) lables to English letter sequences.",
                    "sid": 62,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To reduce the search space, we limit the number of English letters that each pinyin syllable can map to as 0, where Pml (•) are the maximu m likelihood esti 1, or 2.",
                    "sid": 63,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also.",
                    "sid": 64,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "we do not allow cross mappin gs.",
                    "sid": 65,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "mates, dT (C ( e)) (tc ) is the number of occurre nces That is, if an English letter sequenc e e1 precede s of the term tc in Tc (C(e)) , andPml (tc ) is esti another English letter sequence e2 in an English mated similarly by counting the occurrences of word, then the pinyin syllable mapped to e1 tc in the Chinese translation of the whole English corpus.",
                    "sid": 66,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "α is set to 0.6 in our experiments.",
                    "sid": 67,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "translation by transliteration. ",
            "number": "4",
            "sents": [
                {
                    "text": "must precede the pinyin syllable mapped to e2 . Our method differs from (Knight and Graehl, 1998) and (AlOnaizan and Knight, 2002b) in that our method does not generate candidates but For the transliteration model, we use a modified only estimatesP(e | c) for candidates e appearmodel of (Knight and Graehl, 1998) and (Al ing in the English corpus.",
                    "sid": 68,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another difference is Onaizan and Knight, 2002b).",
                    "sid": 69,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Knight and Graehl (1998) proposed a probabilistic model for machine transliteration.",
                    "sid": 70,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this model, a word in the target language (i.e., English in our task) is written and pronounced.",
                    "sid": 71,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This pronunciation is converted to source language pronunciation and then to source language word that our method estimates stead of P(c | e) and P(e) .",
                    "sid": 72,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiment. ",
            "number": "5",
            "sents": [
                {
                    "text": "5.1 Resources.",
                    "sid": 73,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P(e | c)directly, in (i.e., Chinese in our task).",
                    "sid": 74,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "AlOnaizan and Knight (2002b) suggested that pronunciation can be skipped and the target language letters can be mapped directly to source language letters.",
                    "sid": 75,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pinyin is the standard Romanization system of Chinese characters.",
                    "sid": 76,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is phonetic-based.",
                    "sid": 77,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For transliteration, we estimate P(e | c) as follows: P(e | c) = P(e | pinyin) = ∑ P(e, a | pinyin) a For the Chinese corpus, we used the Linguistic Data Consortium (LDC) Chinese Gigaword Corpus from Jan 1995 to Dec 1995.",
                    "sid": 78,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus of the period Jul to Dec 1995 was used to come up with new Chinese words c for translation into English.",
                    "sid": 79,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus of the period Jan to Jun 1995 was just used to determine if a Chinese word c from Jul to Dec 1995 was new, i.e., not occurring from Jan to Jun 1995.",
                    "sid": 80,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chinese Giga- word corpus consists of news from two agencies: = ∑∏ P(l a a i | pi ) Xinhua News Agency and Central News Agency.",
                    "sid": 81,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As for English corpus, we used the LDC English Gigaword Corpus from Jul to Dec 1995.",
                    "sid": 82,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The English Gigaword corpus consists of news from four newswire services: Agence France Press English Service, Associated Press Worldstream English Service, New York Times Newswire Service, and Xinhua News Agency English Service.",
                    "sid": 83,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To avoid accidentally using parallel texts, we did not use the texts of Xinhua News Agency them English translation candidate words.",
                    "sid": 84,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a Chinese source word occurring within a half- month period p, we looked for its English translation candidate words occurring in news documents in the same period p. 5.3 Translation candidates.",
                    "sid": 85,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "English Service.",
                    "sid": 86,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The size of the English corpus from Jul to Dec The context C(c)of a Chinese word c was col 1995 was about 730M bytes, and the size of the Chinese corpus from Jul to Dec 1995 was about 120M bytes.",
                    "sid": 87,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used a ChineseEnglish dictionary which contained about 10,000 entries for translating the words in the context.",
                    "sid": 88,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the training of transliteration probability, we required a ChineseEnglish name list.",
                    "sid": 89,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used a list of 1,580 ChineseEnglish name pairs as training data for the EM algorithm.",
                    "sid": 90,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "lected as follows: For each occurrence of c, we set a window of size 50 characters centered at c. We discarded all the Chinese words in the context that were not in the dictionary we used.",
                    "sid": 91,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The contexts of all occurrences of a word c were then concatenated together to form C(c) . The context of an English translation candidate word e, C (e) , was similarly collected.",
                    "sid": 92,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The window size of English context was 100 words.After all the counts were collected, we esti mated P(C (c) | C (e)) as described in Section 3, 5.2 Preprocessing.",
                    "sid": 93,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike English, Chinese text is composed of Chinese characters with no demarcation for words.",
                    "sid": 94,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So we first segmented Chinese text with a Chinese word segmenter that was based on maximum entropy modeling (Ng and Low, 2004).",
                    "sid": 95,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "for each pair of Chinese source word and English translation candidate word.",
                    "sid": 96,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each Chinese source word, we ranked all its English translation candidate words according to the estimated P(C (c) | C (e)) . For each Chinese source word c and an English translation candidate word e , we also calcu We then divided the Chinese corpus from Jul to Dec 1995 into 12 periods, each containing text lated the probability P(e | c) (as described in from a half-month period.",
                    "sid": 97,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we determined the new Chinese words in each half-month period p. By new Chinese words, we refer to those words that appeared in this period p but not from Jan to Jun 1995 or any other periods that preceded p. Among all these new words, we selected those occurring at least 5 times.",
                    "sid": 98,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These words made up our test set.",
                    "sid": 99,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We call these words Chinese source words.",
                    "sid": 100,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They were the words that we were supposed to find translations from the English corpus.",
                    "sid": 101,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the English corpus, we performed sentence segmentation and converted each word to its morphological root form and to lower case.",
                    "sid": 102,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also divided the English corpus into 12 periods, each containing text from a half-month period.",
                    "sid": 103,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each period, we selected those English words occurring at least 10 times and were not present in the 10,000-word ChineseEnglish dictionary we used and were not stop words.",
                    "sid": 104,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We considered these English words as potential translations of the Chinese source words.",
                    "sid": 105,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We call Section 4), which was used to rank the English candidate words based on transliteration.",
                    "sid": 106,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the English candidate word with the smallest average rank position and that appears within the top M positions of both ranked lists is the chosen English translation (as described in Section 2).",
                    "sid": 107,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If no words appear within the top M positions in both ranked lists, then no translation is output.",
                    "sid": 108,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that for many Chinese words, only one English word e appeared within the top M positions for both lists.",
                    "sid": 109,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And among those cases where more than one English words appeared within the top M positions for both lists, many were multiple translations of a Chinese word.",
                    "sid": 110,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This happened for example when a Chinese word was a non-English person name.",
                    "sid": 111,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The name could have multiple translations in English.",
                    "sid": 112,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, 米 洛西娜 was a Russian name.",
                    "sid": 113,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mirochina and Miroshina both appeared in top 10 positions of both lists.",
                    "sid": 114,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both were correct.",
                    "sid": 115,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.4 Evaluation.",
                    "sid": 116,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluated our method on each of the 12 half- month periods.",
                    "sid": 117,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results when we set M = 10 are shown in Table 1.",
                    "sid": 118,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also investigated the effect of varying M . The results are shown in Table 2.",
                    "sid": 119,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1.",
                    "sid": 120,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accuracy of our system in each period (M = 10) In Table 1, period 1 is Jul 01 – Jul 15, period 2 is Jul 16 – Jul 31, …, period 12 is Dec 16 – Dec 31.",
                    "sid": 121,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "#c is the total number of new Chinese source words in the period.",
                    "sid": 122,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "#e is the total number of English translation candidates in the period.",
                    "sid": 123,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "#o is the total number of output English translations.",
                    "sid": 124,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "#Cor is the number of correct English translations output.",
                    "sid": 125,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prec.",
                    "sid": 126,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is the precision.",
                    "sid": 127,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The correctness of the English translations was manually checked.",
                    "sid": 128,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recall is somewhat difficult to estimate because we do not know whether the English translation of a Chinese word appears in the English part of the corpus.",
                    "sid": 129,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We attempted to estimate recall by manually finding the English translations for all the Chinese source words for the two periods Dec 01 – Dec 15 and Dec 16 – Dec 31 in the English part of the corpus.",
                    "sid": 130,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During the whole December period, we only managed to find English translations which were present in the English side of the comparable corpora for 43 Chinese words.",
                    "sid": 131,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So we estimate that English translations are present in the English part of the corpus for Table 2.",
                    "sid": 132,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Precision and recall for different values of M The past research of (Fung and Yee, 1998; Rapp, 1995; Rapp, 1999) utilized context information alone and was evaluated on different corpora from ours, so it is difficult to directly compare our current results with theirs.",
                    "sid": 133,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, AlOnaizan and Knight (2002a; 2002b) only made use of transliteration information alone and so was not directly comparable.",
                    "sid": 134,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To investigate the effect of the two individual sources of information (context and transliteration), we checked how many translations could be found using only one source of information (i.e., context alone or transliteration alone), on those Chinese words that have translations in the English part of the comparable corpus.",
                    "sid": 135,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As mentioned earlier, for the month of Dec 1995, there are altogether 43 Chinese words that have their translations in the English part of the corpus.",
                    "sid": 136,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This list of 43 words is shown in Table 3.",
                    "sid": 137,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 of the 43 words are translated to English multi-word phrases (denoted as “phrase” in Table 3).",
                    "sid": 138,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since our method currently only considers unigram English words, we are not able to find translations for these words.",
                    "sid": 139,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But it is not difficult to extend our method to handle this problem.",
                    "sid": 140,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can first use a named entity recognizer and noun phrase chunker to extract English names and noun phrases.",
                    "sid": 141,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translations of 6 of the 43 words are words in the dictionary (denoted as “comm.” in Table 3) and 4 of the 43 words appear less than 10 times in the English part of the corpus (denoted as “insuff”).",
                    "sid": 142,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our method is not able to find 43 (329 + 205) × 4499 = 362words in all 12 pe these translations.",
                    "sid": 143,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But this is due to search space riods.",
                    "sid": 144,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And our program finds correct translations for 115 words.",
                    "sid": 145,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So we estimate that recall (for M = 10) is approximately 115 / 362 = 31.8% . pruning.",
                    "sid": 146,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we are willing to spend more time on searching, then in principle we can find these translations.",
                    "sid": 147,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3.",
                    "sid": 148,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rank of correct translation for period Dec 01 – Dec 15 and Dec 16 – Dec 31.",
                    "sid": 149,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘Cont.",
                    "sid": 150,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "rank’ is the context rank, ‘Trans.",
                    "sid": 151,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rank’ is the transliteration rank.",
                    "sid": 152,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘NA’ means the word cannot be transliterated.",
                    "sid": 153,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘insuff’ means the correct translation appears less than 10 times in the English part of the comparable corpus.",
                    "sid": 154,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘comm’ means the correct translation is a word appearing in the dictionary we used or is a stop word.",
                    "sid": 155,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘phrase’ means the correct translation contains multiple English words.",
                    "sid": 156,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Table 3, using just context information alone, 10 Chinese words (the first 10) have their correct English translations at rank one position.",
                    "sid": 157,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And using just transliteration information alone, 9 Chinese words have their correct English translations at rank one position.",
                    "sid": 158,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, using our method of combining both sources of information and setting M = ∞, 19 Chinese words (i.e., the first 22 Chinese words in Table 3 except 巴佐亚,坩埚,普利法) have their correct English translations at rank one position.",
                    "sid": 159,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If M = 10, 15 Chinese words (i.e., the first 19 Chinese words in Table 3 except 叶玛斯,巴佐亚,坩埚,普利法) have their correct English translations at rank one position.",
                    "sid": 160,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, our method of using both sources of information outperforms using either information source alone.",
                    "sid": 161,
                    "ssid": 89,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "6",
            "sents": [
                {
                    "text": "As pointed out earlier, most previous research only considers either transliteration or context information in determining the translation of a source language word w, but not both sources of information.",
                    "sid": 162,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the work of (AlOnaizan and Knight, 2002a; AlOnaizan and Knight, 2002b; Knight and Graehl, 1998) used only the pronunciation or spelling of w in translation.",
                    "sid": 163,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, the work of (Cao and Li, 2002; Fung and Yee, 1998; Rapp, 1995; Rapp, 1999) used only the context of w to locate its translation in a second language.",
                    "sid": 164,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, our current work attempts to combine both complementary sources of information, yielding higher accuracy than using either source of information alone.",
                    "sid": 165,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Koehn and Knight (2002) attempted to combine multiple clues, including similar context and spelling.",
                    "sid": 166,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But their similar spelling clue uses the longest common subsequence ratio and works only for cognates (words with a very similar spelling).",
                    "sid": 167,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The work that is most similar to ours is the recent research of (Huang et al., 2004).",
                    "sid": 168,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They attempted to improve named entity translation by combining phonetic and semantic information.",
                    "sid": 169,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their contextual semantic similarity model is different from our language modeling approach to measuring context similarity.",
                    "sid": 170,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also made use of part-of-speech tag information, whereas our method is simpler and does not require part-of- speech tagging.",
                    "sid": 171,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They combined the two sources of information by weighting the two individual scores, whereas we made use of the average rank for combination.",
                    "sid": 172,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "7",
            "sents": [
                {
                    "text": "In this paper, we proposed a new method to mine new word translations from comparable corpora, by combining context and transliteration information, which are complementary sources of information.",
                    "sid": 173,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluated our approach on six months of Chinese and English Gigaword corpora, with encouraging results.",
                    "sid": 174,
                    "ssid": 2,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "We thank Jia Li for implementing the EM algorithm to train transliteration probabilities.",
                    "sid": 175,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This research is partially supported by a research grant R252000-125112 from National University of Singapore Academic Research Fund.",
                    "sid": 176,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}