{
    "ID": "C08-1062",
    "sections": [
        {
            "text": "sa performs positive reinforcement on its own internally;. ",
            "number": "1",
            "sents": [
                {
                    "text": "3.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SB performs negative reinforcement on SA externally;.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SB performs positive reinforcement on its own internally..",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Positive reinforcement captures the intuition that a sentence is more important if it associates to the other important sentences in the same collection.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Negative reinforcement, on the other hand, reflects the fact that a sentence is less A B + + - - 492 important if it associates to the important sentences in the other collection, since such a sentence might repeat the same or very similar information which is supposed to be included in the summary generated for the other collection.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let RA and RB denote the ranking of the sentences in A and B, the reinforcement can be formally described as ??",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "·+··+··= ·+··+··=+ + Bk BBBk ABAk B Ak BABk AAAk A pRMRMR pRMRMRr r 2)( 2)( 2)1( 1)( 1)( 1)1( ?aß?ßa (1) where the four matrices MAA, MBB, MAB and MBA are the affinity matrices of the sentences in SA, in SB, from SA to SB and from SB to SA.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "?= 22 11 aßßa W is a weight matrix to balance the reinforcement among different sentences.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice that 0, 21 <ßß such that they perform negative reinforcement.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ap r and Bp r are two bias vectors, with 1,0 21 << ??",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "as the damping factors.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[ ]1 1× =n A npr , where n is the order of MAA.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bp r is defined in the same way.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will further define the affinity matrices in section 3.2 later.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the above reinforcement ranking equation, it is also true that 1.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A sentence in SB correlates to many new sentences in SB is supposed to receive a high ranking from RB, and 2.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A sentence in SB correlates to many old sentences in SA is supposed to receive a low ranking from RB.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let [ ]TBA RRR = and [ ]TBA ppp rrr ··= 21 ??",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", then the above iterative equation (1) corresponds to the linear system, ( ) pRMI r=·- (2) where, ??",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "?= BBBA ABAA MMMM M22 11 aßßa . Up to now, the PNR2 is still query-independent.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That means only the content of the sentences is considered.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, for the tasks of query-oriented summarization, the reinforcement should obviously bias to the user’s query.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, we integrate query information into PNR2 by defining the vector pr as ( )qsrelp ii |=r , where ( )qsrel i | denotes the relevance of the sentence si to the query q. To guarantee the solution of the linear system Equation (2), we make the following two transformations on M. First M is normalized by columns.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If all the elements in a column are zero, we replace zero elements with n1 (n is the total number of the elements in that column).",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, M is multiplied by a decay factor ?",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "( 10 <<?",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "), such that each element in M is scaled down but the meaning of M will not be changed.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, Equation (2) is rewritten as, ( ) pRMI r=··- ?",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) The matrix ( )MI ·-?",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is a strictly diagonally dominant matrix now, and the solution of the linear system Equation (3) exists.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Sentence Ranking based on PNR2 We use the above mentioned PNR2 framework to rank the sentences in both SA and SB simultaneously.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3.2 defines the affinity matrices and presents the ranking algorithm.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The affinity (i.e. similarity) between two sentences is measured by the cosine similarity of the corresponding two word vectors, i.e. [ ] ( )ji sssimjiM ,, = (4) where ( ) ji jiji ss sssssim rr rr · •=, . However, when.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "calculating the affinity matrices MAA and MBB, the similarity of a sentence to itself is defined as 0, i.e. [ ] ( )???",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "= ?= ji jisssimjiM ji 0 , , (5) Furthermore, the relevance of a sentence to the query q is defined as ( )qs qsqsrel i ii rr rr * •=, (6) Algorithm 1.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "RankSentence(SA, SB, q) Input: The old sentence set SA, the new sentence set SB, and the query q. Output: The ranking vectors R of SA and SB.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1: Construct the affinity matrices, and set the weight matrix W; 2: Construct the matrix ( )MIA ·-= ? .",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3: Choose (randomly) the initial non-negative vectors TR ]11[)0( L= ; 4: 0?k , 0??",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "; 5: Repeat 6: ( )?",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "?< >++ --= ij ij kjijkjiji ij ki RaRap aR )()1()1( 1 r ; 7: ( ))()1(max kk RR -??",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "+ ; 8: )1( +kR is normalized such that the maximal element in )1( +kR is 1.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "493 9: 1+?",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "kk ; 10: Until ?<?",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1; 11: )(kRR ? ; 12: Return.",
                    "sid": 45,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now, we are ready to adopt the GaussSeidel method to solve the linear system Equation (3), and an iterative algorithm is developed to rank the sentences in SA and SB.",
                    "sid": 46,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After sentence ranking, the sentences in SB with higher ranking will be considered to be included in the final summary.",
                    "sid": 47,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Sentence Selection by Removing Redundancy.",
                    "sid": 48,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When multiple documents are summarized, the problem of information redundancy is more severe than it is in single document summarization.",
                    "sid": 49,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Redundancy removal is a must.",
                    "sid": 50,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since our focus is designing effective sentence ranking approach, we apply the following simple sentence selection algorithm.",
                    "sid": 51,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Algorithm 2.",
                    "sid": 52,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "GenerateSummary(S, length) Input: sentence collection S (ranked in descending order of significance) and length (the given summary length limitation) Output: The generated summary ? {}??",
                    "sid": 53,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "; ?l length; For i ? 0 to |S| do threshold ?",
                    "sid": 54,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "( )( )??ssssim i ,max ; If threshold <= 0.92 do isU???",
                    "sid": 55,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "; ll ? - ( )islen ; If ( l <= 0) break; End End Return ? .",
                    "sid": 56,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 Experimental Studies 4.1 Data Set and Evaluation Metrics The experiments are set up on the DUC 2007 update pilot task data set.",
                    "sid": 57,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each collection of documents is accompanied with a query description representing a user’s information need.",
                    "sid": 58,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We simply focus on generating a summary for the document collection “B” given that the.",
                    "sid": 59,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 ? is a predefined small real number as the convergence threshold.",
                    "sid": 60,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 In fact, this is a tunable parameter in the algorithm.",
                    "sid": 61,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the value of 0.9 by our intuition.",
                    "sid": 62,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "user has read the document collection “A”, which is a typical update summarization task.",
                    "sid": 63,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 below shows the basic statistics of the DUC 2007 update data set.",
                    "sid": 64,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Stop-words in both documents and queries are removed 3 and the remaining words are stemmed by Porter Stemmer 4 . According to the task definition, system-generated summaries are strictly limited to 100 English words in length.",
                    "sid": 65,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We incrementally add into a summary the highest ranked sentence of concern if it doesn’t significantly repeat the information already included in the summary until the word limitation is reached.",
                    "sid": 66,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A B Average number of documents 10 10 Average number of sentences 237.6 177.3 Table 1.",
                    "sid": 67,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basic Statistics of DUC2007 Update Data Set As for the evaluation metric, it is difficult to come up with a universally accepted method that can measure the quality of machine-generated summaries accurately and effectively.",
                    "sid": 68,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many literatures have addressed different methods for automatic evaluations other than human judges.",
                    "sid": 69,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among them, ROUGE5 (Lin and Hovy, 2003) is supposed to produce the most reliable scores in correspondence with human evaluations.",
                    "sid": 70,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the fact that judgments by humans are time-consuming and labor-intensive, and more important, ROUGE has been officially adopted for the DUC evaluations since 2005, like the other researchers, we also choose it as the evaluation criteria.",
                    "sid": 71,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following experiments, the sentences and the queries are all represented as the vectors of words.",
                    "sid": 72,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relevance of a sentence to the query is calculated by cosine similarity.",
                    "sid": 73,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice that the word weights are normally measured by the document-level TF*IDF scheme in conventional vector space models.",
                    "sid": 74,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we believe that it is more reasonable to use the sentence-level inverse sentence frequency (ISF) rather than document-level IDF when dealing with sentence-level text processing.",
                    "sid": 75,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This has been verified in our early study.",
                    "sid": 76,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Comparison of Positive and Negative Reinforcement Ranking Strategy.",
                    "sid": 77,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The aim of the following experiments is to investigate the different reinforcement ranking strategies.",
                    "sid": 78,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Three algorithms (i.e. PR(B), 3 A list of 199 words is used to filter stop-words.",
                    "sid": 79,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 http://www.tartarus.org/~martin/PorterStemmer.",
                    "sid": 80,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 ROUGE version 1.5.5 is used..",
                    "sid": 81,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "494 PR(A+B), PR(A+B/A)) are implemented as reference.",
                    "sid": 82,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These algorithms are all based on the query-sensitive LexRank (OtterBacher et al., 2005).",
                    "sid": 83,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The differences are twofold: (1) the document collection(s) used to build the text graph are different; and (2) after ranking, the sentence selection strategies are different.",
                    "sid": 84,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, PR(B) only uses the sentences in “B” to build the graph, and the other two consider the sentences in both “A” and in “B”.",
                    "sid": 85,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only the sentences in “B” are considered to be selected in PR(B) and PR(A+B/A), but all the sentences in “A” and “B” have the same chance to be selected in PR(A+B).",
                    "sid": 86,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only the sentences from B are considered to be selected in the final summaries in PNR2 as well.",
                    "sid": 87,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following experiments, the damping factor is set to 0.85 in the first three algorithms as the same in PageRank.",
                    "sid": 88,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The weight matrix W is set to ??",
                    "sid": 89,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "15.05.01 in the proposed algorithm (i.e. PNR2) and 5.021 == ??",
                    "sid": 90,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have obtained reasonable good results with the decay factor ? between 0.3 and 0.8.",
                    "sid": 91,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So we set it to 0.5 in this paper.",
                    "sid": 92,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice that the three PageRank-like graph-based ranking algorithms can be viewed as only the positive reinforcement among the sentences is considered, while both positive and negative reinforcement are considered in PNR2 as mentioned before.",
                    "sid": 93,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 below shows the results of recall scores of ROUGE-1, ROUGE-2 and ROUGE-SU4 along with their 95% confidential internals within square brackets.",
                    "sid": 94,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ROUGE -1 ROUGE -2 ROUGE-SU4 PR(B) 0.3323 [0.3164,0.3501] 0.0814 [0.0670,0.0959] 0.1165 0.1053,0.1286] PR(A+B) 0.3059 [0.2841,0.3256] 0.0746 [0.0613,0.0893] 0.1064 [0.0938,0.1186] PR(A+B/A) 0.3376 [0.3186,0.3572] 0.0865 [0.0724,0.1007] 0.1222 [0.1104,0.1304] PNR2 0.3616 [0.3464,0.3756] 0.0895 [0.0810,0.0987] 0.1291 [0.1208,0.1384] Table 2.",
                    "sid": 95,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experiment Results We come to the following three conclusions.",
                    "sid": 96,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, it is not surprising that PR(B) and PR(A+B/A) outperform PR(A+B), because the update task obviously prefers the sentences from the new documents (i.e. “B”).",
                    "sid": 97,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, PR(A+B/A) outperforms PR(B) because the sentences in “A” can provide useful information in ranking the sentences in “B”, although we do not select the sentences ranked high in “A”.",
                    "sid": 98,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Third, PNR2 achieves the best performance.",
                    "sid": 99,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PNR2 is above PR(A+B/A) by 7.11% of ROUGE-1, 3.47% of ROUGE-2, and 5.65% of ROUGE-SU4.",
                    "sid": 100,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result confirms the idea and algorithm proposed in this work.",
                    "sid": 101,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Comparison with DUC 2007 Systems Twenty-four systems have been submitted to the DUC for evaluation in the 2007 update task.",
                    "sid": 102,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 compares our PNR2 with them.",
                    "sid": 103,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For reference, we present the following representative ROUGE results of (1) the best and worst participating system performance, and (2) the average ROUGE scores (i.e. AVG).",
                    "sid": 104,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can then easily locate the positions of the proposed models among them..",
                    "sid": 105,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PNR2 Mean Best / Worst ROUGE-1 0.3616 0.3262 0.3768/0.2621 ROUGE2 0.0895 0.0745 0.1117/0.0365 ROUGE-SU4 0.1291 0.1128 0.1430/0.0745 Table 3.",
                    "sid": 106,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "System Comparison 4.4 Discussion In this work, we use the sentences in the same sentence set for positive reinforcement and sentences in the different set for negative reinforcement.",
                    "sid": 107,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Precisely, the old sentences perform negative reinforcement over the new sentences while the new sentences perform positive reinforcement over each other.",
                    "sid": 108,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is reasonable although we may have a more comprehensive alternation.",
                    "sid": 109,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Old sentences may express old topics, but they may also express emerging new topics.",
                    "sid": 110,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, new sentences are supposed to express new topics, but they may also express the continuation of old topics.",
                    "sid": 111,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, it will be more comprehensive to classify the whole sentences (both new sentences and old sentences together) into two categories, i.e. old topics oriented sentences and new topic oriented sentences, and then to apply these two sentence sets in the PNR2 framework.",
                    "sid": 112,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This will be further studied in our future work..",
                    "sid": 113,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, in the update summarization task, the summary length is restricted to about 100 words.",
                    "sid": 114,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this situation, we find that sentence simplification is even more important in our investigations.",
                    "sid": 115,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will also work on this issue in our forthcoming studies.",
                    "sid": 116,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Conclusion In this paper, we propose a novel sentence ranking algorithm, namely PNR2, for update summarization.",
                    "sid": 117,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As our pilot study, we simply assume to receive two chronologically ordered document collections and evaluate the summaries.",
                    "sid": 118,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "495 generated for the collection given later.",
                    "sid": 119,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With PNR2, sentences from the new (i.e. late) document collection perform positive reinforcement among each other but they receive negative reinforcement from the sentences in the old (i.e. early) document collection.",
                    "sid": 120,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Positive and negative reinforcement are concerned simultaneously in the ranking process.",
                    "sid": 121,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, PNR2 favors the sentences biased to the sentences that are important in the new collection and meanwhile novel to the sentences in the old collection.",
                    "sid": 122,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a matter of fact, this positive and negative ranking scheme is general enough and can be used in many other situations, such as social network analysis etc.",
                    "sid": 123,
                    "ssid": 123,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}