{
    "ID": "C08-1088",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper proposes a new approach to dynamically determine the tree span for tree kernel-based semantic relation extraction.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It exploits constituent dependencies to keep the nodes and their head children along the path connecting the two entities, while removing the noisy information from the syntactic parse tree, eventually leading to a dynamic syntactic parse tree.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper also explores entity features and their combined features in a unified parse and semantic tree, which integrates both structured syntactic parse information and entity-related semantic information.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation on the ACE RDC 2004 corpus shows that our dynamic syntactic parse tree outperforms all previous tree spans, and the composite kernel combining this tree kernel with a linear state-of-the-art feature-based kernel, achieves the so far best performance.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Information extraction is one of the key tasks in natural language processing.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It attempts to identify relevant information from a large amount of natural language text documents.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of three sub- tasks defined by the ACE program1, this paper focuses exclusively on Relation Detection and Characterization (RDC) task, which detects and classifies semantic relationships between predefined types of entities in the ACE corpus.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For © 2008.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Licensed under the Creative Commons Attribution- Noncommercial-Share Alike 3.0 Unported license (http://creativecommons.org/licenses/by-nc-sa/3.0/).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some rights reserved.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 http://www.ldc.upenn.edu/Projects/ACE/ example, the sentence “Microsoft Corp. is based in Redmond, WA” conveys the relation “GPEAFF.Based” between “Microsoft Corp.” [ORG] and “Redmond” [GPE].",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to limited accuracy in state-of-the-art syntactic and semantic parsing, reliably extracting semantic relationships between named entities in natural language documents is still a difficult, unresolved problem.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the literature, feature-based methods have dominated the research in semantic relation extraction.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Featured-based methods achieve promising performance and competitive efficiency by transforming a relation example into a set of syntactic and semantic features, such as lexical knowledge, entity-related information, syntactic parse trees and deep semantic information.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, detailed research (Zhou et al., 2005) shows that it’s difficult to extract new effective features to further improve the extraction accuracy.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, researchers turn to kernel-based methods, which avoids the burden of feature engineering through computing the similarity of two discrete objects (e.g. parse trees) directly.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From prior work (Zelenko et al., 2003; Culotta and Sorensen, 2004; Bunescu and Mooney, 2005) to current research (Zhang et al., 2006; Zhou et al., 2007), kernel methods have been showing more and more potential in relation extraction.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The key problem for kernel methods on relation extraction is how to represent and capture the structured syntactic information inherent in relation instances.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While kernel methods using the dependency tree (Culotta and Sorensen, 2004) and the shortest dependency path (Bunescu andMooney, 2005) suffer from low recall perform ance, convolution tree kernels (Zhang et al., 2006; Zhou et al., 2007) over syntactic parse trees achieve comparable or even better performance than feature-based methods.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, there still exist two problems regarding currently widely used tree spans.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhang et al.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006) discover that the Shortest Path 697 Proceedings of the 22nd International Conference on Computational Linguistics (Coling 2008), pages 697–704 Manchester, August 2008 enclosed Tree (SPT) achieves the best performance.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhou et al.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) further extend it to Context-Sensitive Shortest Path-enclosed Tree (CS- SPT), which dynamically includes necessary predicate-linked path information.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One problem with both SPT and CS-SPT is that they may still contain unnecessary information.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other problem is that a considerable number of useful context-sensitive information is also missing from SPT/CS-SPT, although CS-SPT includes some contextual information relating to predicate- linked path.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper proposes a new approach to dynamically determine the tree span for relation extraction by exploiting constituent dependencies to remove the noisy information, as well as keep the necessary information in the parse tree.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our motivation is to integrate dependency information, which has been proven very useful to relation extraction, with the structured syntactic information to construct a concise and effective tree span specifically targeted for relation extraction.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, we also explore interesting combined entity features for relation extraction via a unified parse and semantic tree.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other sections in this paper are organized as follows.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous work is first reviewed in Section 2.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, Section 3 proposes a dynamic syntactic parse tree while the entity-related semantic tree is described in Section 4.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation on the ACE RDC corpus is given in Section 5.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we conclude our work in Section 6.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Due to space limitation, here we only review kernel-based methods used in relation extraction.",
                    "sid": 35,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For those interested in feature-based methods, please refer to Zhou et al.",
                    "sid": 36,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2005) for more details.",
                    "sid": 37,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zelenko et al.",
                    "sid": 38,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2003) described a kernel between shallow parse trees to extract semantic relations, where a relation instance is transformed into the least common sub-tree connecting the two entity nodes.",
                    "sid": 39,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The kernel matches the nodes of two corresponding sub-trees from roots to leaf nodes recursively layer by layer in a top- down manner.",
                    "sid": 40,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their method shows successful results on two simple extraction tasks.",
                    "sid": 41,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Culotta and Sorensen (2004) proposed a slightly generalized version of this kernel between dependency trees, in which a successful match of two relation instances requires the nodes to be at the same layer and in the identical path starting from the roots to the current nodes.",
                    "sid": 42,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These strong constraints make their kernel yield high precision but very low recall on the ACE RDC 2003 corpus.",
                    "sid": 43,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bunescu and Mooney (2005) develop a shortest path dependency tree kernel, which simply counts the number of common word classes at each node in the shortest paths between two entities in dependency trees.",
                    "sid": 44,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar to Culotta and Sorensen (2004), this method also suffers from high precision but low recall.",
                    "sid": 45,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhang et al.",
                    "sid": 46,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006) describe a convolution tree kernel (CTK, Collins and Duffy, 2001) to investigate various structured information for relation extraction and find that the Shortest Path- enclosed Tree (SPT) achieves the F-measure of 67.7 on the 7 relation types of the ACE RDC 2004 corpus.",
                    "sid": 47,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One problem with SPT is that it loses the contextual information outside SPT, which is usually critical for relation extraction.",
                    "sid": 48,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhou et al.",
                    "sid": 49,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) point out that both SPT and the convolution tree kernel are context-free.",
                    "sid": 50,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Theyexpand SPT to CS-SPT by dynamically includ ing necessary predicate-linked path information and extending the standard CTK to context- sensitive CTK, obtaining the F-measure of 73.2 on the 7 relation types of the ACE RDC 2004 corpus.",
                    "sid": 51,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the CS-SPT only recovers part of contextual information and may contain noisy information as much as SPT.",
                    "sid": 52,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to fully utilize the advantages of feature-based methods and kernel-based methods, researchers turn to composite kernel methods.",
                    "sid": 53,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhao and Grishman (2005) define several feature-based composite kernels to capture diverse linguistic knowledge and achieve the F-measure of 70.4 on the 7 relation types in the ACE RDC 2004 corpus.",
                    "sid": 54,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhang et al.",
                    "sid": 55,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006) design a composite kernel consisting of an entity linear kernel and a standard CTK, obtaining the F-measure of 72.1 on the 7 relation types in the ACE RDC 2004 corpus.",
                    "sid": 56,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhou et al.",
                    "sid": 57,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) describe a composite kernel to integrate a context-sensitive CTK and a state-of-the-art linear kernel.",
                    "sid": 58,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It achieves the so far best F-measure of 75.8 on the 7 relation types in the ACE RDC 2004 corpus.",
                    "sid": 59,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we will further study how to dynamically determine a concise and effective tree span for a relation instance by exploiting constituent dependencies inherent in the parse tree derivation.",
                    "sid": 60,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also attempt to fully capture both the structured syntactic parse information and entity-related semantic information, especially combined entity features, via a unified parse and semantic tree.",
                    "sid": 61,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we validate the effectiveness of a composite kernel for relation extraction, which combines a tree kernel and a linear kernel.",
                    "sid": 62,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "dynamic syntactic parse tree. ",
            "number": "3",
            "sents": [
                {
                    "text": "This section discusses how to generate dynamic syntactic parse tree by employing constituent dependencies to overcome the problems existing in currently used tree spans.",
                    "sid": 63,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Constituent Dependencies in Parse Tree.",
                    "sid": 64,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhang et al.",
                    "sid": 65,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006) explore five kinds of tree spans and find that the Shortest Path-enclosed Tree (SPT) achieves the best performance.",
                    "sid": 66,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhou et al.",
                    "sid": 67,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) further propose Context-Sensitive SPT (CS-SPT), which can dynamically determine the tree span by extending the necessary predicate-linked path information outside SPT.",
                    "sid": 68,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the key problem of how to represent the structured syntactic parse tree is still partially resolved.",
                    "sid": 69,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we indicate as follows, current tree spans suffer from two problems: (1) Both SPT and CS-SPT still contain unnecessary information.",
                    "sid": 70,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the sentence “…bought one of town’s two meat-packing plants”, the condensed information “one of plants” is sufficient to determine “DISC” relationship between the entities “one” [FAC] and “plants” [FAC], while SPT/CS-SPT include the redundant underlined part.",
                    "sid": 71,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore more unnecessary information can be safely removed from SPT/CS-SPT.",
                    "sid": 72,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) CS-SPT only captures part of context- sensitive information relating to predicate-linked structure (Zhou et al., 2007) and still loses much context-sensitive information.",
                    "sid": 73,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let’s take the same example sentence “…bought one of town’s two meat-packing plants”, where indeed there is no relationship between the entities “one” [FAC] and “town” [GPE].",
                    "sid": 74,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, the information contained in SPT/CS-SPT (“one of town”) may easily lead to their relationship being misclassified as “DISC”, which is beyond our expectation.",
                    "sid": 75,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore the underlined part outside SPT/CS- SPT should be recovered so as to differentiate it from positive instances.",
                    "sid": 76,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since dependency plays a key role in many NLP problems such as syntactic parsing, semantic role labeling as well as semantic relation extraction, our motivation is to exploit dependency knowledge to distinguish the necessary evidence from the unnecessary information in the structured syntactic parse tree.",
                    "sid": 77,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On one hand, lexical or word-word dependency indicates the relationship among words occurring in the same sentence, e.g. predicate- argument dependency means that arguments are dependent on their target predicates, modifier head dependency means that modifiers are dependent on their head words.",
                    "sid": 78,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This dependency relationship offers a very condensed representation of the information needed to assess the relationship in the forms of the dependency tree (Culotta and Sorensen, 2004) or the shortest dependency path (Bunescu and Mooney, 2005) that includes both entities.",
                    "sid": 79,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, when the parse tree corresponding to the sentence is derived using derivation rules from the bottom to the top, the word- word dependencies extend upward, making a unique head child containing the head word for every non-terminal constituent.",
                    "sid": 80,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As indicated as follows, each CFG rule has the form: P Æ Ln…L1 H R1…Rm Here, P is the parent node, H is the head child of the rule, Ln…L1 and R1…Rm are left and right modifiers of H respectively, and both n and m may be zero.",
                    "sid": 81,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, the parent node P depends on the head child H, this is what we call constituent dependency.",
                    "sid": 82,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Vice versa, we can also determine the head child of a constituent in terms of constituent dependency.",
                    "sid": 83,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our hypothesis stipulates that the contribution of the parse tree to establishing a relationship is almost exclusively concentrated in the path connecting the two entities, as well as the head children of constituent nodes along this path.",
                    "sid": 84,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Generation of Dynamic Syntactic Parse.",
                    "sid": 85,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tree Starting from the Minimum Complete Tree (MCT, the complete sub-tree rooted by the nearest common ancestor of the two entities under consideration) as the representation of each relation instance, along the path connecting two entities, the head child of every node is found according to various constituent dependencies.",
                    "sid": 86,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then the path nodes and their head children are kept while any other nodes are removed from the tree.",
                    "sid": 87,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Eventually we arrive at a tree called Dynamic Syntactic Parse Tree (DSPT), which is dynamically determined by constituent dependencies and only contains necessary information as expected.",
                    "sid": 88,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There exist a considerable number of constituent dependencies in CFG as described by Collins (2003).",
                    "sid": 89,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, since our task is to extract the relationship between two named entities, our focus is on how to condense Noun-Phrases (NPs) and other useful constituents for relation extraction.",
                    "sid": 90,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore constituent dependencies can be classified according to constituent types of the CFG rules: (1) Modification within base-NPs: base-NPs mean that they do not directly dominate an NP themselves, unless the dominated NP is a possessive NP.",
                    "sid": 91,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The noun phrase right above the entity headword, whose mention type is nominal or name, can be categorized into this type.",
                    "sid": 92,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, the entity headword is also the headword of the noun phrase, thus all the constituents before the headword are dependent on the headword, and may be removed from the parse tree, while the headword and the constituents right after the headword remain unchanged.",
                    "sid": 93,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the sentence “…bought one of town’s two meat- packing plants” as illustrated in Figure 1(a), the constituents before the headword “plants” can be removed from the parse tree.",
                    "sid": 94,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way the parse tree “one of plants” could capture the “DISC” relationship more concisely and precisely.",
                    "sid": 95,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another interesting example is shown in Figure 1(b), where the base-NP of the second entity “town” is a possessive NP and there is no relationship between the entities “one” and “town” defined in the ACE corpus.",
                    "sid": 96,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For both SPT and CS-SPT, this example would be condensed to “one of town” and therefore easily misclassified as the “DISC” relationship between the two entities.",
                    "sid": 97,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the contrast, our DSPT can avoid this problem by keeping the constituent “’s” and the headword “plants”.",
                    "sid": 98,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Modification to NPs: except base-NPs, other modification to NPs can be classified into this type.",
                    "sid": 99,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Usually these NPs are recursive, meaning that they contain another NP as their child.",
                    "sid": 100,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CFG rules corresponding to these modifications may have the following forms: NP Æ NP SBAR [relative clause] NP Æ NP VP [reduced relative] NP Æ NP PP [PP attachment] Here, the NPs in bold mean that the path connecting the two entities passes through them.",
                    "sid": 101,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For every right hand side, the NP in bold is modified by the constituent following them.",
                    "sid": 102,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, the latter is dependent on the former, and may be reduced to a single NP.",
                    "sid": 103,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Figure 1(c) we show a sentence “one of about 500 people nominated for …”, where there exists a “DISC” relationship between the entities “one” and “people”.",
                    "sid": 104,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the reduced relative “nominated for …” modifies and is therefore dependent on the “people”, they can be removed from the parse tree, that is, the right side (“NP VP”) can be reduced to the left hand side, which is exactly a single NP.",
                    "sid": 105,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NP PP NP NP NP NP PP NP NP NP PP NP NP NP NP PP VP NP NP E1FAC E-GPE E1FACE2-FAC E1 PER QP E2-PER E1-PER E2-PER NN DT NN CD JJ NN NN NN IN RB CD NNS NN NNS one the town two meat-packing one plants one of about 500 people one people (a) Removal of constituents before the headword in base-NP (c) Reduction of modification to NP NP E1-PER NP P P N P NP E 2 G P E E-FAC NP E1FAC NP PP NP E2 GPE NP E-FAC NP S B A R S VP PP NP SBAR S NN IN DT NN POS CD JJ NN NN IN NN POS NN NP NP NP NP NP one of the town 's two meat-packing plants one of town 's plants E1FAC E2-PER NP E1FAC E2-PER VP (b) Keeping of constituents after the headword in base-NP JJ NN PRP VBZ IN DT NNS NN PRP VBZ rental NP property he owns in the state property he owns PP NP NP PP (d) Removal of arguments to verb NP NP NP NP NP NP E1-PER E-GPE E-GPE E2GPE E1-PER E2GPE NNS IN NNP , NNP NNP , CC NNP NNS IN NNP governors from connecticut , south dakota , and montana governors from montana (e) Reduction of conjuncts for NP coordination Figure 1.",
                    "sid": 106,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Removal and reduction of constituents using dependencies (3) Arguments/adjuncts to verbs: this type includes the CFG rules in which the left side includes S, SBAR or VP.",
                    "sid": 107,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An argument represents the subject or object of a verb, while an adjunct indicates the location, date/time or way of the action corresponding to the verb.",
                    "sid": 108,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They depend on the verb and can be removed if they are not included in the path connecting the two entities.",
                    "sid": 109,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, when the parent tag is S or SBAR, and its child VP is not included in the path, this VP should be recovered to indicate the predicate verb.",
                    "sid": 110,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1(d) shows a sentence “… maintain rental property he owns in the state”, where the “ART.User-or-Owner” relation holds between the entities “property” and “he”.",
                    "sid": 111,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While PP can be removed from the rule (“VPÆ VBZ PP”), the VP should be kept in the rule (“SÆ NP VP”).",
                    "sid": 112,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, the tree span looks more concise and precise for relation extraction.",
                    "sid": 113,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4) Coordination conjunctions: In coordination constructions, several peer conjuncts may be reduced into a single constituent.",
                    "sid": 114,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the first conjunct is always considered as the headword (Collins, 2003), actually all the conjuncts play an equal role in relation extraction.",
                    "sid": 115,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As illus trated in Figure 1(e), the NP coordination in the Qian et al.",
                    "sid": 116,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) further indicates that among these entity features, entity type, subtype, and mention type, as well as the base form of predicate verb, contribute most while the contribution of other features, such as entity class, headword and GPE role, can be ignored.",
                    "sid": 117,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to effectively capture entity-related semantic features, and their combined features as well, especially bi-gram or tri-gram features, we build an Entity-related Semantic Tree (EST) in three ways as illustrated in Figure 2.",
                    "sid": 118,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the example sentence “they ’re here”, which is excerpted from the ACE RDC 2004 corpus, there exists a relationship “Physical.Located” between the entities “they” [PER] and “here” [GPE.Population-Center].",
                    "sid": 119,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features are encoded as “TP”, “ST”, “MT” and “PVB”, which denote type, subtype, mention-type of the two entities, and the base form of predicate verb if existing (nearest to the 2nd entity along the path connecting the two entities) respectively.",
                    "sid": 120,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the tag “TP1” represents the type of the 1st entity, and the tag “ST2” represents the sub- type of the 2nd entity.",
                    "sid": 121,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The three entity-related semantic tree setups are depicted as follows: ENT sentence (“governors from connecticut, south TP1 ST1 MT1 TP2 ST2 MT2 PVB dakota, and montana”) can be reduced to a single NP (“governors from montana”) by keeping the conjunct in the path while removing the other conjuncts.",
                    "sid": 122,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PER null PRO GPE Pop.",
                    "sid": 123,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PRO be (a) Bag Of Features(BOF) ENT (5) Modification to other constituents: except for the above four types, other CFG rules fall into this type, such as modification to PP, ADVP and PRN etc. These cases are similar to arguments/adjuncts to verbs, but less frequent than them, so we will not detail this scenario.In fact, SPT (Zhang et al., 2006) can be ar TP ST MT TP1 TP2 ST1 ST2 MT1 MT2 PER GPE null Pop.",
                    "sid": 124,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PRO PRO (b) Feature Paired Tree(FPT) ENT E1 E2 PVB be PVBrived at by carrying out part of the above re TP1 ST1 MT1 TP2 ST2 MT2 be moval operations using a single rule (i.e. all the constituents outside the linking path should be removed) and CS-CSPT (Zhou et al., 2007) further recovers part of necessary context-sensitive information outside SPT, this justifies that SPT performs well, while CS-SPT outperforms SPT.",
                    "sid": 125,
                    "ssid": 63,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "entity-related semantic tree. ",
            "number": "4",
            "sents": [
                {
                    "text": "Entity semantic features, such as entity headword, entity type and subtype etc., impose a strong constraint on relation types in terms of relation definition by the ACE RDC task.",
                    "sid": 126,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experiments by Zhang et al.",
                    "sid": 127,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006) show that linear kernel using only entity features contributes much when combined with the convolution parse tree kernel.",
                    "sid": 128,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PER null PRO GPE Pop.",
                    "sid": 129,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PRO (c) Entity-Paired Tree(EPT)Figure 2.",
                    "sid": 130,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different setups for entity-related se mantic tree (EST) (a) Bag of Features (BOF, e.g. Fig.",
                    "sid": 131,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2(a)): all feature nodes uniformly hang under the root node, so the tree kernel simply counts the number of common features between two relation instances.",
                    "sid": 132,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This tree setup is similar to linear entity kernel explored by Zhang et al.",
                    "sid": 133,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006).",
                    "sid": 134,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(b) Feature-Paired Tree (FPT, e.g. Fig.",
                    "sid": 135,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2(b)): the features of two entities are grouped into different types according to their feature names, e.g. “TP1” and “TP2” are grouped to “TP”.",
                    "sid": 136,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This tree setup is aimed to capture the additional similarity of the single feature combined from different entities, i.e., the first and the second entities.",
                    "sid": 137,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(c) Entity-Paired Tree (EPT, e.g. Fig.",
                    "sid": 138,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2(c)): all the features relating to an entity are grouped to nodes “E1” or “E2”, thus this tree kernel can further explore the equivalence of combined entity features only relating to one of the entities between two relation instances.",
                    "sid": 139,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, the BOF only captures the individual entity features, while the FPT/EPT can additionally capture the bi-gram/tri-gram features respectively.",
                    "sid": 140,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rather than constructing a composite kernel, we incorporate the EST into the DSPT to produce a Unified Parse and Semantic Tree (UPST) to investigate the contribution of the EST to relation extraction.",
                    "sid": 141,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The entity features can be attached under the top node, the entity nodes, or directly combined with the entity nodes as in Figure 1.",
                    "sid": 142,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, detailed evaluation (Qian et al., 2007) indicates that the UPST achieves the best performance when the feature nodes are attached under the top node.",
                    "sid": 143,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, we also attach three kinds of entity-related semantic trees (i.e. BOF, FPT and EPT) under the top node of the DSPT right after its original children.",
                    "sid": 144,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thereafter, we employ the standard CTK (Collins and Duffy, 2001) to compute the similarity between two (Moschitti, 2004) 2 is selected as our classifier.",
                    "sid": 145,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For efficiency, we apply the one vs. others strategy, which builds K classifiers so as to separate one class from all others.",
                    "sid": 146,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For comparison purposes, the training parameters C (SVM) and Ȝ (tree kernel) are also set to 2.4 and 0.4 respectively.",
                    "sid": 147,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 evaluates the contributions of different kinds of constituent dependencies to extraction performance on the 7 relation types of the ACE RDC 2004 corpus using the convolution parse tree kernel as depicted in Figure 1.",
                    "sid": 148,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The MCT with only entity-type information is first used as the baseline, and various constituent dependencies are then applied sequentially to dynamically reshaping the tree in two different modes: --[M1] Respective: every constituent dependency is individually applied on MCT.",
                    "sid": 149,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "--[M2] Accumulative: every constituent dependency is incrementally applied on the previously derived tree span, which begins with the MCT and eventually gives rise to a Dynamic Syntactic Parse Tree (DSPT).",
                    "sid": 150,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dependency types P(%) R(%) F MCT (baseline) 75.1 53.8 62.7 UPSTs, since this CTK and its variations are Modification within 76.5 59.8 67.1successfully applied in syntactic parsing, seman tic role labeling (Moschitti, 2004) and relation base-NPs (59.8) (59.8) (67.1) extraction (Zhang et al., 2006; Zhou et al., 2007) Modification to NPs 77.0 63.2 69.4 as well.",
                    "sid": 151,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(76.2) (56.9) (65.1) Arguments/adjuncts to verb 77.1 63.9 69.9",
                    "sid": 152,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimentation. ",
            "number": "5",
            "sents": [
                {
                    "text": "(76.1) (57.5) (65.5) Coordination conjunctions 77.3 65.2 70.8 This section will evaluate the effectiveness of the (77.3) (55.1) (63.8)DSPT and the contribution of entity-related se Other modifications 77.4 65.4 70.9 mantic information through experiments.",
                    "sid": 153,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Experimental Setting.",
                    "sid": 154,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For evaluation, we use the ACE RDC 2004 corpus as the benchmark data.",
                    "sid": 155,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This data set contains 451 documents and 5702 relation instances.",
                    "sid": 156,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It defines 7 entity types, 7 major relation types and 23 subtypes.",
                    "sid": 157,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For comparison with previous work, evaluation is done on 347 (nwire/bnews) documents and 4307 relation instances using 5-fold cross-validation.",
                    "sid": 158,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, the corpus is parsed using Charniak’s parser (Charniak, 2001) and relation instances are generated by iterating over all pairs of entity mentions occurring in the same sentence with given “true” mentions and coreferential information.",
                    "sid": 159,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experimentations, SVMlight (Joachims, 1998) with the tree kernel function (75.0) (53.7) (62.6) Table 1.",
                    "sid": 160,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Contribution of constituent dependencies in respective mode (inside parentheses) and accumulative mode (outside parentheses) The table shows that the final DSPT achieves the best performance of 77.4%/65.4%/70.9 in precision/recall/F-measure respectively after applying all the dependencies, with the increase of F-measure by 8.2 units compared to the baseline MCT.",
                    "sid": 161,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This indicates that reshaping the tree by exploiting constituent dependencies may significantly improve extraction accuracy largely due to the increase in recall.",
                    "sid": 162,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It further suggests that constituent dependencies knowledge is very effec 2 http://ainlp.info.uniroma2.it/moschitti/ tive and can be fully utilized in tree kernel-based relation extraction.",
                    "sid": 163,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This table also shows that: (1) Both modification within base-NPs and modification to NPs contribute much to performance improvement, acquiring the increase of F- measure by 4.4/2.4 units in mode M1 and 4.4/2.3 units in mode M2 respectively.",
                    "sid": 164,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This indicates the local characteristic of semantic relations, which can be effectively captured by NPs near the two involved entities in the DSPT.",
                    "sid": 165,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) All the other three dependencies show minor contribution to performance enhancement, they improve the F-measure only by 2.8/0.9/-0.1 units in mode M1 and 0.5/0.9/0.1 units in mode M2.",
                    "sid": 166,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This may be due to the reason that these dependencies only remove the nodes far from the two entities.",
                    "sid": 167,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compare in Table 2 the performance of Unified Parse and Semantic Trees with different kinds of Entity Semantic Tree setups using standard convolution tree kernel, while the SPT and DSPT with only entity-type information are listed for reference.",
                    "sid": 168,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that: (1) All the three unified parse and semantic tree kernels significantly outperform the DSPT kernel, obtaining an average increase of ~4 units in F-measure.",
                    "sid": 169,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that they can effectively capture both the structured syntactic information and the entity-related semantic features.",
                    "sid": 170,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) The Unified Parse and Semantic Tree with Feature-Paired Tree achieves the best performance of 80.1/70.7/75.1 in P/R/F respectively, with an increase of F-measure by 0.4/0.3 units over BOF and EPT respectively.",
                    "sid": 171,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that additional bi-gram entity features capturedby FPT are more useful than tri-gram entity fea tures captured by EPT.",
                    "sid": 172,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tree setups P(%) R(%) F SPT 76.3 59.8 67.1 DSPT 77.4 65.4 70.9 UPST (BOF) 80.4 69.7 74.7 UPST (FPT) 80.1 70.7 75.1 UPST (EPT) 79.9 70.2 74.8 Table 2.",
                    "sid": 173,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance of Unified Parse and Semantic Trees (UPSTs) on the 7 relation types of the ACE RDC 2004 corpus tree spans.",
                    "sid": 174,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also shows that the Unified Parse and Semantic Tree with Feature-Paired Tree perform significantly better than the other two tree setups (i.e., CS-SPT and DSPT) by 6.7/4.2 units in F-measure respectively.",
                    "sid": 175,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This implies that the entity-related semantic information is very useful and contributes much when they are incorporated into the parse tree for relation extraction.",
                    "sid": 176,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tree setups P(%) R(%) F CS-SPT over SPT3 1.5 1.1 1.3 DSPT over SPT 1.1 5.6 3.8 UPST (FPT) over SPT 3.8 10.9 8.0 Table 3.",
                    "sid": 177,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Improvements of different tree setups over SPT on the ACE RDC 2004 corpus Finally, Table 4 compares our system with other state-of-the-art kernel-based systems on the 7 relation types of the ACE RDC 2004 corpus.",
                    "sid": 178,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that our UPST outperforms all previous tree setups using one single kernel, and even better than two previous composite kernels (Zhang et al., 2006; Zhao and Grishman, 2005).",
                    "sid": 179,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, when the UPST (FPT) kernel is com bined with a linear state-of-the-state feature- based kernel (Zhou et al., 2005) into a composite one via polynomial interpolation in a setting similar to Zhou et al.",
                    "sid": 180,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) (i.e. polynomial degree d=2 and coefficient Į=0.3), we get the so far best performance of 77.1 in F-measure for 7 relation types on the ACE RDC 2004 data set.",
                    "sid": 181,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Systems P(%) R(%) F Ours: composite kernel 83.0 72.0 77.1 Zhou et al., (2007): composite kernel 82.2 70.2 75.8 Zhang et al., (2006): composite kernel 76.1 68.4 72.1 Zhao and Grishman, (2005):4 composite kernel 69.2 70.5 70.4 Ours: CTK with UPST 80.1 70.7 75.1Zhou et al., (2007): context sensitive CTK with CS-SPT 81.1 66.7 73.2 Zhang et al., (2006): CTK with SPT 74.1 62.4 67.7 Table 4.",
                    "sid": 182,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparison of different systems on the ACE RDC 2004 corpus In Table 3 we summarize the improvements of different tree setups over SPT.",
                    "sid": 183,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that in a similar setting, our DSPT outperforms SPT by 3.8 units in F-measure, while CS-SPT outperforms SPT by 1.3 units in F-measure.",
                    "sid": 184,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that the DSPT performs best among these 3 We arrive at these values by subtracting P/R/F.",
                    "sid": 185,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(79.6/5.6/71.9) of Shortest-enclosed Path Tree from P/R/F (81.1/6.7/73.2) of Dynamic Context-Sensitive Shortest- enclosed Path Tree according to Table 2 (Zhou et al., 2007) 4 There might be some typing errors for the performance.",
                    "sid": 186,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "reported in Zhao and Grishman (2005) since P, R and F do not match.",
                    "sid": 187,
                    "ssid": 35,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "6",
            "sents": [
                {
                    "text": "This paper further explores the potential of structured syntactic information for tree kernel-based relation extraction, and proposes a new approach to dynamically determine the tree span (DSPT) for relation instances by exploiting constituent dependencies.",
                    "sid": 188,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also investigate different ways of how entity-related semantic features and their combined features can be effectively captured in a Unified Parse and Semantic Tree (UPST).",
                    "sid": 189,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation on the ACE RDC 2004 corpus shows that our DSPT is appropriate for structured representation of relation instances.",
                    "sid": 190,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also find that, in addition to individual entity features, combined entity features (especially bi-gram) contribute much when they are combined with a DPST into a UPST.",
                    "sid": 191,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And the composite kernel, combining the UPST kernel and a linear state-of- the-art kernel, yields the so far best performance.",
                    "sid": 192,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the future work, we will focus on improving performance of complex structured parse trees, where the path connecting the two entities involved in a relationship is too long for current kernel methods to take effect.",
                    "sid": 193,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our preliminary experiment of applying certain discourse theory exhibits certain positive results.",
                    "sid": 194,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "This research is supported by Project 60673041 under the National Natural Science Foundation of China, Project 2006AA01Z147 under the “863” National High-Tech Research and Development of China, and the National Research Foundation for the Doctoral Program of Higher Education of China under Grant No. 20060285008.",
                    "sid": 195,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would also like to thank the excellent and insightful comments from the three anonymous reviewers.",
                    "sid": 196,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}