{
    "ID": "C08-2009",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We introduce a new type of discourse constraints for the interaction of discourse relations with the configuration of discourse segments.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We examine corpus-extracted examples as soft constraints.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show how to use Regular Tree Gramamrs to process such constraints, and how the representation of some constraints depends on the expressive power of this formalism.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Discourse structures cannot always be described completely, either because they are ambiguous (Stede, 2004), or because a discourse parser fails to analyse them completely.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In either case, underspecification formalisms (UFs) can be used to represent partial information on discourse structure.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "UFs are used in semantics to model structural ambiguity without disjunctive enumeration of the readings (van Deemter and Peters, 1996).",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Underspecified descriptions of discourse must handle two kinds of incomplete information, on the configuration of discourse segments (how they combine into larger units), and on the discourse relations that bring about this configuration: Our corpus studies on the RST Discourse Treebank (Carlson et al., 2002) showed interdependencies between relations and configuration, a phenomenon first noted by (CorstonOliver, 1998).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These interdependencies can be formulated as constraints that contribute to the disambiguation of underspecified descriptions of discourse structure.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "E.g., in discourse segments constituted by the relation Condition, the premiss tends to be a dis Qc 2008.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Licensed under the Creative Commons Attribution-Noncommercial-Share Alike 3.0 Unported license (http://creativecommons.org/licenses/by-nc-sa/3.0/).",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some rights reserved.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "course atom (or at least, maximally short).1 Similarly, there is evidence for an interdependency constraint for the relation Purpose(1) 2.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In most cases, Purpose(1) has a discourse atom as its nucleus.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus evaluation furthermore shows that those patterns never occur exclusively but only as tendencies.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Realised as soft constraints, such tendencies can help to sort the set of readings according to the established preferences, which allows to focus on the best reading or the n-best readings.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is of high value for an UF-based approach to discourse structure, which must cope with extremely high numbers of readings.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To model interdependency constraints, we will use Regular Tree Grammars (RTGs) (Comon et al., 2007).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "RTGs can straightforwardly be extended to weighted Regular Tree Grammars (wRTGs), which can represent both soft and hard constraints.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Apart from our corpus-extracted examples, we also consider a hard interdependency constraint similar to the Right Frontier Constraint.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that we can integrate this attachment constraint with our formalism, and how its representation depends on the expressiveness of RTGs.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "underspecified discourse structure. ",
            "number": "2",
            "sents": [
                {
                    "text": "We describe (partial) information on discourse structure by expressions of a suitable UF, here, dominance graphs (Althaus et al., 2003).",
                    "sid": 21,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider e.g. Fig.",
                    "sid": 22,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1(a), the dominance graph for (1): (1) [C1 I try to read a novel] [C2 if I feel bored] [C3 because the TV programs disappoint me] [C4 but I can’t concentrate on anything.]",
                    "sid": 23,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 Following Rhetorical Structure Theory (Mann and Thompson, 1988), most discourse relations have a central nucleus argument, and a peripheral satellite argument.",
                    "sid": 24,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Condition, the premiss is the satellite, the nucleus, the conclusion.",
                    "sid": 25,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 ‘(n)’ as part of a relation name indicates that the nucleus is its nth argument; relations with names without such an affix are multinuclear, i.e., link two segments of equal prominence.",
                    "sid": 26,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We sometimes omit the numbers where the position of the nucleus is clear from the context.",
                    "sid": 27,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "35 Coling 2008: Companion volume – Posters and Demonstrations, pages 35–38 Manchester, August 2008 (a) Cause(2) Contrast (b) (c) (d) (e) Condition(1) (f) Condition(1) Contrast Contrast Cause(2) Condition(1) 2 4 6 Cause(2) Contrast C1 1 C2 3 C3 5 Condition(1) C4 7 C4 Condition(1) C3 C1 C4 Cause(2) Condition(1) Contrast C1 Cause(2) C4 C1 Cause(2) C2 Co ntrast C1 C2 C2 C3 C1 C2 C3 C4 C2 C3 C3 C4 Figure 1: An underspecified discourse structure and its five configurations {17} → Condition({1}, {37}) [1] {35} → Cause({3}, {5}) [1] {57} → Contrast({5}, {7}) [1] {37} → Cause({3}, {57}) [1] {1} → C1 [1] {3} → C2 [1] {5} → C3 [1] {7} → C4 [1] Figure 2: A wRTG modelling the interdependency constraint for Fig.",
                    "sid": 28,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 Such constraints describe a set of discourse structures (formalised as binary tree structures).",
                    "sid": 29,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their key ingredient are (reflexive, transitive and antisymmetric) dominance relations, which are indicated by dotted lines.",
                    "sid": 30,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dominance of X1 over X2 means that X2 is part of the structure below (and including) X1, but there might be additional material intervening between X1 and X2.",
                    "sid": 31,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fig.",
                    "sid": 32,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1(a) states that C1 is linked to a part of the following discourse (including at least C2) by Condition, Cause(2) connects two discourse segments (comprising at least C2 and C3, respectively), and Contrast links a discourse segment to its left (including at least C3) to C4.",
                    "sid": 33,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This constraint describes (is compatible with) exactly the five tree structures in Fig.",
                    "sid": 34,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1(b-f), if described tree structures may only comprise material that is already introduced in the constraint.",
                    "sid": 35,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They model the potential discourse structures for (1) (see Webber (2004)).",
                    "sid": 36,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dominance graphs like Fig.",
                    "sid": 37,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1a.",
                    "sid": 38,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "are pure chains.",
                    "sid": 39,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pure chains describe all binary trees with the same leaf language, here the discourse segments, in their textual order.",
                    "sid": 40,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pure chains define a left-to-right order, in that not only the leaves always form the same sequence, but also the inner nodes: If a labelled node X is further to the left in the chain than another node Y, in every described tree, X will either be Y’s left child, or Y will be X’s right child, or there will be a fragment F of which X is a successor on the left and Y is a right successor.",
                    "sid": 41,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Henceforth we will refer to fragments with their index in the chain (indicated by encircled numbers in Fig.",
                    "sid": 42,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1a).",
                    "sid": 43,
                    "ssid": 23,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "representing soft interdependencies. ",
            "number": "3",
            "sents": [
                {
                    "text": "The interdependency constraint for Condition(1) is that its satellite tends to be maximally short, i.e., mostly consists of only one discourse atom, and in most remaining cases, of two atoms.",
                    "sid": 44,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, (b) and (d) are preferred among the configurations in Fig.",
                    "sid": 45,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1, (c) is less preferred, and (e) and (f) are the least preferred.",
                    "sid": 46,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Regular Tree Grammars (RTGs) as UF (Koller et al., 2008) can express such complex constraints straightforwardly, and provide a convenient framework to process them.",
                    "sid": 47,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They allow to extract a best configuration with standard algorithms very efficiently.",
                    "sid": 48,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Koller et al.",
                    "sid": 49,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) show how to generate an RTG describing the same set of trees as a dominance graph.",
                    "sid": 50,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar to a context free grammar, an RTG uses production rules with terminal symbols and nonterminal symbols (NTs), whereby the left- hand side (LHS) is always a nonterminal and the right-hand side (RHS) contains at least one terminal symbol.",
                    "sid": 51,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One NT is the start symbol.",
                    "sid": 52,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A tree is accepted by the grammar if the grammar contains a derivation for it.",
                    "sid": 53,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example for an RTG is given in Fig.",
                    "sid": 54,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2, which describes the same trees as the dominance graph in Fig.",
                    "sid": 55,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1a.",
                    "sid": 56,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The start symbol is {17}.",
                    "sid": 57,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To derive e.g. the tree in Fig.",
                    "sid": 58,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1d, we first select the rule {17} → Cause({13}, {57}) that determines Condition as root for the whole tree.",
                    "sid": 59,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The left child of Condition is then derived from {17}, and the right child from {57} respectively.",
                    "sid": 60,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To emphasize the association with the dominance graph, we mark nonterminals as the subgraphs they represent, e.g., {17} denotes the whole graph.",
                    "sid": 61,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The terminal in the RHS of a grammar rule determines the root of the LHS subgraph.",
                    "sid": 62,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Koller et al.",
                    "sid": 63,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) also use weighted RTGs (wRTGs, an extension of RTG with weights) to express soft dominance constraints (which, unlike hard constraints, do not restrict but rather rank the set of configurations).",
                    "sid": 64,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use wRTGs to model the soft interdependency constraints.",
                    "sid": 65,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The grammar in Fig.",
                    "sid": 66,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 is also a wRTG that assigns a weight to each derived tree: Its weight is the product over all weights of all rules used for the derivation.",
                    "sid": 67,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Weights appear in squared brackets after the rules.",
                    "sid": 68,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The (merely expository) weights in our example encode the preference of Condition for a maximally short right child: There are three grammar rules that establish Condition as the root of a sub- graph (shaded in Fig.",
                    "sid": 69,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2), which are distinguished by the size of the right child of the root (one ({3}), three ({35}) or five ({37}) nodes).",
                    "sid": 70,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The shorter the right child, the higher the weight associated with the rule.",
                    "sid": 71,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1 is a neutral weight by definition.)",
                    "sid": 72,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The grammar thus assigns different weights to the trees in Fig.",
                    "sid": 73,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1; (b) and (d) get the maximum weight of 9, (b), a medium weight of 3, and (e) and (f), the lowest weight of 1.",
                    "sid": 74,
                    "ssid": 31,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "expressive power of rtgs. ",
            "number": "4",
            "sents": [
                {
                    "text": "As Koller et al.",
                    "sid": 75,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) show, the expressive power of RTGs is superior to other common underspecification formalism.",
                    "sid": 76,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show an important application of the increased expressiveness with Ex.",
                    "sid": 77,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2, where a. can be continued by b. but not by c: (2) a. [C1 Max and Mary are falling apart.]",
                    "sid": 78,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[C2 They no longer meet for lunch.]",
                    "sid": 79,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[C3 And, last night, Max went to the pub] [C4 but Mary visited her parents.]",
                    "sid": 80,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "b. [C5a She complained bitterly about his behaviour.]",
                    "sid": 81,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "c. [C5b He left after his fifth pint of lager.]",
                    "sid": 82,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Segment C5a continues the preceding clause about Mary’s visit with additional information about the visit, it thus attaches directly to C4.",
                    "sid": 83,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To find a coherent integration of C5b, we would have to connect it to C3, as it provides more details about Max’ night at the pub.",
                    "sid": 84,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, in the given constellation of C3 and C4, that form a Contrast together, C3 is not available any longer for attachment of further discourse units.",
                    "sid": 85,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(This constraint is reminiscent of the Right Frontier Constraint, as it is used by Asher and Lascarides (2003).",
                    "sid": 86,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it is unclear how the Right Frontier Constraint in its exact definition can carry over to binary trees.)",
                    "sid": 87,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The given attachment constraint is not expressible with dominance graphs: it excludes the configurations of its dominance graph (Fig.",
                    "sid": 88,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3) in which Contrast shows up as a direct left child, e.g., (3b/e/f) as opposed to (3c/d).",
                    "sid": 89,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the excluded structure emerges in (3e/f) by choosing Cause as root of the the subgraph 59 (i.e., including the Contrast- and Sequence-fragments).",
                    "sid": 90,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For convenience, we will talk about this constraint as the ”left child constraint” (LCC).",
                    "sid": 91,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "S → C ontrast(S, S) L → Evid(S, S) S → Sequ(L, S) L → List(S, S) S → L L → C1 L → C2 L → C3 L → C4 L → C5 Figure 5: A filter RTG corresponding to Ex.",
                    "sid": 92,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 This additional constraint, however, can be expressed by an RTG like Fig.",
                    "sid": 93,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 94,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We explicitly distinguish between subgraphs (referred to with numbers) and their associated NTs here.",
                    "sid": 95,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Crucially, some subgraphs can be processed in different derivations here, e.g., {59} (as right child of List, irrespective of the relative scope of Evidence and List), or {37} (in the expansions of both {EvLiC o} and {LiC oSe}, like in (3c) as opposed to (3d)).",
                    "sid": 96,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sometimes this derivation history is irrelevant, like in the case of {59} (here, only Contrast may be chosen as root anyway), but there are cases where it matters: If {37} is the left child of Sequence, as in (3b/d), the choice of Contrast as its root is excluded, since this would make Contrast the left child of Sequence, as in (3b).",
                    "sid": 97,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, {37} as the right child of Evidence, like in (3c), allows both Contrast and List as root, because Contrast emerges as a right child in either case.",
                    "sid": 98,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the two occurrences of {37} are distinguished in terms of different NTs in the grammar, and only in the NT for the latter occurrence is there more than one further expansion rule.",
                    "sid": 99,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Regular tree languages are closed under intersection.",
                    "sid": 100,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, one can derive a grammar like Fig.",
                    "sid": 101,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 by intersecting a completely underspecified RTG (here, the one derived from Fig.",
                    "sid": 102,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3a) with a suitable filter grammar, e.g., Fig.",
                    "sid": 103,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 104,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The filter grammar produces an infinite language, containing the fragments of Fig.",
                    "sid": 105,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3a and excluding any derivation in which Sequence is the direct parent of Contrast.",
                    "sid": 106,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is guaranteed by introducing the nonterminal L (the left child NT for Sequence), for which there is no derivation with Contrast as its root.",
                    "sid": 107,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For an arbitrary pure chain with n fragments, the filter grammar generating the LCC is constructed as follows: S is the start symbol.",
                    "sid": 108,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For every fragment i s.t. 0 < i < n, there is a derivation rule with S as its LHS and i in its RHS, thus either S → i, for singleton fragments, or S → i(A, S), for binary fragments.",
                    "sid": 109,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If i is binary, we must determine A: If there is at least one fragment f < i s.t. the LCC is assumed for f , we create a new NT Li; every derivation rule with i on its RHS follows the pattern X → i(Li, S) (thus A = Li in particular).",
                    "sid": 110,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If there is no LCC fragment to the left (a) Evidence(1) List Contrast Sequence (b) Evid (c) Sequ (d) Evid (e) List (f) Evid 2 4 6 8 C1 Sequ Evid C5 C1 Sequ Evid Sequ C1 List 1 C1 3 C2",
                    "sid": 111,
                    "ssid": 37,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "c3",
            "number": "5",
            "sents": [
                {
                    "text": "7 C4 9 C5 List Contr C5 C4 C1 List Contr C4 List C2 C5 Contr C1 C2 Contr C2 Se qu Contr C5 C5 C2 C3 C2 C3 C3 C4 C3 C4 C3 C4 Figure 3: An underspecified discourse structure for Ex.",
                    "sid": 112,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 and five of its configurations {Ev LiC oSe } → Ev id( {C 1 }, {Li C oS e}) {E vLi C o} → Lis t({ Ev }, {C o}) {E v} → Ev id( {C 1 }, {C 2 }) {Ev LiC oSe } → Li st( {E v}, {C oS e}) { C o S e } → C ont ({ C3 }, {S e}) {L i} → Lis t({ C2 }, {C 3 }) {Ev LiC oSe } → C ont ({ Ev Li }, {S e}) { E v L i} → Ev id( {C 1 }, {L i}) {C o} → C ont ({ C3 }, {C 4 }) {Ev LiC oSe } → Se qu( {E vLi C o}, {C 5 }) { E v L i} → Li st( {E v}, {C 3 }) {S e} → Se qu( {C 4 }, {C 5 }) {LiC oSe} → Sequ({LiC o}L , {C5 }) {LiC o}L → List({C2 }, {C o}) {L iC oS e} → Lis t({ C2 }, {C oS e}) { Li C o} S → C ont ({ Li} , {C 4 }) {C1 } → C1 {C2 } → C2 {L iC oS e} → C ont ({ Li} , {S e}) { Li C o} S → Li( {Li }, {C 4 }) {C 3 } → C3 { E vL iC o} → Ev id( {C 1 }, {Li C o}S ) {C4 } → C4 {C5 } → C5 Figure 4: A RTG integrating the attachment constraint for Contrast from Ex.",
                    "sid": 113,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 into Fig.",
                    "sid": 114,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 of i, A = S. If a new NT Li was created, we need to create its RHSs: For every fragment h s.t. 0 < h < i and there is no LCC for h, there is a rewrite rule directly deriving h from Li.",
                    "sid": 115,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If h is a singleton fragment, the rule is Li → h. Otherwise the rule is Li → h(At, S), whereby At = S, if there is no Lh, or At = Lh if there is some LCC fragment on the left of h.3 The grammar in Fig.",
                    "sid": 116,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 can be generated with that scheme; it has been reduced afterwards in that a general rule S → L substitutes for all rules of the form S → N T for which there is a corresponding rule L → N T (e.g., S → Evid(S, S)).",
                    "sid": 117,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Conclusion.",
                    "sid": 118,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Interdependency constraints that arise from the interaction of discourse relations and their surrounding structures are introduced as a new technique for disambiguating discourse structure.",
                    "sid": 119,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We integrate those constraints in underspecified discourse structures by exploiting the expressive power of Regular Tree Grammars as UF.",
                    "sid": 120,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the corpus analysis yields in many cases only soft interdependency constraints, we use the weighted extension of RTGs, which allows to sort the readings of an underspecified representation and to identify preferred discourse structures.",
                    "sid": 121,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then showed that the representation of some discourse constraints depend on the expressive power of RTGs.",
                    "sid": 122,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For notes on implementation and tractability of our approach, see Regneri et al.",
                    "sid": 123,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008).",
                    "sid": 124,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 To model this as a preference rather than as a hard constraint, no rules for the L-NTs are omitted, but rather weighted low.",
                    "sid": 125,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An intersection with a preference-neutral wRTG would rank the configurations violating the constraint low, and all others with neutral weights.",
                    "sid": 126,
                    "ssid": 15,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}