{
    "ID": "C08-1002",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "VerbNet (VN) is a major large-scale English verb lexicon.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mapping verb instances to their VN classes has been proven useful for several NLP tasks.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, verbs are polysemous with respect to their VN classes.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We introduce a novel supervised learning model for mapping verb instances to VN classes, using rich syntactic features and class membership constraints.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluate the algorithm in both in-domain and corpus adaptation scenarios.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In both cases, we use the manually tagged Sem- link WSJ corpus as training data.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For in- domain (testing on Semlink WSJ data), we achieve 95.9% accuracy, 35.1% error reduction (ER) over a strong baseline.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For adaptation, we test on the GENIA corpus and achieve 72.4% accuracy with 10.7% ER.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is the first large-scale experimentation with automatic algorithms for this task.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The organization of verbs into classes whose members exhibit similar syntactic and semantic behavior has been discussed extensively in the linguistics literature (see e.g.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Levin and Rappaport Hovav, 2005; Levin, 1993)).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such an organization helps in avoiding lexicon representation redundancy and enables generalizations across similar verbs.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can also be of great practical use, e.g. in compensating NLP statistical models for data sparseness.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, Levin’s seminal work had motivated Qc 2008.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Licensed under the Creative Commons Attribution-Noncommercial-Share Alike 3.0 Unported license (http://creativecommons.org/licenses/by-nc-sa/3.0/).",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some rights reserved.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "much research aimed at automatic discovery of verb classes (see Section 2).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VerbNet (VN) (Kipper et al., 2000; Kipper- Schuler, 2005) is a large scale, publicly available domain independent verb lexicon that builds on Levin classes and extends them with new verbs, new classes, and additional information such as semantic roles and selectional restrictions.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VN classes were proven beneficial for Semantic Role Labeling (SRL) (Swier and Stevenson, 2005), Semantic Parsing (Shi and Mihalcea, 2005) and building conceptual graphs (Hensman and Dun- nion, 2004).",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Levin-inspired classes have been used in several NLP tasks, such as Machine Translation (Dorr, 1997) and Document Classification (Klavans and Kan, 1998).",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many applications that use VN need to map verb instances onto their VN classes.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, verbs are polysemous with respect to VN classes.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sem- link (Loper et al., 2007) is a dataset that maps each verb instance in the WSJ Penn Treebank to its VN class.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The mapping has been created using a combination of automatic and manual methods.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yi et al.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) have used Semlink to improve SRL.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we present the first large-scale experimentation with a supervised machine learning classification algorithm for disambiguating verb instances to their VN classes.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use rich syntactic features extracted from a treebank-style parse tree, and utilize a learning algorithm capable of imposing class membership constraints, thus taking advantage of the nature of our task.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use Semlink as the training set.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluate our algorithm in both in-domain and corpus adaptation scenarios.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the former, we test on the WSJ (using Semlink again), obtaining 95.9% accuracy with 35.1% error reduction (ER) over a strong baseline (most frequent 9 Proceedings of the 22nd International Conference on Computational Linguistics (Coling 2008), pages 9–16 Manchester, August 2008 class) when using a modern statistical parser.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the corpus adaptation scenario, we disambiguate verbs in sentences taken from outside the training domain.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the manual annotation of new corpora is costly, and since VN is designed to be a domain independent resource, adaptation results are important to the usability in NLP in practice.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We manually annotated 400 sentences from GENIA (Kim et al., 2003), a medical domain corpus1 . Testing on these, we achieved 72.4% accuracy with 10.7% ER.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our adaptation scenario is complete in the sense that the parser we use was also trained on a different corpus (WSJ).",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also report experiments done using gold-standard (manually created) parses.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most relevant previous works addressing verb instance class classification are (Lapata and Brew, 2004; Li and Brew, 2007; Girju et al., 2005).",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The former two do not use VerbNet and their experiments were narrower than ours, so we cannot compare to their results.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The latter mapped to VN, but used a preliminary highly restricted setup where most instances were monosemous.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For completeness, we compared our method to theirs2 , achieving similar results.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We review related work in Section 2, and discuss the task in Section 3.",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 introduces the model, Section 5 describes the experimental setup, and Section 6 presents our results.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "VerbNet.",
                    "sid": 43,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VN is a major electronic English verb lexicon.",
                    "sid": 44,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is organized in a hierarchical structure of classes and subclasses, each subclass inheriting the full characterization of its super-class.",
                    "sid": 45,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VN is built on a refinement of the Levin classes, the intersective Levin classes (Dang et al., 1998), aimed at achieving more coherent classes both semantically and syntactically.",
                    "sid": 46,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VN was also substantially extended (Kipper et al., 2006) using the Levin classes extension proposed in (Korhonen and Briscoe, 2004).",
                    "sid": 47,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VN today contains 3626 verb lemmas (forms), organized in 237 main classes having 4991 verb types (we refer to a lemma with an ascribed class as a type).",
                    "sid": 48,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of the 3626 lemmas, 912 are polysemous (i.e., appear in more than a single class).",
                    "sid": 49,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VN’s significant coverage of 75.5% coverage of VN classes over PropBank3 instances (Loper et al., 2007).",
                    "sid": 50,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each class contains rich semantic information, including semantic roles of the arguments augmented with selectional restrictions, and possible subcategorization frames consisting of a syntactic description and semantic predicates with temporal information.",
                    "sid": 51,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VN thematic roles are relatively coarse, vs. the situation-specific FrameNet role system or the verb-specific PropBank role system, enabling generalizations across a wide semantic scope.",
                    "sid": 52,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Swier and Stevenson (2005) and Yi et al.",
                    "sid": 53,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) used VN for SRL.",
                    "sid": 54,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verb type classification.",
                    "sid": 55,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Quite a few works have addressed the issue of verb type classification and in particular classification to ‘Levin inspired’ classes (e.g., (Schulte im Walde, 2000; Merlo and Stevenson, 2001)).",
                    "sid": 56,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such work is not comparable to ours, as it deals with verb type (sense) rather than verb token (instance) classification.",
                    "sid": 57,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verb token classification.",
                    "sid": 58,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lapata and Brew (2004) dealt with classification to Levin classes of polysemous verbs.",
                    "sid": 59,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They established a prior from the BNC in an unsupervised manner.",
                    "sid": 60,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They also showed that this prior helps in the training of a naive Bayes classifier employed to distinguish between possible verb classes of a given verb in a given frame (when the ambiguity is not solved by knowing the frame alone).",
                    "sid": 61,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Li and Brew (2007) extended this model by proposing a method to train the class disambiguator without using hand-tagged data.",
                    "sid": 62,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While these papers have good results, their experimental setup was rather narrow and used only at most 67 polysemous verbs (in 4 frames).",
                    "sid": 63,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VN includes 912 polysemous verbs, of which 695 appeared in our in-domain experiments.",
                    "sid": 64,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Girju et al.",
                    "sid": 65,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2005) performed the only previous work we are aware of that addresses the problem of token level verb disambiguation into VN classes.",
                    "sid": 66,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They treated the task as a supervised learning problem, proposing features based on a POS tagger, a Chunker and a named entity classifier.",
                    "sid": 67,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to create the data4 , they used a mapping between Propbank rolesets and VN classes, and took the instances in WSJ sections 1518,20,21 that were annotated by Propbank and for which the roleset determines the VN class uniquely.",
                    "sid": 68,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This resulted in most instances being in fact monosemous.",
                    "sid": 69,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their the English verb lexicon is demonstrated by the",
                    "sid": 70,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "propbank (palmer et al., 2005) is a corpus annotation of. ",
            "number": "3",
            "sents": [
                {
                    "text": "1 Our annotations will be made available to the community..",
                    "sid": 71,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Using the same sentences and instances, obtained from.",
                    "sid": 72,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the WSJ sections of the Penn Treebank with semantic roles of each verbal proposition.",
                    "sid": 73,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "experiment was conducted in a WSJ in-domain scenario, and in a much narrower scope than in this paper.",
                    "sid": 74,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They had 870 (39 polysemous) unique verb lemmas, compared to 2091 (695 polysemous) in our in-domain scenario.",
                    "sid": 75,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They did not test their model in an adaptation scenario.",
                    "sid": 76,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The scope and difficulty contrast between our setup and theirs are demonstrated by the large differences in the number of instances and in the percentage of polysemous instances: 972/12431 (7.8%) in theirs, compared to 49571/84749 (58.5%) in our in-domain scenario (training+test).",
                    "sid": 77,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compared our method to theirs for completeness and achieved similar results.",
                    "sid": 78,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semlink.",
                    "sid": 79,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Semlink project (Yi et al., 2007; Loper et al., 2007) aims to create a mapping of PropBank, FrameNet (Baker et al., 1998), Word- Net (henceforth WN) and VN to one another, thus allowing these resources to synergize.",
                    "sid": 80,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, the project includes the most extensive token mapping of verbs to their VN classes available today.",
                    "sid": 81,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It covers all verbs in the WSJ sections of the Penn Treebank within VN coverage (out of 113K verb instances, 97K have lemmas present in VN).",
                    "sid": 82,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 Nature of the Task.",
                    "sid": 83,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Polysemy is a major issue in NLP.",
                    "sid": 84,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verbs are not an exception, resulting in a single verb form (lemma) appearing in more than a single class.",
                    "sid": 85,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This pol- ysemy is also present in the original Levin classification, where polysemous classes account for more than 48% of the BNC verb instances (Lapata and Brew, 2004).",
                    "sid": 86,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a verb instance whose lemma is within the coverage of VN, given the sentence in which it appears, given a parse tree of this sentence (see below), and given the VN resource, our task is to classify the verb instance to its correct VN class.",
                    "sid": 87,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are currently 237 possible classes5 . Each verb has only a few possible classes (no more than 10, but only about 2.5 on the average over the polysemous verbs).",
                    "sid": 88,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Depending on the application, the parse tree for the sentence may be either a gold standard parse or a parse tree generated by a parser.",
                    "sid": 89,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have experimented with both options.",
                    "sid": 90,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The task can be viewed in two complementary ways: per-class and per-verb type.",
                    "sid": 91,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The per- class perspective takes into consideration the small 5 We ignore subclass distinctions.",
                    "sid": 92,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is justified since in. 98.2% of the in-coverage instances in Semlink, knowing the number of classes relative to the number of types6 . A classifier may gather valuable information for all members of a certain VN class, without seeing all of its members in the training data.",
                    "sid": 93,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From this perspective the task resembles POS tagging.",
                    "sid": 94,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In both tasks there are many dozens (or more) of possible labels, while each word has only a small subset of possible labels.",
                    "sid": 95,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different words may receive the same label.",
                    "sid": 96,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The per-verb perspective takes into consideration the special properties of every verb type.",
                    "sid": 97,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even the best lexicons necessarily ignore certain idiosyncratic characteristics of the verb when assigning it to a certain class.",
                    "sid": 98,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a verb appears many times in the corpus, it is possible to estimate its parameters to a reasonable reliability, and thus to use its specific distributional properties for disambiguation.",
                    "sid": 99,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Viewed in this manner, the task resembles a word sense disambiguation (WSD) task: each verb has a small distinct set of senses (types), and no two different verbs have the same sense.",
                    "sid": 100,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The similarity to WSD suggests that our task might be solved by WN sense disambiguation followed by a mapping from WN to VN.",
                    "sid": 101,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, good results are not to be expected, due to the medium quality of today’s WSD algorithms and because the mapping between WN and VN is both incomplete and many-to-many7 . Even for a perfect WN WSD algorithm, the resulting WN synset may not be mapped to VN at all or may be mapped onto multiple VN classes.",
                    "sid": 102,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We experimented with this method and obtained results below the MF baseline we used8 . The above discussion does not rule out the possibility of obtaining reasonable results through applying a high quality WSD engine followed by a WN to VN mapping.",
                    "sid": 103,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, there are much fewer VN classes than WN classes per verb.",
                    "sid": 104,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This may result in the WSD engine learning many distinctions that are not useful in this context, which may in turn jeopardize its performance with respect to our task.",
                    "sid": 105,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, a word sense may belong to a single verb only while a VN class contains many verbs.",
                    "sid": 106,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, the performance 6 237 classes vs. 4991 types.",
                    "sid": 107,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 In the WN to VN mapping built into VN, 14.69% of the covered WN synsets were mapped to more than a single VN class.",
                    "sid": 108,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 We used the publicly available SenseLearner 2.0, the VB- Collocations model.",
                    "sid": 109,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose VN classes containing the lemma in random when a single mapping is not specified.",
                    "sid": 110,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We obtained 67.74% accuracy on section 00 of the WSJ, which is on a certain lemma may benefit from training instances of other lemmas.",
                    "sid": 111,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that our task is not reducible to VN frame identification (a nontrivial task given the richness of the information used to define a frame in VN).",
                    "sid": 112,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the categorizing criterion for Levin’s classification is the subset of frames the verb may appear in (equivalently, the diathesis alternations the verbal proposition may perform), knowing only the frame in which an instance appears does not suffice, as frames are shared among classes.",
                    "sid": 113,
                    "ssid": 43,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the learning model. ",
            "number": "4",
            "sents": [
                {
                    "text": "As common in supervised learning models, we encode the verb instances into feature vectors and then apply a learning algorithm to induce a classifier.",
                    "sid": 114,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first discuss the feature set and then the learning algorithm.",
                    "sid": 115,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Features.",
                    "sid": 116,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our feature set heavily relies on syntactic annotation.",
                    "sid": 117,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dorr and Jones (1996) showed that perfect knowledge of the allowable syntactic frames for a verb allows 98% accuracy in type assignment to Levin classes.",
                    "sid": 118,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This motivates the encoding of the syntactic structure of the sentence as features, since we have no access to all frames, only to the one appearing in the sentence.",
                    "sid": 119,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since some verbs may appear in the same syntactic frame in different VN classes, a model relying on the syntactic frame alone would not be able to disambiguate instances of these verbs when appearing in those frames.",
                    "sid": 120,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence our features include lexical context words.",
                    "sid": 121,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parse tree enables us to use words that appear in specific syntactic slots rather than in a linear window around the verb.",
                    "sid": 122,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To this end, we use the head words of the neighboring constituents.",
                    "sid": 123,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The definition of the head of a constituent is given in (Collins, 1999).",
                    "sid": 124,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our feature set is comprised of two parallel sets of features.",
                    "sid": 125,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first contains features extracted from the parse tree and the verb’s lemma as a standalone feature.",
                    "sid": 126,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second set, each feature is a conjunction of a feature from the first set with the verb’s lemma.",
                    "sid": 127,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By doing so we created a general feature space shared by all verbs, and replications of it for each and every verb.",
                    "sid": 128,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This feature selection strategy was chosen in view of the two perspectives on the task (per-class and per-verb) discussed in Section 3.",
                    "sid": 129,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our first set of features encodes the verb’s context as inferred from the sentence’s parse tree (Fig Fi rst Fe at ur e Se t T h e st e m m e d h e a d w or d s, P O S, p ar s e tr e e la b el s, fu n ct io n ta g s, a n d or di n al s o f th e v er b’ s ri g ht k r si bl in g s ( k r is th e m a xi m u m n u m b er o f ri g ht si b - li n g s in th e c or p u s. T h es e ar e at m o st 5 k r di ff ere nt fe at ur es ).",
                    "sid": 130,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Th e ste m m ed he ad w or ds, P O S, la be ls, fu nc tio n ta g s a n d or di n al s o f th e v er b’ s le ft kl si bl in g s, a s a b o v e. Th e ste m m ed he ad w or d & P O S of th e ‘se co nd h e a d w o r d ’ n o d e s o n th e le ft a n d ri g ht (s e e te xt f o r p re ci s e d ef in it io n ).",
                    "sid": 131,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Al l of th e ab ov e fe at ur es e m pl oy ed on th e sib li n g s o f th e p ar e nt o f th e v er b ( o nl y if th e v er b’ s p ar e nt is th e h e a d c o n st it u e nt o f it s g ra n d p ar e nt ) Th e nu m be r of rig ht/ lef t sib lin gs of th e ve rb.",
                    "sid": 132,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Th e nu m be r of rig ht/ lef t sib lin gs of th e ve rb’ s pa re nt.",
                    "sid": 133,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Th e pa rse tre e la be l of th e ve rb’ s pa re nt.",
                    "sid": 134,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Th e ve rb’ s vo ice (a cti ve or pa ssi ve ).",
                    "sid": 135,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Th e ve rb’ s le m m a. Figure 1: The first set of features in our model.",
                    "sid": 136,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All of them are binary.",
                    "sid": 137,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final feature set includes two sets: the set here, and a set obtained by its conjunction with the verb’s lemma.",
                    "sid": 138,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ure 1).",
                    "sid": 139,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We attempt to encode both the syntactic frame, by encoding the tree structure, and the argument preferences, by encoding the head words of the arguments and their POS.",
                    "sid": 140,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The restriction on the verb’s parent being the head constituent of its grandparent is done in order to focus on the correct verb in verb series such as ‘intend to run’.",
                    "sid": 141,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 3rd cell in the table makes use of a ‘second head word’ node, defined as follows.",
                    "sid": 142,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider a left sibling (right siblings are addressed analogously) M of the verb’s node.",
                    "sid": 143,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Take the node H in the subtree of M where M ’s head appears.",
                    "sid": 144,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "H is a descendent of a node J which is a child of M . The ‘second head word’ node is J ’s sibling on the right.",
                    "sid": 145,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the sentence We went to school (see Figure 2) the head word of the PP ‘to school’ is ‘to’, and the ‘second head word’ node is ‘school’.",
                    "sid": 146,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rationale is that ‘school’ could be a useful feature for ‘went’, in addition to ‘to’, which is highly polysemous (note that it is also a feature for ‘went’, in the 1st and 2nd cells of the table).",
                    "sid": 147,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The voice feature was computed using a simple heuristic based on the verb’s POS tag (past participle) and presence of auxiliary verbs to its left.",
                    "sid": 148,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NP PRP We S VBD went VP PP TO NP to NN school parser (Charniak and Johnson, 2005) (Note that this parser does not output function tags).",
                    "sid": 149,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parser was also trained on sections 0221 and tuned on section 0010 . Consequently, our adaptation scenario is a full adaptation situation in which both the parser and the VerbNet training data are not in the test domain.",
                    "sid": 150,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that generative parser adaptation Figure 2: An example parse tree for the ‘second head word’ feature.",
                    "sid": 151,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The current set of features does not detect verb particle constructions.",
                    "sid": 152,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We leave this for future research.",
                    "sid": 153,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Learning Algorithm.",
                    "sid": 154,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our learning task can be formulated as follows.",
                    "sid": 155,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let xi denote the feature vector of an instance i, and let X denote the space of all such feature vectors.",
                    "sid": 156,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The subset of possible labels for xi is denoted by Ci, and the correct label by ci ∈ Ci.",
                    "sid": 157,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We denote the label space by S. Let T be the training set of instances T = {< x1, C1 , c1 >, < x2, C2 , c2 >, ..., < xn, Cn, cn > } ⊆ (X × 2S × S)n, where n is the size of the training set.",
                    "sid": 158,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let < xn+1, Cn+1 >∈ (X × 2S ) be a new instance.",
                    "sid": 159,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our task is to select which of the labels in Cn+1 is its correct label cn+1 (xn+1 does not have to be a previously observed lemma, but its lemma must appear in a VN class).",
                    "sid": 160,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The structure of the task lets us apply a learning algorithm that is especially appropriate for it.",
                    "sid": 161,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What we need is an algorithm that allows us to restrict the possible labels of each instance, both in training and in testing.",
                    "sid": 162,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sequential model algorithm presented by Even-Zohar and Roth (2001) directly supports this requirement.",
                    "sid": 163,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the SNOW learning architecture for multi-class classification (Roth, 1998), which contains an implementation of that algorithm 9 .",
                    "sid": 164,
                    "ssid": 51,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental setup. ",
            "number": "5",
            "sents": [
                {
                    "text": "We used SemLink VN annotations and parse trees on sections 0221 of the WSJ Penn Treebank for training, and section 00 as a development set, as is common in the parsing community.",
                    "sid": 165,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We performed two parallel sets of experiments, one using manually created gold standard parse trees and one using parse trees created by a state-of-the-art 9 Experiments on development data revealed that for verbs for which almost all of the training instances are mapped to the same VN class, it is most beneficial to select that class.",
                    "sid": 166,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, where more than 90% of the training instances of a verb are mapped to the same class, our algorithm mapped the instances of the verb to that class regardless of the context.",
                    "sid": 167,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "results are known to be of much lower quality than in-domain results (Lease and Charniak, 2005).",
                    "sid": 168,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The quality of the discriminative parser we used did indeed decrease in our adaptation scenario (Section 7).",
                    "sid": 169,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training data included 71209 VN in-scope instances (of them 41753 polysemous) and the development 3624 instances (2203 polysemous).",
                    "sid": 170,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An ‘in-scope’ instance is one that appears in VN and is tagged with a verb POS.",
                    "sid": 171,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same trained model was used in both the in-domain and adaptation scenarios, which only differ in their test sets.",
                    "sid": 172,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In-Domain.",
                    "sid": 173,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tests were held on sections 01,22,23,24 of WSJ PTB.",
                    "sid": 174,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Test data includes all in- scope instances for which there is a SemLink annotation, yielding 13540 instances, 7798 (i.e., 57.6%) of them polysemous.",
                    "sid": 175,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adaptation.",
                    "sid": 176,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the testing we annotated sentences from GENIA (Kim et al., 2003) (version 3.0.2).",
                    "sid": 177,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The GENIA corpus is composed of MED- LINE abstracts related to transcription factors in human blood cells.",
                    "sid": 178,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We annotated 400 sentences from the corpus, each including at least one in- scope verb instance.",
                    "sid": 179,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We took the first 400 sentences from the corpus that met that criterion11 . After cleaning some GENIA POS inconsistencies, this amounts to 690 in-scope instances (380 of them polysemous).",
                    "sid": 180,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tagging was done by two annotators with an inter-annotator agreement rate of 80.35% and Kappa 67.66%.",
                    "sid": 181,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Baselines.",
                    "sid": 182,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used two baselines, random and most frequent (MF).",
                    "sid": 183,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The random baseline selects uniformly and independently one of the possible classes of the verb.",
                    "sid": 184,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most frequent (MF) baseline selects the most frequent class of the verb in the training data for verbs seen while training, and selects in random for the unseen ones.",
                    "sid": 185,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, it obtains a perfect score over the monosemous verbs.",
                    "sid": 186,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This baseline is a strong one and is common in disambiguation tasks.We repeated all of the setup above in two sce 10 For the very few sentences out of coverage for the parser, we used the MF baseline (see below).",
                    "sid": 187,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "11 Discarding the first 120 sentences, which were used to design the annotator guidelines.",
                    "sid": 188,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "narios.",
                    "sid": 189,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first (main) scenario, in-scope instances were always mapped to VN classes, while in the second (‘other is possible’ (OIP)) scenario, in-scope instances were allowed to be tagged (during training) and classified (during test) as not belonging to any existing VN class12 . In all cases, out-of-scope instances (verbs whose lemmas do not appear in VN) were ignored.",
                    "sid": 190,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the OIP scenario, we used a different ‘other’ label for each of the lemmas, not a single label shared by them all.",
                    "sid": 191,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results. ",
            "number": "6",
            "sents": [
                {
                    "text": "Table 1 shows our results.",
                    "sid": 192,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the overall results, we also show results for the polysemous ones alone, since the task is trivial for the monosemous ones.",
                    "sid": 193,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results using gold standard parses effectively set an upper bound on our model’s performance, while those using statistical parser output demonstrate its current usability.",
                    "sid": 194,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In-Domain.",
                    "sid": 195,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results are shown in the WSJ → WSJ columns of Table 1.",
                    "sid": 196,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using gold standard parses (top), we achieve 96.42% accuracy overall.",
                    "sid": 197,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Over the polysemous verbs, the accuracy is 93.68%.",
                    "sid": 198,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This translates to an error reduction over the MF baseline of 43.35% overall and 43.22% for the polysemous verbs.",
                    "sid": 199,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the ‘other is possible’ scenario (right), we obtained 36.67% error reduction.",
                    "sid": 200,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using a state-of-the-art parser (Charniak and Johnson, 2005) (bottom), we experienced some degradation of the results (as expected), but they remained significantly above baseline.",
                    "sid": 201,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We achieve 95.9% accuracy overall and 92.77% for the polysemous verbs, which translates to about 35.13% and 35.04% error reduction respectively.",
                    "sid": 202,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the OIP scenario, we obtained 28.95% error reduction.",
                    "sid": 203,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of the random baseline for the in- domain scenario are substantially worse than the MF baseline.",
                    "sid": 204,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the WSJ the random baseline scored 66.97% (37.51%) accuracy in the main (OIP) scenarios.",
                    "sid": 205,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adaptation.",
                    "sid": 206,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here we test our model’s ability to generalize across domains.",
                    "sid": 207,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since VN is supposed to be a domain independent resource, we hope to acquire statistics that are relevant across domains as well and so to enable us to automatically map verbs in domains of various genres.",
                    "sid": 208,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are shown in the WSJ → GENIA columns of Table 1.",
                    "sid": 209,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When using gold standard parses, our model scored 73.16%.",
                    "sid": 210,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This translates to about13.17% ER on GENIA.",
                    "sid": 211,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We interestingly experi 12i.e., including instances tagged by SemLink as ‘none’.",
                    "sid": 212,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "enced very little degradation in the results when moving to parser output, achieving 72.4% accuracy which translates to 10.71% error reduction over the MF baseline.",
                    "sid": 213,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The random baseline on GENIA was again worse than MF, obtaining 66.04% accuracy as compared to 69.09% of MF (in the OIP scenario, 39.12% compared to 46.41%).",
                    "sid": 214,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Run-time performance.",
                    "sid": 215,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a parsed corpus, our main model trains and runs in no morethan a few minutes for a training set of ∼60K in stances and a test set of ∼11K instances, using aPentium 4 CPU 2.40GHz with 1GB main mem ory.",
                    "sid": 216,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bottleneck in tagging large corpora using our model is thus most likely the running time of current parsers.",
                    "sid": 217,
                    "ssid": 26,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discussion. ",
            "number": "7",
            "sents": [
                {
                    "text": "In this paper we introduced a new statistical model for automatically mapping verb instances into VerbNet classes, and presented the first large-scale experiments for this task, for both in-domain and corpus adaptation scenarios.",
                    "sid": 218,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using gold standard parse trees, we achieved 96.42% accuracy on WSJ test data, showing 43.35% error reduction over a strong baseline.",
                    "sid": 219,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For adaptation to the GENIA corpus, we showed 13.1% error reduction over the baseline.",
                    "sid": 220,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A surprising result in the context of adaptation is the little influence of using gold standard parses versus using parser output, especially given the relatively low performance of today’s parsers in the adaptation task (91.4% F-score for the WSJ in-domain scenario compared to 81.24% F-score when parsing our GENIA test set).",
                    "sid": 221,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is an interesting direction for future work.",
                    "sid": 222,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we conducted some additional preliminary experiments in order to shed light on some aspects of the task.",
                    "sid": 223,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments reported below were conducted on the development data, given gold standard parse trees.",
                    "sid": 224,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, motivated by the close connection between WSD and our task (see Section 3), we conducted an experiment to test the applicability of using a WSD engine.",
                    "sid": 225,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the experiments listed above, we also attempted to encode the output of a modern WSD engine (the VBCollo- cations Model of SenseLearner 2.0 (Mihalcea and Csomai, 2005)), both by encoding the synset (if exists) of the verb instance as a feature, and by encoding each possible mapped class of the WSD engine output synset as a feature.",
                    "sid": 226,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are k Main Scenario ‘Other is Possible’ (OIP) Scenario WSJ→ WSJ WSJ→ GENIA WSJ→ WSJ WSJ→ GENIA M F Mo del MF Mo del M F Mo del MF Mo del Go ld Std Tot al ER 93.",
                    "sid": 227,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "68 96.",
                    "sid": 228,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "42 43.",
                    "sid": 229,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "35 69.",
                    "sid": 230,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "09 73.",
                    "sid": 231,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "16 13.",
                    "sid": 232,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "17 88.",
                    "sid": 233,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 92.",
                    "sid": 234,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "78 36.",
                    "sid": 235,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "67 46.",
                    "sid": 236,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "41 52.",
                    "sid": 237,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "46 11.",
                    "sid": 238,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "29 Pol y. ER 88.",
                    "sid": 239,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "87 93.",
                    "sid": 240,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "68 43.",
                    "sid": 241,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "22 48.",
                    "sid": 242,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "58 55.",
                    "sid": 243,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "35 13.",
                    "sid": 244,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "17 – – – – – – Par ser Tot al ER 93.",
                    "sid": 245,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "68 95.",
                    "sid": 246,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 35.",
                    "sid": 247,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "13 69.",
                    "sid": 248,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "09 72.",
                    "sid": 249,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 10.",
                    "sid": 250,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "71 88.",
                    "sid": 251,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 91.",
                    "sid": 252,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 28.",
                    "sid": 253,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "95 46.",
                    "sid": 254,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "41 52.",
                    "sid": 255,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "46 11.",
                    "sid": 256,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "29 Pol y. ER 88.",
                    "sid": 257,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "87 92.",
                    "sid": 258,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "77 35.",
                    "sid": 259,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "04 48.",
                    "sid": 260,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "58 55.",
                    "sid": 261,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "35 10.",
                    "sid": 262,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "72 – – – – – – Table 1: Accuracy and error reduction (ER) results (in percents) for our model and the MF baseline.",
                    "sid": 263,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Error reduction is computed as M ODEL− M F . Results are given for the WSJ and GENIA corpora test 100−M F sets.",
                    "sid": 264,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The top table is for a model receiving gold standard parses of the test data.",
                    "sid": 265,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bottom is for a model using (Charniak and Johnson, 2005) state-of-the-art parses of the test data.",
                    "sid": 266,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the main scenario (left), instances were always mapped to VN classes, while in the OIP one (right) it was possible (during both training and test) to map instances as not belonging to any existing class.",
                    "sid": 267,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the latter, no results are displayed for polysemous verbs, since each verb can be mapped both to ‘other’ and to at least one class.",
                    "sid": 268,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "features if there are k possible classes13 . There was no improvement over the previous model.",
                    "sid": 269,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A possible reason for this is the performance of the WSD engine (e.g. 56.1% precision on the verbs in Senseval3 all-words task data).",
                    "sid": 270,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Naturally, more research is needed to establish better methods of incorporating WSD information to assist in this task.",
                    "sid": 271,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, we studied the relative usability of class information as opposed to verb idiosyncratic information in the VN disambiguation task.",
                    "sid": 272,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By measuring the accuracy of our model, first given the per-class features (the first set of features excluding the verb’s lemma feature) and second given the per-verb features (the conjunction of the first set with the verb’s lemma), we tried to address this question.",
                    "sid": 273,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We obtained 94.82% accuracy for the per-class experiment, and 95.51% for the per-verb experiment, compared to 95.95% when using both in the in-domain gold standard scenario.",
                    "sid": 274,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The MF baseline scored 92.45% on this development set.",
                    "sid": 275,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results, which are close in the per-class experiment to those of the MF baseline, indicate that combining both approaches in the construction of the classifier is justified.",
                    "sid": 276,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Third, we studied the importance of having a learning algorithm utilizing the task’s structure (mapping into a large label space where each in 13The mapping is many-to-many and partial.",
                    "sid": 277,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To overcome the first issue, given a WN sense of the verb, we encoded all possible VN classes that correspond to it.",
                    "sid": 278,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To overcome the second, we treated a verb in a certain VN class, for which the mapping to WN was available, as one that can be mapped to all WN senses of the verb.",
                    "sid": 279,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "stance can be mapped to only a small subspace).",
                    "sid": 280,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our choice of the algorithm in (Even-Zohar and Roth, 2001) was done in light of this requirement.",
                    "sid": 281,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We conducted an experiment in which we omitted these per-instance restrictions on the label space, effectively allowing each verb to take every label in the label space.",
                    "sid": 282,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We obtained 94.54% accuracy, which translates to 27.68% error reduction, compared to 95.95% accuracy (46.36% error reduction) when using the restrictions.",
                    "sid": 283,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results indicate that although our feature set keeps us substantially above baseline even without the above algorithm, using it boosts our results even further.",
                    "sid": 284,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result is different from the results obtained in (Girju et al., 2005), where the results of the un- constrained (flat) model were significantly below baseline.",
                    "sid": 285,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As noted earlier, the field of instance level verb classification into Levin-inspired classes is far from being exhaustively explored.",
                    "sid": 286,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We intend to make our implementation of the model available to the community, to enable others to engage in further research on this task.",
                    "sid": 287,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Acknowledgements.",
                    "sid": 288,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would like to thank Dan Roth, Mark Sammons and Ran Luria for their help.",
                    "sid": 289,
                    "ssid": 72,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}