{
    "ID": "C10-2164",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper focuses on the Web-based EnglishChinese OOV term translation pattern, and emphasizes particularly on the translation selection strategy based on the fusion of multiple features and the ranking mechanism based on Ranking Support Vector Machine (Ranking SVM).",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By utilizing the CoNLL2003 corpus for the English Named Entity Recognition (NER) task and selected new terms, the experiments based on different data sources show the consistent results.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our OOV term translation model can “filter” the most possible translation candidates with better ability.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the experimental results for combining our OOV term translation model with EnglishChinese Cross- Language Information Retrieval (CLIR) on the data sets of Text Retrieval Evaluation Conference (TREC), it can be found that the obvious performance improvement for both query translation and retrieval can also be obtained.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "In Cross-Language Information Retrieval (CLIR), most of users’ queries are generally composed of short terms, in which there are many Out-of-Vocabulary (OOV) terms like Named Entities (NEs), new words, terminologies and so on.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation quality of OOV term directly influences the precision of querying relevant multilingual information.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, OOV term translation has become a very important and challenging issue in CLIR.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the increasing growth of Web information which includes multilingual hypertext resources with abundant topics, it appears that Web information can mitigate the problem of the restricted OOV term translation accuracy (Lu and Chien, 2002).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, how to select the correct translations from Web information and locate the appropriate translation resources rapidly is still the main goal for OOV term translation.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, finding the effective feature representation and the optimal ranking pattern for translation candidates is the core part for the Web-based OOV term translation.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper focuses on the Web-based English-Chinese OOV term translation pattern, and emphasizes particularly on the translation selection strategy based on the fusion of multiple features and the translation ranking mechanism based on Ranking Support Vector Machine (Ranking SVM).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By utilizing the CoNLL2003 corpus for the English Named Entity Recognition (NER) task and manually selected new terms in various fields, the established OOV term translation model can “filter” the most possible translation candidates with better ability.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper also attempts to apply the OOV term translation mechanism above in EnglishChinese CLIR.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be observed from the experimental results on the data sets of Text Retrieval Evaluation Conference (TREC) that the obvious performance improvement for query translation can be obtained, which is very beneficial to CLIR and can improve the whole retrieval performance.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "At present, the methods for OOV term translation have changed from the basic pattern based on bilingual dictionary, transliteration or parallel corpus to the intermediate pattern based on comparable corpus (Lee et al., 2006; Shao and Ng, 2004; Virga and Khudanpur, 2003), and 1435 Coling 2010: Poster Volume, pages 1435–1443, Beijing, August 2010 then become a new pattern based on Web mining (Fang et al., 2006; Sproat et al., 2006).",
                    "sid": 15,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In recent years, many researchers have utilized Web to find the translation candidates on webpages (Wu and Chang, 2007).",
                    "sid": 16,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "AlOnaizan and Knight (2002) used Web statistics information to validate the translation candidates generated by language model, and obtained the accuracy of 72.6% in ArabicEnglish OOV word translation.",
                    "sid": 17,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lu and Chien (2004) utilized the statistics information about the anchor texts in Web search results to recognize the translation candidates, and got the accuracy of 63.6% in EnglishChinese title query term translation.",
                    "sid": 18,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhang and Vines (2004) extracted the translation candidates for OOV query terms in CLIR from Web, and improved the performance of EnglishChinese/ChineseEnglish CLIR to some extent.",
                    "sid": 19,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhang et al.",
                    "sid": 20,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2005) searched the translation candidates by using cross-language query expansion and Web, and obtained the Top-1 accuracy of 81.0% in ChineseEnglish OOV word translation.",
                    "sid": 21,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chen and Chen (2006) used the combination of Web statistics and the vocabulary, and acquired the Top-1 accuracy of 87.6% in ChineseEnglish OOV word translation.",
                    "sid": 22,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Jiang et al.",
                    "sid": 23,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) utilized the combination of Web mining, transliteration and ranking based on Maximum Entropy (ME), only focused on EnglishChinese person name translation and got the Top-1 accuracy of 47.5%.",
                    "sid": 24,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the methods above can improve the translation performance for OOV term to a certain degree, there are still three common problems in the OOV term translation based on Web mining.",
                    "sid": 25,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) Chinese key term extraction pattern from Web documents is over complex and the complexity is always higher.",
                    "sid": 26,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of the inherent property of having no segmentation delimitation in Chinese, it’s very difficult for EnglishChinese OOV term translation to extract Chinese key terms from Web documents.",
                    "sid": 27,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cost for the extraction computation is generally overlarge (Wang et al., 2004; Zhang and Vines, 2004).",
                    "sid": 28,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) The feature information for the evaluation of translation candidates is not enough and comprehensive.",
                    "sid": 29,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of OOV term translation methods implement the evaluation for candidates through mining simple local and Boolean features, that is, inherent features in candidates and their surrounding context features.",
                    "sid": 30,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, if only a certain Web document that an OOV term appears is explored, the global information contained in the whole Web document set will be ignored, and the inconsistency and polyse- my of candidates cannot be considered.",
                    "sid": 31,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) The relevance measurement for translation pairs is very simple, or the computation cost is too high.",
                    "sid": 32,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For ranking candidates, most of OOV term translation approaches adopt the simple combination computation of the feature values used, or get assessment based on classification models.",
                    "sid": 33,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, the feature weights are determined according to the corresponding induction and suitable for some specific fields, but cannot guarantee the accuracy of the final translation ranking results.",
                    "sid": 34,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the Ranking SVM model can effectively express multiple ranking constraints, and has better universality and applicability (Cao et al., 2006; Joa- chimes, 2002; Vapnik, 1995).",
                    "sid": 35,
                    "ssid": 21,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "our solutions. ",
            "number": "3",
            "sents": [
                {
                    "text": "To support more precise EnglishChinese OOV term translation, we establish a multiple- feature-based translation pattern based on Web mining and Ranking SVM.",
                    "sid": 36,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the one hand, a Chinese key term extraction strategy is built on the simplified extraction computation for PAT- Tree, in which the optimization processing for the confidence of word building is improved to a certain extent.",
                    "sid": 37,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, translation candidates are chosen by the fusion of multiple features.",
                    "sid": 38,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The representation forms of local, global and Boolean feature are constructed under the consideration of the complex characteristics of English/Chinese OOV term and Web information.",
                    "sid": 39,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, for the relevance measurement between an OOV term to be translated and its translation candidates, the supervised learning based on Ranking SVM is introduced to rank candidates precisely.",
                    "sid": 40,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At first, given an OOV term to be translated as a query, it is input into the Google search engine to acquire the returned webpage snippet set.",
                    "sid": 41,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, Chinese key terms are extracted from the PAT-Tree built on the snippet set to determine the translation candidates.",
                    "sid": 42,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subse quently, local, global and Boolean features are extracted from the candidates based on the fusion of multiple features.",
                    "sid": 43,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the candidates are filtered and ranked through the supervised learning based on Ranking SVM.",
                    "sid": 44,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "chinese key term extraction. ",
            "number": "4",
            "sents": [
                {
                    "text": "In Web mining of EnglishChinese OOV term translation, an important problem is to extract the target translation candidates from the returned Chinese Web documents, which can be considered as a key term extraction task.",
                    "sid": 45,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The PAT-Tree structure is an efficient indexing method in both IR and Information Extraction (IE) domains (Chien, 1997; Gonnet et al., 1992).",
                    "sid": 46,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its superior feature is the Semi Infinite String, which can store all the strings from the whole corpus (i.e., the returned snippet set in this paper) in a binary tree.",
                    "sid": 47,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The branch node indicates the search direction and the leaf node stores the index and frequency for a string.",
                    "sid": 48,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generally, a Chinese character corresponds to a binary-coded form with 2 bytes (16 bits).",
                    "sid": 49,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chinese strings can be transformed into binary strings.",
                    "sid": 50,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is an ending tag for each string and its binary form is “00000000”.",
                    "sid": 51,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Take “中文 信息抽取” (Chinese IE) and “信息检索” (IR) as an example, the binary strings for them are of both two child nodes are added as the frequency of the common string (i.e., the parent branch node).",
                    "sid": 52,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At last, the common strings with the frequency values larger than 2 are extracted as the key terms.",
                    "sid": 53,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the PAT-Tree in Figure 2, there is a branch node with the Comp-bit value of 37, which indicates that at least the prefixes of two strings contain two identical characters.",
                    "sid": 54,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be known from the leaf nodes that two strings are “信息抽取” (IE) and “信息检索”(IR).",
                    "sid": 55,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, the prefix substring “信息” (in formation) with the frequency of 2 is extracted as the common string.",
                    "sid": 56,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the key terms with the arbitrary lengths and frequency values can be retrieved from the built PAT-Tree.",
                    "sid": 57,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, with the common strings being extracted, large amounts of noisy terms and fragments are also extracted.",
                    "sid": 58,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To filter noisy fragments, Wang et al.",
                    "sid": 59,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) used SPDCD and the Local-Maxima algorithm, but the computation cost was too expensive.",
                    "sid": 60,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the simplified filtering manner is adopted here: described in Figure 1.",
                    "sid": 61,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus a PAT-Tree can be built based on these strings, as shown in Figure α(ci Lcj ) = f (ci Lcj )− f (c1Lcn) f (ci Lcj ) (1) 2.",
                    "sid": 62,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The branch node stands for the comparison.",
                    "sid": 63,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "bit (Comp-bit), which represents the position of different bit in binary strings.",
                    "sid": 64,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some binary strings have the value of 0 in such a bit and are classified into the left branch, while others have 1 and turn to the right branch.",
                    "sid": 65,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1.",
                    "sid": 66,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Binary string representation instantiation.",
                    "sid": 67,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2.",
                    "sid": 68,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PAT-Tree Instantiation for Figure 1.",
                    "sid": 69,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the extraction process, the PAT-tree is traversed first, and the branch nodes with the Comp-bit values larger than 32 are selected.",
                    "sid": 70,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because the minimum length of a Chinese common string is 2 characters and each has 16 binary bits.",
                    "sid": 71,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, the frequency valueswhere c1…cn is a n-gram that contains the substring ci…cj; ci…cj is the n-1-gram to be esti mated, i.e., ci…cj=c1…cn1 or ci…cj=c2…cn; f( ) denotes the string frequency; α represents the cohesion factor of the n-1-gram string, that is, the ability of independent word building.",
                    "sid": 72,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The closer to 1 the value of α is, the more possible meaningful key term ci…cj is.",
                    "sid": 73,
                    "ssid": 29,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "multiple feature representation. ",
            "number": "5",
            "sents": [
                {
                    "text": "Local Feature (LF) is constructed based on neighboring tokens and the token itself.",
                    "sid": 74,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are two types of contextual information to beconsidered when extracting LFs, namely inter nal lexical and external contextual information.",
                    "sid": 75,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) Term length (Len) – Aims to consider the length of the translation candidate.",
                    "sid": 76,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Phonetic Value (PV) – Aims to investigate the phonetic similarity between an OOV termand its translation candidates.",
                    "sid": 77,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because the as sociated syllabification representations can often be found between Chinese and English syllables with fewer ambiguities, the syllabification has become an effective channel in phonetic feature expression.",
                    "sid": 78,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PV means that for measuring the edit distance similarity between the syllabification sequences of an OOV term and its candidates, the processing is executed according to the specific linguistic rules.",
                    "sid": 79,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Global Feature (GF) is extracted from other occurrences of the same or similar tokens in PV (S , T ) = 1 − EditDist (S OOV ' , TOOV ') (2) the Web docume nt set.",
                    "sid": 80,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The commo n case in OOV OOV Len (S OOV ')+ Len (TOOV ')the Web based OOV term translation is that where SOOV and TOOV denote the OOV term in the source language and its translation candidate in the target language respectively, SOOV’ and TOOV’ are the character strings after the syllabification and removing the vowels, EditDist( , ) indicates the edit distance between two strings, and Len( ) is the string length.",
                    "sid": 81,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) Length Ratio of OOV Term and Its Translation Candidate (LR) – Aims to explore the composition possibility that the extracted key term can be regarded as the translation for an OOV term.",
                    "sid": 82,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An OOV term and its translation should have the similar length, so the LR value is close to 1 as possible.",
                    "sid": 83,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Chinese term is segmented into significant pieces first, and the number of pieces is taken as its length.",
                    "sid": 84,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “非典型肺炎” (SARS) is segmented into “非” (non), “典型” (typical) and “肺炎” (pneumonia), and its length is 3.",
                    "sid": 85,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For an English term, the number of words is counted as the length.",
                    "sid": 86,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If there is only one word composed of capital letters, its length is defined as the number of letters, e.g., “SARS” has the length of 4.",
                    "sid": 87,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the LR value of “SARS” the translation candidates in the previous parts of Web documents will often occur with the same or similar forms in the latter parts.",
                    "sid": 88,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The contextual information from the same and other Web documents may play an important role in determining the final translation.",
                    "sid": 89,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To utilize such global information, GFs are constructed based on the characteristics of Web documents.",
                    "sid": 90,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) Global Term Frequency (G_Freq) – Aims to utilize the frequency information that an OOV term and its translation candidates appear in the Web document set.",
                    "sid": 91,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is always the most important feature and includes four parameters.",
                    "sid": 92,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "FreqSOOV denotes the frequency of SOOV in all the returned webpage snippets.",
                    "sid": 93,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TFTOOV indicates the number of TOOVs in all the snippets.",
                    "sid": 94,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DFTOOV represents the number of snippets that contain TOOV.",
                    "sid": 95,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CO_Freq means the number of snippets that contain both SOOV and TOOV, i.e, co-occurrence frequency.",
                    "sid": 96,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Chi-Square (χ2) Feature Value (CV) – Aims to evaluate the semantic similarity between an OOV term and its translation candidates by their occurrence in Web documents.",
                    "sid": 97,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and its candidate “非典型肺炎” is 4/3=1.3.",
                    "sid": 98,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CV 2 (SOOV , TOOV ) N × (a × d − b × c )2 = (a + b)× (a + c )× (b + d )× (c + d ) (4)(4) Phonetic and Semantic Integration Fea ture (P&S_IF) – Aims to consider the phonetic information and senses of an OOV term and its candidates synthetically.",
                    "sid": 99,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is set up for mul- ti-word OOV terms, especially for NEs and new terms.",
                    "sid": 100,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each constituent can be translated by the phonetic information or senses.",
                    "sid": 101,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P & S _ IF (SOOV , TOOV ) LScore(SOOV , TOOV )+ PV (SOOV ' ', TOOV ' ') where a is the number of snippets that contain both SOOV and TOOV, b is the number of snippets that contain SOOV but do not contain TOOV, c is the number of snippets that do not contain SOOV but contain TOOV, d is the number of snippets that do not contain neither of SOOV and TOOV, and N=a+b+c+d.",
                    "sid": 102,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) Co-occurrence Distance (CO_Dist) – = LScore(S OOV , TOOV )+ 1 (3) Aims to investigate the distance between an OOV term and its candidates in Web docu where LScore( , ) is the matching word number of non-transliteration words in SOOV and TOOV, while SOOV’’ and TOOV’’ are the remaining strings of SOOV and TOOV after computing LScore.",
                    "sid": 103,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, given SOOV “Capitoline Museum” and its TOOV “卡比多里尼博物馆” (Capitoline Museum), the non-transliteration words “Museum” and “博物馆” (museum) are matched, then LScore(SOOV, TOOV)=1; the PV value between the remaining strings “Capitoline” and “卡比多里尼” (Capitoline) is 0.8, so the final P&S_IF value is 1.8/2=0.9.",
                    "sid": 104,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ments.",
                    "sid": 105,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This distance is often very closer.",
                    "sid": 106,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each snippet that contains both SOOV and TOOV, three positions are considered, that is, the first position that SOOV and TOOV appear (p1), the second position (p2) and the last one (p3).",
                    "sid": 107,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following snippet, SOOV is “AARP” andTOOV is “美国退休者协会” (America Associa tion of Retired Persons, AARP).",
                    "sid": 108,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "p1SOOV=6, p2SOOV=62, p3SOOV=97; p1TOOV=54, p2TOOV=-1, p3TOOV=54.",
                    "sid": 109,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The position is indexed from 0 and p2TOOV=-1 means only one candidate exists in the snippet.",
                    "sid": 110,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then the nearest position pair p2SOOV and p1TOOV can be found for this example.",
                    "sid": 111,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distance Dist between SOOV and TOOV is computed as: “TOOV (SOOV)” or “SOOV (TOOV)”, then this feature is set as 1.",
                    "sid": 112,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4) Special Mark Word (SMW) – This is an intuitive feature.",
                    "sid": 113,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Within a certain co-occurrence distance (usually less than 10 characters) between an OOV term and its can Dist(S T ) = ⎧piSOOV − pjTOOV − Len(TOOV ), pi > pj OOV OOV didate s, if there is such a term like “全称 ” (full OOV , OOV ⎨pj − pi − Len(S ), pi < pj (5) ⎩ TOOV SOOV OOV SOOV TOOV name), “叫” (be named as), “译为” (be trans Given the example above, Dist=p2SOOVp1TOOV-7 =6254-7=1, that is, SOOV and TOOV are a left bracket ‘(’ apart.",
                    "sid": 114,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the average distance CODist in the snippet set can be computed as: CO _ Dist(SOOV , TOOV ) = AVG _ Dist(SOOV , TOOV ) Sum(Dist ) lated as …), “名称” (name), or “(或/又)称为” ((or/also) be called as …), or within 5 characters if there are some punctuations like “( )”, “[ ]” and “（）”, then this feature is set as 1.",
                    "sid": 115,
                    "ssid": 42,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "ranking based on ranking svm. ",
            "number": "6",
            "sents": [
                {
                    "text": "= CO _ Freq(S OOV , TOOV ) (6) For the OOV term translation based on Web where Sum( ) is the sum of Dist in each snippet.",
                    "sid": 116,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4) Rank Value (RV) – Aims to consider the rank for translation candidates in the Web document set.",
                    "sid": 117,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It includes five parameters.",
                    "sid": 118,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Top_Rank (T_Rank) is the rank of the snippet that first contains TOOV and given by the search engine.",
                    "sid": 119,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Average_Rank (A_Rank) is the average position of TOOV in the returned snippets.",
                    "sid": 120,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "mining, another difficulty is how to evaluate the relevance between an OOV term and its translation candidates, that is, how to rank the translation candidates from “best” to “worst”.",
                    "sid": 121,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The candidate ranking can be regarded as a binary classification problem.",
                    "sid": 122,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, usually only highly related fragments of OOV terms can be found, rather than their correct A _ Rank(T ) = Sum(Rank ) (7) translations.",
                    "sid": 123,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of regarding the candidate OOV DF OOV (TOOV ) ranking as binary classification, it is solved as where Sum( ) denotes the rank sum of each snippet.",
                    "sid": 124,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Simple_Rank (S_Rank) is computed as S_Rank(TOOV)=TFTOOV(TOOV)*Len(TOOV), which aims at investigating the impact of the frequency and length of TOOV on ranking.",
                    "sid": 125,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "R_Rank is utilized as a comparison basis.",
                    "sid": 126,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "an Ordinal Regression problem.",
                    "sid": 127,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ranking SVM maps different objects into a certain kind of order relation.",
                    "sid": 128,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The key is modeling the judgements for user’s preferences, and then the constraint relations for ranking can be derived (Herbrich et al., 1999; Xu et al., 2005).",
                    "sid": 129,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "R _ Rank(T ) = β × TOOV + (1 − β )× TFT (TOOV ) (8) For a given OOV term SOOV, if there are two OOV MAX _WL FreqS OOV (SOOV ) translation candidates T OOVi and T OOVj, the pre where β is set as 0.25 empirically, |TOOV| is the length of TOOV, and MAX_WL denotes the maximum length of candidate terms.",
                    "sid": 130,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DF_Rank (D_Rank) is similar to S_Rank and computed as D_Rank(TOOV)=DFTOOV(TOOV)*Len(TOOV).",
                    "sid": 131,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ference judgement can be formulated as TOOVi>SOOVTOOVj.",
                    "sid": 132,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus more training samples are constructed, which contain multiple constraint features.",
                    "sid": 133,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The preference judgement can be transformed into the feature function as: Boolean Feature (BF) is a binary feature and f (w, T , S ) > S f (w, T , S ) (9) equivalent to a heuristic rule designed for the particular relationship between an OOV term and its translation candidates.",
                    "sid": 134,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BFs are used to where w is a parameter and represented as a n- dimensional vector w={w1, w2, …, wn}.",
                    "sid": 135,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This feature function can also be expressed as: explore the different occurrence forms with f (w, T , S p ) = ∑ w LF (T , S )+ higher possibility for the translation candidates OOV q OOV k k k =1 n OOV OOV in Web documents.",
                    "sid": 136,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) Position Distance with ∑ wl GFl (TOOV , SOOV )+ ∑ wm BFm (TOOV , SOOV ) (10) OOV Term (PD_SOOV) – If TOOV occurs close l = p +1 m =q +1 to SOOV (within 10 characters), then this feature is set as 1, else -1.",
                    "sid": 137,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Neighbor Relationship with OOV Term (NR_SOOV) – If TOOV occurs prior or next to SOOV, then this feature is set as 1.",
                    "sid": 138,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) Bracket Neighbor Relationship with OOV Term (BNR_SOOV) – If TOOV locates where LFk( , ), GFl( , ) and BFm( , ) are the local, global and Boolean feature representa tion respectively.",
                    "sid": 139,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These three kinds of feature representation are incorporated as a whole and represented as a feature function family with the multidimensional feature vector in (11).",
                    "sid": 140,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "prior or next to SOOV and occurs with the form f (w, TOOV , SOOV ) = w ⋅ h(TOOV , SOOV ) (11) That is the ranking results for candidates.",
                    "sid": 141,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the relevance for each feature vector x (translation candidate) containing a group of features can be evaluated through Ranking SVM.",
                    "sid": 142,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiment and analysis. ",
            "number": "7",
            "sents": [
                {
                    "text": "7.1 Data Set and Evaluation Metrics.",
                    "sid": 143,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the performance evaluation, 4,593 English NEs are selected from the English corpus of the NER task in CoNLL2003.",
                    "sid": 144,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The test set contains 446 Person Names (PRNs), 329 Location Names (LCNs) and 455 Organization Names (OGNs), and the remaining is taken as the training set (including 1,137 PRNs, 1,152 LCNs and 1,074 OGNs) through manually tagging.",
                    "sid": 145,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, 300 English new terms are chosen randomly from 9 categories, including movie name, book title, brand name, terminology, idiom, rare animal name, rare PRN and OGN.",
                    "sid": 146,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such terms are used to investigate the generalization ability of our model.",
                    "sid": 147,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Top-N-Inclusion-Rate is used as a measurement for the translation performance.",
                    "sid": 148,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a set of OOV terms to be translated, its Top-N- Inclusion-Rate is defined as the percentage of the OOV terms whose translations could be found in the first N extracted translations.",
                    "sid": 149,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.2 Experiment on Parameter Setting.",
                    "sid": 150,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Chinese key term extraction, the test on the threshold α is performed.",
                    "sid": 151,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Figure 3, when the lower bound of α is set as 0.4, the best performance can be achieved.",
                    "sid": 152,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3.",
                    "sid": 153,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results for α value setting.To get the most relevant candidates into top 10 before the final ranking, an initial ranking test is performed on S_Rank, R_Rank and D_Rank.",
                    "sid": 154,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be seen from Figure 4 that D_Rank exhibits the better performance.",
                    "sid": 155,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 4.",
                    "sid": 156,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results for initial ranking manner.",
                    "sid": 157,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To find how many returned webpage snippets are suitable for the translation acquisition, the test on the snippet number is performed.",
                    "sid": 158,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Figure 5, the best performance can be obtained by using 200 snippets.",
                    "sid": 159,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 5.",
                    "sid": 160,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results for webpage snippet number.",
                    "sid": 161,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.3 Experiment on Multiple Feature Fusion.",
                    "sid": 162,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To verify the effectiveness for multiple feature fusion, the test on the feature combination for OOV term translation is implemented.",
                    "sid": 163,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Table 1, the highest accuracy (the percentage of the correct translations in all the extracted translations) of 83.1367% can be acquired by using all the features.",
                    "sid": 164,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "-LR -P IF -CV Table 1.",
                    "sid": 165,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results for feature combination.",
                    "sid": 166,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Table 1, ‘-’ before the specific feature denotes that the OOV term is translated by combining all the other features except this feature; “Reduction” represents the difference value between the translation accuracy obtained by using all the features and that by removing a specific feature.",
                    "sid": 167,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The positive “Reduction” indicates that the accuracy is improved after removing a specific feature, while the negative shows the accuracy is decreased.",
                    "sid": 168,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be seen from Table 1 that for mining the translations for OOV terms, the most important three features are PV, P&S_IF and BNR, then LR, Len and CO_Dist.",
                    "sid": 169,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As for the frequency feature, its contribution is limited, because many translation candidates with higher PV or P&S_IF values are the terms with low frequency.",
                    "sid": 170,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that PV and P&S_IF play a very crucial role in mining the translation candidates with low frequency.",
                    "sid": 171,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, the contribution degree of CV is also positive.",
                    "sid": 172,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, when training based on only the features that are beneficial to the whole translation performance, the best translation accuracy is 83.1243%, which is worse than that by combining all the features.",
                    "sid": 173,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From a view of the effect of the single feature on the whole translation performance, some features may have slightly negative impact.",
                    "sid": 174,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, through combining all the features, the multiple feature fusion mechanism can indeed efficiently improve the translation accuracy.",
                    "sid": 175,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.4 Experiment on OOV Term Translation.",
                    "sid": 176,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some translation examples based on different ranking patterns are given in Table 2, in which the score represents the correlation degree between the translation pair.",
                    "sid": 177,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The closer to -1 the score is, the more irrelevant the translation pair is; while the closer to 3 the score is, the more relevant the translation pair is. conventional ranking strategies, and Ranking SVM is superior to SVM and ME for translation candidate ranking.",
                    "sid": 178,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the contrast between our model and Jiang’s method, it can be found that our approach is superior to Jiang’s and the better performance can be achieved based on the fusion of multiple features proposed in this paper.",
                    "sid": 179,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Meanwhile, it can also be observed from Table 3 that the performance for LCN and OGN translation is better, while the best performance is obtained for PRN translation.",
                    "sid": 180,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that our translation model is sensitive to the category and the popularity degree of OOV term to some extent.",
                    "sid": 181,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to test the translation performance for the other kinds of English OOV term, another test is performed based on the OOV new terms selected randomly from 9 categories.",
                    "sid": 182,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experimental results are shown in Table 4.",
                    "sid": 183,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4.",
                    "sid": 184,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results for other OOV terms.",
                    "sid": 185,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the translations for some OOV terms based on different translation manners are compared, including our proposed model, Google Translate and the Live Trans translation model developed by WKD Lab at National Taiwan University, as shown in Table 5.",
                    "sid": 186,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2.",
                    "sid": 187,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "OOV term translation examples.",
                    "sid": 188,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, Jiang et al.",
                    "sid": 189,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) utilized the combination of Web mining, transliteration and ME-based ranking to implement EnglishChinese PRN translation, which is very similar to our approach.",
                    "sid": 190,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To make a contrast with it, we accomplished this method on the same data set.",
                    "sid": 191,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The comparison results are shown in Table 3.",
                    "sid": 192,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3.",
                    "sid": 193,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance comparison results.",
                    "sid": 194,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the experimental results above, it can be concluded that the ranking based on the supervised learning significantly outperforms the Red Mansio Table 5.",
                    "sid": 195,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparison for different translation manners.",
                    "sid": 196,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results above demonstrate that our model can be applicable to all kinds of OOV terms and has better translation performance.",
                    "sid": 197,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.5 Experiment on EnglishChinese CLIR.",
                    "sid": 198,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To explore the applicability and usefulness of our OOV term translation model in EnglishChinese CLIR, four CLIR runs based on long query (terms in both title and description fields) and short query (only terms in the title field) are carried out on the English topic set (25 topics) and Chinese corpus (127,938 documents) from TREC9.",
                    "sid": 199,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) E-C_LongCLIR1 – using long query and the bilingual-dictionary-based query translation; (2) E-C_LongCLIR2 – using long query, the bilingual-dictionary-based query translation and our OOV term translation; (3) E-C_ShortCLIR1 – using short query and the bilingual-dictionary-based query translation; (4) E-C_ShortCLIR2 – using short query, the bilingual-dictionary-based query translation and our OOV term translation.",
                    "sid": 200,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Precision-Recall curves and Median Average Precision (MAP) values are shown in Figure 6.",
                    "sid": 201,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 6.",
                    "sid": 202,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results for EnglishChinese CLIR combining our OOV term translation model.",
                    "sid": 203,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be seen from Figure 6 that the best run is E-C_LongCLIR2, and its results exceed those by another run E-C_LongCLIR1 based on long query.",
                    "sid": 204,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By adopting both query translation based on bilingual dictionary and OOV term translation, the EnglishChinese CLIR for long query has gained the significant improvement on the whole retrieval performance.",
                    "sid": 205,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared with the traditional query translation based on bilingual dictionary, such a combination manner is exactly a better way for query translation from the source language to the target language.",
                    "sid": 206,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, through comparing the results for the other two runs E- C_ShortCLIR1 and E-C_ShortCLIR2 based on short query, it can also be further confirmed that our OOV term translation mechanism can also support CLIR for short query effectively.",
                    "sid": 207,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.6 Analysis and Discussion.",
                    "sid": 208,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Through analyzing the results for translation extraction and ranking, it can be found that the translation quality is highly related to the following aspects.",
                    "sid": 209,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) The translation results are associated with the search engine used, especially for some specific OOV terms.",
                    "sid": 210,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, given an OOV term “Cross-Strait Three-links”, the mining result based on Google in China is “两岸大三通”, while some meaningless information is mined by Live Trans.",
                    "sid": 211,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Some terms are conventional terminologies and cannot be translated literally.",
                    "sid": 212,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “Woman PaceSetter”, a proper noun with the Chinese characteristic, should be translated into “三八红旗手”, rather than “女 子的步伐” (women’s pace) or “制定” (estab lishment) given by Google Translate.",
                    "sid": 213,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) The proposed model is sensitive to the notability degree of OOV term.",
                    "sid": 214,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This phenomenon is the main reason why there is obvious difference among the translation performance for PRN, LCN and OGN.",
                    "sid": 215,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4) There is a “fragment effect” in PAT-Tree-based Chinese key term extraction.",
                    "sid": 216,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fragments of Chinese terms have become the main noisy data.",
                    "sid": 217,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such a problem should be solved by setting the specific threshold for additional features like heuristic rules and occurrence distance.",
                    "sid": 218,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5) Word Sense Disambiguation (WSD) should be added to improve the translation performance.",
                    "sid": 219,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although most of OOV terms have a unique semantic definition, there are still a few OOV terms with ambiguity, e.g., “AARP” (American Association of Retired Persons or AppleTalk Address Resolution Protocol).",
                    "sid": 220,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(6) The ranking pattern based on the supervised learning is able to synthesize various feature representations for translation candidates.",
                    "sid": 221,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the rank for a candidate can be precisely predicted through tagging and training.",
                    "sid": 222,
                    "ssid": 80,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "8",
            "sents": [
                {
                    "text": "In this paper, the proposed model improves the acquirement ability for OOV term translation through Web mining, and solves the translation pair selection and evaluation in a novel way by fusing multiple features and introducing the supervised learning based on Ranking SVM.",
                    "sid": 223,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, it is significant to apply the key techniques in machine translation into OOV term translation, such as OOV term recognition, statistical machine learning, alignment of sentence and phoneme, and WSD.",
                    "sid": 224,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All these aspects will be our research focus in the future.",
                    "sid": 225,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "This work is supported by National Natural Science Fund of China (No. 60773124), Shanghai Natural Science Fund (No. 09ZR1403000), National Science and Technology Pillar Program of China (No. 2007BAH09B03), 973 Program of China (No. 2010CB327906), Shanghai Municipal R&D Foundation (No. 08dz1500109) and Shanghai Key Laboratory of Intelligent Information Processing.",
                    "sid": 226,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cheng Jin from Fudan University is the corresponding author.",
                    "sid": 227,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}