{
    "ID": "C10-2101",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "In this paper, we present a two-stage approach to acquire Japanese unknown morphemes from text with full POS tags assigned to them.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first acquire unknown morphemes only making a morphology- level distinction, and then apply semantic classification to acquired nouns.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One advantage of this approach is that, at the second stage, we can exploit syntactic clues in addition to morphological ones because as a result of the first stage acquisition, we can rely on automatic parsing.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Japanese semantic classification poses an interesting challenge: proper nouns need to be distinguished from common nouns.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is because Japanese has no orthographic distinction between common and proper nouns and no apparent morphosyntactic distinction between them.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We explore lexico-syntactic clues that are extracted from automatically parsed text and investigate their effects.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "A dictionary plays an important role in Japanese morphological analysis, or the joint task of segmentation and part-of-speech (POS) tagging (Kurohashi et al., 1994; Asahara and Mat- sumoto, 2000; Kudo et al., 2004).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Like Chinese and Thai, Japanese does not delimit words by white-space.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This makes the first step of natural language processing more ambiguous than simple POS tagging.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accordingly, morphemes in a predefined dictionary compactly represent our knowledge about both segmentation and POS.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One obvious problem with the dictionary-based approach is caused by unknown morphemes, or morphemes not defined in the dictionary.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even though, historically, extensive human resources were used to build high-coverage dictionaries (Yokoi, 1995), texts other than newspaper articles, in particular web pages, contain a large number of unknown morphemes.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These unknown morphemes often cause segmentation errors.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, morphological analyzer JU MAN 6.01 wrongly segments the phrase “さっぽ ろ駅” (saQporo eki, “Sapporo Station”), where “ さっぽろ” (saQporo) is an unknown morpheme, as follows: “さ” (sa, noun-common, “difference”), “っ” (Q, UNK), “ぽ” (po, UNK), “ろ” (ro, noun-common, “sumac”) and “駅” (eki, noun-common, “station”), where UNK refers to unknown morphemes automatically identified by the analyzer.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such an erroneous sequence has disastrous effects on applications of morphological analysis.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, it can hardly be identified as a LOCATION in named entity recognition.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One solution to the unknown morpheme problem is unknown morpheme acquisition (Mori and Nagao, 1996; Murawaki and Kurohashi, 2008).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is the task of automatically augmenting the dictionary by acquiring unknown morphemes from text.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the above example, the goal is to acquire the morpheme “さっぽろ” (saQporo) with the POS tag “noun-location name.” However, unknown morpheme acquisition usually adopts a coarser POS tagset that only represents the morphology level distinction among noun, verb and adjective.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that “さっぽろ” (saQporo) is acquired as just a noun and that the semantic label “location name” remains to be assigned.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason only the morphology level distinction is made is 1 http://nlp.kuee.kyoto-u.ac.jp/ nl-resource/juman-e.html 876 Coling 2010: Poster Volume, pages 876–884, Beijing, August 2010 that the semantic level distinction cannot easily be captured with morphological clues that are exploited in unknown morpheme acquisition.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we investigate the remaining problem and introduce the new task of semantic classification that is to be applied to automatically acquired nouns.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this task, we can exploit syntactic clues in addition to morphological ones because, as a result of acquisition, we can now rely on automatic parsing.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For exam ple, since text containing “さっぽろ” (saQporo, noun-unclassified) is correctly segmented, we can extract not only the phrase “saQporo station,” but the tree fragment “ϕ go to saQporo,” and we can determine its semantic label.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Japanese semantic classification poses an interesting challenge: proper nouns need to be distinguished from common nouns.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Like Chinese and Thai, Japanese has no orthographic distinction between common and proper nouns as there is no such thing as capitalization.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, there seems no morphosyntactic (i.e. grammatical) distinction between them.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we explore lexico-syntactic clues that can be extracted from automatically parsed text.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We train a classification model on manually registered nouns and apply it to automatically acquired nouns.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then investigate the effects of lexico-syntactic clues.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "semantic classification task. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Two-Stage Approach to Unknown.",
                    "sid": 31,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Morpheme Acquisition Our goal is to identify unknown morphemes in un- segmented text and assign POS tags to them.",
                    "sid": 32,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we omit the details of boundary identification (segmentation) and review the Japanese POS tagset to see why we propose a two-stage approach to assign full POS tags.",
                    "sid": 33,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Japanese POS tagset derives from traditional grammar.",
                    "sid": 34,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is a mixture of several linguistic levels: morphology, syntax and semantics.",
                    "sid": 35,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, information encoded in a POS tag is more than how the morpheme behaves in a sequence of morphemes.",
                    "sid": 36,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, POS tags given to predefined morphemes are useful for applications of morphological analysis, such as dependency parsing (Kudo and Matsumoto, 2002), named entity recognition (Asahara and Matsumoto, 2003; Sasano and Kurohashi, 2008) and anaphora resolution (Iida et al., 2009; Sasano and Kurohashi, 2009).",
                    "sid": 37,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In these applications, POS tags are incorporated as features for models.",
                    "sid": 38,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, the mixed nature of the POS tagset poses a challenge to unknown morpheme acquisition.",
                    "sid": 39,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous approaches (Mori and Nagao, 1996; Murawaki and Kurohashi, 2008) directly or indirectly reply on morphology, or our knowledge on how a morpheme behaves in a sequence of morphemes.",
                    "sid": 40,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that semantic level distinction is difficult to make in these approaches, and in fact, is left unresolved.",
                    "sid": 41,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To be specific, nouns are only distinguished from verbs and adjectives but they have subcategories in the original tagset.",
                    "sid": 42,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are what we try to classify acquired nouns into in this paper.",
                    "sid": 43,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Semantic Labels.",
                    "sid": 44,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Japanese noun subcategories may require an explanation since they are different from the English ones (Marcus et al., 1993) in many respects.",
                    "sid": 45,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Singular and mass nouns are not distinguished from plural nouns because Japanese has no grammatical distinction between them.",
                    "sid": 46,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More importantly for this paper, proper nouns have sub- categories such as person name, location name and organization name in addition to the distinction from common nouns.",
                    "sid": 47,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These subcategories provide important information to named entity recognition among other applications.",
                    "sid": 48,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For proper nouns, we adopt these subcategories as semantic labels in our task.",
                    "sid": 49,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast to proper nouns, common nouns have only one subcategory “common.” However, we consider that subcategories of common nouns similar to those of proper nouns are useful for, for example, anaphora resolution (Sasano and Kurohashi, 2009).",
                    "sid": 50,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopt the “categories” of morphological analyzer JUMAN, with which common nouns in its dictionary are annotated.",
                    "sid": 51,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are 22 “categories” including PERSON, ORGANIZATION and CONCEPT.",
                    "sid": 52,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We collapse these “categories” into coarser semantic labels that roughly correspond to those for proper nouns.",
                    "sid": 53,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To sum up, we define 9 semantic labels as shown Table 1: List of semantic labels.",
                    "sid": 54,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "lab els P / C s o u r c e s 1 m an ua lly re gi st er ed n o u n s a ut o m at ic al ly a c q ui re d n o u n s PSN P pr o p er sub PO S:p ers on na me 松 井 (m ats ui, a sur na me ) ジ ョ ー ジ (joˆ ji, “G eo rg e”) 佐 祐 理 (sa yuri , a giv en na me ) キ ョ ン (ky oN, a nic kn am e) LOC P sub PO S:p lac e na me 京 都 (ky out o, “K yot o”) ド イ ツ (do itsu , “G er ma ny” ) ア キ バ (ak iba , “A kih ab ara ”) ワ イ キ キ (w aiki ki, “W aik iki” ) O RG P su bP OS :or ga niz ati on na me 日 銀 (nic higi n, a ba nk) N HK (a br oa dc ast er) マ ツ ダ (m ats ud a, “M az da” ) ヤ フ ー (ya huˆ , “Y ah oo” ) OTH P sub PO S:p rop er no un 平 成 (hei sei, an era na me ) ス ラ ブ (su rab u, “Sl av” ) ジ プ シ ー (jip us hˆı, “G yp sy” ) PSN C co m mo n cat eg ory :P ER S O N 先 生 (se Nse i, “te ac he r”) ス タ ッ フ (su taQ fu, “st aff ”) メ ル 友 (m eru to mo , “ke yp al”) ニ ー ト (nˆıt o, “N EE T”) LOC C cat eg ory :PL ACE ∗2 職 場 (sh oku ba, “of fic e”) カ フ ェ (ka fe, “ca fe” ) 囲 炉 裏 (iro ri, “he art h”) 圃 場 (ho jou , “fa rm fiel d”) O RG C cat eg ory :O RG AN IZ AT IO N 政 府 (se ifu, “g ov er nm ent ”) チ ー ム (chˆ ım u, “te am ”) メ ー カ (me ˆka , “m an ufa ctu rer ”) 弊 所 (he ish o, “ou r offi ce” ) A NI -C cat eg ory :A NI MA L an d cat eg ory :A NI M AL PA RT 犬 (in u, “d og ”) 顔 (ka o, “fa ce” ) チ ワ ワ (chi wa wa, “C hih ua hu a”) マ ン タ (m aNt a, “m ant a”) OTH C oth er cat eg ori es 主 張 (sh uch ou, “ar gu me nt” ) 枕 (m ak ura , “pil lo w” ) 甚 平 (jiN bei , a kin d of clo thi ng) 着 メ ロ (ch aku me ro, “rin gto ne” ) 1 A subPOS refers to a subcategory of noun.",
                    "sid": 55,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, PSN-P corresponds to the POS tag “noun-person name”.",
                    "sid": 56,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 category:PLACE-INSTITUTION, category:PLACE-INSTITUION PART and others.",
                    "sid": 57,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "in Table 1.",
                    "sid": 58,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Related Tasks.",
                    "sid": 59,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A line of research is dedicated to identify unknown morphemes with varying degrees of identification.",
                    "sid": 60,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Asahara and Matsumoto (2004) only focus on boundary identification (segmentation) of unknown morphemes.",
                    "sid": 61,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mori and Nagao (1996), Nagata (1999) and Murawaki and Kurohashi (2008) assign POS tags at the morphology level.",
                    "sid": 62,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Uchimoto et al.",
                    "sid": 63,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2001) assign full POS tags but unsurprisingly the accuracy is low.",
                    "sid": 64,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nakagawa and Matsumoto (2006) also assign full POS tags.",
                    "sid": 65,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They address the fact that local information used in previous studies is inherently insufficient and present a method that uses global information, in other words, takes into consideration all occurrences of each unknown word in a document.",
                    "sid": 66,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They report an improvement in tagging proper nouns in Japanese.",
                    "sid": 67,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A related task is named entity recognition (NER).",
                    "sid": 68,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can handle a named entity longer than a single morpheme and is usually formalized as a chunking problem.",
                    "sid": 69,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since Japanese does not delimit words by white-space, the unit of chunk- ing can be a character (Asahara and Matsumoto,2003; Kazama and Torisawa, 2008) or a mor errors.",
                    "sid": 70,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, Saito et al.",
                    "sid": 71,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) report that a majority of unknown named entities (those never appear in a training corpus) contain unknown morphemes as their constituents and that NER models perform poorly on them.",
                    "sid": 72,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A straightforward solution to this problem would be to acquire unknown morphemes and to assign semantic labels to them.",
                    "sid": 73,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another related task is supersense tagging (Ciaramita and Johnson, 2003; Curran, 2005; Ciaramita and Altun, 2006).",
                    "sid": 74,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A supersense corresponds to one of the 26 broad categories defined by WordNet (Fellbaum, 1998).",
                    "sid": 75,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each noun synset is associated with a supersense.",
                    "sid": 76,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “chair” has supersenses PERSON, ARTIFACT and ACT because it belongs to several synsets.",
                    "sid": 77,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since supersense tagging is studied in English, it differs from our task in several respects.",
                    "sid": 78,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In English, the distinction between common and proper nouns is clear.",
                    "sid": 79,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, the tagging models can use POS features even for unknown nouns.",
                    "sid": 80,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, the syntactic behavior of English nouns is different from that of Japanese nouns (Gil, 1987).",
                    "sid": 81,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Definiteness is not marked in Japanese as it lacks determiners (e.g. “the” and “a”), and Japanese has no obligatory plural marking.",
                    "sid": 82,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, Japanese obligatorily uses numeral classifiers to indicate the count of nouns, as in pheme (Sasano and Kurohashi, 2008).",
                    "sid": 83,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In either (1) saN satsu no hoNcase, NER models encode the output of morpho three CL GEN book logical analysis and therefore are affected by its three volumes of books, or three books, where “satsu” is a numeral classifier for books.",
                    "sid": 84,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A number together with its numeral classifier forms a numeral quantifier.",
                    "sid": 85,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Numeral quantifiers would be informative about the semantic categories of nouns.",
                    "sid": 86,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that Japanese shares the above features with Chinese and Thai.",
                    "sid": 87,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our findings in this paper may hold for these languages.",
                    "sid": 88,
                    "ssid": 58,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "proposed method. ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 Lexico-Syntactic Clues.",
                    "sid": 89,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the task of semantic classification, we can exploit syntactic clues in addition to morphological ones.",
                    "sid": 90,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result of unknown morpheme acquisition, text containing acquired morphemes, or former unknown morphemes, is correctly segmented.",
                    "sid": 91,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now we can treat automatic parsing as (at least partly) reliable with regard to acquired morphemes.",
                    "sid": 92,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For noun X , we use the following sets of features for classification.",
                    "sid": 93,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "call: noun phrase Y that appears in a pattern like “Y called X ” and “Y such as X ,” e.g. “call:kuni” from suf: suffix or suffix-like noun that follows X , e.g. “suf:saN” from “X saN” (Mr./Ms. X ) and “suf:eki” from “X eki” (X station).",
                    "sid": 94,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using automatically parsed text to extract syntactic features has an advantage.",
                    "sid": 95,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since no manual annotation is necessary, we can utilize a huge raw corpus.",
                    "sid": 96,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, parsing errors are inevitable.",
                    "sid": 97,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we can circumvent this problem by using the constraints of Japanese dependency structures: head-final and projective.",
                    "sid": 98,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The simplest example is the second last element of a sentence, which always depends on the last element.",
                    "sid": 99,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With these constraints, we can focus on syntactically unambiguous dependency pairs and extract syntactic features accurately.",
                    "sid": 100,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We follow Kawahara and Kurohashi (2001) to extract a pair of an argument noun and a predicate (cf), and Sasano et al.",
                    "sid": 101,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) to extract a pair of nouns connected with the genitive case marker “no” (ncf1 and ncf2).",
                    "sid": 102,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun X can be part of a compound noun.",
                    "sid": 103,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We leave it for named entity recognition.",
                    "sid": 104,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Except for suf, we extract features only when X alone forms a word.",
                    "sid": 105,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, we extract suf features only X to iu kuni when X and a suffix alone form a noun phrase.",
                    "sid": 106,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "X QT call country a country called X . cf: predicate with a case marker with which it takes X as an argument, e.g. “cf:tooru:wo” from For call, ncf1, and ncf2, we generalize numerals within noun phrases.",
                    "sid": 107,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For “hoN” (book) in example 1, we extract the feature “ncf2:<NUM>satsu.” X wo tooru X ACC pass ϕ pass through X . demo: demonstrative that modifies X , e.g. “demo:kono” from “kono X ” (this X ) and “demo:doNna” from “doNna X ” (what kind of X ).",
                    "sid": 108,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ncf1: noun phrase which X modifies with the genitive case marker “no,” e.g. “ncf1:heya” from 3.2 Instances for Classification.",
                    "sid": 109,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now that features are extracted for each noun, the question is how to combine them together to make an instance for classification.",
                    "sid": 110,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One factor we need to consider is polysemy: a noun can be a person name in one context and a location name in another.",
                    "sid": 111,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we combine features extracted from the whole corpus, they may represent several semantic labels.",
                    "sid": 112,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "X no heya Modeling a mixture of semantic labels might X GEN room X ’s room.",
                    "sid": 113,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ncf2: noun phrase that modifies X with the genitive case marker “no,” e.g. “ncf2:subete” from subete no X be a solution, but we do not take this approach on the grounds that each occurrence of a noun corresponds to a single semantic label.",
                    "sid": 114,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our strategy, we perform classification multiple times for each noun and aggregate the results at the end.",
                    "sid": 115,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features for each classification are all all X . GEN X extracted from a relatively small subset of a corpus where the noun is supposedly consistent in terms of semantic labels.",
                    "sid": 116,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the field of named entity recognition, it is known that label consistency holds strongly at the level of a document and less strongly across different documents (Krishnan and Manning, 2006).",
                    "sid": 117,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus we start with a document and gradually cluster related documents until a sufficient number of features are obtained.",
                    "sid": 118,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the specific procedures we took in the experiments, see Section 4.1.",
                    "sid": 119,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Training Data.",
                    "sid": 120,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following unknown morpheme acquisition (Mu- rawaki and Kurohashi, 2008), we create training data using manually registered nouns, for which we can obtain correct semantic labels.",
                    "sid": 121,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We perform the same procedure as above to make instances of registered nouns.",
                    "sid": 122,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some registered nouns are tagged with more than one semantic label, which we call “explicit polysemy.” We drop them from the training data.",
                    "sid": 123,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining problem is “implicit polysemy.” Nouns are sometimes used with an uncovered sense.",
                    "sid": 124,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In preliminary experiments, we found that a typical case of implicit polysemy was that a proper noun derived from a basic noun.",
                    "sid": 125,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To alleviate this problem, we use an NE tagger for filtering.",
                    "sid": 126,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We run an NE tagger over a small portion of the corpus and extract common nouns that are frequently tagged as named entities.",
                    "sid": 127,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we remove these nouns from the training data.",
                    "sid": 128,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also drop nouns that appear extremely frequently such as “人” (hito, “person”), “事” (koto, “thing”) and “私” (watashi, “I”2).",
                    "sid": 129,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since acquired nouns to be classified are typically low frequency morphemes, they would not behave similarly to these basic nouns.",
                    "sid": 130,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the inner product of wy and x. y = argmax⟨wy , x⟩.",
                    "sid": 131,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "y Several methods have been proposed to estimate weight vector wy from training data.",
                    "sid": 132,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use online algorithms because they are easy to implement and scale to huge instances.",
                    "sid": 133,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We try the Per- ceptron family of algorithms.",
                    "sid": 134,
                    "ssid": 46,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "4",
            "sents": [
                {
                    "text": "4.1 Settings.",
                    "sid": 135,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used JUMAN for morphological analysis and KNP3 for dependency parsing.",
                    "sid": 136,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The dictionary of JUMAN was augmented with automatically acquired morphemes (Murawaki and Kurohashi, 2008).",
                    "sid": 137,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of manually registered morphemes was 120 thousands while there were 13,071 acquired morphemes, of which 12,615 morphemes were nouns.",
                    "sid": 138,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used a web corpus that was compiled through the procedures proposed by Kawahara and Kurohashi (2006).",
                    "sid": 139,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It consisted of 100 million pages.",
                    "sid": 140,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first extracted features from the web corpus.",
                    "sid": 141,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To keep the model size manageable, we used 447,082 features that appeared more than 100 times in the corpus.",
                    "sid": 142,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We constructed training data from manually registered nouns and test data from automatically acquired nouns.",
                    "sid": 143,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each noun, we combined text together until the number of features grew to more than 100.",
                    "sid": 144,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We started with a single web page, then merge pages that share a domain name and finally clustered texts across different domains.",
                    "sid": 145,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We split the web corpus into 40 subcorpora and ap 4 3.4 Classifier.",
                    "sid": 146,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To assign a semantic label to each instance, we use a multiclass discriminative classifier.",
                    "sid": 147,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The input it takes is an instance that is represented by a feature vector x ∈ Rd. The output is one semantic label y ∈ Y , where Y is the set of semantic labels.",
                    "sid": 148,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use a linear classifier.",
                    "sid": 149,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has a weight vector wy ∈ Rd for each y and outputs y that maximizes 2 Japanese personal pronouns are treated as common nouns because they show no special morphosyntactic behavior.",
                    "sid": 150,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "plied this procedure in parallel.",
                    "sid": 151,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used Bayon for clustering domain texts.",
                    "sid": 152,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We sequentially read texts and applied the repeated bisections clustering every time some 5,000 pages were appended.",
                    "sid": 153,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The vectors for clustering were nouns, both registered and acquired, with their tfidf scores.",
                    "sid": 154,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We obtained 4,843,085 instances for 10,613 registered nouns and 196,098 instances for 2,556 acquired nouns.",
                    "sid": 155,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 http://nlp.kuee.kyoto-u.ac.jp/ nl-resource/knp-e.html 4 http://code.google.com/p/bayon/ Table 2: Results of semantic classification.",
                    "sid": 156,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "lea rni ng alg orit hm s a c q u ir e d n o u n s r e g i s t e r e d n o u n s Av era ge d Pe rce ptr on Pas sive Ag gre ssi ve Co nfi de nce We igh ted 86.",
                    "sid": 157,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "40 % (43 2 / 50 0) 87.",
                    "sid": 158,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "00 % (43 5 / 50 0) 85.",
                    "sid": 159,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "20 % (42 6 / 50 0) 88.",
                    "sid": 160,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "59 % (12 3,1 13 / 13 8,9 71) 91.",
                    "sid": 161,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "68 % (12 7,4 07 / 13 8,9 71) 89.",
                    "sid": 162,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "66 % (12 4,6 04 / 13 8,9 71) ba sel ine 1 69.",
                    "sid": 163,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "60 % (34 8 / 50 0) 79.",
                    "sid": 164,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "14 % (10 9,9 80 / 13 8,9 71) 1 assign OTH-C to all instances.",
                    "sid": 165,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3: Examples of aggregated instances.",
                    "sid": 166,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a c q u i r e d n o u n s ins tan ce s l a b e l s ヒ カ ル (hik aru , a per son na me ) チ ワ ワ (ch iwa wa, “C hih ua hu a”) か み さ ん (ka mis aN, coll oq.",
                    "sid": 167,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“wi fe” ) ラ ス ベ ガ ス (ra sub ega su, “L as Ve ga s”) ア ッ プ ル (aQ pur u, “A ppl e/a ppl e”) メ ル マ ガ (m eru ma ga, ab br.",
                    "sid": 168,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of “m ail ma ga zin e”) 84 1 2 8 1 3 1 1 3 6 1 8 7 1 , 6 2 2 PSN P:5 8.3 3% , PSN C: 41.",
                    "sid": 169,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "67 % ANI C: 54.",
                    "sid": 170,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "69 %, OTH C: 45.",
                    "sid": 171,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "31 % PSN C: 10 0% LOC P:9 7.0 6% , LOC C: 2.9 4% ORG P:6 3.1 0% , PSN C:3 4.7 6% , OTH C: 2.1 4% OTH C:9 9.3 2% , LOC C:0 .55 %, PSN C: 0.0 6% In order to handle polysemy, we evaluated semantic classification on an instance-by-instance basis.",
                    "sid": 172,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We randomly selected 500 instances from the test data and manually assigned the correct labels to them.",
                    "sid": 173,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For comparison purposes, we also classified registered nouns.",
                    "sid": 174,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We split the training data: 829 nouns or 138,971 instances for testing and the rest for training.",
                    "sid": 175,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We trained the model with three online learning algorithms, (1) the averaged version (Collins, 2002) of Perceptron (Crammer and Singer, 2003), (2) the Passive-Aggressive algorithm (Crammer et al., 2006), and (3) the Confidence-Weighted algorithm (Crammer et al., 2009).",
                    "sid": 176,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Passive- Aggressive algorithm, we used PA-I and set parameter C to 1.",
                    "sid": 177,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Confidence-Weighted, we used the single-constraint updates.",
                    "sid": 178,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All algorithms iterated five times through the training data.",
                    "sid": 179,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Results.",
                    "sid": 180,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows the results of semantic classification.",
                    "sid": 181,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All algorithms significantly improved over the baseline.",
                    "sid": 182,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As suggested by the gap in accuracy between acquired and registered nouns in the baseline method, the label distribution of the training data differed from that of the test data, but the decrease in accuracy was smaller than expected.",
                    "sid": 183,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Passive-Aggressive algorithm performed best on both acquired and registered nouns.",
                    "sid": 184,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the rest of this paper, we report the results of the Passive-Aggressive algorithm.",
                    "sid": 185,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows aggregated instances of some acquired nouns.",
                    "sid": 186,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although classification sometimes failed, correct labels took the majority.",
                    "sid": 187,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How ever, it is noticeable that PSN-P was frequently misidentified as PSN-C while PSN-C was correctly identified.",
                    "sid": 188,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This phenomenon is clearly seen in the confusion matrix (Table 4).",
                    "sid": 189,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Half of PSN-P instances were misidentified as PSN-C but the percentage of errors in the opposite direction was just above 9%.",
                    "sid": 190,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will investigate this in the next section.",
                    "sid": 191,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Discussion.",
                    "sid": 192,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our interest is in determining what kinds of features are effective in semantic classification.",
                    "sid": 193,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first performed standard ablation experiments.",
                    "sid": 194,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We trained a series of models on the training data after removing each feature set.",
                    "sid": 195,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training and test data were the same with those in Section 4.1.",
                    "sid": 196,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 shows the results of ablation experiments.",
                    "sid": 197,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Significant decreases in accuracy are observed in the cf dataset.",
                    "sid": 198,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is easily explained by the fact that more than half of features belonged to cf.",
                    "sid": 199,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ratio of ncf1 was much the same with that of ncf2, but the removal of ncf1 resulted in a worse performance in classifying registered nouns than that of ncf2.",
                    "sid": 200,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that a modifiee of a noun explains more about the noun than its modifier.",
                    "sid": 201,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ablation experiments cannot capture interesting properties of features because each feature set has a great diversity within it.",
                    "sid": 202,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, we directly examine features instead.",
                    "sid": 203,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since we use a simple linear classifier, a feature has |Y | corresponding weights, each of which represents how likely a noun belongs to label y. For example, features whose weights for PSN-C are the largest Table 4: Confusion matrix of acquired nouns.",
                    "sid": 204,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A c t u a l PSN P LOC-P ORG-P OTH-P PSN C LOC-C ORG-C ANI-C OTH-C P r e d i c t e d P S N P L O C P O R G -P O T H P 1 6 1 4 4 1 1 P S N C L O C C O R G -C A NI C O T H C 1 6 2 2 1 3 1 1 39 1 2 10 4 2 2 8 1 13 9 338 Table 5: Results of ablation experiments.",
                    "sid": 205,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "feat ure set r a ti o 1 a c q u ir e d n o u n s r e g i s t e r e d n o u n s cal l -cf de mo ncf 1 ncf 2 suf 0.",
                    "sid": 206,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 3 % 54.",
                    "sid": 207,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "84 % 2.",
                    "sid": 208,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 0 % 19.",
                    "sid": 209,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "03 % 18.",
                    "sid": 210,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "40 % 5.",
                    "sid": 211,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 0 % 87.",
                    "sid": 212,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "60 % (43 8 / 50 0) 84.",
                    "sid": 213,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "80 % (42 4 / 50 0) 88.",
                    "sid": 214,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "00 % (44 0 / 50 0) 87.",
                    "sid": 215,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "20 % (43 6 / 50 0) 85.",
                    "sid": 216,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "60 % (42 8 / 50 0) 87.",
                    "sid": 217,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "40 % (43 7 / 50 0) 91.",
                    "sid": 218,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "58 % (12 7,2 76 / 13 8,9 71) 88.",
                    "sid": 219,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "96 % (12 3,6 30 / 13 8,9 71) 91.",
                    "sid": 220,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "38 % (12 6,9 96 / 13 8,9 71) 89.",
                    "sid": 221,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "23 % (12 4,0 08 / 13 8,9 71) 91.",
                    "sid": 222,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "54 % (12 7,2 20 / 13 8,9 71) 91.",
                    "sid": 223,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "30 % (12 6,8 89 / 13 8,9 71) all 87.",
                    "sid": 224,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "00 % (43 5 / 50 0) 91.",
                    "sid": 225,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "68 % (12 7,4 07 / 13 8,9 71) 1 The proportion of each feature set that appears in the instances of the test.",
                    "sid": 226,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "data.",
                    "sid": 227,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "include: • cf:nakusu:wo (“ϕ lose X to the disease”), The modifiee of a numeral expression is not always the noun to be counted, as demonstrated by the following example: • cf:oshieru:ni (“ϕ1 teach X ϕ2”), (2) saN niN no moNdai • ncf2:ooku (“many/much X ”), and three CL GEN problem • nc f2: <N UM >ni N (X is m od ifi ed by < N U M > p l u s a nu m er al cla ssi fie r for persons).",
                    "sid": 228,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As briefly mentioned in Section 2.3, Japanese numeral quantifiers received scholarly attention in the fields of linguistic philosophy and linguistics in relation to the count/mass distinction (Quine, 1969; Gil, 1987).",
                    "sid": 229,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our feature sets, numeral quantifiers typically appear as ncf2, e.g. “ncf2:<NUM>niN.” The weights given to matters among the three persons.",
                    "sid": 230,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the above, the feature “ncf2:<NUM>niN” is extracted although “moNdai” is OTH-C.",
                    "sid": 231,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Theis “noise” is attributed to the genitive case marker “no” because it can denote a wide range of relations between two nouns.",
                    "sid": 232,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We might be able to avoid this problem if we focus on “floating” numeral quantifiers.",
                    "sid": 233,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A floating numeral quantifier has no direct dependency relation to the noun to be counted, as in them demonstrate their effectiveness in semantic (3) seito ga saN niN keQseki shita classification.",
                    "sid": 234,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They discriminate common nouns student NOM three CL absence do from proper nouns as the weights given to common nouns are larger with wide margins.",
                    "sid": 235,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not surprising because, say, the phrase “two Johns” is semantically acceptable but extremely rare in reality.",
                    "sid": 236,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are also informative about the distinction among PSN, LOC and others.",
                    "sid": 237,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the classifier “niN” for persons suggest the noun in question is a person while “keN” for houses would modify a location-like noun.",
                    "sid": 238,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we found quite a few “noises” about these features in data.",
                    "sid": 239,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "three students were absent, where the numeral quantifier modifies the verb phrase instead of the noun.",
                    "sid": 240,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further work is needed to anchor floating numeral quantifiers since they bring a different kind of ambiguity themselves (Bond et al., 1998).",
                    "sid": 241,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Closely related to numeral quantifiers are quantificational nouns that appear as “ncf2:ooku” (“many/much”), “ncf2:subete” (“all”) and others.",
                    "sid": 242,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They distinguish common nouns from proper nouns but does not make a further classification.",
                    "sid": 243,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same is true of other numeral expressions such as “cf:hueru:ga” (“X increase in number”) and “cf:nai:ga” (“there is no X ” or “X do not exist”).",
                    "sid": 244,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found that, other than numeral expressions, some features distinguished common nouns from proper nouns because they indicated the noun denoted an attribute.",
                    "sid": 245,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such features include “cf:naru:ni” (“ϕ become X ”) and “cf:kaneru:wo” (“ϕ double as X ”).",
                    "sid": 246,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We expected that demonstratives (demo) served similar functions to quantificational expressions, but it turned out to be more complex.",
                    "sid": 247,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distal demonstrative “ano” (“that”) often modifies proper nouns to give emphasis.",
                    "sid": 248,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, the model gave larger weights to proper nouns.",
                    "sid": 249,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, interrogative demonstratives such as “dono” (“which”) and “doNna” (“what kind of”) are rarely used with proper nouns although semantically acceptable.",
                    "sid": 250,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As seen above, there is an abundant variety of features that distinguish common nouns from proper nouns.",
                    "sid": 251,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, it is not difficult to make a distinction among PSN, LOC and others although the far largest cluster OTH-C sometimes absorbs other instances.",
                    "sid": 252,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining question is how to distinguish proper nouns from common nouns, or specifically PSN-P from PSN-C.",
                    "sid": 253,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We examined features that gave larger weights to PSN-P than to PSN-C.",
                    "sid": 254,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They generally had smaller margins in weights than those which distinguish PSN-C from PSN-P.",
                    "sid": 255,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among them, features such as “cf:utau:ga” (“X sing”) and “cf:hanasu:ni” (“ϕ talk to X ”) have no problem with being used for common nouns in terms of both semantics and pragmatics.",
                    "sid": 256,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They seem to have resulted from over-training.",
                    "sid": 257,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There were seemingly appropriate features such as “suf:saNchi” (“X ’s house”) and “suf:seNshu” (honorific suffix for players), but they were not ubiquitous in the corpus.",
                    "sid": 258,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PSN-P instances suffered from lack of distinctive features.",
                    "sid": 259,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One solution to this problem is to combine additional knowledge about person names.",
                    "sid": 260,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, a Japanese family name is followed by a given name, and most Chinese names consist of three Chinese characters.",
                    "sid": 261,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, quite a few person names in the web corpus do not follow the usual patterns of person names because they are handles (or nicknames) and names for fictional characters.",
                    "sid": 262,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus it would be desirable to be able to classify person names without additional knowledge.",
                    "sid": 263,
                    "ssid": 129,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "5",
            "sents": [
                {
                    "text": "In this paper, we presented the new task of semantic classification of Japanese nouns and applied it to nouns automatically acquired from text.",
                    "sid": 264,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike in unknown morpheme identification in previous studies, we can exploit automatically parsed text.",
                    "sid": 265,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We explored lexico-syntactic clues and investigated their effects.",
                    "sid": 266,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found plenty of features that distinguished common nouns from proper nouns, but few features worked in the opposite direction.",
                    "sid": 267,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further work is needed to overcome this bias.",
                    "sid": 268,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}