{
    "ID": "C10-2023",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We present a new reordering model estimated as a standard n-gram language model with units built from morpho- syntactic information of the source and target languages.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be seen as a model that translates the morpho-syntactic structure of the input sentence, in contrast to standard translation models which take care of the surface word forms.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We take advantage from the fact that such units are less sparse than standard translation units to increase the size of bilingual context that is considered during the translation process, thus effectively accounting for mid-range reorderings.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Empirical results on French-English and GermanEnglish translation tasks show that our model achieves higher translation accuracy levels than those obtained with the widely used lexicalized reordering model.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Word ordering is one of the major issues in statistical machine translation (SMT), due to the many word order peculiarities of each language.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is widely accepted that there is a need for structural information to account for such differences.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Structural information, such as Part-of-speech (POS) tags, chunks or constituency/dependency parse trees, offers a greater potential to learn generalizations about relationships between languages than models based on word surface forms, because such “surfacist” models fail to infer generalizations from the training data.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word ordering problem is typically decomposed in a number of related problems which can be further explained by a variety of linguistic phenomena.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accordingly, we can sort out the reordering problems into three categories based on the kind of linguistic units involved and/or the typical distortion distance they imply.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Roughly speaking, we face short-range reorderings when single words are reordered within a relatively small window distance.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It consist of the easiest case as typically, the use of phrases (in the sense of translation units of the phrase-based approach to SMT) is believed to adequately perform such reorderings.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mid-range reorderings involve reorderings between two or more phrases (translation units) which are closely positioned, typically within a window of about 6 words.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many alternatives have been proposed to tackle mid- range reorderings through the introduction of linguistic information in MT systems.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To the best of our knowledge, the authors of (Xia and Mc- Cord, 2004) were the first to address this problem in the statistical MT paradigm.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They automatically build a set of linguistically grounded rewrite rules, aimed at reordering the source sentence so as to match the word order of the target side.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, (Collins, et al 2005) and (Popovic and Ney, 2006) reorder the source sentence using a small set of handcrafted rules for GermanEnglish translation.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Crego and Marin˜ o, 2007) show that the ordering problem can be more accurately solved by building a source-sentence word lattice containing the most promising reordering hypotheses, allowing the decoder to decide for the best word order hypothesis.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word lattices are built by means of rewrite rules operating on POS tags; such rules are automatically extracted from the training bi-text.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Zhang, et al 2007) introduce shallow parse (chunk) information to reorder the source sentence, aiming at extending the scope of their rewrite rules, encoding reordering hypotheses in the form of a confusion network that is then passed to the decoder.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These studies tackle mid-range reorderings by predicting more or less accurate reordering hypotheses.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, none 197 Coling 2010: Poster Volume, pages 197–205, Beijing, August 2010 of them introduce a reordering model to be used in decoding time.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nowadays, most of SMT systems implement the well known lexicalized reordering model (Tillman, 2004).",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basically, for each translation unit it estimates the probability of being translated monotone, swapped or placed discontiguous with respect to its previous translation unit.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Integrated within the Moses (Koehn, et al 2007) decoder, the model achieves state-of- the-art results for many translation tasks.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the main reasons that explains the success of the model is that it considers information of the source- and target-side surface forms, while the above mentionned approaches attempt to hypothesize reorderings relying only on the information contained on the source-side words.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, long-range reorderings imply reorder- ings in the structure of the sentence.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such reorderings are necessary to model the translation for pairs like ArabicEnglish, as English typically follows the SVO order, while Arabic sentences have different structures.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even if several attempts exist which follow the above idea of making the ordering of the source sentence similar to the target sentence before decoding (Niehues and Kolss, 2009), long-range reorderings are typically better addressed by syntax-based and hierarchical (Chi- ang, 2007) models.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (Zollmann et al., 2008), ables to account for arbitrary large sequences of units.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, the proposed model takes care of the translation adequacy of the structural information present in translation hypotheses, here introduced in the form of POS tags.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also show how the new model compares to a widely used lexical- ized reordering model, which we have also implemented in our particular bilingual n-gram approach to SMT, as well as to the widely known Moses SMT decoder, a state-of-the-art decoder performing lexicalized reordering.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining of this paper is as follows.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 2 we briefly describe the bilingual n-gram SMT system.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 details the bilingual n- gram reordering model, the main contribution of this paper, and introduces additional well known reordering models.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 4, we analyze the reordering needs of the language pairs considered in this work and we carry out evaluation experiments.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we conclude and outline further work in Section 5.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "bilingual n-gram smt. ",
            "number": "2",
            "sents": [
                {
                    "text": "Our SMT system defines a translation hypothesis t given a source sentence s, as the sentence which maximizes a linear combination of feature functions: an interesting comparison between phrase-based,hierarchical and syntax-augmented models is car ( M 1 = arg max ) λmhm(sJ I (1)ried out, concluding that hierarchical and syntax I 1 m=1 1 , t1 ) based models slightly outperform phrase-based models under large data conditions and for sufficiently non-monotonic language pairs.",
                    "sid": 37,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Encouraged by the work reported in (Hoang and Koehn, 2009), we tackle the mid-range reordering problem in SMT by introducing a n- gram language model of bilingual units built from POS information.",
                    "sid": 38,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rationale behind such a model is double: on the one hand we aim at introducing morpho-syntactic information into the reordering model, as we believe it plays an im where λm is the weight associated with the feature hm(s, t).",
                    "sid": 39,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main feature is the log-score of the translation model based on bilingual n-grams.",
                    "sid": 40,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This model constitutes a language model of a particular bi-language composed of bilingual units which are typically referred to as tuples (Marin˜ o et al., 2006).",
                    "sid": 41,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, the translation model probabilities at the sentence level are approximated by using n-grams of tuples: K p(sJ I n portant role for predicting systematic word ordering differences between language pairs; at the 1 , t1) = k=1 p((s, t)k |(s, t)k−1 . . .",
                    "sid": 42,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(s, t)k−n+1) same time that it drastically reduces the sparseness problem of standard translation units built from surface forms.",
                    "sid": 43,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, n-gram language modeling is a robust approach, that en where s refers to source t to target and (s, t)k to the kth tuple of the given bilingual sentence pairs, J and tI . It is important to notice that, since both languages are linked up in tuples, the context information provided by this translation model is bilingual.",
                    "sid": 44,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As for any standard n-gram language model, our translation model is estimated over a training corpus composed of sentences of the language being modeled, in this case, sentences of the bi-language previously introduced.",
                    "sid": 45,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Translation units consist of the core elements of any SMT system.",
                    "sid": 46,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our case, tuples are extracted from a word aligned corpus in such a way that a unique segmentation of the bilingual corpus is achieved, allowing to estimate the n-gram model.",
                    "sid": 47,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 presents a simple example illustrating the unique tuple segmentation for a given word-aligned pair of sentences (top).",
                    "sid": 48,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "alignments.",
                    "sid": 49,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following on the previous example, the ruleperfect translations ❀ translations perfect produces the swap of the English words that is ob served for the French and English pair.",
                    "sid": 50,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typically, POS information is used to increase the generalization power of such rules.",
                    "sid": 51,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, rewrite rules are built using POS instead of surface word forms.",
                    "sid": 52,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "See (Crego and Marin˜ o, 2007) for details on tuples extraction and reordering rules.",
                    "sid": 53,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "reordering models. ",
            "number": "3",
            "sents": [
                {
                    "text": "In this section, we detail three different reordering models implemented in our SMT system.",
                    "sid": 54,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As previously outlined, the purpose of reordering models is to accurately learn generalizations for the word order modifications introduced on the source side during the tuple extraction process.",
                    "sid": 55,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Source n-gram Language Model.",
                    "sid": 56,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We employ a n-gram language model estimated over the source words of the training corpus after being reordered in the tuple extraction process.",
                    "sid": 57,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the model scores a given source-side reordering hypothesis according to the reorder ings performed in the training sentences.",
                    "sid": 58,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "POS tags are used instead of surface formsFigure 1: Tuple extraction from an aligned sen tence pair.",
                    "sid": 59,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting sequence of tuples (1) is further refined to avoid NULL words in source side of the tuples (2).",
                    "sid": 60,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once the whole bilingual training data in order to improve generalization and to reduce sparseness.",
                    "sid": 61,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The model is estimated as any standard n-gram language model, described by the following equation: J is segmented into tuples, n-gram language model p(sJ I n j j 1 j n+1 probabilities can be estimated.",
                    "sid": 62,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice from the 1 , t1) = j=1 p(st st − , . . .",
                    "sid": 63,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", st − ) (2) example that the English source words perfect and where st relates to the POS tag used for the jth translations have been reordered in the final tuple segmentation, while the French target words are kept in their original order.",
                    "sid": 64,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During decoding, sentences to be translated are encoded in the form of word lattices containing the most promising reordering hypotheses, so as to reproduce the word order modifications introduced during the tuple extraction process.",
                    "sid": 65,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, at decoding time, only those reordering hypotheses encoded in the word lattice are examined.",
                    "sid": 66,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reordering hypotheses are introduced following a set of reordering rules automatically learned from the bi-text corpus word source word.",
                    "sid": 67,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main drawback of this model is the lack of knowledge of the hypotheses on the target- side.",
                    "sid": 68,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability assigned to a sequence of source words is only conditioned to the sequence of source words.",
                    "sid": 69,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Lexicalized Reordering Model.",
                    "sid": 70,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A broadly used reordering model for phrase-based systems is lexicalized reordering (Tillman, 2004).",
                    "sid": 71,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It introduces a probability distribution for each phrase pair that indicates the likelihood of being translated monotone, swapped or placed discontiguous to its previous phrase.",
                    "sid": 72,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ordering of the next phrase with respect to the current phrase is typically also modeled.",
                    "sid": 73,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our implementation, we modified the three orientation types and Figure 2 shows the sequence of translation units built from POS tags, used in our previous example.",
                    "sid": 74,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "consider: a consecutive type, where the original monotone and swap orientations are lumped together, a forward type, specifying discontiguous forward orientation, and a backward type, specifying discontiguous backward orientation.",
                    "sid": 75,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Empirical results showed that in our case, the new orientations slightly outperform the original ones.",
                    "sid": 76,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This may be explained by the fact that the model is applied over tuples instead of phrases.",
                    "sid": 77,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Counts of these three types are updated for each unit collected during the training process.",
                    "sid": 78,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given these counts, we can learn probability dis tributions of the form pr (orientation|(st)) where orientation ∈ {c, f, b} (consecutive, forward and backward) and (st) is a translation unit.",
                    "sid": 79,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Counts are typically smoothed for the estimation of the probability distribution.",
                    "sid": 80,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A major weakness of the lexicalized reordering model is due to the fact that it does not considers phrase neighboring, i.e. a single probability is learned for each phrase pair without considering its context.",
                    "sid": 81,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An additional concern is the problem of sparse data: translation units may occur only a few times in the training data, making it hard to estimate reliable probability distributions.",
                    "sid": 82,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Linguistically Informed Bilingual.",
                    "sid": 83,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "n-gram Language Model The bilingual n-gram LM is estimated as a standard n-gram LM over translation units built from POS tags represented as: K Figure 2: Sequence of POS-tagged units used to estimate the bilingual n-gram LM.",
                    "sid": 84,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "POS-tagged units used in our model are expected to be much less sparse than those built from surface forms, allowing to estimate higher order language models.",
                    "sid": 85,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, larger bilingual context are introduced in the translation process.",
                    "sid": 86,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This model can also be seen as a translation model of the sentence structure.",
                    "sid": 87,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It models the adequacy of translating sequences of source POS tags into target POS tags.",
                    "sid": 88,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the model is not limited to using POS information.",
                    "sid": 89,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rather, many other information sources could be used (supertags, additional morphology features, etc.), allowing to model different translation properties.",
                    "sid": 90,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we must take into account that the degree of sparsity of the model units, which is directly related to the information they contain, affects the level of bilingual context finally introduced in the translation process.",
                    "sid": 91,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since more informed units may yield more accurate predictions, more informed units may also force the model to fall to lower n-grams.",
                    "sid": 92,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, the degree of accuracy and generalization power of the model units must be carefully balanced to allow good reordering predictions for contexts as large as possible.",
                    "sid": 93,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As any standard language model, smoothing is needed.",
                    "sid": 94,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Empirical results showed that KneserNey smoothing (Kneser and Ney, 1995) achieved p(sJ , tI ) = n p((st)t |(st)t . . .",
                    "sid": 95,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(st)t ) the best performance among other options (mea 1 1 k=1 k k−1 k−n+1 sured in terms of translation accuracy).",
                    "sid": 96,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "where (st)t relates to the kth translation unit, 3.4 Decodi ng Issues (st)k , built from POS tags instead of words.",
                    "sid": 97,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This model aims at alleviating the drawbacks of the previous two reordering models.",
                    "sid": 98,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the one hand it takes into account bilingual information to model reordering.",
                    "sid": 99,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand it considers the phrase neighboring when estimating the reordering probability of a given translation unit.",
                    "sid": 100,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A straightforward implementation of the three models is carried out by extending the log-linear combination of equation (1) with the new features.",
                    "sid": 101,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that no additional decoding complexity is introduced in the baseline decoding implementation.",
                    "sid": 102,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Considering the bilingual n-gram language model, the decoder must know the POS tags for each tuple.",
                    "sid": 103,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, each tuple may be tagged differently, as words with same surface form may have different POS tags.",
                    "sid": 104,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have implemented two solutions for this situation.",
                    "sid": 105,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Firstly, we assume that each tuple has a single POS-tagged version.",
                    "sid": 106,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accordingly, we select a single POS-tagged version out of the multiple choices (the most frequent).",
                    "sid": 107,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondly, all POS-tagged versions of each tuple are allowed.",
                    "sid": 108,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second choice implies using more accurate POS-tagged tuples to model reordering, however, it overpopulates the search space with spurious hypotheses, as multiple identical units (with different POS tags) are considered.",
                    "sid": 109,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our first empirical findings showed no differences in translation accuracy for both configurations.",
                    "sid": 110,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, in the remaining of this paper we only consider the first solution (a single POS- tagged version of each tuple).",
                    "sid": 111,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training corpus composed of tagged units out of which our new model is estimated is accordingly modified to contain only those tagged units considered in decoding.",
                    "sid": 112,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that most of the ambiguity present in word tagging is resolved by the fact that translation units may contain multiple source and target side words.",
                    "sid": 113,
                    "ssid": 60,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "evaluation framework. ",
            "number": "4",
            "sents": [
                {
                    "text": "In this section, we perform evaluation experiments of our novel reordering model.",
                    "sid": 114,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we give details of the corpora and baseline system employed in our experiments and analyze the reordering needs of the translation tasks, French- English and GermanEnglish (in both directions).",
                    "sid": 115,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we evaluate the performance of our model and contrast results with other reordering models and translation systems.",
                    "sid": 116,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Corpora.",
                    "sid": 117,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have used the fifth version of the EPPS and the News Commentary corpora made available in the context of the Fifth ACL Workshop on Statistical Machine Translation.",
                    "sid": 118,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 presents the basic statistics for the training and test data sets.",
                    "sid": 119,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our test sets correspond to news-test2008 and new- stest2009 file sets, hereinafter referred to as Tune and Test respectively.",
                    "sid": 120,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "French, German and English Part-of-speech tags are computed by means of the TreeTagger 1 toolkit.",
                    "sid": 121,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additional German tags are obtained using the RFTagger 2 toolkit, which annotates text with fine-grained part-of-speech tags (Schmid and Laws, 2008) with a vocabulary of more than 700 tags containing rich morpho-syntactic information (gender, number, case, tense, etc.).",
                    "sid": 122,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "L a n g. S e nt . W or ds V o c. O O V Ref s Train Fr en ch En gli sh 1.7 5 M 1.7 5 M 52.",
                    "sid": 123,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 M 47.",
                    "sid": 124,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 M 13 7 k 13 8 k − − − − Tune Fr en ch En gli sh 2, 05 1 2, 05 1 55.",
                    "sid": 125,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 k 49.",
                    "sid": 126,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 k 8, 95 7 8, 35 9 1, 28 2 1, 34 4 1 1 Test Fr en ch En gli sh 2, 52 5 2, 52 5 72.",
                    "sid": 127,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 k 65.",
                    "sid": 128,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 k 10, 83 2 9, 56 8 1, 74 9 1, 72 4 1 1 Train Ge rm an En gli sh 1, 61 M 1, 61 M 42.",
                    "sid": 129,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 M 44.",
                    "sid": 130,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 M 38 1 k 13 7 k − − − − Tune Ge rm an En gli sh 2, 05 1 2, 05 1 47, 8 k 49, 2 k 10, 99 4 8, 35 9 2, 15 3 1, 49 1 1 1 Test Ge rm an En gli sh 2, 52 5 2, 52 5 62, 8 k 65, 1 k 12, 85 6 9, 56 8 2, 70 4 1, 81 0 1 1 Table 1: Statistics for the training, tune and test data sets.",
                    "sid": 131,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 System Details.",
                    "sid": 132,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After preprocessing the corpora with standard tokenization tools, word-to-word alignments are performed in both directions, source-to-target and target-to-source.",
                    "sid": 133,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our system implementation, the GIZA++ toolkit3 is used to compute the word alignments.",
                    "sid": 134,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, the grow-diag-final-and (Koehn et al., 2005) heuristic is used to obtain the alignments from which tuples are extracted.",
                    "sid": 135,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the tuple n-gram translation model, our SMT system implements six additional feature functions which are linearly com 1 www.ims.unistuttgart.de/projekte/corplex/TreeTagger 2 www.ims.unistuttgart.de/projekte/corplex/RFTagger 3 http://www.fjoch.com/GIZA++.html bined following a discriminative modeling framework (Och and Ney, 2002): a target-language model which provides information about the target language structure and fluency; two lexicon models, which constitute complementary translation models computed for each given tuple; a ’weak’ distance-based distortion model; and finally a word-bonus model and a tuple-bonus model which are used in order to compensate for the system preference for short translations.",
                    "sid": 136,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All language models used in this work are estimated using the SRI language modeling toolkit4.",
                    "sid": 137,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to our experience, KneserNey smoothing (Kneser and Ney, 1995) and interpolation of lower and higher n-grams options are used as they typically achieve the best performance.",
                    "sid": 138,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Optimization work is carried out by means of the widely used MERT toolkit5 which has been slightly modified to perform optimizations embedding our decoder.",
                    "sid": 139,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The BLEU (Pap- ineni et al., 2002) score is used as objective function for MERT and to evaluate test performance.",
                    "sid": 140,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Reordering in GermanEnglish and.",
                    "sid": 141,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "French-English Translation Two factors are found to greatly impact the overall translation performance: the morphological mismatch between languages, and their reordering needs.",
                    "sid": 142,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The vocabulary size is strongly influenced by the number of word forms for number, case, tense, mood, etc., while reordering needs refer to the difference in their syntactic structure.",
                    "sid": 143,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, we are primarily interested on the reordering needs of each language pair.",
                    "sid": 144,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 displays a quantitative analysis of the reordering needs for the language pairs under study.",
                    "sid": 145,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 displays the (%) distribution of the reordered sequences, according to their size, observed for the training bi-texts of both translation tasks.",
                    "sid": 146,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word alignments are used to determine reorderings.",
                    "sid": 147,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A reordering sequence can also be seen as the sequence of words implied in a reordering rule.",
                    "sid": 148,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, we used the reordering rules extracted from the training corpus to account for reordering sequences.",
                    "sid": 149,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Coming back to the example of Figure 1, a single reordering sequence is found, 4 http://www.speech.sri.com/projects/srilm/ 5 http://www.statmt.org/moses/ which considers the source words perfect translations.",
                    "sid": 150,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "50 fren deen 45 40 35 30 25 20 15 10 5 2 3 4 5 6 7 >=8 Size (words) Figure 3: Size (in words) of reorderings (%) observed in training bi-texts.",
                    "sid": 151,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As can be seen, the French-English and GermanEnglish pairs follow a different distribution of reorderings according to their size.",
                    "sid": 152,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A lower number of short-range reorderings are observed for the GermanEnglish task while a higher number of long-range reorderings.",
                    "sid": 153,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Considering mid-range reorderings (from 5 to 7 words), the French-English pair shows a lower percentage (∼14%) than the GermanEnglish (∼ 22%).",
                    "sid": 154,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A simi lar performance is expected when considering the opposite translation directions.",
                    "sid": 155,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that reorderings are extracted from word-alignments, an automatic process which is far notoriously error- prone.",
                    "sid": 156,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The above statistics must be accordingly considered.",
                    "sid": 157,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.4 Results.",
                    "sid": 158,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Translation accuracy (BLEU) results are given in table 2 for the same baseline system performing different reordering models: source 6-gram LM (sLM); lexicalized reordering (lex); bilingual 6- gram LM (bLM) assuming a single POS-tagged version of each tuple.",
                    "sid": 159,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of the GermanEnglish translation task we also report results for the bilingual 5-gram LM built from POS tags obtained from RFTagger containing a richer vocabulary tag set (b+LM).",
                    "sid": 160,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For comparison purposes, we also show the scores obtained by the Moses phrase-based system performing lexicalized reordering.",
                    "sid": 161,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Models of both systems are built sharing the same training data and word alignments.",
                    "sid": 162,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The worst results are obtained by the sLM model.",
                    "sid": 163,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fact that it only considers source- language information results clearly relevant to accurately model reordering.",
                    "sid": 164,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A very similar performance is shown by our bilingual n-gram system and Moses under lexicalized reordering (bLM and Moses), slightly lower results are obtained by the n-gram system under French- English translation.",
                    "sid": 165,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "test set.",
                    "sid": 166,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows the BLEU results of the reordering task.",
                    "sid": 167,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bigram, trigram and 4gram precision scores are also given.",
                    "sid": 168,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3: Reordering accuracy (BLEU) results.",
                    "sid": 169,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2: Translation accuracy (BLEU) results.",
                    "sid": 170,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When moving from lex to bLM, our system increases its accuracy results for both tasks and translation directions.",
                    "sid": 171,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, results are slightly higher than those obtained by Moses (same results for English-to-French).",
                    "sid": 172,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, results for translations performed with the bilingual n-gram reordering model built from rich German POS tags (b+LM) achieve the highest accuracy results for both directions of the GermanEnglish task.",
                    "sid": 173,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even though results are consistent for all translation tasks and directions they fall within the statistical confidence margin.",
                    "sid": 174,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Add ±2.36to French-English results and ±1.25 to German English results for a 95% confidence level.",
                    "sid": 175,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Very similar results were obtained when estimating our model for orders from 5 to 7.",
                    "sid": 176,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to better understand the impact of the proposed reordering model, we have measured the accuracy of the reordering task.",
                    "sid": 177,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, isolating the reordering problem from the more general translation problem.",
                    "sid": 178,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use BLEU to account the n-gram matching between the sequence of source words aligned to the 1-best translation hypothesis, i.e. the permutation of the source words output by the decoder, and the permutation of source words that monotonizes the word alignments with respect to the target reference.",
                    "sid": 179,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that in order to obtain the word alignments of the test sets we re-aligned the entire corpus after including the As can be seen, the bilingual n-gram reordering model shows higher results for both translation tasks and directions than lexicalized reordering, specially for GermanEnglish translation.",
                    "sid": 180,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our model also obtains higher values of n-gram precision for all values of n. Next, we validate the introduction of additional bilingual context in the translation process.",
                    "sid": 181,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 4 shows the average size of the translation unit n-grams used for the test set according to different models (GermanEnglish), the surface form 3-gram language model (main translation model), and the new reordering model when built from the reduced POS tagset (POS) and using the rich POS tagset (POS+).",
                    "sid": 182,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "40 word-based bilingual units POS-based bilingual units POS+-based bilingual units 35 30 25 20 15 10 5 0 0 1 2 3 4 5 6 7 8 9 Size (units) Figure 4: Size of translation unit n-grams (%) seen in test for different n-gram models.",
                    "sid": 183,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As expected, translation units built from the reduced POS tagset are less sparse, enabling us to introduce larger n-grams in the translation process.",
                    "sid": 184,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the fact that they achieve lower translation accuracy scores (see Table 2) indicates that the probabilities associated to these large n- grams are less accurate.",
                    "sid": 185,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can also be seen that the model built from the rich POS tagset uses a higher number of large n-grams than the language model built from surface forms.",
                    "sid": 186,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The availability of mid-range n-grams validates the introduction of additional bilingual context achieved by the new model, leading to effectively modeling mid-range reorderings.",
                    "sid": 187,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice additionally that considering the language model built from surface forms, only a few 4-grams of the test set are seen in the training set, which explains the small reduction in performance observed when translating with a bilingual 4-gram language model (internal results).",
                    "sid": 188,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, the results shown in Figure 4 validates the choice of using bilingual 5-grams for b+LM and 6-grams for bLM . Finally, we evaluate the mismatch between the reorderings collected on the training data, and those output by the decoder.",
                    "sid": 189,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 shows the percentage of reordered sequences found for the1-best translation hypothesis of the test set ac cording to their size.",
                    "sid": 190,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The French-to-English and German-to-English tasks are considered.",
                    "sid": 191,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P a i r Co nfi g 2 3 4",
                    "sid": 192,
                    "ssid": 79,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "6\t7",
            "number": "5",
            "sents": [
                {
                    "text": "≥ 8 Fr ❀ En l e x b L M 58 23 10 57 23 11 5 2 1 4 2.",
                    "sid": 193,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 1.",
                    "sid": 194,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 1 1 De ❀ En lex b+ L M 33 24 22 35 25 19 14 5 1.5 13 5 2.5 0.",
                    "sid": 195,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 0.",
                    "sid": 196,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Table 4: Size (%) of the reordered sequences observed when translating the test set.",
                    "sid": 197,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Very similar distributions are observed for both reordering models.",
                    "sid": 198,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In parallel, distributions are also comparable to those presented in Figure 3 for reorderings collected from the training bi-text, with the exception of long-range and very short- range reorderings.",
                    "sid": 199,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This may be explained by the fact that system models, in special the distortion penalty model, typically prefer monotonic translations, while the system lacks a model to support large-range reorderings.",
                    "sid": 200,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Conclusions and Further Work.",
                    "sid": 201,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have presented a new reordering model based on bilingual n-grams with units built from linguistic information, aiming at modeling the structural adequacy of translations.",
                    "sid": 202,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compared our new reordering model to the widely used lexical- ized reordering model when implemented in our bilingual n-gram system as well as using Moses, a state-of-the-art phrase-based SMT system.",
                    "sid": 203,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our model obtained slightly higher translation accuracy (BLEU) results.",
                    "sid": 204,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also analysed the quality of the reorderings output by our system when performing the new reordering model, which also outperformed the quality of those output by the system performing lexicalized reordering.",
                    "sid": 205,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The back-off procedure used by standard language models allows to dynamically adapt the scope of the context used.",
                    "sid": 206,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, in the case of our reordering model, back-off allows to consider always as much bilingual context (n-grams) as possible.",
                    "sid": 207,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The new model was straightforward implemented in our bilingual n-gram system by extending the log-linear combination implemented by our decoder.",
                    "sid": 208,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No additional decoding complexity was introduced in the baseline decoding implementation.",
                    "sid": 209,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we showed that mid-range reorderings are present in French-English and GermanEnglish translations and that our reordering model effectively tackles such reorderings.",
                    "sid": 210,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we saw that long-range reorderings, also present in these tasks, are yet to be addressed.",
                    "sid": 211,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We plan to further investigate the use of different structural information, such as supertags, and tags conveying different levels of morphology information (gender, number, tense, mood, etc.) for different language pairs.",
                    "sid": 212,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This work has been partially funded by OSEO under the Quaero program.",
                    "sid": 213,
                    "ssid": 21,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}