{
    "ID": "C90-3046",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper proposes that sentence analysis should be treated as de feasible reasoning, and presents such a treatment lbr Japanese sentence analyses using an argumentation system by Konolige, which is a for- malizat'ion of defeasible reasoning, that includes arguments and defeat rules that capture defeasibility.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Sentence analyses are essentially reasoning processes which derive assumptions/expectations t?om observed input sentences.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A syntactic structure ex-.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tracted fl'om a sentence by parsing is only a prediction, and may be invalidated by semantic or contextual analyses.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because interpretation of a sentence requires the use of semantic and contextual analyses to determine its meaning, and because information expressed by an utterance is partial.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, even when utterances are not grammatical, it is impractical for a parser to reject them because of their ungrammatieality.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the following two desiderata can be considered for such sentence analyses: to select plausible candidates from among many possible candidates and to integrate, in a uniform manner, syntactic, semantic, m~d pragmatic processing.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From these viewpoints, this paper proposes that sentence analysis should be treated as defeasible reasoning, and presents such a treatment using an argumentation system [7], which is a formalization of defeasible rea~soning, that includes arguments and defeat rules that capture defe,asibility.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, this paper discusses treatments of chart parsing [5], e~use analyses, and interpretation of Japanese noun phrases with adnominal particles.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since there is a continuity from syntactic analysis (parsing) to semantic and contextual analyses when viewed as reasoning processes, we use the word analysis rather than parsing.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "underlying frameworks. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Sentenee Analysis as Deduction.",
                    "sid": 11,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mental processes can be viewed as reasoning processes that are invoked by observations of external environments and interactions with other agents.",
                    "sid": 12,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reasoning has been generally formalized and implemented as deduction frameworks.",
                    "sid": 13,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even parsing and generation can be formalized a~s deduction [12] [15].",
                    "sid": 14,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This treatment has several advantages, including, in particular, theoretical cleanliness, harmony with semantics and pragmatics, generalization of parsing, gap a.nd unbounded dependency treatments that avoid the addition of specific mechanisms.",
                    "sid": 15,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The deductive formalisms ['or parsing proposed by Shieber correspond to chart parsing [5].",
                    "sid": 16,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\\\\\"e describe deduction rules for parsing [15], which satis{)' our present requirements for describing sentence analysis and defeat rules.",
                    "sid": 17,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic inf0rence rules are prediction and completion.",
                    "sid": 18,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The inference rule of prediction is as follows.",
                    "sid": 19,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[a ,--- b7, i, j, a.]",
                    "sid": 20,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "b ~ ,3 [b ~ /3,j,j,_] The inference rule of completion is as follows.",
                    "sid": 21,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[a'--bT,i,j, ct] [b~,j,k,9] [a~- 7, i, k, al~] Itere, [a ,-- 3, i,j,c*] represents an edge where i is its starting position, j is its ending position, and where a is analysed, b :-, /3 represents a grammar rule.",
                    "sid": 22,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "'Ib be precise, these rules are schemata.",
                    "sid": 23,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contr~st to these rules, grammar rules in DCG themselves flmction as deduction rules.",
                    "sid": 24,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Argunmntation System.",
                    "sid": 25,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many types of common sense reasoning are said to be defeasible; such reasoning involves inferences that are plausible on tile basis of current information, but that rnay be invalidated by new information.",
                    "sid": 26,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Konofige defined a simple and natural system that tbrmalizes such rea~soning.",
                    "sid": 27,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This tbrmalization used arguments specified by schemata, tie showed how the Yale Shooting Problem and the plan recognition problem can be treated in an intuitively satisfying manner by using the argumentation syst.em ARGH [7], [8].",
                    "sid": 28,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to [8], the ARGtI is a tbr- real system, in the sense that its elements are formal objects.",
                    "sid": 29,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is similar in many respects to so-called justification-based 'Duth Maintenance Systems, but differs in tile diversity of argumentation allowed, and in the fact that arguments for a proposition and its negation may coexist without contradiction.",
                    "sid": 30,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Formally, an argulnent is a relation between a set of propositions (the premises of the argument), and another set of propositions (the conclusion of the arguments).",
                    "sid": 31,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Argumentation is started with an initial sel of facts.",
                    "sid": 32,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, argument schemata are used to construct plausible arguments.",
                    "sid": 33,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The process of deciding which arguments are valid is carried out using defeat rules.",
                    "sid": 34,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although there are other formalizations for defeasible reasoning, such as abduction [1], [3], since our main concern is to clarify inferences in sentence analysis and the relations between them, we use the argumentation system here, without consideration of the alternatives.",
                    "sid": 35,
                    "ssid": 25,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "sentence analysis as argmnentation. ",
            "number": "3",
            "sents": [
                {
                    "text": "Sentence analysis is comprised of reasoning processes which derive assumptions/expectations from observed input sentences.",
                    "sid": 36,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From such a viewpoint, sentence analysis is reatly abduction rather than deduction: Baekground +Assum, ption t- sentence Therefore, various decisions pertaining to the assumption expectations are carried out in the sentence analysis processes.",
                    "sid": 37,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These decisions may be invalidated later in the processes as the analysis becomes further elaborated.",
                    "sid": 38,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ba~sic decisions are performed, when syntactic structures and semantic structures (logical forms) are extracted along with their contextual analyses.",
                    "sid": 39,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The important point here is that we can view these analysis processes as decisions in a defeasible reasoning process; in this paper, we model this point with an a.rgumeutation process.",
                    "sid": 40,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basic arguments in analysis and related defeat rules ~tre presented in the following.",
                    "sid": 41,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a.1 Chart Parsing as Argumentation Based on the framework that defines chart parsing as deduction, we define arguments corresponding to fundanaental rules of top-down chart parsing, prediction, and completion steps, as follows.",
                    "sid": 42,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "member([a ~-- bT, i, j, a.], Agenda), member([b ÷- ,8, j, j, _], Agenda) [sn+l }{ere, Chart and Agenda respectively denote a chart and an agenda list as in usual implementations of chart parsing.",
                    "sid": 43,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lower case roman and Greek letters indicate schema variables.",
                    "sid": 44,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": ",~en, be,'([a ~-bT, i, j, o.], Agenda), mernber([b +-, j, k, ~], Chart) Is,, c°'2~'~ member([a ,-- 7, i, k, ab], Agenda) Is,,+1 This is for cases where an inactive edge [b ~-, j, k, fl] is in Chart.",
                    "sid": 45,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cases where the inactive edge is in Agenda are described similarly.",
                    "sid": 46,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both of the above arguments may be satisfied when applicable.",
                    "sid": 47,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since, in a chart parsing algorithm, an edge from tile agenda must be removed and added to the chart when the above arguments are applied, the following argument is necessary.",
                    "sid": 48,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "mernber([a ~--fl, i, j, c~], Agenda) [s,, ,a~o,~ me. ber([a i, j, Agenda), rncmbe r( [a ~-- /3, i, j, a] , C h.art ) I.s,~+l Here, we assume that propositions continue to hold unless they are denied.",
                    "sid": 49,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, -- ~ ISn.t-1 A subsume argument is necessary to keep edges nonredundant.",
                    "sid": 50,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is one characteristic of chart parsing.",
                    "sid": 51,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "member(e, Agenda), already-in(e, Chart) Is, '\"~'~ -~mernber( ˘, Agenda) Is,~+l Only when the subsume argument does not hold, is the prediction or completion argument permitted.",
                    "sid": 52,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the following defeat rule is necessary.",
                    "sid": 53,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When both a subsume argument and a pre diction/completion argument are possible, tile former defeats the latter.",
                    "sid": 54,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the important characteristics of chart parsing is that it can control the order of parsing processes, that is, the order of edge selections from the agenda.",
                    "sid": 55,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This aspect is suited for treating defeasible reasoning.",
                    "sid": 56,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To incorporate such control, we modify tile prediction and completion arguments.",
                    "sid": 57,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we select an edge from Agenda and put it on a list called Cache.",
                    "sid": 58,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we apply the prediction and completion argltmeltts to the edge in Cache, and add the resulting edges into Agenda.",
                    "sid": 59,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The selection argument is as follows.",
                    "sid": 60,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "select member(˘,Agenda) [s,~ ==:>.",
                    "sid": 61,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "--member(e, Agenda), member(O, Cache) [sn+ 1 ':['he edge addition argument is modified by replacing Agenda with Cache.",
                    "sid": 62,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several selection arguments are generally possible because of plural edges in Agenda.",
                    "sid": 63,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Selections are classified according to types of edges.",
                    "sid": 64,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following is classification of selection arguments based on types of edges in the premise of the arguments [15].",
                    "sid": 65,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "prediction-type: ˘ = [a ,-- fl, i, i, _] active-type: ˘ = [a ~ 7, i, j, fl] inactive-type: ˘ = [a ~--, i, k, fl] lexical-type: ˘ = lexical inactive edge where we List only 4) in member(˘, Agenda) instead of listing tile whole selection argument.",
                    "sid": 66,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3,2 Sinmlation of LR Parsing for English For selections of instances of selection argument, that is, selection of edges from the agenda, we have the following defeat rules b~sed on [15], which guide the parser to determine an appropriate syntactic structure of English sentences ms the first solution.",
                    "sid": 67,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The deductive parser by [15] simulates LR parsing, which reflects right association and minimal attachment readings.",
                    "sid": 68,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(i) If there is more than one possible argument, prediction-types defeat lexieal-types, which defeat active-types, which defeat passive-types.",
                    "sid": 69,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "260 2 (2) If (1) does not fully order possible arguments, arguments with items ending farther to the right defeat the others.",
                    "sid": 70,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) If (1) and (2) together do not fully order possible arguments, arguments with items constructed from the instantiation of longer rules defeat the othert~.",
                    "sid": 71,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Shieber devised the above preferences based on correspondences between an I,P~.",
                    "sid": 72,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "parser and a chart parser, and on preferences of shift/reduce and reduce/reduce conflicts in English [13].",
                    "sid": 73,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Japanese Sentence Analysis 4,1 Simulation of LR Parsing for Japanese For ,Japanese sentences, however, the above defeat rules are inappropriate.",
                    "sid": 74,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Japanese sentences have the following characteristics.",
                    "sid": 75,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "* When we read/hear a. Japanese sentence from left.",
                    "sid": 76,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "to right, we usually relate the word/phrase just, read to the next word.",
                    "sid": 77,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "- A Japanese sentence generally have a recursive structure derived by a rule modifier + h{ad [2].",
                    "sid": 78,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These two characteristics result in a tendency for .lapanese sentences to have left.",
                    "sid": 79,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "branching structures like [[[[[[[[neko ga] oikaketa] ,,czur,d] gel tabeta] .,;akana] ,vet] shinsendatla] (The fish that the rat that the cat chased ate was fresh.)",
                    "sid": 80,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[9].",
                    "sid": 81,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\\Ve can capture the left.",
                    "sid": 82,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "branching characteristics by the strategy of re&tee preference when shifl/rc&~ce conflicts occur against Shieber's strategy, llere, these arguments do not me~m that a aapnese sentence always has a left branching structure, but they\" do mean that the preferable reading tram to resuhs in the left branching structure, provided that linguistic constraints are satisfied, i, br example, R)r 7'arc, ga kou,,~ ~i iku (Taro Subj park Goal go.",
                    "sid": 83,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"Taro goes to a park.\"), the structure is [[Taro gel,, v [[kouen ni]vv ikuv]8@, mtd is not left branching, since Taro ga is not related to kouen.",
                    "sid": 84,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, we try to combine 7~r0 ga with Ko,ten, and since a relation between \"/at0 9a and Konen does not hold, the above structure is tried.",
                    "sid": 85,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To simulate the strategy of reduce preference when shill/red'ace cont]icts occur, the following three rules in addition to (1) replace rules (2) and (3) for a [)roper treatment of Japanese.",
                    "sid": 86,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4) If (1) does not fl~lly order possible arguments, arguments with longer items defeat the others.",
                    "sid": 87,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Length is defined as ending position minus starting position.)",
                    "sid": 88,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5) If (1) and (4) together do not fully order possible arguments, arguments with items starting farther to the left defeat the others.",
                    "sid": 89,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "((i) If (1), (4) and (5) together do not fully or der possible arguments, arguments with items pushed into the agenda earlier dethat the others.",
                    "sid": 90,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rules (4) and (5) are based on the preference for left, branching structures.",
                    "sid": 91,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Becm.lse these preferences tend to prevent the parser from proceeding to the right, rule (6) is necessary for longer phrases.",
                    "sid": 92,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These rules have been tested for basic sentences [17], some of which are syntactically ambiguous.",
                    "sid": 93,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, there are many Japanese noun phrases that have the following pattern.",
                    "sid": 94,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "N1 no N~.",
                    "sid": 95,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "no ... no Nk N1 poss Nu poss ... poss Nk N~, of N~-I of ... of N1 Generally there can be 2\"-1(2n3)!!/n! possibli- ties for this noun phrase, which is computed by dependency combinations like ((((N1 no N2) no) ...,~o)N,,).",
                    "sid": 96,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Contemporary parsing technology is based on con> plex feature structures.",
                    "sid": 97,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chart parsing uses such linguistic constraints presented by features when completion and/or prediction steps are applied as in [14].",
                    "sid": 98,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accordingly, for example, a compleX, ion argument for cases where an inactive edge is in the chart is as follows.",
                    "sid": 99,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"membe,'([a ~-- b 7, i,j, a, el, Cache), member( [b ,-, j, k, fl, f ], Chart), unify(e, [b: f], g)Is,~ ~'°'2~ ~t~ rnember([a +-- 7, i, k, ctb,g], Agenda) Isn+, where e,f and g are feature structures, and .unify(x, y, z) means that z is the result of unifying x and y. Feature structures uniformly represent various lingtlistic constraints such as subcategorizations, gaps, unbounded dependencies, and logical forms.",
                    "sid": 100,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A problem of this representation scheme is that it describes all possible constraints in one structure and deals with them at once.",
                    "sid": 101,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is inefficient with many copy operations due to unfications of unnecessary features that do not contribute to successful unification [6].",
                    "sid": 102,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus treatments such as strategic unification [6] have been developed.",
                    "sid": 103,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It seems that a preferable approach is to treat linguistic constraints piecew'ise, taking into consider> tion abductivity of parsing, uniform integration of various linguistic proc~ssings, and the problem of a unificat.ion-based approach.",
                    "sid": 104,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From this point of view, we describe such treatments as, especially, incorporation of word properties, case analyses, composition of logical forms, and interpretMon of noun phrases with adnominal particles.",
                    "sid": 105,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This section discusses the incorporation of word properties, and the following section the others.",
                    "sid": 106,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word properties are incorporated using lexical arguments when a. lexical edge is in Cache.",
                    "sid": 107,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, semantic categories of Tarv (boy's name) are incorporated using the following lexical argument.",
                    "sid": 108,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": ".~,.t~,.([Xv ~., O, 1, Ta,.o, X], Ca,:he), scategorg(Taro, Animate) [s,~ ,,.oun~.ov scatcgorg( X, Animate) Is,~4.1 3 261 where the edge representation is redefined adding the identifier X for the edge.",
                    "sid": 109,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "seategowj(x, e) means that x's semantic category is c. Likewise, proposition partiele(x,p) is introduced for edge [P ~--, i,j,p, a:] corresponding to a particle.",
                    "sid": 110,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Properties of constituents are generally propagated to their mother.",
                    "sid": 111,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, since the above Taro and ga (subject e~se particle) are combined to make a postpositional phrase (Pp), their properties are propagated to the postpositional phrase, and used for case analyses.",
                    "sid": 112,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "member([Pp +-, i, j, Np P, x y z], Cache), seatcgory(y, c), particle(z, p) Is,, vpeategorvO:, p, e) where ppcategory(a~,p,c) means that postpositional phrase Pp identified as a~ has particle p, usually a case particle, and semantic category e. A subcategorization frame for a verb is introduced as follows 1 member([S ~, j, k, v, x], Cache), subcat(v, role,p, c) !,s,, ~%':~,'ov subcat(x, role,p,c) {s,,+l where subcat(v,role,p,c) means thai.",
                    "sid": 113,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "verb v sub-categorizes for a postpositional phrase with particle p and semantic category c. For example, subcat( X, Sub j, Ga, Animate) is introduced for edge [S +--,2,3,asobu, X] corresponding to verb asobu (play).",
                    "sid": 114,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is an argument for an intransitive verb.",
                    "sid": 115,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, for simplicity, we use the intransitive ease.",
                    "sid": 116,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Arguments for plural case roles can be represented in a similar manner by just adding extra subcat predicates for the other cast roles like subcat(v, role2, P2, C2).",
                    "sid": 117,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Like the property propagation of postpositional phrases, when the above edge [S --+, j, k, v, z] is combined with active edge [S ~ S, i,j, Pp, z y z], a sub- categorization frame is propargated for later use, as follows.",
                    "sid": 118,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "member(IS +--, i, j, Pp S, x y z], Cache), member([S ~, j, k, v, z], Chart), subcat( z, role, p, c) [s,~ ,,,b~rov subcat(x, role,p, c) Is,,+~ 4.3 Case Analysis Arguments.",
                    "sid": 119,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two important characteristics of Japanese sentences are that it exhibit fi'ee word order, and that it has zero pronouns, i.e., subjects or objects which are not explicitly expressed, but are supplied from the context.",
                    "sid": 120,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accordingly, ease particles and semantic categories of head nouns are necessary to analyze relations between postpositionM phrases (Pp) and verbs (v).",
                    "sid": 121,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In some cases, only modal particles are used instead of case particles [11].",
                    "sid": 122,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, semantic categories are important for subeategorization or case analysis.",
                    "sid": 123,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These characteristics of Japanese inevitably necessitate defeat rules for practical analyses.",
                    "sid": 124,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 Here, we assume that a verb itself can be ~ Japanese sentence, and use Japanese gr~tmmar rules including S -+ v, and S --* PpS [17]..",
                    "sid": 125,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two basic arguments of case analysis are a rule for obligatory e~tses (subcategorization) and a rule for optional cases (adjunction).",
                    "sid": 126,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subeategorization The argument for obligatory case analysis is as fob lows.",
                    "sid": 127,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pp S, i, j, V d, Cache), subcat( z, role, p, c), ppeategory(y , p, c) ls'n $ubcat relation(z, y, role) [s,~+a where relation(z,y, role) means that the postpositional phrase y is the case role of phra.se z. For example, when there is ppcategory(Y , Ga, Animate) corresponding to postpositional phrase Pp with identifier Y, and there is subcat(Z, Subj, Ga, Animate) corresponding to sentence S with identifier Z, we get relation(X, Y, Sub j).",
                    "sid": 128,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adjunetlon The argument for optional case analysis is as follows.",
                    "sid": 129,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "member([S ~, Pp S, i, j, x y z], Cache), adjunction(y, role, p, c), ppcategory( y, p, c) I*,, ~dj~io~ relation(z, y, role)Isn+l where adjunetion(y, role,p, c) means that postpositional phrase y modifies sentence z in the relation role when y h~s the postposition particle p and the semantic category c. 2 The properW a@unetion(y, role, p, c) is introduced for particles or adverbial nouDs, No case relation holds when the above arguments do not hold, which is represented by the following argument.",
                    "sid": 130,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "member([S ,-, Pp S, i, j, a~ y z], Cache), subcat(z, role,p, c) [sn cr]ailurc -,relation(z, y, role) Isn+l There is a similar argnment for an adjunct case.",
                    "sid": 131,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The above argument always holds when it is applicable, but it should be defeated when the subcategorization or adjunction argument holds.",
                    "sid": 132,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we haw~ the following defeat rule.",
                    "sid": 133,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a subcategorizaiton or adjunction argument holds, the case relation failure argument is defeated.",
                    "sid": 134,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When a case relation failure argument holds, it is preferable to retract the premise edge which triggered case relation analyses.",
                    "sid": 135,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is represented by tile following argument.",
                    "sid": 136,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "member([S' +--, Pp S, i, j, x v z], C.d,e), -~relation( z, .Y,.",
                    "sid": 137,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "role) Is,, ,.c,r~ct -,member([S +--, ep S, i,j, x y z], Cache) Ix 2Strictly speaking, there are correlations between types of adjunctive phrases (Pp) and types of setences (S) [10].",
                    "sid": 138,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we do not represent such correl,~tions for simplici ty.",
                    "sid": 139,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Composition of Logical Forms Like case analyses, composition of logical forms is treated as follows.",
                    "sid": 140,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "member([S ~--, i, j, Pp S, x y z], Cache), lf(z,p(a')), If(a, a'), relation(z, a, ,') Is, ']~'P lf(x,p(a')) I,s,~+, This is an argument for an intransitive verb where lf(x,x') is introduced by lexieal edge introductions, and means that the logical form of the constituent x is x'.",
                    "sid": 141,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The premise predicates of this argument are satisfied providied that instances of relation(z, y, role) and lf(y, y') hoht.",
                    "sid": 142,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the case of Taro ga asobu (Taro subj-case play, \"Taro plays\"), If(X, play(Taro)) holds when l f ( Z, play(a')), If(Y, Taro), and relation(Z, Y, Subj) hold.",
                    "sid": 143,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The above two rules result in the possibility that a given Pp may fill both obligatory and optional c~Lses.",
                    "sid": 144,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, the requirements ,subcat(y, role, p, c), adjunction(y, role, p, c), and ppcategory(y, p, c) in the above rules are too strict, for practical liguistic processings, since there are noun phrases with modal particles, no particles, and no strict category matches.",
                    "sid": 145,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we relax the requirement ppcategory(y, p, c) replacing it with one of the following conditions.",
                    "sid": 146,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, if some of the arguments having the following conditions hold, a given Pp can fill the corresponding case roles.",
                    "sid": 147,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(a) ppeategory(y, p, c), (b) ppcategory(y, p, e'), isa(c', c), (c) ppcategory(y, p, c'), -~i,sa(c', e), (d) ppcate,aory(y, p', c), (e) ppca* 9orv(y, p', i,a(c', if) pp ategorv(v, p', c'), c), where isa(e', c) means that c is a super semantic category of e', and m(p') means that / is a modal particle.",
                    "sid": 148,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, when we replace the requirement condition in the two arguments given above with conditions (a) -(f), we obtain twelve arguments for case analysis.",
                    "sid": 149,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This results in the possibility that some constituent may be analyzed as filling more than one possible case role.",
                    "sid": 150,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we need defeat rnles to select the appropriate case analysis argument.",
                    "sid": 151,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following are two basic defeat rules.",
                    "sid": 152,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) Generally, the strength order is (a) > (b) > (c) \"> (d) > (e) > (f) except :for the following condition (2).",
                    "sid": 153,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(e) and (f) do not hold for optional cases.",
                    "sid": 154,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) If both obligatory and optional cases fill (a) or (b), the obligatory case defeats the optional case.",
                    "sid": 155,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, (a)ob > (b)ob > (a)op > (b)op.",
                    "sid": 156,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fact.",
                    "sid": 157,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "that (c) and (f) cannot be satisfied by optional cases means that semantics is important when optional information is expressed.",
                    "sid": 158,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rule (2) means that syntax is important when case particles are expressed explicitly.",
                    "sid": 159,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the sentence Walashi mo non-da.",
                    "sid": 160,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I modal-particle drink-past.",
                    "sid": 161,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I drank (something), too.",
                    "sid": 162,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "an argument using (d) concludes that watashi mo is the subject, while one using (f) concludes that it is the object.",
                    "sid": 163,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As (d) defeats (f), walashi rao is deter-- mined to be the subject.",
                    "sid": 164,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the sentence Budoushu mo non-da.",
                    "sid": 165,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "wine modal-particle drink-past.",
                    "sid": 166,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Someone) drank wine, too.",
                    "sid": 167,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the reverse conditions hold.",
                    "sid": 168,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F'or noun phrases with relative clauses constructed by Np -~ 3 Np, the Np on the right of S may be a case element of S. In such cases, we use properly t)pcategory(x,p,c) with variable p, which is not in-stanciated when applied, and it is assumed that only (a.) and (b)hold.",
                    "sid": 169,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As for such a problem, interpretation of Japanese noun phrase patterns of the type A no B, which abound in Japanese [16], is a good testbed.",
                    "sid": 170,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A no B, which consists of two nouns A and Ł' with an adnominal particle no, and which has at.",
                    "sid": 171,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "least the same ambiguity as B of A, is generally interpreted by assuming an appropriate predicate [16].",
                    "sid": 172,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, densha no mado (a window of a train) is interpreted as densha (train) ni (Loc) aru (be) mado (window), supplementing a verb amt (be).",
                    "sid": 173,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A no 1) is generally ambiguous when taken out of context as IIanako no e (\"the picture of Hanako\" or \"ttanako's picture\") with a range of possible semantic relations including possession, producer, purchase, and con--tent.",
                    "sid": 174,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can interpret semantic relations of A no B by using arguments in a similar way as before For example, from the following sentence IIanako wa e o kakimasu.",
                    "sid": 175,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "llanako paints a picture.",
                    "sid": 176,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tile propositions If(X1, Paint(Hanako, O)) and If (X2, Picture(O)) hold.",
                    "sid": 177,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this context, we can in terpret an A no B relation of the following sentence Kono Hanako no e wa kireida.",
                    "sid": 178,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This picture of Hanako is beautififl.",
                    "sid": 179,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the second sentence, the relation(Y, z, No) and If(Y, Hanako) hold for an edge correspoinding to Pp (Hanako no), and If(Z, Picture(O)), lf(Z, p(a',O)), lf(a,a'), relation(a, Z, No) for an edge Np (e).",
                    "sid": 180,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we have propositions relation(Y, Z, No) and lf(X, p(Zlanako, O)) based on the following argument.",
                    "sid": 181,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 rnember([Np +--, Pp Np, i, k, x y z], Cache), lf(z,p(y', z')), relation(y, z, No), If(y, y') Is~ a_,_~ If(x, p(y', z')) I.%+1 Finally, we get Paint(Hanako, O) using the following argument, relation(y, z, No), lf(z,p(al, a2)), lf(c, q(al,a~)) [s,~ in_~o lf(z, q(al, a2)) ISn+l and thereby complement the meaning of Hanako no e by extrapolating the verb Paint.",
                    "sid": 182,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If it is learned that Hanako in fact bought the picture, and not painted it, the final interpretation is defeated using the same framework.",
                    "sid": 183,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conclusion We have presented an argumentation-based model of Japanese sentence analysis, which is essentially abductive.",
                    "sid": 184,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe that this model is well suited for sentence analyses including various linguistic processings under conditions where information expressed by utterances is partial and its interpretation depends on context, for the following reason.",
                    "sid": 185,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since [3] J. tlobbs, M. Stickel, P. Martin, and D. Edwards.",
                    "sid": 186,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Interpretation as abduction.",
                    "sid": 187,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Proceedings of the 26th Annual Meeting of the Association for Computational Linguistics, 1988.",
                    "sid": 188,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[4] M. Kameyama.",
                    "sid": 189,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A property-sharing constraint in centering.",
                    "sid": 190,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Proceedings of the 2~th Annual Meeting of the Association for Computational Linguistics, 1986.",
                    "sid": 191,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[5] M. Kay.",
                    "sid": 192,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Algorithm Schemata and Data Structures in Syntactic Processing.",
                    "sid": 193,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Technical P~eport CSL80-12, Xerox PARC, 1980.",
                    "sid": 194,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[6] K. Kogure.",
                    "sid": 195,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Strategic lazy incrementM copy graph unification.",
                    "sid": 196,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Proceeding of the 13th International Conference on Computational Linguistics, 1990.",
                    "sid": 197,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[7] K. Konolige.",
                    "sid": 198,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Defensible argumentation in reasoning about events.",
                    "sid": 199,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Proceeding of the International Symposium on Machine Intelligence and Systems, Torino, Italy, 1988.",
                    "sid": 200,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[8] K. Konolige and M. E. Pollack.",
                    "sid": 201,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ascribing plans to agents.",
                    "sid": 202,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Proceeding of the llth International Joint Conference on Artificial hztelligence, 1989.",
                    "sid": 203,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[9] S. Kuno.",
                    "sid": 204,
                    "ssid": 169,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Japanese Grammar (in Japanese).",
                    "sid": 205,
                    "ssid": 170,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Taishukan, 1973.",
                    "sid": 206,
                    "ssid": 171,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the argumentation system is incremental and has the ability to cope with resource limitations [8], the analysis systems based on this argumentation system can return an appropriate decision that has been derived to that point.",
                    "sid": 207,
                    "ssid": 172,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The original heuristics to which arguments and defeat rules are formally described have been tested with about a thousand sentences over a period of more than five years.",
                    "sid": 208,
                    "ssid": 173,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For case analysis, arguments and defeat rules that handle zero prononns [4] could be introduced, thereby making reasoning about case analysis much more precise.",
                    "sid": 209,
                    "ssid": 174,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generally speaking, defeat rules for case analyses are based on the idea that, for new information, syntactic constraints are preferred, and, for old information, semantic and wag- matic constraints preferred.",
                    "sid": 210,
                    "ssid": 175,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, arguments such as those presented by [8] will also be necessary.",
                    "sid": 211,
                    "ssid": 176,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such arguments should be integrated with the arguments described in this paper.",
                    "sid": 212,
                    "ssid": 177,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgment",
            "number": "",
            "sents": [
                {
                    "text": "I would like to thank Douglas Appelt, Jerry Hobbs, Yasuhiro Katagiri, Masahito Kawamori, Kiyoshi Kogure, Kurt Konolige, Shozo Naito, Martha Pollack, and Ikuo Takeuchi for their discussion, comments, and improvements on this research and paper.",
                    "sid": 213,
                    "ssid": 178,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}