{
    "ID": "C98-1097",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Text Segmentation Using Reiteration and Collocation",
                    "sid": 0,
                    "ssid": 0,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A method is presented for segmenting text into subtopic areas.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proportion of related pairwise words is calculated between adjacent windows of text to determine their lexical similarity.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lexical cohesion relations of reiteration and collocation are used to identify related words.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These relations are automatically located using a combination of three linguistic features: word repetition, collocation and relation weights.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method is shown to successfully detect known subject changes in text and corresponds well to the segmentations placed by test subjects.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Many examples of heterogeneous data can be found in daily life.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Wall Street Journal archives, for example, consist of a series of articles about different subject areas.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Segmenting such data into distinct topics is useful for information retrieval, where only those segments relevant to a user's query can be retrieved.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Text segmentation could also be used as a pre-processing step in automatic summarisation.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each segment could be summarised individually and then combined to provide an abstract for a document.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous work on text segmentation has used term matching to identify clusters of related text.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Salton and Buckley (1992) and later, Hearst (1994) extracted related text pmtions by matching high frequency terms.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yaari ( 1997) segmented text into a hierarchical structure, identifying sub-segments of larger segments.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ponte and Croft ( 1997) used word co-occurrences to expand the number of terms for matching.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reynar ( 1994) compared all Lindsay J. Evett Department of Computing Nottingham Trent University Nottingham NGI 4BU, UK lje@doc.ntu.ac.uk words across a text rather than the more usual nearest neighbours.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A problem with using word repetition is that inappropriate matches can be made because of the lack of contextual information (Salton et al., 1994).",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another approach to text segmentation is the detection of semantically related words.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hearst (1993) incorporated semantic information derived from WordNet but in later work reported that this information actually degraded word repetition results (Hearst, 1994).",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Related words have been located using spreading activation on a semantic network (Kozima, 1993), although only one text was segmented.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another approach extracted semantic information from Roget's Thesaurus (RT).",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexical cohesion relations (Halliday and Hasan, 1976) between words were identified in RT and used to construct lexical chains of related words in five texts (Morris and Hirst, 1991 ).",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It was reported that the lexical chains closely correlated to the intentional structure (Grosz and Sidner, 1986) of the texts, where the start and end of chains coincided with the intention ranges.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, RT does not capture all types of lexical cohesion relations.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In previous work, it was found that collocation (a lexical cohesion relation) was under-represented in the thesaurus.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, this process was not automated and relied on subjective decision making.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following Morris and Hirst's work, a segmentation algorithm was developed based on identifying lexical cohesion relations across a text.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed algorithm is fully automated, and a quantitative measure of the association between words is calculated.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This algorithm utilises linguistic features additional to those captured in the thesaurus to identify the other types of lexical cohesion relations that can exist in text.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 Background Theory: Lexical Cohesion.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cohesion concerns how words in a text are related.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The major work on cohesion in English was conducted by Halliday and Hasan (1976).",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An instance of cohesion between a pair of elements is referred to as a tie.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ties can be anaphoric or cataphoric, and located at both the sentential and suprasentential level.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Halliday and Hasan classified cohesion under two types: grammatical and lexical.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Grammatical cohesion is expressed through the grammatical relations in text such as ellipsis and conjunction.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexical cohesion is expressed through the vocabulary used in text and the semantic relations between those words.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Identifying semantic relations in a text can be a useful indicator of its conceptual structure.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexical cohesion is divided into three classes: general noun, reiteration and collocation.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "General noun's cohesive function is both grammatical and lexical, although Halliday and Hasan's analysis showed that this class plays a minor cohesive role.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, it was not further considered.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reiteration is subdivided into four cohesive effects: word repetition (e.g. ascent and ascent), synonym (e.g. ascent and climb) which includes near-synonym and hyponym, superordinate (e.g. ascent and task) and general word (e.g. ascent and thing).",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The effect of general word is difficult to automatically identify because no common referent exists between the general word and the word to which it refers.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A collocation is a predisposed combination of words, typically pairwise words, that tend to regularly co-occur (e.g. orange and peel).",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All semantic relations not classified under the class of reiteration are attributed to the class of collocation.",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "identifying lexical cohesion. ",
            "number": "2",
            "sents": [
                {
                    "text": "To automatically detect lexical cohesion tics between pairwise words, three linguistic features were considered: word repetition, collocation and relation weights.",
                    "sid": 45,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first two methods represent lexical cohesion relations.",
                    "sid": 46,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word repetition is a component of the lexical cohesion class of reiteration, and collocation is a lexical cohesion class in its entirety.",
                    "sid": 47,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining types of lexical cohesion considered, include synonym and superordinate (the cohesive effect of general word was not included).",
                    "sid": 48,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These types can be identified using relation weights (Jobbins and Evett, 1998).",
                    "sid": 49,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word repetition: Word repetition ties in lexical cohesion are identified by same word matches and matches on inflections derived from the same stem.",
                    "sid": 50,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An inflected word was reduced to its stem by look­ up in a lexicon (Keenan and Evett, 1989) comprising inflection and stem word pair records (e.g. \"orange oranges\").",
                    "sid": 51,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Collocation: Collocations were extracted from a seven million word sample of the Longman English Language Corpus using the association ratio (Church and Hanks, 1990) and outputted to a lexicon.",
                    "sid": 52,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Collocations were automatically located in a text by looking up pairwise words in this lexicon.",
                    "sid": 53,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 shows the record for the headword orange followed by its collocates.",
                    "sid": 54,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the pairwise words orange and peel form a collocation.",
                    "sid": 55,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "orange free green lemon peel red state yellow Figure 1.",
                    "sid": 56,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Excerpt from the collocation lexicon.",
                    "sid": 57,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Relation Weights: Relation weights quantify the amount of semantic relation between words based on the lexical organisation of RT (Jobbins and Evett, 1995).",
                    "sid": 58,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A thesaurus is a collection of synonym groups, indicating that synonym relations are captured, and the hierarchical structure of RT implies that superordinate relations are also captured.",
                    "sid": 59,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An alphabetically-ordered index of RT was generated, referred to as the Thesaurus Lexicon (TLex).",
                    "sid": 60,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Relation weights for pairwise words are calculated based on the satisfaction of one or more of four possible connections in TLex.",
                    "sid": 61,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "proposed segmentation algorithm. ",
            "number": "3",
            "sents": [
                {
                    "text": "The proposed segmentation algorithm compares adjacent windows of sentences and determines their lexical similarity.",
                    "sid": 62,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A window size of three sentences was found to produce the best results.",
                    "sid": 63,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Multiple sentences were compared because calculating lexical similarity between words is too fine (Rotondo, 1984) and between individual sentences is unreliable (Salton and Buckley, 1991).",
                    "sid": 64,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexical similarity is calculated for each window comparison based on the proportion of related words, and is given as a normalised score.",
                    "sid": 65,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word repetitions are identified between identical words and words derived from the same stem.",
                    "sid": 66,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "troughs placed subject change linguistic feature points located average std.",
                    "sid": 67,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "dev.",
                    "sid": 68,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(out of 42 poss.)",
                    "sid": 69,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "word repetition 7.1 3.16 41 collocation (97.6%) word repetition 7.3 5.22 41 relation weights (97.6%) 41 Collocations are located by looking up word pairs in the collocation lexicon.",
                    "sid": 70,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Relation weights are word repetition 8.5 3.62 (97.6%) calculated between pairwise words according to their location in RT.",
                    "sid": 71,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lexical similarity score indicates the amount of lexical cohesion demonstrated by two windows.",
                    "sid": 72,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Scores plotted on a graph show a series of peaks (high scores) and troughs (low scores).",
                    "sid": 73,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Low scores indicate a weak collocation 5.8 3.70 40 relation weights (95.2%) word repetition 40 collocation 6.4 4.72 (95.2%) relation weights 39 level of cohesion.",
                    "sid": 74,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, a trough signals a potential subject change and texts can be relation weights 7 4.23 (92.9%) segmented at these points.",
                    "sid": 75,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiment 1: locating subject change. ",
            "number": "4",
            "sents": [
                {
                    "text": "An investigation was conducted to determine whether the segmentation algorithm could reliably locate subject change in text.",
                    "sid": 76,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Method: Seven topical articles of between 250 to 450 words in length were extracted from the World Wide Web.",
                    "sid": 77,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A total of 42 texts for test data were generated by concatenating pairs of these articles.",
                    "sid": 78,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, each generated text consisted of two articles.",
                    "sid": 79,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The transition from the first article to the second represented a known subject change point.",
                    "sid": 80,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous work has identified the breaks between concatenated texts to evaluate the performance of text segmentation algorithms (Reynar, 1994; Stairmand, 1997).",
                    "sid": 81,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each text, the troughs placed by the segmentation algorithm were compared to the location of the known subject change point in that text.",
                    "sid": 82,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An error margin of one sentence either side of this point, determined by empirical analysis, was allowed.",
                    "sid": 83,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results: Table I gives the results for the comparison of the troughs placed by the segmentation algorithm to the known subject change points.",
                    "sid": 84,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "collocation 6.3 3.83 35 (83.3%) Table 1.",
                    "sid": 85,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparison of segmentation algorithm using different linguistic features.",
                    "sid": 86,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discussion: The segmentation algorithm using the linguistic features word repetition and collocation in combination achieved the best result.",
                    "sid": 87,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A total of 41 out of a possible 42 known subject change points were identified from the least number of troughs placed per text (7.I).",
                    "sid": 88,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the text where the known subject change point went undetected, a total of three troughs were placed at sentences 6, 11 and 18.",
                    "sid": 89,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The subject change point occurred at sentence 13, just two sentences after a predicted subject change at sentence 11.",
                    "sid": 90,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this investigation, word repetition alone achieved better results than using either collocation or relation weights individually.",
                    "sid": 91,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The combination of word repetition with another linguistic feature improved on its individual result, where less troughs were placed per text.",
                    "sid": 92,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiment 2: test subject evaluation. ",
            "number": "5",
            "sents": [
                {
                    "text": "The objective of the current investigation was to determine whether all troughs coincide with a subject change.",
                    "sid": 93,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The troughs placed by the algorithm were compared to the segmentations identified by test subjects for the same texts.",
                    "sid": 94,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Method: Twenty texts were randomly selected for test data each consisting of approximately 500 words.",
                    "sid": 95,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These texts were presented to seven test subjects who were instructed to identify the sentences at which a new subject area commenced.",
                    "sid": 96,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No restriction was placed on the number of subject changes that could be identified.",
                    "sid": 97,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Segmentation points, indicating a change of subject, were determined by the agreement of three or more test subjects (Litman ami Passonneau, 1996).",
                    "sid": 98,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adjacent segmentation points were treated as one point because it is likely that they refer to the same subject change.",
                    "sid": 99,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The troughs placed by the segmentation algorithm were compared to the segmentation points identified by the test subjects.",
                    "sid": 100,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Experiment 1, the top five approaches investigated identified at least 40 out of 42 known subject change points.",
                    "sid": 101,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to that success, these five approaches were applied in this experiment.",
                    "sid": 102,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To evaluate the results, the information retrieval metrics precision and recall were used.",
                    "sid": 103,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These metrics have tended to be adopted for the assessment of text segmentation algorithms, but they do not provide a scale of correctness (Beeferman et al., 1997).",
                    "sid": 104,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The degree to which a segmentation point was 'missed' by a trough, for instance, is not considered.",
                    "sid": 105,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Allowing an error margin provides some degree of flexibility.",
                    "sid": 106,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An error margin of two sentences either side of a segmentation point was used by Hearst (1993) and Reynar ( 1994) allowed three sentences.",
                    "sid": 107,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this investigation, an error margin of two sentences was considered.",
                    "sid": 108,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results: Table 2 gives the mean values for the comparison of troughs placed by the segmentation algorithm to the segmentation points identified by the test subjects for all the texts.",
                    "sid": 109,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discussion: The segmentation algorithm usmg word repetition and relation weights in combination achieved mean precision and recall rates of 0.80 and 0.69, respectively.",
                    "sid": 110,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For 9 out of the 20 texts segmented, all troughs were relevant.",
                    "sid": 111,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, many of the troughs placed by the segmentation algorithm represented valid subject Table 2.",
                    "sid": 112,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparison of troughs to segmentation points placed by the test subjects.",
                    "sid": 113,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "changes.",
                    "sid": 114,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both word repetition in combination with collocation and all three features in combination also achieved a precision rate of 0.80 but attained a lower recall rate of 0.62.",
                    "sid": 115,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results demonstrate that supplementing word repetition with other linguistic features can improve text segmentation.",
                    "sid": 116,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an example, a text segmentation algorithm developed by Hearst ( 1994) based on word repetition alone attained inferior precision and recall rates of 0.66 and 0.61.",
                    "sid": 117,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this investigation, recall rates tended to be lower than precision rates because the algorithm identified fewer segments (4.1 per text) than the test subjects (4.5).",
                    "sid": 118,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each text was only 500 words in length and was related to a specific subject area.",
                    "sid": 119,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These factors limited the degree of subject change that occurred.",
                    "sid": 120,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, the test subjects tended to identify subject changes that were more subtle than the algorithm could detect.",
                    "sid": 121,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conclusion The text segmentation algorithm developed used three linguistic features to automatically detect lexical cohesion relations across windows.",
                    "sid": 122,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The combination of features word repetition and relation weights produced the best precision and recall rates of 0.80 and 0.69.",
                    "sid": 123,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When used in isolation, the performance of each feature was inferior to a combined approach.",
                    "sid": 124,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This fact provides evidence that different lexical relations are detected by each linguistic feature considered.",
                    "sid": 125,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Areas for improving the segmentation algorithm include incorporation of a threshold for troughs.",
                    "sid": 126,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Currently, all troughs indicate a subject change, however, minor fluctuations in scores may be discounted.",
                    "sid": 127,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Future work with this algorithm should include application to longer documents.",
                    "sid": 128,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With trough thresholding the segments identified in longer documents could detect significant subject changes.",
                    "sid": 129,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Having located the related segments in text, a method of determining the subject of each segment could be developed, for example, for information retrieval purposes.",
                    "sid": 130,
                    "ssid": 38,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}