{
    "ID": "D07-1012",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper compares a deep and a shallow processing approach to the problem of classifying a sentence as grammatically well- formed or ill-formed.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The deep processing approach uses the XLE LFG parser and English grammar: two versions are presented, one which uses the XLE directly to perform the classification, and another one which uses a decision tree trained on features consisting of the XLE’s output statistics.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The shallow processing approach predicts gram- maticality based on n-gram frequency statistics: we present two versions, one which uses frequency thresholds and one which uses a decision tree trained on the frequencies of the rarest n-grams in the input sentence.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We find that the use of a decision tree improves on the basic approach only for the deep parser-based approach.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also show that combining both the shallow and deep decision tree features is effective.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our evaluation is carried out using a large test set of grammatical and ungrammatical sentences.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ungrammatical test set is generated automatically by inserting grammatical errors into well-formed BNC sentences.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "This paper is concerned with the task of predicting whether a sentence contains a grammatical error.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An accurate method for carrying out automatic ∗Also affiliated to IBM CAS, Dublin.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "grammaticality judgements has uses in the areas of computer-assisted language learning and grammar checking.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparative evaluation of existing error detection approaches has been hampered by a lack of large and commonly used evaluation error corpora.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We attempt to overcome this by automatically creating a large error corpus, containing four different types of frequently occurring grammatical errors.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use this corpus to evaluate the performance of two approaches to the task of automatic error detection.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One approach uses low-level detection techniques based on POS n-grams.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other approach is a novel parser-based method which employs deep linguistic processing to discriminate grammatical input from ungrammatical.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For both approaches, we implement a basic solution, and then attempt to improve upon this solution using a decision tree classifier.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that combining both methods improves upon the individual methods.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "N-gram-based approaches to the problem of error detection have been proposed and implemented in various forms by Atwell(1987), Bigert and Knutsson (2002), and Chodorow and Leacock (2000) amongst others.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Existing approaches are hard to compare since they are evaluated on different test sets which vary in size and error density.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, most of these approaches concentrate on one type of grammatical error only, namely, context-sensitive or real- word spelling errors.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We implement a vanilla n- gram-based approach which is tested on a very large test set containing four different types of error.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idea behind the parser-based approach to error detection is to use a broad-coverage handcrafted precision grammar to detect ungrammatical sen 112 Proceedings of the 2007 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning, pp.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "112–121, Prague, June 2007.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2007 Association for Computational Linguistics tences.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach exploits the fact that a precision grammar is designed, in the traditional generative grammar sense (Chomsky, 1957), to distinguish grammatical sentences from ungrammatical sentences.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is in contrast to treebank-based grammars which tend to massively overgenerate and do not generally aim to discriminate between the two.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order for our approach to work, the coverage of the precision grammars must be broad enough to parse a large corpus of grammatical sentences, and for this reason, we choose the XLE (Maxwell and Kaplan, 1996), an efficient and robust parsing system for Lexical Functional Grammar (LFG) (Kaplan and Bresnan, 1982) and the ParGram English grammar (Butt et al., 2002) for our experiments.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This system employs robustness techniques, some borrowed from Optimality Theory (OT) (Prince and Smolen- sky, 1993), to parse extra-grammatical input (Frank et al., 1998), but crucially still distinguishes between optimal and suboptimal solutions.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evaluation corpus is a subset of an ungrammatical version of the British National Corpus (BNC), a 100 million word balanced corpus of British English (Burnard, 2000).",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This corpus is obtained by automatically inserting grammatical errors into the original BNC sentences based on an analysis of a manually compiled “real” error corpus.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper makes the following contributions to the task of automatic error detection: 1.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A novel deep processing XLE-based approach",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "an effective and novel application of decision. ",
            "number": "2",
            "sents": [
                {
                    "text": "tree machine learning to both shallow and deep approaches",
                    "sid": 33,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "a novel combination of deep and shallow pro- ",
            "number": "3",
            "sents": [
                {
                    "text": "cessing",
                    "sid": 34,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "an evaluation of an n-gram-based approach on. ",
            "number": "4",
            "sents": [
                {
                    "text": "a wider variety of errors than has previously been carried out",
                    "sid": 35,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "a large evaluation error corpus",
            "number": "5",
            "sents": [
                {
                    "text": "The paper is organised as follows: in Section 2, we describe previous approaches to the problem of error detection; in Section 3, a description of the error corpus used in our evaluation experiments is presented, and in Section 4, the two approaches to error detection are presented, evaluated, combined and compared.",
                    "sid": 36,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 5 provides a summary and suggestions for future work.",
                    "sid": 37,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Background.",
                    "sid": 38,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Precision Grammars.",
                    "sid": 39,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A precision grammar is a formal grammar designed to distinguish ungrammatical from grammatical sentences.",
                    "sid": 40,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is in contrast to large treebank-induced grammars which often accept ungrammatical input (Charniak, 1996).",
                    "sid": 41,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While high coverage is required, it is difficult to increase coverage without also increasing the amount of ungrammatical sentences that are accepted as grammatical by the grammar.",
                    "sid": 42,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most publications in grammar-based automatic error detection focus on locating and categorising errors and giving feedback.",
                    "sid": 43,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Existing grammars are reused (Vandeventer Faltin, 2003), or grammars of limited size are developed from scratch (Reuer, 2003).",
                    "sid": 44,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ParGram English LFG is a handcrafted broad-coverage grammar developed over several years with the XLE platform (Butt et al., 2002).",
                    "sid": 45,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The XLE parser uses OT to resolve ambiguities (Prince and Smolensky, 1993).",
                    "sid": 46,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Grammar constraints resulting in rare constructions can be marked as “dis- preferred” and constraints resulting in common ungrammatical constructions can be marked as “ungrammatical”.",
                    "sid": 47,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of constraint ordering and marking increases the robustness of the grammar, while maintaining the grammatical / ungrammatical distinction (Frank et al., 1998).",
                    "sid": 48,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The English Resource Grammar (ERG) is a precision Head- Driven Phrase Structure Grammar (HPSG) of English (Copestake and Flickinger, 2000; Pollard and Sag, 1994).",
                    "sid": 49,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its coverage is not as broad as the XLE English grammar.",
                    "sid": 50,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Baldwin et al.",
                    "sid": 51,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) propose a method to identify gaps in the grammar.",
                    "sid": 52,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Blunsom and Baldwin (2006) report ongoing development.",
                    "sid": 53,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There has been previous work using the ERG and the XLE grammars in the area of computer-assisted language learning.",
                    "sid": 54,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bender et al.",
                    "sid": 55,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) use a version of the ERG containing mal-rules to parse ill- formed sentences from the SST corpus of Japanese learner English (Emi et al., 2004).",
                    "sid": 56,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They then use the semantic representations of the ill-formed input to generate well-formed corrections.",
                    "sid": 57,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Khader et al.",
                    "sid": 58,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) study whether the ParGram English LFG can be used for computer-assisted language learning by adding additional OT marks for ungrammatical constructions observed in a learner corpus.",
                    "sid": 59,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the evaluation is preliminary, on only 50 test items.",
                    "sid": 60,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 N-gram Methods Most shallow approaches to grammar error detection originate from the area of real-word spelling error correction.",
                    "sid": 61,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A real-word spelling error is a spelling or typing error which results in a token which is another valid word of the language in question.",
                    "sid": 62,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The (to our knowledge) oldest work in this area is that of Atwell (1987) who uses a POS tagger to flag POS bigrams that are unlikely according to a reference corpus.",
                    "sid": 63,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While he speculates that the bi- gram frequency should be compared to how often the same POS bigram is involved in errors in an error corpus, the proposed system uses the raw frequency with an empirically established threshold to decide whether a bigram indicates an error.",
                    "sid": 64,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the same paper, a completely different approach is presented that uses the same POS tagger to consider spelling variants that have a different POS.",
                    "sid": 65,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the example sentence I am very hit the POS of the spelling variant hot/JJ is added to the list NNVB-VBDVBN of possible POS tags of hit.",
                    "sid": 66,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the POS tagger chooses hit/JJ, the word is flagged and the correction hot is proposed to the user.",
                    "sid": 67,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike most n-gram-based approaches, Atwell’s work aims to detect grammar errors in general and not just real-word spelling errors.",
                    "sid": 68,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, a complete evaluation is missing.",
                    "sid": 69,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idea of disambiguating between the elements of confusion sets is related to word sense disambiguation.",
                    "sid": 70,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Golding (1995) builds a classifier based on a rich set of context features.",
                    "sid": 71,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mays et al.",
                    "sid": 72,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1991) apply the noisy channel model to the disambiguation problem.",
                    "sid": 73,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each candidate correction S′ of the input S the probability P (S′)P (S|S′) is calculated and the most likely correction selected.",
                    "sid": 74,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method is reevaluated by Wilcox-O’Hearn et al.",
                    "sid": 75,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006) on WSJ data with artificial real-word spelling errors.",
                    "sid": 76,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bigert and Knutsson (2002) extend upon a basic n-gram approach by attempting to match n-grams of low frequency with similar n-grams in order to reduce overflagging.",
                    "sid": 77,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, n-grams crossing clause boundaries are not flagged and the similarity measure is adapted in the case of phrase boundaries that usually result in low frequency n-grams.Chodorow and Leacock (2000) use a mutual in formation measure in addition to raw frequency of n- grams.",
                    "sid": 78,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Apart from this, their ALEK system employs other extensions to the basic approach, for example frequency counts from both generic and word- specific corpora are used in the measures.",
                    "sid": 79,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not reported how much each of these contribute to the overall performance.",
                    "sid": 80,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rather than trying to implement all of the previous n-gram approaches, we implement the basic approach which uses rare n-grams to predict grammaticality.",
                    "sid": 81,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This property is shared by all previous shallow approaches.",
                    "sid": 82,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also test our approach on a wider class of grammatical errors.",
                    "sid": 83,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 Ungrammatical Data.",
                    "sid": 84,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we discuss the notion of an artificial error corpus (Section 3.1), define the type of ungrammatical language we are dealing with (Section 3.2), and describe our procedure for creating a large artificial error corpus derived from the BNC (Section 3.3).",
                    "sid": 85,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 An Artificial Error Corpus.",
                    "sid": 86,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to meaningfully evaluate a shallow versus deep approach to automatic error detection, a large test set of ungrammatical sentences is needed.",
                    "sid": 87,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A corpus of ungrammatical sentences can take the form of a learner corpus (Granger, 1993; Emi et al., 2004), i. e. a corpus of sentences produced by language learners, or it can take the form of a more general error corpus comprising sentences which are not necessarily produced in a language-learning context and which contain competence and performance errors produced by native and non-native speakers of the language (Becker et al., 1999; Foster and Vogel, 2004; Foster, 2005).",
                    "sid": 88,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For both types of error corpus, it is not enough to collect a large set of sentences which are likely to contain an error - it is also necessary to examine each sentence in order to determine whether an error has actually occurred, and, if it has, to note the nature of the error.",
                    "sid": 89,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, like the creation of a treebank, the creation of a corpus of ungrammatical sentences requires time and linguistic knowledge, and is by no means a trivial task.",
                    "sid": 90,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A corpus of ungrammatical sentences which is large enough to be useful can be created automatically by inserting, deleting or replacing words in grammatical sentences.",
                    "sid": 91,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These transformations should be linguistically realistic and should, therefore, be based on an analysis of naturally produced grammatical errors.",
                    "sid": 92,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Automatically generated error corpora have been used before in natural language processing.",
                    "sid": 93,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bigert (2004) and Wilcox-O’Hearn et al.",
                    "sid": 94,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006), for example, automatically introduce spelling errors into texts.",
                    "sid": 95,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we generate a large error corpus by automatically inserting four different kinds of grammatical errors into BNC sentences.",
                    "sid": 96,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Commonly Produced Grammatical Errors.",
                    "sid": 97,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following Foster (2005), we define a sentence to be ungrammatical if all the words in the sentence are well-formed words of the language in question, but the sentence contains one or more error.",
                    "sid": 98,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This error can take the form of a performance slip which can occur due to carelessness or tiredness, or a competence error which occurs due to a lack of knowledge of a particular construction.",
                    "sid": 99,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This definition includes real-word spelling errors and excludes non- word spelling errors.",
                    "sid": 100,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also excludes the abbreviated informal language used in electronic communication.",
                    "sid": 101,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using the above definition as a guideline, a 20,000 word corpus of ungrammatical English sentences was collected from a variety of written texts including newspapers, academic papers, emails and website forums (Foster and Vogel, 2004; Foster, 2005).",
                    "sid": 102,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The errors in the corpus were carefully anal- ysed and classified in terms of how they might be corrected using the three word-level correction operators: insert, delete and substitute.",
                    "sid": 103,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following frequency ordering of the three word-level correction operators was found: substitute (48%) > insert (24%) > delete (17%) > combination (11%) Stemberger (1982) reports the same ordering of the substitution, deletion and insertion correction operators in a study of native speaker spoken language slips.",
                    "sid": 104,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among the grammatical errors which can be corrected by substituting one word for another, the most common errors are real-word spelling errors and agreement errors.",
                    "sid": 105,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, 72% of all errors fall into one of the following four classes: 1.",
                    "sid": 106,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "missing word errors: What are the subjects?",
                    "sid": 107,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "> What the subjects?",
                    "sid": 108,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 109,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "extra word errors: Was that in the summer?",
                    "sid": 110,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "> Was that in the summer in?",
                    "sid": 111,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 112,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "real-word spelling errors: She could not comprehend.",
                    "sid": 113,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "> She could no comprehend.",
                    "sid": 114,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 115,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "agreement errors: She steered Melissa round a corner.",
                    "sid": 116,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "> She steered Melissa round a corners.",
                    "sid": 117,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A similar classification was adopted by Nicholls (1999), having analysed the errors in a learner corpus.",
                    "sid": 118,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our research is currently limited to the four error types given above, i. e. missing word errors, extra word errors, real-word spelling errors and agreements errors.",
                    "sid": 119,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it is possible for it to be extended to handle a wider class of errors.",
                    "sid": 120,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Automatic Error Creation.",
                    "sid": 121,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The error creation procedure takes as input a part- of-speech-tagged corpus of sentences which are assumed to be well-formed, and outputs a corpus of ungrammatical sentences.",
                    "sid": 122,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The automatically introduced errors take the form of the four most common error types found in the manually created corpus, i. e. missing word errors, extra word errors, real- word spelling errors and agreement errors.",
                    "sid": 123,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each sentence in the original tagged corpus, an attempt is made to automatically produce four ungrammatical sentences, one for each of the four error types.",
                    "sid": 124,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the output of the error creation procedure is, in fact, four error corpora.",
                    "sid": 125,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3.1 Missing Word Errors In the manually created error corpus of Foster (2005), missing word errors are classified based on the part-of-speech (POS) of the missing word.",
                    "sid": 126,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "98% of the missing parts-of-speech come from the following list (the frequency distribution in the error corpus is given in brackets): det (28%) > verb (23%) > prep (21%) > pro (10%) > noun (7%) > “to” (7%) > conj (2%) We use this information when introducing missing word errors into the BNC sentences.",
                    "sid": 127,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each sentence, all words with the above POS tags are noted.",
                    "sid": 128,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of these is selected and deleted.",
                    "sid": 129,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The above frequency ordering is respected so that, for example, missing determiner errors are produced more often than missing pronoun errors.",
                    "sid": 130,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No ungrammatical sentence is produced if the original sentence contains just one word or if the sentence contains no words with parts-of-speech in the above list.",
                    "sid": 131,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3.2 Extra Word Errors We introduce extra word errors in the following three ways: 1.",
                    "sid": 132,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Random duplication of any token within a sen-.",
                    "sid": 133,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tence: That’s the way we we learn here.",
                    "sid": 134,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 135,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Random duplication of any POS within a sen-.",
                    "sid": 136,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tence: There it he was.",
                    "sid": 137,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 138,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Random insertion of an arbitrary token into the.",
                    "sid": 139,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sentence: Joanna drew as a long breadth.",
                    "sid": 140,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Apart from the case of duplicate tokens, the extra words are selected from a list of tagged words compiled from a random subset of the BNC.",
                    "sid": 141,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Again, our procedure for inserting extra words is based on the analysis of extra word errors in the 20,000 word error corpus of Foster (2005).",
                    "sid": 142,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3.3 Real-Word Spelling Errors We classify an error as a real-word spelling error if it can be corrected by replacing the erroneous word with another word with a Levenshtein distance of one from the erroneous word, e.g. the and they.",
                    "sid": 143,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on the analysis of the manually created error corpus (Foster, 2005), we compile a list of common English real-word spelling error word pairs.",
                    "sid": 144,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each BNC sentence, the error creation procedure records all tokens in the sentence which appear as one half of one of these word pairs.",
                    "sid": 145,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One token is selected at random and replaced by the other half of the pair.",
                    "sid": 146,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The list of common real-word spelling error pairs contains such frequently occurring words as is and a, and the procedure therefore produces an ill-formed sentence for most input sentences.",
                    "sid": 147,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3.4 Agreement Errors We introduce subject-verb and determiner-noun number agreement errors into the BNC sentences.",
                    "sid": 148,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We consider both types of agreement error equally likely and introduce the error by replacing a singular determiner, noun or verb with its plural counterpart, or vice versa.",
                    "sid": 149,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For English, subject-verb agreement errors can only be introduced for present tense verbs, and determiner-noun agreement errors can only be introduced for determiners which are marked for number, e.g. demonstratives and the indefinite article.",
                    "sid": 150,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The procedure would be more productive if applied to a morphologically richer language.",
                    "sid": 151,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3.5 Covert Errors James (1998) uses the term covert error to describe a genuine language error which results in a sentence which is syntactically well-formed under some interpretation different from the intended one.",
                    "sid": 152,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The prominence of covert errors in our automatically created error corpus is estimated by manually inspecting 100 sentences of each error type.",
                    "sid": 153,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The percentage of grammatical structures that are inadvertently produced for each error type and an example of each one are shown below: • Agreement Errors, 7% Mary’s staff include Jones,Smith and Murphy > Mary’s staff includes Jones,Smith and Murphy • Real-Word Spelling Errors, 10% And then?",
                    "sid": 154,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "> And them?",
                    "sid": 155,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Extra Word Errors, 5%in defiance of the free rider prediction > in de fiance of the free rider near prediction • Missing Word Errors, 13% She steered Melissa round a corner > She steered round a corner The occurrence of these covert errors can be reduced by fine-tuning the error creation procedure but they can never be completely eliminated.",
                    "sid": 156,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, they should not be eliminated from the test data, because, ideally, an optimal error detection system should be sophisticated enough to flag syntactically well-formed sentences containing covert errors as potentially ill-formed.1 4 Error Detection Evaluation.",
                    "sid": 157,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section we present the error detection evaluation experiments.",
                    "sid": 158,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experimental setup is explained in Section 4.1, the results are presented in Section 4.2 and they are analysed in Section 4.3.",
                    "sid": 159,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 An example of this is given in the XLE User Documentation (http://www2.parc.com/isl/groups/nltt/ xle/doc/).",
                    "sid": 160,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The authors remark that an ungrammatical reading of the sentence Lets go to the store in which Lets is missing an apostrophe, is preferable to the grammatical yet implausible analysis in which Lets is a plural noun.",
                    "sid": 161,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Experimental Setup.",
                    "sid": 162,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1.1 Test Data and Evaluation Procedure The following steps are carried out to produce training and test data for this experiment: 1.",
                    "sid": 163,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Speech material, poems, captions and list items.",
                    "sid": 164,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "are removed from the BNC.",
                    "sid": 165,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 million sentences remain.",
                    "sid": 166,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The order of sentences is ran- domised.",
                    "sid": 167,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 168,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the purpose of cross-validation, the corpus.",
                    "sid": 169,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is split into 10 parts.",
                    "sid": 170,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 171,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each part is passed to the 4 automatic error in-.",
                    "sid": 172,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sertion modules described in Section 3.3, resulting in 40 additional sets of varying size.",
                    "sid": 173,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 174,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first 60,000 sentences of each of the 50.",
                    "sid": 175,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sets, i. e. 3 million sentences, are parsed with XLE.2 5.",
                    "sid": 176,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "N-gram frequency information is extracted for the first 60,000 sentences of each set.",
                    "sid": 177,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An additional 20,000 is extracted as held-out data.",
                    "sid": 178,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "joining a quarter of each respective error set.",
                    "sid": 179,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.",
                    "sid": 180,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each error type (including mixed errors).",
                    "sid": 181,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and cross-validation set, the 60,000 grammatical and 60,000 ungrammatical sentences are joined.",
                    "sid": 182,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8.",
                    "sid": 183,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each cross-validation run uses one set out of.",
                    "sid": 184,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the 10 as test data (120,000 sentences) and the remaining 9 sets for training (1,080,000 sentences).",
                    "sid": 185,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiment is a standard binary classification task.",
                    "sid": 186,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The methods classify the sentences of the test sets as grammatical or ungrammatical.",
                    "sid": 187,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the standard measures of precision, recall, f-score and accuracy (Figure 1).",
                    "sid": 188,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "True positives are understood to be ungrammatical sentences that are identified as such.",
                    "sid": 189,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline precision and accuracy is 50% as half of the test data is ungrammatical.",
                    "sid": 190,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If 100% of the test data is classified as ungrammatical, recall will be 100% and f-score 2/3.",
                    "sid": 191,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recall shows the accuracy we would get if the grammatical half of the test data was removed.",
                    "sid": 192,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parametrised methods 2 We use the XLE command parse-testfile with parse- literally set to 1, max xle scratch storage set to 1,000 MB, time- out to 60 seconds, and the XLE English LFG.",
                    "sid": 193,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Skimming is not switched on and fragments are.",
                    "sid": 194,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "M ea su re Fo r m ul a pr eci sio n re cal l f s c o r e a c c u r a c y tp /( tp + f p) tp /( tp + f n) 2p r ∗ re /( pr + re ) (t p + tn )/ (t p + tn + f p + f n) Figure 1: Evaluation measures: tp = true positives, fp = false positives, tn = true negatives, fn = false negatives, pr = precision, re = recall are first optimised for accuracy and then the other measures are taken.",
                    "sid": 195,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, f-scores below the artificial 2/3 baseline are meaningful.",
                    "sid": 196,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1.2 Method 1: Precision Grammar According to the XLE documentation, a sentence is marked with a star (*) if its optimal solution uses a constraint marked as ungrammatical.",
                    "sid": 197,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use this star feature, parser exceptions and zero number of parses to classify a sentence as ungrammatical.",
                    "sid": 198,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1.3 Method 2: POS N-grams In each cross-validation run, the full data of the remaining 9 sets of step 2 of the data generation (see Section 4.1.1) is used as a reference corpus of0.9×4, 200, 000 = 3, 800, 000 assumedly grammat ical sentences.",
                    "sid": 199,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reference corpora and data sets are POS tagged with the IMS TreeTagger (Schmidt, 1994).",
                    "sid": 200,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Frequencies of POS n-grams (n = 2, . . .",
                    "sid": 201,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", 7) are counted in the reference corpora.",
                    "sid": 202,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A test sentence is flagged as ungrammatical if it contains an n-gram below a fixed frequency threshold.",
                    "sid": 203,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Method 2 has two parameters: n and the frequency threshold.",
                    "sid": 204,
                    "ssid": 169,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1.4 Method 3: Decision Trees on XLE Output The XLE parser outputs additional statistics for each sentence that we encode in six features: • An integer indicating starredness (0 or 1) and various parser exceptions (-1 for time out, -2 for exceeded memory, etc.) • The number of optimal parses3 • The number of unoptimal parses • The duration of parsing • The number of subtrees • The number of words 3 The use of preferred versus dispreferred constraints are used to distinguish optimal parses from unoptimal ones.",
                    "sid": 205,
                    "ssid": 170,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training data for the decision tree learner is composed of 9×60, 000 = 540, 000 feature vectors from grammatical sentences and 9 × 15, 000 = 135, 000 feature vectors from ungrammatical sentences of each error type, resulting in equal amounts of grammatical and ungrammatical training data.",
                    "sid": 206,
                    "ssid": 171,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We choose the weka implementation of machine learning algorithms for the experiments (Witten and Frank, 2000).",
                    "sid": 207,
                    "ssid": 172,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use a J48 decision tree learner with the default model.",
                    "sid": 208,
                    "ssid": 173,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1.5 Method 4: Decision Trees on N-grams Method 4 follows the setup of Method 3.",
                    "sid": 209,
                    "ssid": 174,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the features are the frequencies of the rarest n-grams (n = 2, . . .",
                    "sid": 210,
                    "ssid": 175,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", 7) in the sentence.",
                    "sid": 211,
                    "ssid": 176,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the feature vector of one sentence contains 6 numbers.",
                    "sid": 212,
                    "ssid": 177,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1.6 Method 5: Decision Trees on Combined Feature Sets This method combines the features of Methods 3 and 4 for training a decision tree.",
                    "sid": 213,
                    "ssid": 178,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Results.",
                    "sid": 214,
                    "ssid": 179,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 shows the results for Method 1, which uses XLE starredness, parser exceptions4 and zero parses to classify grammaticality.",
                    "sid": 215,
                    "ssid": 180,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows the results for Method 2, the basic n-gram approach.",
                    "sid": 216,
                    "ssid": 181,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows the results for Method 3, which classifies based on a decision tree of XLE features.",
                    "sid": 217,
                    "ssid": 182,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results for Method 4, the n-gram-based decision tree approach, are shown in Table 4.",
                    "sid": 218,
                    "ssid": 183,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, Table 5 shows the results for Method 5 which combines n- gram and XLE features in decision trees.",
                    "sid": 219,
                    "ssid": 184,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of Method 2, we first have to find optimal parameters.",
                    "sid": 220,
                    "ssid": 185,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As only very limited integer values for n and the threshold are reasonable, an exhaustive search is feasible.",
                    "sid": 221,
                    "ssid": 186,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We considered n = 2, . . .",
                    "sid": 222,
                    "ssid": 187,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", 7 and frequency thresholds below 20,000.",
                    "sid": 223,
                    "ssid": 188,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Separate held- out data (400,000 sentences) is used in order to avoid overfitting.",
                    "sid": 224,
                    "ssid": 189,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Best accuracy is achieved with 5-grams and a threshold of 4.",
                    "sid": 225,
                    "ssid": 190,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 reports results with these parameters.",
                    "sid": 226,
                    "ssid": 191,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 XLE parsing (see footnote 2 for configuration) runs out of time for 0.7 % and out of memory for 2.5 % of sentences, measured on training data of the first cross-validation run, i. e. 540,000 grammatical sentence and 135,000 of each error type.",
                    "sid": 227,
                    "ssid": 192,
                    "kind_of_tag": "s"
                },
                {
                    "text": "14 sentences of 3 million caused the parser to terminate abnormally.",
                    "sid": 228,
                    "ssid": 193,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Er ro r ty pe P r. R e.F Sc . Ac c. A gr ee m en t R e al w o r d E xt ra w o r d M is si n g w o r d 66 .2 63 .5 64 .4 59 .2 64 .6 57 .3 59 .7 47 .8 6 5 . 4 6 0 . 3 6 2 . 0 5 2 . 9 65 .8 62 .2 63 .4 57 .4 Mi xe d err or s 63 .5 57 .3 6 0 . 3 62 .2 Table 1: Classification results with XLE starredness, parser exceptions and zero parses (Method 1) Er ro r ty pe P r. R e.F Sc . Ac c. A gr ee m en t R e al w o r d E xt ra w o r d M is si n g w o r d 58 .6 64 .0 64 .8 57 .2 51 .7 64 .9 67 .3 48 .8 5 5 . 0 6 4 . 5 6 6 . 0 5 2 . 7 57 .6 64 .2 65 .4 56 .1 Mi xe d err or s 61 .5 58 .2 5 9 . 8 60 .8 Table 2: Classification results with 5-gram and frequency threshold 4 (Method 2) The standard deviation of results across cross- validation runs is below 0.006 on all measures, except for Method 4.",
                    "sid": 229,
                    "ssid": 194,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore we only report average percentages.",
                    "sid": 230,
                    "ssid": 195,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The highest observed standard deviation is 0.0257 for recall of Method 4 on agreement errors.",
                    "sid": 231,
                    "ssid": 196,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Methods 3, 4 and 5, the decision tree learner optimises accuracy and, in doing so, chooses a trade- off between precision and recall.",
                    "sid": 232,
                    "ssid": 197,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Analysis.",
                    "sid": 233,
                    "ssid": 198,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both Method 1 (Table 1) and Method 2 (Table 2) achieve above baseline accuracy for all error types.",
                    "sid": 234,
                    "ssid": 199,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, Method 1, which uses the XLE starred feature, parser exceptions and zero parses to determine whether or not a sentence is grammatical, slightly outperforms Method 2, which uses the fre Er ro r ty pe P r. R e.F Sc . Ac c. A gr ee m en t R e al w o r d E xt ra w o r d M is si n g w o r d 67 .0 63 .4 63 .0 59 .7 79 .3 67 .6 66 .4 57 .8 7 2 . 6 6 5 . 4 6 4 . 7 5 8 . 7 70 .1 64 .3 63 .7 59 .4 Mi xe d err or s 63 .4 67 .8 6 5 . 6 64 .4 Table 3: Classification results with decision tree on XLE output (Method 3) Er ro r ty pe P r. R e.F Sc . Ac c. A gr ee m en t R e al w o r d E xt ra w o r d M is si n g w o r d 61 .2 65 .3 66 .4 59 .1 53 .8 64 .3 67 .4 49 .2 5 7 . 3 6 4 . 8 6 6 . 9 5 3 . 7 59 .9 65 .1 66 .7 57 .5 Mi xe d err or s 63 .3 58 .7 6 0 . 9 62 .3 Table 4: Classification results with decision tree on vectors of frequency of rarest n-grams (Method 4) Er ro r ty pe P r. R e.F Sc . Ac c. A gr ee m en t R e al w o r d E xt ra w o r d M is si n g w o r d 67 .1 65 .8 65 .9 61 .2 75 .2 70 .7 71 .2 58 .0 7 0 . 9 6 8 . 1 6 8 . 5 5 9 . 5 69 .2 67 .0 67 .2 60 .6 Mi xe d err or s 65 .2 68 .8 6 6 . 9 66 .0 Table 5: Classification results with decision tree on joined feature set (Method 5) quency of POS 5-grams to detect an error.",
                    "sid": 235,
                    "ssid": 200,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The XLE deep-processing approach is better than the n- gram-based approach for agreement errors (f-score +10.4).",
                    "sid": 236,
                    "ssid": 201,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examining the various types of agreement errors, we can see that this is especially the case for singular subjects followed by plural copula verbs (recall +37.7) and determiner-noun number mismatches (recall +23.6 for singular nouns and +18.0 for plural nouns), but not for plural subjects followed by singular verbs (recall -24.0).",
                    "sid": 237,
                    "ssid": 202,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relatively poor performance of Method 2 on agreement errors involving determiners could be due to the lack of agreement marking on the Penn Treebank determiner tag used by TreeTagger.",
                    "sid": 238,
                    "ssid": 203,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Method 1 is outperformed by Method 2 for real- word spelling and extra word errors (f-score -4.2, -4.0).",
                    "sid": 239,
                    "ssid": 204,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unsurprisingly, Method 2 has an advantage on those real-word spelling errors that change the POS (recall -8.8 for Method 1).",
                    "sid": 240,
                    "ssid": 205,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both methods perform poorly on missing word errors.",
                    "sid": 241,
                    "ssid": 206,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For both methods there are only very small differences in performance between the various missing word error sub- types (identified by the POS of the deleted word).",
                    "sid": 242,
                    "ssid": 207,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Method 3, which uses machine learning to exploit all the information returned by the XLE parser, improves performance from Method 1, the basic XLE method, for all error types.5 The general improvement comes from an improvement in recall, meaning that more ungrammatical sentences are actually flagged as such without compromising precision.",
                    "sid": 243,
                    "ssid": 208,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The improvement is highest for agreement errors (f-score +7.2).",
                    "sid": 244,
                    "ssid": 209,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Singular subject with plural copula errors (e. g. The man are) peak at a recall of 91.0.",
                    "sid": 245,
                    "ssid": 210,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Method 3 results indicate that information on the number of solutions (optimal and unoptimal), the number of subtrees, the time taken to parse the sentence and the number of words can be used to predict grammaticality.",
                    "sid": 246,
                    "ssid": 211,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It would be interesting to investigate this approach with other parsers.",
                    "sid": 247,
                    "ssid": 212,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Method 4, which uses a decision tree with n- gram-based features, confirms the results of Method 2.",
                    "sid": 248,
                    "ssid": 213,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The decision trees’ root nodes are similar or even.",
                    "sid": 249,
                    "ssid": 214,
                    "kind_of_tag": "s"
                },
                {
                    "text": "identical (depending on cross-validation run) to the decision rule of Method 2 (5-gram frequency below 4).",
                    "sid": 250,
                    "ssid": 215,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the 10 decision trees have between 1,111 and 1,905 nodes and draw from all features, even bigrams and 7-grams that perform poorly on their own.",
                    "sid": 251,
                    "ssid": 216,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The improvements are very small though and they are not significant according the criterion of non-overlapping cross-validation results.",
                    "sid": 252,
                    "ssid": 217,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main reason for the evaluation of Method 4 is to provide another reference point for comparison of the final method.",
                    "sid": 253,
                    "ssid": 218,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall best results are those for Method 5, the combined XLE, n-gram and machine-learning- based method, which outperforms the next best method, Method 3, on all error types apart from agreement errors (f-score -1.7, +2.7, +3.8, +0.8).",
                    "sid": 254,
                    "ssid": 219,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For agreement errors, it seems that the relatively poor results for n-grams have a negative effect on the relatively good results for the XLE.",
                    "sid": 255,
                    "ssid": 220,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows that the performance is almost constant on ungrammatical data in the important sentence length range from 5 to 40.",
                    "sid": 256,
                    "ssid": 221,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, there is a negative correlation of accuracy and sentence length for grammatical sentences.",
                    "sid": 257,
                    "ssid": 222,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Very long sentences of any kind tend to be classified as ungrammatical, except for missing word errors which remain close to the 50% baseline of coin-flipping.",
                    "sid": 258,
                    "ssid": 223,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For all methods, missing word errors are the worst-performing, particularly in recall (i. e. the ac 5 The +0.3 increase in average accuracy for extra word errors is not clearly significant as the results of cross-validation runs overlap.",
                    "sid": 259,
                    "ssid": 224,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2: Accuracy by sentence length for Method 5 measured on separate grammatical and ungrammatical data: Gr = Grammatical, AG = Agreement, RW = Real-Word, EW = Extra Word, MW = Missing Word curacy on ungrammatical data alone).",
                    "sid": 260,
                    "ssid": 225,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that the omission of a word is less likely to result in the sentence being flagged as erroneous.",
                    "sid": 261,
                    "ssid": 226,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, extra word errors perform consistently and relatively well for all methods.",
                    "sid": 262,
                    "ssid": 227,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Conclusion and Future Work.",
                    "sid": 263,
                    "ssid": 228,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluated a deep processing approach and a POS n-gram-based approach to the automatic detection of common grammatical errors in a BNC-derived artificial error corpus.",
                    "sid": 264,
                    "ssid": 229,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are broken down by error type.",
                    "sid": 265,
                    "ssid": 230,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Together with the deep approach, a decision tree machine learning algorithm can be used effectively.",
                    "sid": 266,
                    "ssid": 231,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, extending the shallow approach with the same learning algorithm gives only small improvements.",
                    "sid": 267,
                    "ssid": 232,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Combining the deep and shallow approaches gives an additional improvement on all but one error type.",
                    "sid": 268,
                    "ssid": 233,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our plan is to investigate why all methods perform poorly on missing word errors, to extend the error creation procedure so that it includes a wider range of errors, to try the deep approach with other parsers, to integrate additional features from state- of-the-art shallow techniques and to repeat the experiments for languages other than English.",
                    "sid": 269,
                    "ssid": 234,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "This work is supported by the IRCSET Embark Initiative (basic research grant SC/02/298 and postdoctoral fellowship P/04/232).",
                    "sid": 270,
                    "ssid": 235,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training and test data used in this reseach is based on the British National Corpus (BNC), distributed by Oxford University Computing Services on behalf of the BNC Consortium.",
                    "sid": 271,
                    "ssid": 236,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thank Djame´ Seddah for helping us to run the XLE parsing on the SFI/HEA Irish Centre for High-End Computing (ICHEC) and the authors wish to acknowledge ICHEC for the provision of computational facilities and support.",
                    "sid": 272,
                    "ssid": 237,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}