{
    "ID": "D07-1018",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper assesses the role of multi-label classification in modelling polysemy for language acquisition tasks.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We focus on the acquisition of semantic classes for Catalan adjectives, and show that polysemy acquisition naturally suits architectures used for multi- label classification.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we explore the performance of information drawn from different levels of linguistic description, using feature sets based on morphology, syntax, semantics, and n-gram distribution.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we demonstrate that ensemble classifiers are a powerful and adequate way to combine different types of linguistic evidence: a simple, majority voting ensemble classifier improves the accuracy from 62.5% (best single classifier) to 84%.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "This paper reports on a series of experiments to explore the automatic acquisition of semantic classes for Catalan adjectives.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most important challenge of the classification task is to model the assignment of polysemous lexical instances to multiple semantic classes, combining a) a state-of-the-art Machine Learning architecture for Multi-label Classification (Schapire and Singer, 2000; Ghamrawi and McCallum, 2005) and an Ensemble Classifier (Dietterich, 2002) with b) the definition of features at various levels of linguistic description.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A proper treatment of polysemy is essential in the area of lexical acquisition, since polysemy repre sents a pervasive phenomenon in natural language.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, previous approaches to the automatic acquisition of semantic classes have mostly disregarded the problem (cf.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Merlo and Stevenson, 2001 and Stevenson and Joanis, 2003 for English semantic verb classes, or Schulte im Walde, 2006 for German semantic verb classes).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are a few exceptions to this tradition, such as Pereira et al.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1993), Rooth et al.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1999), Korhonen et al.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2003), who used soft clustering methods for multiple assignment to verb semantic classes.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work addresses the lack of methodology in modelling a polysemous classification.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We implement a multi-label classification architecture to handle polysemy.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper concentrates on the classification of Catalan adjectives, but the general nature of the architecture should allow related tasks to profit from our insights.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As target classification for the experiments, a set of 210 Catalan adjectives was manually classified by experts into three simple and three polysemous semantic classes.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We deliberately decided in favour of a small-scale, broad classification.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So far, there is little work on the semantic classification of adjectives, as opposed to verbal semantic classification.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The semantic classification we propose is a first step in characterising adjectival meaning, and can be refined and extended in subsequent work.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments also provide a thorough comparison of feature sets based on different levels of linguistic description (morphology, syntax, semantics).",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A set of features is defined for each level of description, and its performance is assessed within the series of experiments.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An ensemble classifier comple 171 Proceedings of the 2007 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning, pp.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "171–180, Prague, June 2007.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2007 Association for Computational Linguistics ments the classification architecture, by optimising the combination of these different types of linguistic evidence.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our task is motivated by the fact that adjectives play an important role in sentential semantics: they are crucial in determining the reference of NPs, and in defining properties of entities.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even using only three different classes, the information acquired could be applied to, e.g., identify referents in a given context in Dialog or Question Answering systems, and to induce properties of objects within Information Extraction tasks.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, with the semantic classes corresponding to broad sense representations, they can be exploited for Word Sense Disambiguation.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remainder of this paper is organised as follows.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2 provides background on Catalan adjectives, and Section 3 presents the Gold Standard classification.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 introduces the methodology of the multi-label classification experiments, Section 5 discusses the results, and the improved ensemble classifier is presented in Section 6.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "catalan adjective classes. ",
            "number": "2",
            "sents": [
                {
                    "text": "The definition and characterisation of our target semantic classification follows the proposal by Raskin and Nirenburg (1998) within the framework of On- tological Semantics(Nirenburg and Raskin, 2004).",
                    "sid": 32,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Ontological Semantics, an ontology of concepts modelling the world is explicitly defined, and the semantics of words are mapped onto elements of the ontology.",
                    "sid": 33,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classification pursued in this paper is drawn up based on the ontological sort of adjectival denotation: all adjectives denote properties, but these properties can be instantiated as simple attributes (basic adjectives), relationships to objects (object-related adjectives), or relationships to events (event-related adjectives).",
                    "sid": 34,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basic adjectives are the prototypical adjectives mapped onto event concepts in the ontology.",
                    "sid": 35,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the semantics of tangible (‘tangible’) includes a pointer to the event element touch in the ontology.",
                    "sid": 36,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, object-related adjectives are mapped onto object concepts in the ontology: deformació nasal (‘nasal deformity’) can be paraphrased as deformity that affects the nose, so nasal evokes the object nose.",
                    "sid": 37,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The semantic distinctions are mirrored at several levels of linguistic description, such as morphology, syntax, and semantics.",
                    "sid": 38,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, there is a clear relationship between morphological type and semantic class: basic adjectives are typically non-derived, object adjectives tend to be denominal, and event adjectives are usually deverbal.",
                    "sid": 39,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is the default mapping that one expects from the morphology-semantics interface.",
                    "sid": 40,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an example for syntactic evidence, basic adjectives in Catalan can be used non-restrictively (in a pre-nominal position) and also predicatively, while object adjectives typically cannot.",
                    "sid": 41,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the correspondences between the linguistic properties and the semantic classes are not one-to-one mappings.",
                    "sid": 42,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Taking the morphological level as an example, some denominal adjectives are basic (such as vergonyós ‘shy’, from vergonya ‘shyness’).",
                    "sid": 43,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conversely, some object adjectives are not synchronically denominal (such as botànic ‘botanical’), and some deverbal adjectives are not event- related, such as amable (lit.",
                    "sid": 44,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘suitable to be loved’; has evolved to ‘kind, friendly’).",
                    "sid": 45,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In such cases, the semantic class can be better traced in the distributional properties, not the morphological properties of the adjective.",
                    "sid": 46,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed classification accounts for some cases of adjectival polysemy.",
                    "sid": 47,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, familiar has an object reading (related to the Catalan noun for ‘family’), and a basic reading (corresponding to the English adjective ‘familiar’): which denote attributes or properties and cannot be (1) reunió familiar / cara familiar decomposed further (such as bonic ‘beautiful’, gran ‘big’).",
                    "sid": 48,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Ontological Semantics, these adjectives are mapped to concepts of type attribute.",
                    "sid": 49,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the semantics of the adjective gran specifies a mapping to the size-attribute element in the onto- logy.",
                    "sid": 50,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As for event-related adjectives, they have an event component in their meaning and are therefore meeting familiar / face familiar ‘family meeting / familiar face’ Similarly, the participial adjective sabut (‘known’) has an event-related sense, corresponding to the verb saber (‘know’), and a basic sense equivalent to ‘wise’: (2) conseqüència sabuda / home sabut polysemy.",
                    "sid": 51,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if a lemma was classified consequence known / man wise both as basic and as object in each of the binary de ‘known consequence / wise man’ The polysemy between our proposed classes, as exemplified in (1) and (2), is the kind of polysemy we aim to model in the acquisition experiments reported in this paper.",
                    "sid": 52,
                    "ssid": 21,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "gold standard classes. ",
            "number": "3",
            "sents": [
                {
                    "text": "As a Gold Standard for the experiments to follow, 210 Catalan adjectives were classified by three experts.",
                    "sid": 53,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The adjectives were randomly sampled from an adjective database (Sanromà, 2003), balancing three factors of variability: frequency, morphological type, and suffix.",
                    "sid": 54,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An equal number of adjectives was chosen from three frequency bands (low, medium, high), from four derivational types (denominal, deverbal, non-derived, participle), and from a series of suffixes within each type.",
                    "sid": 55,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The derivational type and suffix of each adjective were available in the adjective database, and had been manually encoded.",
                    "sid": 56,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Three experts assigned the 210 lemmata to one out of six classes: each adjective was tagged as basic (B), event (E), object (O), or as polysemous between basic and event (BE), between basic and object (BO), or between event and object (EO).",
                    "sid": 57,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The decisions were reached by consensus.",
                    "sid": 58,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distribution of the Gold Standard material across classes is shown in the last column of Table 6 (Section 5.2).",
                    "sid": 59,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the acquisition experiments, our aim is to automatically assign a class to each adjective that can be simple (B, E, O) or complex (BE, BO, EO), in case of polysemy.",
                    "sid": 60,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "classification method. ",
            "number": "4",
            "sents": [
                {
                    "text": "Adjective classification was performed within a two- level architecture for multi-label classification: first, make a binary decision on each of the classes, and then combine the classifications to achieve a final, multi-label classification.",
                    "sid": 61,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We therefore decomposed the global decision on the (possibly polysemous) class of an adjective into three binary decisions: Is it basic or not?",
                    "sid": 62,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Is it event-related or not?",
                    "sid": 63,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Is it object- related or not?",
                    "sid": 64,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The individual decisions were then combined into an overall classification that included cisions, it was deemed polysemous (BO).",
                    "sid": 65,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The motivation behind this approach was that polysemous adjectives should exhibit properties of all the classes involved.",
                    "sid": 66,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, positive decisions on each binary classification can be made by the algorithm, which can be viewed as implicit polysemous assignments.",
                    "sid": 67,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This classification architecture is very popular in Machine Learning for multi-label problems, cf.",
                    "sid": 68,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Schapire and Singer, 2000; Ghamrawi and McCallum, 2005), and has also been applied to NLP problems such as entity extraction and noun-phrase chunking (McDonald et al., 2005).",
                    "sid": 69,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remainder of this section describes other methodological aspects of our experiments.",
                    "sid": 70,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Classifier: Decision Trees.",
                    "sid": 71,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As classifier for the binary decisions we chose Decision Trees, one of the most widely used Machine Learning techniques for supervised experiments (Witten and Frank, 2005).",
                    "sid": 72,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Decision Trees provide a transparent representation of the decisions made by the algorithm, and thus facilitate the inspection of results and the error analysis.",
                    "sid": 73,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments were carried out with the freely available Weka software package.",
                    "sid": 74,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The particular algorithm chosen, Weka’s J48, is the latest open source version of C4.5 (Quinlan, 1993).",
                    "sid": 75,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For an explanation of decision tree induction and C4.5, see Quinlan (1993) and Witten and Frank (2005, Sections 4.3 and 6.1).",
                    "sid": 76,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Feature definition.",
                    "sid": 77,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Five levels of linguistic description, formalised as different feature sets, were chosen for our task.",
                    "sid": 78,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They included evidence from morphology (morph), syntax (func, uni, bi), semantics (sem), plus a combination of the five levels (all).",
                    "sid": 79,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 lists the linguistic levels, their explanations, and the number of features used on each level.1 Morphological features (morph) encode the derivational type (denominal, deverbal, participial, non-derived) and the suffix (in case the adjective is derived) of each adjective, and correspond to the manually encoded informa 1 In level all, different features were used for each of the three classes.",
                    "sid": 80,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 reports the mean number of features across the three classes.",
                    "sid": 81,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Le ve l Ex pl an ati on # Fe at ur es m or ph m or ph ol og ica l (d eri va tio na l) pr op ert ies 2 fu nc sy nt act ic fu nc tio n 4 un i uni gr a m dis tri bu tio n 24 bibi gr a m dis tri bu tio n 50 se m dis tri bu tio na l cu es of se m an tic pr op ert ies 18 all co m bi na tio n of th e 5 lin gu ist ic le ve ls 1 0 . 3 Table 1: Linguistic levels as feature sets.",
                    "sid": 82,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tion from the adjective database.",
                    "sid": 83,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic and semantic features encode distributional properties of adjectives.",
                    "sid": 84,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic features comprise three sub- types: (i) the syntactic function (level func) of the adjective, as assigned by a shallow Constraint Grammar (Alsina et al., 2002), distinguishing the modifier (pre-nominal or post-nominal) and predicative functions; (ii) a unigram distribution (level uni), independently encoding the parts of speech (POS) of the words preceding and following the adjective, respectively; and (iii) a bigram distribution (level bi), the POS bigram around the target adjective, considering only the 50 most frequent bigrams to avoid sparse features.",
                    "sid": 85,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantic features (level sem) expand syntactic features with heterogeneous shallow cues of semantic properties.",
                    "sid": 86,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 lists the semantic properties encoded in the features, as well as the number of heuristic cues defined for each property.",
                    "sid": 87,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an example, one of the shallow cues used for gradability was the presence of degree adverbs (més ‘more’, menys ‘less’) to the left of the target adjectives.",
                    "sid": 88,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last set of features, all, combines features from all levels of description.",
                    "sid": 89,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it does not contain all features, but a selection of the most relevant ones (further details in Section 4.3).",
                    "sid": 90,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "property # non-restrictivity 1 predicativity 4 gradability 4 syntactic function of head noun 3 distance to the head noun 1 binaryhood (adjectives with two arguments) 1 agreement properties 2 Table 2: Semantic features.",
                    "sid": 91,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Feature selection.",
                    "sid": 92,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Irrelevant features typically decrease performance by 5 to 10% when using Decision Trees (Witten and Frank, 2005, p. 288).",
                    "sid": 93,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We therefore applied a feature selection algorithm.",
                    "sid": 94,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose a feature selection method available in Weka (WrapperSubsetEval) that selects a subset of the features according to its performance within the Machine Learning algorithm used for classification.",
                    "sid": 95,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accuracy for a given subset of features is estimated by cross-validation over the training data.",
                    "sid": 96,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because the number of subsets increases exponentially with the number of features, this method is computationally very expensive, and we used a best-first search strategy to alleviate this problem.",
                    "sid": 97,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We additionally used the feature selection procedure to select the features for level all: for each class, we used only those features that were selected by the feature selection algorithm in at least 30% of the experiments.",
                    "sid": 98,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.4 Differences across linguistic levels.",
                    "sid": 99,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of our goals was to test the strengths and weaknesses of each level of linguistic description for the task of adjective classification.",
                    "sid": 100,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This was done by comparing the accuracy results obtained with each of the feature sets in the Machine Learning experiments.",
                    "sid": 101,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following a standard procedure in Machine Learning, we created several partitions of the data to obtain different estimates of the accuracy of each of the levels, so as to be able to perform a significance test on the differences in accuracy.",
                    "sid": 102,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We performed 10 experiments with 10-fold cross-validation (10x10 cv for short), so that for each class 100 different binary decisions were made for each adjective.",
                    "sid": 103,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the comparison of accuracies, a standard paired t-test could not be used, because of the inflated Type I er ror probability when reusing data (Dietterich, 1998).",
                    "sid": 104,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, we used the corrected resampled t-test as proposed by Nadeau and Bengio (2003).2",
                    "sid": 105,
                    "ssid": 45,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "classification results. ",
            "number": "5",
            "sents": [
                {
                    "text": "5.1 Accuracy results.",
                    "sid": 106,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The accuracy results for each of the binary decisions (basic/non-basic, event/nonevent, object/non- object) are depicted in Table 3.3 Level bl corresponds to the baseline: the baseline accuracy was determined by assigning all lemmata to the most frequent class.",
                    "sid": 107,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining levels follow the nomenclature in Table 1 above.",
                    "sid": 108,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each column contains the mean and the standard deviation (marked by ±) of the accuracy for the relevant level of information over the 100 results obtained with 10x10 cv.",
                    "sid": 109,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ment over the baseline was significant according to the corrected resampled t-test.",
                    "sid": 110,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And for the event class, only levels morph and all offered a significant improvement in accuracy; the remaining levels even obtained a slightly lower accuracy score.",
                    "sid": 111,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results concern the three individual binary decisions.",
                    "sid": 112,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, our goal was not to obtain three separate decisions, but a single classification including polysemy.",
                    "sid": 113,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 shows the accuracy results for the classification obtained by combining the three individual decisions for each adjective.",
                    "sid": 114,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We report two accuracy measures, full and partial: full accuracy required the class assignments to be identical; partial accuracy only required some overlap in the classification of the Machine Learning algorithm and the Gold Standard for a given class assignment.",
                    "sid": 115,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The motivation for calculating partial overlap was that a class assignment with some overlap with the Gold Standard (even if they were not identical) is generally more useful than a class assignment with no overlap.",
                    "sid": 116,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3: Accuracy results for binary decisions.",
                    "sid": 117,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As one might have expected, the best results were obtained with the all level (bold faced in Table 3), which is the combination of all feature types.",
                    "sid": 118,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This level achieved a mean improvement of 12.3% over the baseline.",
                    "sid": 119,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The differences in accuracy results between most levels of information were, however, rather small.",
                    "sid": 120,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the object class, all levels except for func and uni achieved a significant improvement over the baseline.",
                    "sid": 121,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the basic class, no improve 2 Note that the corrected resampled t-test can only compare accuracies obtained under two conditions (algorithms or, as is our case, feature sets); ANOVA would be more adequate.",
                    "sid": 122,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the field of Machine Learning, there is no established correction for ANOVA for the purposes of testing differences in accuracy (Bouckaert, 2004).",
                    "sid": 123,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we used multiple t-tests instead, which increases the overall error probability of the results for the significance tests.",
                    "sid": 124,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 The accuracy for each decision was computed independently.",
                    "sid": 125,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, a BE adjective was judged correct within the basic class iff the decision was basic; correct within the event class iff the decision was event; and correct within the object class iff the decision was non-object.",
                    "sid": 126,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4: Accuracy results for combined decisions.",
                    "sid": 127,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Again, the best results were obtained with the all level.",
                    "sid": 128,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second best results were obtained with level morph.",
                    "sid": 129,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results could have been expected from the results obtained by the individual decisions (Table 3); however, note that the differences between the various levels are much clearer in the combined classification than in the individual binary decisions.",
                    "sid": 130,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 shows the two-by-two comparisons of the accuracy scores.",
                    "sid": 131,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each cell contains the difference in accuracy means between two levels of description, as well as the level of significance of the difference.",
                    "sid": 132,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The significance is marked as follows: * for p < 0.05, ** for p < 0.01, *** for p < 0.001.",
                    "sid": 133,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If no asterisk is shown, the difference was not significant.Under the strictest evaluation condition (full accu ag re e m en t lev el b l m o r p h f u n c u n i b i s e m mo rph 9 . 7 * * * fun c 2 . 5 * 7 . 1 * * * ful l uni 1 . 4 8 . 3 * * * 1.",
                    "sid": 134,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 bi 2 . 0 7 . 7 * * * 0.",
                    "sid": 135,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 0 . 6 se m 1 . 0 8 . 7 * * * 1.",
                    "sid": 136,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 0.",
                    "sid": 137,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 1 . 0 all 11.4** * 1.7 8.9*** 10.0*** 9.4*** 10.4*** m o r p h 22 .6 ** * f u n c 1 4.",
                    "sid": 138,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 * * * 8 . 0 * * * partial uni 1 1.",
                    "sid": 139,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 * * * 11 .1 ** * 3.",
                    "sid": 140,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 ** b i 1 1.",
                    "sid": 141,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 * * * 10 .9 ** * 2.",
                    "sid": 142,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 ** 0 . 2 s e m 1 3.",
                    "sid": 143,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 * * * 9 . 1 * * * 1.",
                    "sid": 144,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 2 . 0 1 . 8 a l l 2 5.",
                    "sid": 145,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 * * * 2 . 9 * 10 .9 ** * 14 .0 ** * 13 .8 ** * 12 .0 ** * Table 5: Comparison of accuracy scores across linguistic levels.",
                    "sid": 146,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "racy), only levels morph, func, and all significantly improved upon the baseline.",
                    "sid": 147,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Levels morph and all are better than the remaining levels, to a similar extent.",
                    "sid": 148,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the partial evaluation condition, all levels achieved a highly significant improvement over the baseline (p < 0.001).",
                    "sid": 149,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the classifications obtained with any of the feature levels are more useful than the baseline, in the sense that they present more overlap with the Gold Standard.",
                    "sid": 150,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best result obtained for the full classification of adjectives with our methodology achieved a mean of 62.3% (full accuracy) or 90.7% (partial accuracy), which represents an improvement of 11.3% and 25.5% over the baselines, respectively.",
                    "sid": 151,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Levels including morphological information were clearly superior to levels using only distributional information.",
                    "sid": 152,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results suggest that morphology is the best single source of evidence for our task.",
                    "sid": 153,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, recall from Section 3 that the sampling procedure for the Gold Standard explicitly balanced for morphological factors.",
                    "sid": 154,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, denominal and participial adjectives are underrepresented in the Gold Standard, while non-derived and deverbal adjectives are overrepresented.",
                    "sid": 155,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, previous experiments on different datasets (Boleda et al., 2004; Boleda et al., 2005) provided some evidence that distributional information outperforms morphological information for our task.",
                    "sid": 156,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we cannot conclude from the experiments that morphological features are the most important information for the classification of Catalan adjectives in general.",
                    "sid": 157,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Error analysis.",
                    "sid": 158,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The error analysis focuses on the two best feature sets, morph and all.",
                    "sid": 159,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6 compares the errors made by the experiment classifications (based on the two sets of features) against the Gold Standard classification.",
                    "sid": 160,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To obtain a unique experiment classification for each feature level in this comparison, we applied majority voting across the 10 different classifications obtained in the 10 experiment runs for each of the linguistic levels.",
                    "sid": 161,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The table rows correspond to the Gold Standard classification and the columns correspond to the experiment classifications with the feature levels all and morph, respectively.",
                    "sid": 162,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The matches (the diagonal elements) are in italics, and off-diagonal cells representing the largest numbers of mismatches are boldfaced.",
                    "sid": 163,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall number of mistakes made by both levels with majority voting is almost the same: 86 (morph) vs. 89 (all).",
                    "sid": 164,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the mismatches are qualitatively quite different.",
                    "sid": 165,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Level morph uniformly mapped denominal adjectives to both basic and object (BO).",
                    "sid": 166,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of this overgeneration of BOs, 31 lemmata that were tagged as either basic or object in the Gold Standard were assigned to BO.",
                    "sid": 167,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, level all was overly dis- criminative: most of the BO cases (16 out of 23), as well as 16 object adjectives, were assigned to basic.",
                    "sid": 168,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This type of confusion could be explained by the fact that some non-prototypical basic adjectives were as GS Table 6: Levels all and morph against the Gold Standard.",
                    "sid": 169,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "signed to the basic class in the Gold Standard, because they did not fit the narrower definitions of the event and object classes, but these adjectives do not behave like typical basic adjectives.",
                    "sid": 170,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As for event adjectives, the morph level assigned almost all deverbal adjectives to the event class, which worked well in most cases (26).",
                    "sid": 171,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, this mapping cannot distinguish deverbal adjectives with a basic meaning (11 basic and 6 BE adjectives in the Gold Standard).",
                    "sid": 172,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Level all, including morphological and distributional cues, also shows difficulties with the event class, but of a different nature.",
                    "sid": 173,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feature examination showed that the distributional differences between basic and event adjectives are not robust.",
                    "sid": 174,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, according to t-tests performed on the Gold Standard (α = 0.05), only three of the 18 semantic features exhibit significant mean differences for classes basic and event.",
                    "sid": 175,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, ANOVA across the 6 classes (α = 0.05) yields significant differences for 16 out of the 18 features, which indicates that most features serve to distinguish object adjectives from basic and event adjectives.",
                    "sid": 176,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result of the lack of robust distributional differences between basic and event adjectives, 35 basic or event adjectives were classified as BE when using the all level as feature set.",
                    "sid": 177,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further 23 event adjectives were incorrectly classified as BE by the all level, but correctly classified by the morph level, because they are deverbal adjectives.",
                    "sid": 178,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These cases involved adjectives derived from stative verbs, such as abundant (‘abundant’) or preferible (‘preferable’).",
                    "sid": 179,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feature analysis revealed that deverbal adjectives derived from stative verbs are more similar to basic adjectives than those derived from process-denoting verbs.",
                    "sid": 180,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To sum up, the default morphological mapping mentioned in Section 2 works well in most cases but has a clear ceiling, as it cannot account for deviations from the expected mapping.",
                    "sid": 181,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Distributional cues are more sensitive to these deviations, but fail mostly in the distinction between basic and event, because the differences in syntactic distribution between these classes are not robust.",
                    "sid": 182,
                    "ssid": 77,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "an improved classifier. ",
            "number": "6",
            "sents": [
                {
                    "text": "The error analysis in the previous section has shown that, although the number of mistakes made with level morph and all is comparable, the kinds of mistakes are qualitatively very different.",
                    "sid": 183,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that mixing features for the construction of a single Decision Tree, as is done in level all, is not the optimal way to combine the strengths of each level of description.",
                    "sid": 184,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An alternative combination can be achieved with an ensemble classifier, a type of classifier that has received much attention in the Machine Learning community in the last decade (Diet- terich, 2002).",
                    "sid": 185,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When building an ensemble classifier, several class proposals for each item are obtained, and one of them is chosen on the basis of majority voting, weighted voting, or more sophisticated decision methods.",
                    "sid": 186,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has been shown that in most cases, the accuracy of the ensemble classifier is higher than the best individual classifier (Freund and Schapire, 1996; Dietterich, 2000; Breiman, 2001).",
                    "sid": 187,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Within NLP, ensemble classifiers have been applied, for instance, to genus term disambiguation in machine- readable dictionaries (Rigau et al., 1997), using a majority voting scheme upon several heuristics, and to part of speech tagging, by combining the class predictions of different algorithms (van Halteren et levels all and morph, respectively.",
                    "sid": 188,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 7: Results for ensemble classifier.",
                    "sid": 189,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "al., 1998).",
                    "sid": 190,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main reason for the general success of ensemble classifiers is that they gloss over the biases introduced by the individual systems.",
                    "sid": 191,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We implemented an ensemble classifier by using the different levels of description as different subsets of features, and applying majority voting across the class proposals from each level.",
                    "sid": 192,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intuitively, this architecture is analogous to having a team of linguists and NLP engineers, each contributing their knowledge on morphology, n-gram distribution, syntactic properties, etc., and have them reach a consensus classification.",
                    "sid": 193,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thus established a different classification for each of the 10 cross-validation runs by assigning each adjective to the class that received most votes.",
                    "sid": 194,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To enable a majority vote, at least three levels have to be combined.",
                    "sid": 195,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 7 contains a representative selection of the combinations, together with their accuracies.",
                    "sid": 196,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, the accuracies obtained with the baseline (bl) and the best single level (all) are included for comparison.",
                    "sid": 197,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In any of the combinations tested, accuracy improved over 10% with respect to the all level.",
                    "sid": 198,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best result, a mean of 84% (full accuracy), was obtained by combining all levels of description.",
                    "sid": 199,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results represent a raw improvement over the baseline of 33%, and 21.7% over the best single classifier.",
                    "sid": 200,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also note that with this procedure 95.7% of the classifications obtained with the ensemble classifier present partial overlap with the class assignments in the Gold Standard.",
                    "sid": 201,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results show that the combination of different sources of linguistic evidence is more important than the type of information used.",
                    "sid": 202,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an example, consider the second ensemble classifier in Table 7: this classifier excludes the two levels that contain morphological information (morph and all), which represents the most successful individual source of information for our dataset.",
                    "sid": 203,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, the combination achieved 19.2/20.9% more accuracy than",
                    "sid": 204,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "7",
            "sents": [
                {
                    "text": "Adjectives have received less attention than verbs and nouns within Lexical Acquisition.",
                    "sid": 205,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Work by Hatzivassiloglou and colleagues (Hatzivassiloglou and McKeown, 1993; Hatzivassiloglou and McKe- own, 1997; Hatzivassiloglou and Wiebe, 2000) used clustering methods to automatically identify adjectival scales from corpora.",
                    "sid": 206,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Coordination information was used in Bohnet et al.",
                    "sid": 207,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2002) for a classification task similar to the task we pursue, using a bootstrapping approach.",
                    "sid": 208,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The authors, however, pursued a classification that is not purely semantic, between quantitative adjectives (similar to determiners, like viele ‘many’), referential adjectives (heutige, ‘of today’), qualitative adjectives (equivalent to basic adjectives), classificatory adjectives (equivalent to object adjectives), and adjectives of origin (Stuttgarter, ‘from Stuttgart’).",
                    "sid": 209,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a recent paper, Yallop et al.",
                    "sid": 210,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2005) reported experiments on the acquisition of syntactic subcategorisation patterns for English adjectives.",
                    "sid": 211,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Apart from the above research with a classificatory flavour, other lines of research exploited lexical relations among adjectives for Word Sense Disambiguation (Justeson and Katz, 1995; Chao and Dyer, 2000).",
                    "sid": 212,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Work by Lapata (2001), contrary to the studies mentioned so far, focused on the meaning of adjective-noun combinations, not on that of adjectives alone.",
                    "sid": 213,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "8",
            "sents": [
                {
                    "text": "This paper has presented an architecture for the semantic classification of Catalan adjectives that explicitly includes polysemous classes.",
                    "sid": 214,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The focus of the architecture was on two issues: (i) finding an appropriate set of linguistic features, and (ii) defining an adequate architecture for the task.",
                    "sid": 215,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The investigation and comparison of features at various linguistic levels has shown that morphology plays a major role for the target classification, despite the caveats raised in the discussion.",
                    "sid": 216,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Morphological features related to derivational processes are among the simplest types of features to extract, so that the approach can be straightforwardly extended to languages similar to Catalan with no extensive need of resources.",
                    "sid": 217,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we have argued that polysemy acquisition naturally suits multi-label classification architectures.",
                    "sid": 218,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have implemented a standard architecture for this class of problems, and demonstrated its applicability and success.",
                    "sid": 219,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The general nature of the architecture should be useful for related tasks that involve polysemy within the area of automatic lexical acquisition.",
                    "sid": 220,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work has focused on a broad classification of the adjectives, similarly to Merlo and Stevenson (2001), who classified transitive English verbs into three semantic classes.",
                    "sid": 221,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The small number of classes might be considered as an oversimplification of adjective semantics, but the simplified setup facilitates a detailed qualitative evaluation.",
                    "sid": 222,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, as there has been virtually no work on the acquisition of semantic classes for adjectives, it seems sensible to start with a small number of classes and incre- mentally build upon that.",
                    "sid": 223,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous work has demonstrated that multi-label classification is applicable also to a large number of classes as used in, e.g., document categorisation (Schapire and Singer, 2000).",
                    "sid": 224,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This potential can be exploited in future work, addressing a finer-grained adjective classification.",
                    "sid": 225,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we have demonstrated that the combination of different types of linguistic evidence boosts the performance of the system beyond the best single type of information: ensemble classifiers are a more adequate way to combine the linguistic levels of description than simply merging all features for tree construction.",
                    "sid": 226,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using a simple, majority voting ensemble classifier, the accuracy jumped from 62.5% (best single classifier) to 84%.",
                    "sid": 227,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result is impressive by itself, and also in comparison to similar work such as (Rigau et al., 1997), who achieved a 9% improvement on a similar task.",
                    "sid": 228,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our insights are therefore useful in related work which involves the selection of linguistic features in Machine Learning experiments.",
                    "sid": 229,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Future work involves three main lines of research.",
                    "sid": 230,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the refinement of the classification itself, based on the results of the experiments presented.",
                    "sid": 231,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, the use of additional linguistic evidence that contributes to the semantic class distinctions (e.g., selectional restrictions).",
                    "sid": 232,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Third, the application of the acquired information to broader NLP tasks.",
                    "sid": 233,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, given that each semantic class exhibits a particular syntactic behaviour, infor mation on the semantic class should improve POS- tagging for adjective-noun and adjective-participle ambiguities, probably the most difficult distinctions both for humans and computers (Marcus et al., 1993; Brants, 2000).",
                    "sid": 234,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, semantic classes might be useful in terminology extraction, where, presumably, object adjectives participate in terms more often than basic adjectives.4",
                    "sid": 235,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "We thank Roser Sanromà for providing us with the manually annotated database of adjectives, and for being part of the Gold Standard annotation committee.",
                    "sid": 236,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Special thanks also to the Institut d’Estudis Catalans for proding us with the research corpus.",
                    "sid": 237,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The comments of three anonymous reviewers helped improve the paper.",
                    "sid": 238,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the financial support of the Universitat Pompeu Fabra and its Translation and Philology Department and the Fundación Caja Madrid is gratefully acknowledged.",
                    "sid": 239,
                    "ssid": 26,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}