{
    "ID": "D09-1149",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper presents a new approach to selecting the initial seed set using stratified sampling strategy in bootstrapping-based semi-supervised learning for semantic relation classification.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the training data is partitioned into several strata according to relation types/subtypes, then relation instances are randomly sampled from each stratum to form the initial seed set.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also investigate different augmentation strategies in iteratively adding reliable instances to the labeled set, and find that the bootstrapping procedure may stop at a reasonable point to significantly decrease the training time without degrading too much in performance.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experiments on the ACE RDC 2003 and 2004 corpora show the stratified sampling strategy contributes more than the bootstrapping procedure itself.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that a proper sampling strategy is critical in semi-supervised learning.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "With the dramatic increase in the amount of textual information available in digital archives and the WWW, there has been growing interest in techniques for automatically extracting information from text documents.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Information Extraction (IE) is such a technology that IE systems are expected to identify relevant information (usually of predefined types) from text documents in a certain domain and put them in a structured format.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to the scope of the NIST AutomaticContent Extraction (ACE) program (ACE, 2000 2007), current research in IE has three main objectives: Entity Detection and Tracking (EDT), Relation Detection and Characterization (RDC), and Event Detection and Characterization (EDC).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper focuses on the ACE RDC subtask, where many machine learning methods have been proposed, including supervised methods (Miller et al., 2000; Zelenko et al., 2002; Culotta and Soresen, 2004; Kambhatla, 2004; Zhou et al., 2005; Zhang et al., 2006; Qian et al., 2008), semi-supervised methods (Brin, 1998; Agichtein and Gravano, 2000; Zhang, 2004; Chen et al., 2006; Zhou et al., 2008), and unsupervised methods (Hasegawa et al., 2004; Zhang et al., 2005) . Current work on semantic relation extraction task mainly uses supervised learning methods, since it achieves relatively better performance.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However this method requires a large amount of manually labeled relation instances, which is both time-consuming and laborious.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the contrast, unsupervised methods do not need definitions of relation types and hand-tagged data, but it is difficult to evaluate their performance since there are no criteria for evaluation.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, semi-supervised learning has received more and more attention, as it can balance the advantages and disadvantages between supervised and unsupervised methods.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the plenitude of unlabeled natural language data at hand, semi-supervised learning can significantly reduce the need for labeled data with only limited sacrifice in performance.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, a bootstrapping algorithm chooses the unlabeled instances with the highest probability of being correctly labeled and use them to augment labeled training data iteratively.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although previous work (Yarowsky, 1995; Blum and Mitchell, 1998; Abney, 2000; Zhang, 2004) has tackled the bootstrapping approach from both the theoretical and practical point of view, many key problems still remain unresolved, such as the selection of initial seed set.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the size of the initial seed set is usually small (e.g. 1437 Proceedings of the 2009 Conference on Empirical Methods in Natural Language Processing, pages 1437–1445, Singapore, 67 August 2009.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2009 ACL and AFNLP 100 instances), the imbalance of relation types or manifold structure (cluster structure) in it will severely weaken the strength of bootstrapping.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, it is critical for a bootstrapping approach to select the most appropriate initial seed set.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, current systems (Zhang, 2004; Chen et al., 2006) use a randomly sampling strategy, which fails to explore the affinity nature among the training instances.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alternatively, Zhou et al.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) bootstrap a set of weighted support vectors from both labeled and unlabeled data using SVM.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, the initial labeled data is still randomly generated only to ensure that there are at least 5 instances for every relation subtype.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper presents a new approach to selecting the initial seed set based on stratified sampling strategy in the bootstrapping procedure for semi-supervised semantic relation classification.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The motivation behind the stratified sampling is that every relation type should be as much as possible represented in the initial seed set, thus leading to more instances with diverse structures being added to the labeled set.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we also explore different strategies to augment reliably classified instances to the labeled data iteratively, and attempt to find a stoppage criterion for the iteration procedure to greatly decrease the training time, other than using up all the unlabeled set.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of this paper is organized as follows.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, Section 2 reviews related work on semi- supervised relation extraction.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we present an underlying supervised learner in Section 3.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 details various key aspects of the bootstrapping procedure, including the stratified sampling strategy.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experimental results are reported in Section 5.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally we conclude our work in Section 6.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Within the realm of information extraction, currently there are several representative semi- supervised learning systems for extracting relations between named entities.",
                    "sid": 32,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DIPRE (Dual Iterative Pattern Relation Expansion) (Brin, 1998) is a system based on bootstrapping that exploits the duality between patterns and relations to augment the target relation starting from a small sample.",
                    "sid": 33,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it only extracts simple relations such as (author, title) pairs from the WWW.",
                    "sid": 34,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Snowball (Agichtein and Gravano, 2000) is another bootstrapping- based system that extracts relations from unstructured text.",
                    "sid": 35,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Snowball shares much in common with DIPRE, including the use of both the bootstrapping framework and the pattern matching approach to extract new unlabeled instances.",
                    "sid": 36,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to pattern matching techniques, their systems are hard to be adapted to the general problem of relation extraction.",
                    "sid": 37,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhang (2004) approaches the relation classification problem with bootstrapping on top of SVM.",
                    "sid": 38,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He uses various lexical and syntactic features in the BootProject algorithm based on random feature projection to extract top-level relation types in the ACE corpus.",
                    "sid": 39,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation shows that bootstrapping can alleviate the burden of hand annotations for supervised learning methods to a certain extent.",
                    "sid": 40,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chen et al.",
                    "sid": 41,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006) investigate a semi- supervised learning algorithm based on label propagation for relation extraction, where labeled and unlabeled examples and their distances are represented as the nodes and the weights of edges respectively in a connected graph, then the label information is propagated from any vertex to nearby vertices through weighted edges iteratively, finally the labels of unlabeled examples are inferred after the propagation process converges.",
                    "sid": 42,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhou et al.",
                    "sid": 43,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) integrate the advantages of SVM bootstrapping in learning critical instances and label propagation in capturing the manifold structure in both the labeled and unlabeled data, by first bootstrapping a moderate number of weighted support vectors through a co-training procedure from all the available data, and then applying label propagation algorithm via the bootstrapped support vectors.",
                    "sid": 44,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, in most current systems, the initial seed set is selected randomly such that they may not adequately represent the inherent structure of unseen examples, hence the power of bootstrapping may be severely weakened.",
                    "sid": 45,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper presents a simple yet effective approach to generate the initial seed set by applying the stratified sampling strategy, originated from statistics theory.",
                    "sid": 46,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we try to employ the same stratified strategy to augment the labeled set.",
                    "sid": 47,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we attempt to find a reasonable criterion to terminate the iteration process.",
                    "sid": 48,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "underlying supervised learning. ",
            "number": "3",
            "sents": [
                {
                    "text": "A semi-supervised learning system usually consists of two relevant components: an underlying supervised learner and a bootstrapping algorithm on top of it.",
                    "sid": 49,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section we discuss the former, while the latter will be described in the following section.",
                    "sid": 50,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we select Support Vector Machines (SVMs) as the underlying supervised classifier since it represents the state-of-the-art in the machine learning research community, and there are good implementations of the algorithm available.",
                    "sid": 51,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, we use LIBSVM (Chang et al., 2001), an effective tool for support vector classification, since it supports multi-class classification and provides probability estimation as well.",
                    "sid": 52,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each pair of entity mentions, we extract and compute various lexical and syntactic features, as employed in a state-of-the-art relation extraction system (Zhou et al., 2005).",
                    "sid": 53,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) Words: According to their positions, four categories of words are considered: a) the words of both the mentions; b) the words between the two mentions; c) the words before M1; and d) the words after M2.",
                    "sid": 54,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "straightforwardly trained from previously available labeled data as follows: Algorithm self-bootstrapping Require: labeled seed set L Require: unlabeled data set U Require: batch size S Repeat Train a single classifier on L Run the classifier on U Find at most S instances in U that the classifier has the highest prediction confidence Add them into L Until: no data points available or the stoppage condition is reached Figure 1.",
                    "sid": 55,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Self-bootstrapping algorithm In order to measure the confidence of the classifier’s prediction, we compute the entropy of the label probability distribution that the classifier assigns to the class label on an example (the lower the entropy, the higher the confidence): n (2) Entity type: This category of features concerns about the entity types of both the H = −∑ pi log pi i (1) mentions.",
                    "sid": 56,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) Mention Level: This category of features considers the entity level of both the mentions.",
                    "sid": 57,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4) Overlap: This category of features includes the number of other mentions and words between two mentions.",
                    "sid": 58,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typically, the overlap features are usually combined with other features such as entity type and mention level.",
                    "sid": 59,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5) Base phrase chunking: The base phrase chunking is proved to play an important role in semantic relation extraction.",
                    "sid": 60,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of the chunking features concern about the headwords of the phrases between the two mentions.",
                    "sid": 61,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we do not employ any deep syntactic or semantic features (such as dependency tree, full parse tree etc.), since they contribute quite limited in relation extraction.",
                    "sid": 62,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "bootstrapping & stratified sampling. ",
            "number": "4",
            "sents": [
                {
                    "text": "We first present the self-bootstrapping algorithm, and then discuss several key problems on bootstrapping in the order of initial seed selection, augmentation of labeled data and stoppage criterion for iteration.",
                    "sid": 63,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Bootstrapping Algorithm.",
                    "sid": 64,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following Zhang (2004), we define a basic self- bootstrapping strategy, which keeps augmenting the labeled data set with the models Where n denotes the total number of relation classes, and pi denotes the probability of current example being classified as the ith class.",
                    "sid": 65,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Stratified Sampling for Initial Seeds.",
                    "sid": 66,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normally, the number of available labeled instances is quite limited (usually less than 100 instances) when the iterative bootstrapping procedure begins.",
                    "sid": 67,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the distribution of the initial seed set fails to approximate the distribution of the test data, the augmented data generated from bootstrapping would not capture the essence of relation types, and the performance on the test set will significantly decrease even only after one or two rounds of iterations.",
                    "sid": 68,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the selection of initial seed set plays an important role in bootstrapping-based semantic relation extraction.",
                    "sid": 69,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sampling is a part of statistical practice concerned with the selection of individual observations, which is intended to yield some knowledge about a population of interest.",
                    "sid": 70,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When dealing with the task of semi-supervised semantic relation classification, the population is the training set of relation instances from the ACE RDC corpora.",
                    "sid": 71,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compare two practical sampling strategies as follows: (1) Randomly sampling, which picks the initial seeds from the training data using a random scheme.",
                    "sid": 72,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each element thus has an equal probability of selection, and the population is not subdivided or partitioned.",
                    "sid": 73,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Currently, most work on semi-supervised relation extraction employs this method.",
                    "sid": 74,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, since the size of the initial seed set is very small, they are not guaranteed to capture the statistical properties of the whole training data, let alone of the test data.",
                    "sid": 75,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Stratified sampling.",
                    "sid": 76,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When the population embraces a number of distinct categories, stratified sampling (Neyman, 1934) can be applied to this case.",
                    "sid": 77,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the population can be organized by these categories into separate \"strata\", then a sample is selected within each \"stratum\" separately, and randomly.",
                    "sid": 78,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generally, the sample size is normally proportional to the relative size of the strata.",
                    "sid": 79,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main motivation for using a stratified sampling design is to ensure that particular groups within a population are adequately represented in the sample.",
                    "sid": 80,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is well known that the number of the instances for each relation type in the ACE RDC corpora is greatly unbalanced (Zhou et al., 2005) as shown in Table 1 for the ACE RDC 2004 corpus.",
                    "sid": 81,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When the relation instances for a specific relation type occurs frequently in the initial seed set, the classifier will achieve good performance on this type, otherwise the classifier can hardly recognize them from the test set.",
                    "sid": 82,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order for every type of relations to be properly represented, the stratified sampling strategy is applied to the seed selection procedure.",
                    "sid": 83,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1.",
                    "sid": 84,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Numbers of relations on the ACE RDC 2004: break down by relation types and subtypes Figure 2 illustrates the stratified sampling strategy we use in bootstrapping, where RSET denotes the training set, V is the stratification variable, and SeedSET denotes the initial seed set.",
                    "sid": 85,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we divide the relation instances into different strata according to available properties, such as major relation type (considering reverse relations or not) and relation subtype (considering reverse relations or not).",
                    "sid": 86,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then within every stratum, a certain number of instances are sampled randomly, and this number is normally proportional to the size of that stratum in the whole population.",
                    "sid": 87,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, when this number is 0 due to the rounding of real numbers, it is set to 1.",
                    "sid": 88,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also it must be ensured that the total number of instances being sampled is NS.",
                    "sid": 89,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, these instances form the initial seed set and can be used as the input to the underlying supervised learning for the bootstrapping procedure.",
                    "sid": 90,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Require: RSET ={R1,R2,…,RN} Require: V = {v1, v2,…,vK} Require: SeedSET with the size of NS (100) Initialization: SeedSET = NULL Steps: z Group RSET into K strata according to the stratified variable V, i.e.: RSET={RSET1,RSET2,…,RSETK} z Calculate the class prior probability for each stratum i={1,2,…,K} Pi = NUM (RSETi ) / NUM (RSET ) z Caculate the number of intances being sampled for each stratum Ni = Pi ∗ N If Ni =0 then Ni=1 z Calculate the difference of numbers as follows: K N∆ = NS − ∑ Ni i =1 z If N△>0 then add Ni (i=1,2,…,|N△|) by 1 If N△<0 then subtract 1 from Ni (i=1,2,...,|N△|) z For each i from 1 to K Select Ni instances from RESTi randomly Add them into SeedSET Figure 2.",
                    "sid": 91,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Stratefied Sampling for initial seeds 4.3 Augmentation of labeled data.",
                    "sid": 92,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After each round of iteration, some newly classified instances with the highest confidence can be augmented to the labeled training data.",
                    "sid": 93,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, just like the selection of initial seed set, we still wish that every stratum would be represented as appropriately as possible in the instances added to the labeled set.",
                    "sid": 94,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we compare two kinds of augmentation strategies available: (1) Top n method: the classified instances are first sorted in the ascending order by their entropies (i.e. decreasing confidence), and then the top n (usually 100) instances are chosen to be added.",
                    "sid": 95,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Stratified method: in order to make the added instances representative for their stratum, we first select m (usually greater than n) instances with the highest confidence, then we choose n instances from them using the stratified strategy.",
                    "sid": 96,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.4 Stoppage of Iterations.",
                    "sid": 97,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a self-bootstrapping procedure, as the iterations go on, both the reliable and unreliable instances are added to the labeled data continuously, hence the performance will fluctuate in a relatively small range.",
                    "sid": 98,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The key question here is how we can know when the bootstrapping procedure reaches its best performance on the test data.",
                    "sid": 99,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bootstrapping algorithm by Zhang (2004) stops after it runs out of all the training instances, which may take a relatively long time.",
                    "sid": 100,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we present a method to determine the stoppage criterion based on the mean entropy as follows: Hi <= p (2) Where Hi denotes the mean entropy of the confidently classified instances being augmented to the labeled data in each iteration, and p denotes a threshold for the mean entropy, which will be fixed through empirical experiments.",
                    "sid": 101,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This criterion is based on the assumption that when the mean entropy becomes less than or equal to a certain threshold, the classifier would achieve the most reliable confidence on the instances being added to the labeled set, and it may be impossible to yield better performance since then.",
                    "sid": 102,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the iteration may stop at that reasonable point.",
                    "sid": 103,
                    "ssid": 41,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimentation. ",
            "number": "5",
            "sents": [
                {
                    "text": "This section aims to empirically investigate the effectiveness of the bootstrapping-based semi- supervised learning we discussed above for semantic relation classification.",
                    "sid": 104,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, different methods for selecting the initial seed set and augmenting the labeled data are evaluated.",
                    "sid": 105,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Experimental Setting.",
                    "sid": 106,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the ACE corpora as the benchmark data, which are gathered from various newspapers, newswire and broadcasts.",
                    "sid": 107,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ACE 2004 corpus contains 451 documents and 5702 positive relation instances.",
                    "sid": 108,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It defines 7 relation types and 23 subtypes between 7 entity types.",
                    "sid": 109,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For easy reference with related work in the literature, evaluation is also done on 347 documents (including nwire and bnews domains) and 4305 relation instances using 5-fold cross-validation.",
                    "sid": 110,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, these relation instances are first divided into 5 sets, then, one of them (about 860 instances) is used as the test data set, while the others are regarded as the training data set, from which the initial seed set is sampled.",
                    "sid": 111,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the ACE 2003 corpus, the training set consists of 674 documents and 9683 positive relation instances while the test data consists of 97 documents and 1386 positive relation instances.",
                    "sid": 112,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ACE RDC 2003 task defines 5 relation types and 24 subtypes between 5 entity types.",
                    "sid": 113,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpora are first parsed using Collins’s parser (Collins, 2003) with the boundaries of all the entity mentions kept.",
                    "sid": 114,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, the parse trees are converted into chunklink format using chunklink.pl 1.",
                    "sid": 115,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, various useful lexical and syntactic features, as described in Subsection 3.1, are extracted and computed accordingly.",
                    "sid": 116,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the purpose of comparison, we define our task as the classification of the 5 or 7 major relation types in the ACE RDC 2003 and 2004 corpora.",
                    "sid": 117,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For LIBSVM parameters, we adopted the polynomial kernel, and c is set to 10, g is set to 0.15.",
                    "sid": 118,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Under this setting, we achieved the best classification performance.",
                    "sid": 119,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Experimental Results.",
                    "sid": 120,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this subsection, we compare and discuss the experimental results using various sampling strategies, different augmentation methods, and iteration stoppage criterion.",
                    "sid": 121,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparison of sampling strategies in selecting the initial seed set Table 2 and Table 3 show the initial and the highest classification performance of Precision/Recall/F-measure for various sampling strategies of the initial seed set on 7 major relation types of the ACE RDC 2004 corpus respectively when the size of initial seed set L is 100, the batch size S is 100, and the top 100 1 http://ilk.kub.nl/~sabine/chunklink/ instances with the highest confidence are added at each iteration.",
                    "sid": 122,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 also lists the number of strata for stratified sampling methods from which the initial seeds are randomly chosen respectively.",
                    "sid": 123,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 additionally lists the time needed to complete the bootstrapping process (on a PC with a Pentium IV 3.0G CPU and 1G memory).",
                    "sid": 124,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we consider the following five experimental settings when sampling the initial seeds: z Randomly Sampling: as described in Subsection 4.2.",
                    "sid": 125,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "z Stratified-M Sampling: the strata are grouped in terms of major relation types without considering reverse relations.",
                    "sid": 126,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "z Stratified-MR Sampling: the strata are grouped in terms of major relation types, including reverse relations.",
                    "sid": 127,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "z Stratified-S Sampling: the strata are grouped in terms of relation subtypes without considering reverse subtypes.",
                    "sid": 128,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "z Stratified-SR Sampling: the strata are grouped in terms of relation subtypes, including reverse subtypes.",
                    "sid": 129,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each sampling strategies, we performed 20 trials and computed average scores and the total time on the test set over these 20 trials.",
                    "sid": 130,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2.",
                    "sid": 131,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The initial performance of applying various sampling strategies to selecting the initial seed set on the ACE RDC 2004 corpus Table 3.",
                    "sid": 132,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The highest performance of applying various sampling strategies in selecting the initial seed set on the ACE RDC 2004 corpus These two tables jointly indicate that the self- bootstrapping procedure for all sampling strategies can moderately improve the classification performance by ~1.2 units in F- score, which is also verified by Zhang (2004).",
                    "sid": 133,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, they show that: z The most improvements in performance come from improvements in precision.",
                    "sid": 134,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Actually, for some settings the recalls even decrease slightly.",
                    "sid": 135,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason may be that due to the nature of self-bootstrapping, the instances augmented at each iteration are always those which are the most similar to the initial seed instances, therefore the models trained from them would exhibit higher precision on the test set, while it virtually does no help for recall.",
                    "sid": 136,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "z All of the four stratified sampling methods outperform the randomly sampling method to various degrees, both in the initial performance and the highest performance.",
                    "sid": 137,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that sampling of the initial seed set based on stratification by major/sub relation types can be helpful to relation classification, largely due to the performance improvement of the initial seed set, which is caused by adequate representation of instances for every relation type.",
                    "sid": 138,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "z Of all the four stratified sampling methods, the Stratified-SR sampling achieves the best performance of 72.9/68.4/70.6 in P/R/F. Moreover, the more the number of strata generated by the sampling strategy, the more appropriately they would be represented in the initial seed set, and the better performance it will yield.",
                    "sid": 139,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This also implies that the hierarchy of relation types/subtypes in the ACE RDC 2004 corpus is fairly reasonably defined.",
                    "sid": 140,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "z An important conclusion, which can be draw accordingly, is that the F-score improvement of Stratified-SR sampling over Randomly sampling in initial performance (3.3 units) is significantly greater than the F-score improvement gained by bootstrapping itself using Randomly sampling (1.4 units).",
                    "sid": 141,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that the sampling strategy of the initial seed set is even more important than the bootstrapping algorithm itself for relation classification.",
                    "sid": 142,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "z It is interesting to note that the time needed to bootstrap increases with the number of strata.",
                    "sid": 143,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason may be that due to more diverse structures in the labeled data for stratified sampling, the SVM needs more time to differentiate between instances, i.e. more time to learn the models.",
                    "sid": 144,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparison of different augmentation strategies of training data Figure 3 compares the performance of F-score for two augmentation strategies: the Top n method and the stratified method, over various initial seed sampling strategies on the ACE RDC 2004 corpus.",
                    "sid": 145,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each iteration, a variable number (m is ranged from 100 to 500) of classified instances in the decreasing order of confidence are first chosen as the base examples, then at most 100 examples are selected from the base examples to be augmented to the labeled set.",
                    "sid": 146,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, when m is equal to 100, the whole set of the base example is added to the labeled data, i.e. degenerated to the Top n augmentation strategy.",
                    "sid": 147,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, when m is greater than 100, we wish we would select examples of different major relation types from the base examples according to their distribution in the training set, in order to achieve the performance improvement as much as the stratified sampling does in the selection of the initial seed set.",
                    "sid": 148,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "probability of extracting instances of more relation types increases with the increase of the number of the base examples.",
                    "sid": 149,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These two factors inversely interact with each other, leading to the fluctuation in performance.",
                    "sid": 150,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparison of different threshold values for stoppage criterion We compare the performance and bootstrapping time (20 trials with the same initial seed set) when applying stoppage criterion in Formula (2) with different threshold p over various sampling strategies on the ACE RDC 2004 corpus in Figure 4 and Figure 5 respectively.",
                    "sid": 151,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These two figures jointly show that: 72 Randomly.",
                    "sid": 152,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "71 70 Stratified-M.",
                    "sid": 153,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "69 Stratified-MR. 68 Stratified-S.",
                    "sid": 154,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "67 Stratified-SR. 66 65 71 70 69 68 67 Randomly.",
                    "sid": 155,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "64 66 Stratified-M Stratified-MR 65 Stratified-S.",
                    "sid": 156,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "# Base examples Figure 3.",
                    "sid": 157,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparison of two augmentation strategies over different sampling strategies in selecting the initial seed set.",
                    "sid": 158,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This figure shows that, except for randomly sampling strategy, the stratified augmentation strategies improve the performance.",
                    "sid": 159,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, this result is far from our expectation in two ways: z The performance improvement in F-score is trivial, at most 0.4 units on average.",
                    "sid": 160,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason may be that, although we try to add as many as 100 classified instances to the labeled data according to the distribution of every major relation type in the training set, the top m instances with the highest confidence are usually focused on certain relation types (e.g. PHSY and PER-SOC), this leads to the stratified augmentation failing to function effectively.",
                    "sid": 161,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, all the following experiments will only adopt Top n method for augmenting the labeled data.",
                    "sid": 162,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "z With the increase of the number of the base examples, the performance fluctuates slightly, thus it is relatively difficult to recognize where the optima is. We think there are two contradictory factors that affect the performance.",
                    "sid": 163,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the reliability of the instances extracted from the base examples decreases with the increase of the number of base examples, the 64 Stratified-SR. 0 0.2 0.22 0.24 0.26 0.28 0.3 p Figure 4.",
                    "sid": 164,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance for different p values 90 80 Randomly.",
                    "sid": 165,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "70 Stratified-M.",
                    "sid": 166,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "60 Stratified-MR. 50 Stratified-S.",
                    "sid": 167,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "40 Stratified-SR. 30 20 10 0 0 0.2 0.22 0.24 0.26 0.28 0.3 p Figure 5.",
                    "sid": 168,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bootstrapping time for different p values z The performance decreases slowly while the bootstrapping time decreases dramatically with the increase of p from 0 to 0.3.",
                    "sid": 169,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, when the p equals to 0.3, the bootstrapping time tends to be neglected, while the performance is almost similar to the initial performance.",
                    "sid": 170,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It implies that we can find a reasonable point for each sampling strategy, at which the time falls greatly while the performance nearly does not degrade.",
                    "sid": 171,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Re lati on typ es Boo tpro ject L P j s Stratified Bootstrap ping P R F P R F P R F R O LE 7 8 . 5 6 9 . 7 7 3 . 8 8 1 . 0 7 4 . 7 7 7 . 7 7 4 . 7 8 6 . 3 8 0 . 1 PA RT 6 5 . 6 3 4 . 1 4 4 . 9 7 0 . 1 4 1 . 6 5 2 . 2 6 6 . 4 4 7 . 0 5 5 . 0 A T 6 1 . 0 8 4 . 8 7 0 . 9 7 4 . 2 7 9 . 1 7 6 . 6 7 4 . 9 6 6 . 1 7 0 . 2 N E A R 1 3 . 7 1 2 . 5 1 3 . 0 1 0 0 . 0 2 . 9 5 . 6 SO C 4 7 . 0 5 7 . 4 5 1 . 7 4 5 . 0 5 9 . 1 5 1 . 0 6 5 . 2 7 9 . 0 7 1 . 4 Av era ge 6 7 . 9 6 7 . 4 6 7 . 6 7 3 . 6 6 9 . 4 7 0 . 9 7 3 . 8 7 3 . 3 7 3 . 5 Table 4.",
                    "sid": 172,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparison of semi-supervised relation classification systems on the ACE RDC 2003 corpus z Clearly, if the performance is the primary concern, then p=0.2 may be the best choice in that we can get ~30% saving on the time at the cost of only ~0.08 loss in F-score on average.",
                    "sid": 173,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the time is a primary concern, then p=0.22 is a reasonable threshold in that we get ~50% saving on the time at the cost of ~0.25 units loss in F- score on average.",
                    "sid": 174,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that our proposed stoppage criterion is effective to terminate the bootstrapping procedure with minor performance loss.",
                    "sid": 175,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparison of Stratified Bootstrapping with Bootproject and Label propagation Table 4 compares Bootproject (Zhang, 2004), Label propagation (Chen et al., 2006) with our Stratified Bootstrapping on the 5 major types of the ACE RDC 2003 corpus.",
                    "sid": 176,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both Bootproject and Label propagation select 100 initial instances randomly, and at each iteration, the top 100 instances with the highest confidence are added to the labeled data.",
                    "sid": 177,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Differently, we choose 100 initial seeds using stratified sampling strategy; similarly, the top 100 instances with the highest confidence are augmented to the labeled data at each iteration.",
                    "sid": 178,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the lack of comparability followed from the different size of the labeled data used in (Zhou et al., 2008), we omit their results here.",
                    "sid": 179,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "outperforms both Bootproject and Label Propagation methods on the ACE RDC corpus, with the increase of 5.9/4.1 units in F-score on average respectively.",
                    "sid": 180,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Stratified bootstrapping consistently outperforms Bootproject in every major relation type, while it outperforms Label Propagation in three of the major relation types, especially SOC type, with the exception of AT and NEAR types.",
                    "sid": 181,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reasons may be follows.",
                    "sid": 182,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although there are many AT relation instances in the corpus, they are scattered divergently in multi-dimension space so that they tend to be relatively difficult to be recognized via SVM.",
                    "sid": 183,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the NEAR relation instances, they occur least frequently in the whole corpus, so it is very hard for them to be identified via SVM.",
                    "sid": 184,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By contrast, even small size of labeled instances can be fully utilized to correctly induce the unlabeled instances via LP algorithm due to its ability to exploit manifold structures of both labeled and unlabeled instances (Chen et al., 2006).",
                    "sid": 185,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, these results again suggest that the sampling strategy in selecting the initial seed set plays a critical role for relation classification, and stratified sampling can significantly improve the performance due to proper selection of the initial seed set.",
                    "sid": 186,
                    "ssid": 83,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "6",
            "sents": [
                {
                    "text": "This paper explores several key issues in semi- supervised learning based on bootstrapping for semantic relation classification.",
                    "sid": 187,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The application of stratified sampling originated from statistics theory to the selection of the initial seed set contributes most to the performance improvement in the bootstrapping procedure.",
                    "sid": 188,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, the more strata the training data is divided into, the better performance will be achieved.",
                    "sid": 189,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the augmentation of the labeled data using the stratified strategy fails to function effectively largely due to the unbalanced distribution of the confidently classified instances, rather than the stratified sampling strategy itself.",
                    "sid": 190,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we also propose a mean entropy-based stoppage criterion in the bootstrapping procedure, which can significantly decrease the training time with little loss in performance.",
                    "sid": 191,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, it also shows that our method outperforms other state-of-the-art semi-supervised ones.",
                    "sid": 192,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This research is supported by Project 60673041 and 60873150 under the National Natural Science Foundation of China, Project 2006AA01Z147 under the “863” National High- Tech Research and Development of China, Project BK2008160 under the Jiangsu Natural Science Foundation of China, and the National Research Foundation for the Doctoral Program of Higher Education of China under Grant No. 20060285008.",
                    "sid": 193,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would also like to thank the excellent and insightful comments from the three anonymous reviewers.",
                    "sid": 194,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}