{
    "ID": "D09-1115",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Current system combination methods usually use confusion networks to find consensus translations among different systems.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Requiring one-to-one mappings between the words in candidate translations, confusion networks have difficulty in handling more general situations in which several words are connected to another several words.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, we propose a lattice-based system combination model that allows for such phrase alignments and uses lattices to encode all candidate translations.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experiments show that our approach achieves significant improvements over the state-of- the-art baseline system on Chinese-to-English translation test sets.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "System combination aims to find consensus translations among different machine translation systems.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has been proven that such consensus translations are usually better than the output of individual systems (Frederking and Nirenburg, 1994).",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In recent several years, the system combination methods based on confusion networks developed rapidly (Bangalore et al., 2001; Matusov et al., 2006; Sim et al., 2007; Rosti et al., 2007a; Rosti et al., 2007b; Rosti et al., 2008; He et al., 2008), which show state-of-the-art performance in benchmarks.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A confusion network consists of a sequence of sets of candidate words.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each candidate word is associated with a score.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The optimal consensus translation can be obtained by selecting one word from each set to maximizing the overall score.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To construct a confusion network, one first need to choose one of the hypotheses (i.e., candidate translations) as the backbone (also called “skeleton” in the literature) and then decide the word alignments of other hypotheses to the backbone.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hypothesis alignment plays a crucial role in confusion- network-based system combination because it has a direct effect on selecting consensus translations.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, a confusion network is restricted in such a way that only 1-to-1 mappings are allowed in hypothesis alignment.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not the fact even for word alignments between the same languages.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is more common that several words are connected to another several words.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “be capable of” and “be able to” have the same meaning.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although confusion-network-based approaches resort to inserting null words to alleviate this problem, they face the risk of producing degenerate translations such as “be capable to” and “be able of”.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we propose a new system combination method based on lattices.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a more general form of confusion network, a lattice is capable of describing arbitrary mappings in hypothesis alignment.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a lattice, each edge is associated with a sequence of words rather than a single word.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we select phrases instead of words in each candidate set and minimize the chance to produce unexpected translations such as “be capable to”.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compared our approach with the state-of-the-art confusion-network-based system (He et al., 2008) and achieved a significant absolute improvement of 1.23 BLEU points on the NIST 2005 Chinese-to-.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "English test set and 0.93 BLEU point on the NIST 2008 Chinese-to-English test set..",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1105 Proceedings of the 2009 Conference on Empirical Methods in Natural Language Processing, pages 1105–1113, Singapore, 67 August 2009.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2009 ACL and AFNLP He feels like apples He prefer apples He feels like apples He is fond of apples (a) unidirectional alignments He feels like apples He prefer apples He feels like apples He is fond of apples (b) bidirectional alignments lations.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the phrase “is fond of” is attached to an edge.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now, it is unlikely to obtain a translation like “He is like of apples”.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A lattice G = (V, E) is a directed acyclic graph, formally a weighted finite state automation (FSA), where V is the set of nodes and E is the set of edges.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The nodes in a lattice are usually labeled according ε prefer of He feels like ε apples is fond (c) confusion network ε prefer he feels like apples is fond of (d) lattice Figure 1: Comparison of a confusion network and a lattice.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "background. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Confusion Network and Lattice.",
                    "sid": 30,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use an example shown in Figure 1 to illustrate our idea.",
                    "sid": 31,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suppose that there are three hypotheses: to an appropriate numbering to reflect how to produce a translation.",
                    "sid": 32,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each edge in a lattice is attached with a sequence of words as well as the associated probability.",
                    "sid": 33,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As lattice is a more general form of confusion network (Dyer et al., 2008), we expect that replacing confusion networks with lattices will further improve system combination.",
                    "sid": 34,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 IHMM-based Alignment Method.",
                    "sid": 35,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the candidate hypotheses are aligned using Indirect-HMM-based (IHMM-based) alignment method (He et al., 2008) in both direction, we briefly review the IHMM-based alignment method first.",
                    "sid": 36,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Take the direction that the hypothesis is aligned to the backbone as an example.",
                    "sid": 37,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The conditional probability that the hypothesis is generated by the backbone is given by He feels like apples J 1 1 ) = ) n[p(a |a −1, I )p(e′ |e )]l (1) He prefer apples He is fond of apples p(e′ J |eI j j J j=1 1 j aj We choose the first sentence as the backbone.",
                    "sid": 38,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Where eI = (e1 , ..., eI ) is the backbone, e′J = Then, we perform hypothesis alignment to build a (e′1, ..., e′ J ) is a hypothesis aligned to eI , and aJ = 1 1 confusion network, as shown in Figure 1(a).",
                    "sid": 39,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that although “feels like” has the same meaning with “is fond of”, a confusion network only allows for one-to-one mappings.",
                    "sid": 40,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the confusion network shown in Figure 1(c), several null words ε are in(a1 , .., aJ ) is the alignment that specifies the posi tion of backbone word that each hypothesis word is aligned to.",
                    "sid": 41,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation probability p(e′ |ei ) is a linear interpolation of semantic similarity ( |e ) and serted to ensure that each hypothesis has the samesurface similarity psur (e′ |ei) and α is the interpo length.",
                    "sid": 42,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As each edge in the confusion network only has a single word, it is possible to produce inappropriate translations such as “He is like of apples”.",
                    "sid": 43,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, we allow many-to-many mappings in the hypothesis alignment shown in Figure 2(b).",
                    "sid": 44,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “like” is aligned to three words: “is”, “fond”, and “of”.",
                    "sid": 45,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we use a lattice shown in Figure 1(d) to represent all possible candidate trans lation factor: p(ej |ei ) = α·psem(ej |ei )+(1−α)·psur (ej |ei ) (2) ′ ′ ′ The semantic similarity model is derived by using the source word sequence as a hidden layer, so the bilingual dictionary is necessary.",
                    "sid": 46,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The semantic sim ilarity model is given by K psem(e′ |ei) = ) p(fk |ei)p(e′ |fk , ei ) (2) Choose the backbone from the hypotheses.",
                    "sid": 47,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is performed using a sentence-level Minimum Bayes Risk (MBR) method.",
                    "sid": 48,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hypothesis with the j k=0 K ) ≈ k=0 j p(fk |ei)p(e′ |fk ) (3) minimum cost of edits against all hypotheses is selected.",
                    "sid": 49,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The backbone is significant for it influences not only the word order, but also the following alignments.",
                    "sid": 50,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The backbone is selected as follows:The surface similarity model is estimated by calcu EB = argmin ) T ER(E′, E) (8) lating the literal matching rate: E′∈E E∈E psur (e′ |ei ) = exp{ρ · [s(e′ , ei ) − 1]} (4) j j where s(e′j , ei ) is given by (3) Get the alignments of the backbone and hypothesis pairs.",
                    "sid": 51,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, each pair is aligned in both directions using the IHMM-based alignment method.",
                    "sid": 52,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "s(e′ , ei ) = M (e′ , ei ) max(|e′ |, |ei |) (5) In the IHMM alignment model, bilingual dictionaries in both directions are indispensable.",
                    "sid": 53,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we apply a grow-diag final algorithm which is widely where M (e′ , ei) is the length of the longest matched prefix (LMP) and ρ is a smoothing factor that specifies the mapping.",
                    "sid": 54,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distortion probability p(aj = i|aj−1 = i′, I ) is estimated by only considering the jump distance: c(i − i′) used in bilingual phrase extraction (Koehn et al., 2003) to monolingual alignments.",
                    "sid": 55,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bidirectional alignments are combined to one resorting to the grow-diag-final algorithm, allowing n-to-n mappings.(4)Normalize the alignment pairs.",
                    "sid": 56,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word or p(i|i′, I ) = i=1 c(l − i′) (6) der of the backbone determines the word order of consensus outputs, so the word order of hypotheses The distortion parameters c(d) are grouped into 11 buckets, c(≤ −4), c(−3), ..., c(0), ..., c(5), c(≥ 6).",
                    "sid": 57,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the alignments are in the same language, the distortion model favor monotonic alignments and penalize non-monotonic alignments.",
                    "sid": 58,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is given in a intuitive way c(d) = (1 + |d − 1|)−K , d = −4, ..., 6 (7) where K is tuned on held-out data.",
                    "sid": 59,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also the probability p0 of jumping to a null word state is tuned on held-out data.",
                    "sid": 60,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So the overall distortion model becomes p0 if i = null state must be consistent with that of the backbone.",
                    "sid": 61,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All words of a hypotheses are reordered according to the alignment to the backbone.",
                    "sid": 62,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a word aligned to null, an actual null word may be inserted to the proper position.",
                    "sid": 63,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The alignment units are extracted first and then the hypothesis words in each unit are shifted as a whole.",
                    "sid": 64,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5) Construct the lattice in the light of phrase pairs extracted on the normalized alignment pairs.",
                    "sid": 65,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The expression ability of the lattice depends on the phrase pairs.",
                    "sid": 66,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(6) Decode the lattice using a model similar to the log-linear model.The confusion-network-based system combina p(i|i′, I ) = (1 − p0 ) · p(i|i′, I ) otherwise tion model goes in a similar way.",
                    "sid": 67,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first two steps are the same as the lattice-based model.",
                    "sid": 68,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The differ",
                    "sid": 69,
                    "ssid": 40,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "lattice-based system combination. ",
            "number": "3",
            "sents": [
                {
                    "text": "Model Lattice-based system combination involves the following steps: (1) Collect the hypotheses from the candidate systems.",
                    "sid": 70,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ence is that the hypothesis pairs are aligned just in one direction due to the expression limit of the confusion network.",
                    "sid": 71,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, the normalized alignments only contain 1-to-1 mappings (Actual null words are also needed in the case of null alignment).",
                    "sid": 72,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following, we will give more details about the steps which are different in the two models.",
                    "sid": 73,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "lattice construction. ",
            "number": "4",
            "sents": [
                {
                    "text": "EB : e1 e2 e3 e2 ε e1 ′ ′ Unlike a confusion network that operates words only, a lattice allows for phrase pairs.",
                    "sid": 74,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So phrase pairs must be extracted before constructing a lattice.",
                    "sid": 75,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A major difficulty in extracting phrase pairs Eh : e′ e′ 1 2 (a) EB : e1 e2 e1 e2 e3 e′ e′ e′ 1 2 3 e1 e2 is that the word order of hypotheses is not consistent Eh : e′ ′ ′ 1 e2 e3 e′ ′ with that of the backbone.",
                    "sid": 76,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, hypothesis words belonging to a phrase pair may be discontinuous.",
                    "sid": 77,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Before phrase pairs are extracted, the hy (b) EB : e1 e2 1e3 1 e2 e3 e′ ′ ′ e ε e pothesis words should be normalized to make sure 1 2 Eh : e′ ′ ′ the words in a phrase pair is continuous.",
                    "sid": 78,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We call a 1 e2 e3 (c) phrase pair before normalization a alignment unit.The problem mentioned above is shown in Fig ure 2.",
                    "sid": 79,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Figure 2 (a), although (e′ e′ , e2) should be Figure 3: Different cases of null insertion 1 3 1 3 ik ∈ e¯i, ea′ ∈ e¯i a phrase pair, but e′ and e′are discontin e′ ′ i k uous, so the phras e pai r can n ot be extracted.",
                    "sid": 80,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only aik = null or eaik ∈ e¯i after the words of the hypothesis are reordered according to the corresponding words in the backbone • ∀ eik ∈ e¯i, e′ ′ ′ ′ as shown in Figure 2 (b), and ebe • ∄ a¯j = (e¯j , e¯j ), e¯j = ei1 , ..., eik or e¯j = 1 3 , ..., ein , k ∈ [1, n] come continuous and the phrase pair (e′ e′ , e2) can e extracted.",
                    "sid": 81,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The procedure of reorder is called k Where a′ denotes the position of the word in the b alignment normalization ing ik backbone that e′ is aligned to, and aik denotes the Eh: e′ ′ ′ : e e e Eh: e′ ′ ′ e e e position of the word in the hypothesis that eik is aligned to.",
                    "sid": 82,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An actual null word may be inserted to a proper position if a word, either from the hypothesis or from EB 1 2 3 (a) EB : 1 2 3 (b) the backbone, is aligned to null.",
                    "sid": 83,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, the minimum alignment set is extended to an alignment Figure 2: An example of alignment units 4.1 Alignment Normalization.",
                    "sid": 84,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After the final alignments are generated in the grow- diag-final algorithm, minimum alignment units are extracted.",
                    "sid": 85,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hypothesis words of an alignment unit are packed as a whole in shift operations.See the example in Figure 2 (a) first.",
                    "sid": 86,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All mini mum alignment units are as follows: (e′ , e1 ), (e′ e′ , unit set, which includes not only minimum alignment units but also alignment units which are generated by adding null words to minimum alignment units.",
                    "sid": 87,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, the following three conditions should be taken into consideration: • A backbone word is aligned to null.",
                    "sid": 88,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A null word is inserted to the hypothesis as shown in Figure 3 (a).",
                    "sid": 89,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 1 3 A hypothesis word is aligned to null and it is e2 ) and (ε, e3 ).",
                    "sid": 90,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(e′ e′ e′ , e1 e2 ) is an alignment unit, • 1 2 3 but not a minimum alignment unit.",
                    "sid": 91,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let a¯i = (e¯′ , e¯i ) denote a minimum alignment unit, and assume that the word string e¯′ covers words i1 ,..., eim on the hypothesis side, and the word between the span of a minimum alignment unit.",
                    "sid": 92,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A new alignment unit is generated by inserting the hypothesis word aligned to null to the minimum alignment unit.",
                    "sid": 93,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The new hypothesis string must remain the original word order of e′ ′ string e¯i covers the consecutive words ei1 ,..., ein on the backbone side.",
                    "sid": 94,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In an alignment unit, the word string on the hypothesis side can be discontinuous.",
                    "sid": 95,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The minimum unit a¯i = (e¯′ , e¯i ) must observe the following rules: the hypothesis.",
                    "sid": 96,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is illustrated in Figure 3 (b).",
                    "sid": 97,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• A hypothesis word is aligned to null and it is not between the hypothesis span of any minimum alignment unit.",
                    "sid": 98,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, a null word e¯′ e¯′ e¯′ e¯′ e¯′ e¯′ e¯′ e¯′ e¯′ e1 e2 ε e3 e1 ε e2 e3 e1 ε e2 e3 (a) (b) e¯′ (c) e¯′ e¯′ e¯′ e¯′ e¯′ e¯′ e1 ε e2 ε e3 e1 ε e2 ε e3 e¯4 e¯′ e¯4 e¯′ e¯′ (d) (e) Figure 4: A toy instance of lattice construction are inserted to the backbone.",
                    "sid": 99,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is shown in Figure 3 (c).",
                    "sid": 100,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Lattice Construction Algorithm.",
                    "sid": 101,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lattice is constructed by adding the normalized alignment pairs incrementally.",
                    "sid": 102,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One backbone arc in a lattice can only span one backbone word.",
                    "sid": 103,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, all hypothesis words in an alignment unit must be packed into one hypothesis arc. First the lattice is initialized with a normalized alignment pair.",
                    "sid": 104,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then given all other alignment pairs one by one, the lattice is modified dynamically by adding the hypothesis words of an alignment pair in a left-to-right fash • e2 is compared with e2 . There is no hypothesis arc coming from the same node with the bone arc e2 in the alignment pair, so the lattice remains the same.",
                    "sid": 105,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both go to the next backbone words.",
                    "sid": 106,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• ε is compared with e3 . A null backbone arc is inserted into the lattice between e2 and e3 . The hypothesis arc e¯5 is inserted to the lattice, too.",
                    "sid": 107,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The modified lattice is shown in Figure 4(d).",
                    "sid": 108,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The alignment pair goes to the next backbone word e3 . • e3 is compared with e3.",
                    "sid": 109,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For they are the same ion.",
                    "sid": 110,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and there is no hypo thesi s arc e¯′ in the lattic e, A toy instance is given in Figure 4 to illustrate the procedure of lattice construction.",
                    "sid": 111,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Assume the current inputs are: an alignment pair as in Figure 4 (a), and a lattice as in Figure 4 (b).",
                    "sid": 112,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The backbone words of the alignment pair are compared to the backbone words of the lattice one by one.",
                    "sid": 113,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The procedure is as follows: • e1 is compared with e1 . Since they are the same, the hypothesis arc e¯′ , which comes from the same node with e1 in the alignment pair, is compared with the hypothesis arc e¯′ , which comes from the same node with e1 in the lattice.",
                    "sid": 114,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two hypothesis arcs are not the same, e¯′ is inserted to the lattice as in Figure 4(e).",
                    "sid": 115,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Both arrive at the end and it is the turn of the next alignment pair.",
                    "sid": 116,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When comparing a backbone word of the given alignment pair with a backbone word of the lattice, the following three cases should be handled: • The current backbone word of the given alignment pair is a null word while the current backbone word of the lattice is not.",
                    "sid": 117,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A null backbone word is inserted to the lattice.",
                    "sid": 118,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• The current backbone word of the lattice is a so e¯′ is added to the lattice as shown in Figure null word while the current word of the given 4(c).",
                    "sid": 119,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both go to the next backbone words.",
                    "sid": 120,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• e2 is compared with ε.",
                    "sid": 121,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lattice remains the same.",
                    "sid": 122,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lattice goes to the next backbone word e2 .alignment pair is not.",
                    "sid": 123,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The current null back bone word of the lattice is skipped with nothing to do.",
                    "sid": 124,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The next backbone word of the lattice is compared with the current backbone word of the given alignment pair.",
                    "sid": 125,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Algorithm 1 Lattice construction algorithm.",
                    "sid": 126,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1: Input: alignment pairs {pn}N 2: L ← p1 3: U nique(L) 4: for n ← 2 ..",
                    "sid": 127,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "N do 5: pnode = pn · f irst 6: lnode = L · f irst 7: while pnode · barcnext /= N U LL do 8: if lnode · barcnext = N U LL or pnode · bword = null and lnode · bword /= null then 9: INSE RT BARC(lnode, null) 10: pnode = pnode · barcnext 11: else 12: if pnode · bword /= null and lnode · bword = null then 13: lnode = lnode · barcnext 14: else 15: for each harc of pnode do 16: if NotExist(lnode, pnode · harc) then 17: INSE RT HARC(lnode, pnode · harc) 18: pnode = pnode · barcnext 19: lnode = lnode · barcnext 20: Output: lattice L• The current backbone words of the given align Line 9 inserts a null bone arc to the position right before the current node.",
                    "sid": 128,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Line 12 − 13 deal with con dition 2 and jump to the next backbone word of the lattice.",
                    "sid": 129,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Line 15 − 19 handle condition 3 and function InsertHarc inserts to the lattice a harc with the same hypothesis words and the same backbone word span with the current hypothesis arc.",
                    "sid": 130,
                    "ssid": 57,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "decoding. ",
            "number": "5",
            "sents": [
                {
                    "text": "In confusion network decoding, a translation is generated by traveling all the nodes from left to right.",
                    "sid": 131,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So a translation path contains all the nodes.",
                    "sid": 132,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While in lattice decoding, a translation path may skip some nodes as some hypothesis arcs may cross more than one backbone arc. Similar to the features in Rosti et al.",
                    "sid": 133,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007a), the features adopted by lattice-based model are arc posterior probability, language model probability, the number of null arcs, the number of hypothesis arcs possessing more than one non-null word and the number of all non-null words.",
                    "sid": 134,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features are combined in a log-linear model with the arc posterior probabilities being processed specially as follows: ment pair and the lattice are the same.",
                    "sid": 135,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let {harcl } denotes the set of hypothesis arcs,which come from the same node with the cur log p(e/f ) = Narc ) i=1 Ns log () s=1 λsps(arc)) (9) rent backbone arc in the lattice, and harch denotes one of the corresponding hypothesis arcs in the given alignment pair.",
                    "sid": 136,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the {harcl }, if there is no arc which is the same with the harch, a hypothesis arc projecting to harch is added to the lattice.",
                    "sid": 137,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm of constructing a lattice is illustrated in Algorithm 1.",
                    "sid": 138,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The backbone words of the alignment pair and the lattice are processed one by one in a left-to-right manner.",
                    "sid": 139,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Line 2 initializes the lattice with the first alignment pair, and Line 3 removes the hypothesis arc which contains the same words with the backbone arc. barc denotes the backbone arc, storing one backbone word only, and harc denotes the hypothesis arc, storing the hypothesis words.",
                    "sid": 140,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For there may be many alignment units span the same backbone word range, there may be more than one harc coming from one node.",
                    "sid": 141,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Line 8 − 10 consider the condition 1 and function InsertBarc in + ζ L(e) + αNnullarc(e) + βNlongarc(e) + γNword(e) where f denotes the source sentence, e denotes a translation generated by the lattice-based system, Narc is the number of arcs the path of e covers, Ns is the number of candidate systems and λs is the weight of system s. ζ is the language model weight and L(e) is the LM log-probability.",
                    "sid": 142,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nnullarcs(e) is the number of the arcs which only contain a null word, and Nlongarc(e) is the number of the arcs which store more than one non-null word.",
                    "sid": 143,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The above two numbers are gotten by counting both backbone arcs and hypothesis arcs.",
                    "sid": 144,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "α and β are the corresponding weights of the numbers, respectively.",
                    "sid": 145,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nword(e) is the non-null word number and γ is its weight.",
                    "sid": 146,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each arc has different confidences concerned with different systems, and the confidence of system s is denoted by ps(arc).",
                    "sid": 147,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ps(arc) is increased by 1/(k + 1) if the hypothesis ranking k in the system s contains the arc (Rosti et al., 2007a; He et al., 2008).",
                    "sid": 148,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cube pruning algorithm with beam search is employed to search for the consensus output (Huang and Chiang, 2005).",
                    "sid": 149,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The nodes in the lattice are searched in a topological order and each node retains a list of N best candidate partial translations.",
                    "sid": 150,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "6",
            "sents": [
                {
                    "text": "The candidate systems participating in the system combination are as listed in Table 1: System A is a BTG-based system using a MaxEnt-based reordering model; System B is a hierarchical phrase-based system; System C is the Moses decoder (Koehn et al., 2007); System D is a syntax-based system.",
                    "sid": 151,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10- best hypotheses from each candidate system on the dev and test sets were collected as the input of the system combination.",
                    "sid": 152,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, the weights were all tuned on the NIST MT02 Chinese-to-English test set, including 878 sentences, and the test data was the NIST MT05 Chinese-to-English test set, including 1082 sentences, except the experiments in Table 2.",
                    "sid": 153,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A 5- gram language model was used which was trained on the XinHua portion of Gigaword corpus.",
                    "sid": 154,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results were all reported in case sensitive BLEU score and the weights were tuned in Powell’s method to maximum BLEU score.",
                    "sid": 155,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The IHMM-based align the lattice-based model.",
                    "sid": 156,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the dev set, the lattice- based system was 3.92 BLEU points higher than the best single system and 0.36 BLEU point higher than the IHMM-based system.",
                    "sid": 157,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the test set, the lattice- based system got an absolute improvement by 3.73 BLEU points over the best single system and 1.23 BLEU points over the IHMM-based system.",
                    "sid": 158,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sy ste m M T0 2 B L E U % M T0 5 B L E U % Sy ste m A 31 .9 3 30 .6 8 Sy ste m B 32 .1 6 32 .0 7 Sy ste m C 32 .0 9 31 .6 4 Sy ste m D 33 .3 7 31 .2 6 IH M M 36 .9 3 34 .5 7 La tti ce 37 .2 9 35 .8 0 Table 1: Results on the MT02 and MT05 test sets The results on another test sets are reported in Table 2.",
                    "sid": 159,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parameters were tuned on the newswire part of NIST MT06 Chinese-to-English test set, including 616 sentences, and the test set was NIST MT08 Chinese-to-English test set, including 1357 sentences.",
                    "sid": 160,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The BLEU score of the lattice-based system is 0.93 BLEU point higher than the IHMM- based system and 3.0 BLEU points higher than the best single system.",
                    "sid": 161,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ment module was implemented according to He et al.",
                    "sid": 162,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008), He (2007) and Vogel et al.",
                    "sid": 163,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1996).",
                    "sid": 164,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all experiments, the parameters for IHMM-based alignment module were set to: the smoothing factor for the surface similarity model, ρ = 3; the controlling factor for the distortion model, K = 2.",
                    "sid": 165,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1 Comparison with.",
                    "sid": 166,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Confusion-network-based model In order to compare the lattice-based system with the confusion-network-based system fairly, we used IHMM-based system combination model on behalf of the confusion-network-based model described in He et al.",
                    "sid": 167,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008).",
                    "sid": 168,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In both lattice-based and IHMM- based systems, the bilingual dictionaries were extracted on the FBIS data set which included 289K sentence pairs.",
                    "sid": 169,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The interpolation factor of the similarity model was set to α = 0.1.",
                    "sid": 170,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are shown in Table 1.",
                    "sid": 171,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "IHMM stands for the IHMM-based model and Lattice stands for System MT06 MT08 BLEU% BLEU% SystemA 32.51 25.63 SystemB 31.43 26.32 SystemC 31.50 23.43 SystemD 32.41 26.28 IHMM 36.05 28.39 Lattice 36.53 29.32 Table 2: Results on the MT06 and MT08 test sets We take a real example from the output of the two systems (in Table 3) to show that higher BLEU scores correspond to better alignments and better translations.",
                    "sid": 172,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation of System C is selected as the backbone.",
                    "sid": 173,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From Table 3, we can see that because of 1-to-1 mappings, “Russia” is aligned to “Russian” and “’s” to “null” in the IHMM-based model, which leads to the error translation “Russian Source: SystemA: Ru ssi a m er ger of sta te ow ne d o il c om pa ny an d the sta te- run g as company in Russia SystemB: Russia ’s state-owned oil company is working with Russia ’s state-run gas company mergers SystemC: Russian state-run oil company is combined with the Russian state-run gas company SystemD: Russia ’s state-owned oil companies are combined with Russia ’s state-run gas company IHMM: Russian ’s state-owned oil company working with Russia ’s state-run gas company Lattice: Russia ’s state-owned oil company is combined with the Russian state-run gas company Table 3: A real translation example ’s”.",
                    "sid": 174,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, “Russia ’s” is together aligned to ”Russian” in the lattice-based model.",
                    "sid": 175,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also due to 1-to 1 mappings, null word aligned to “is” is inserted.",
                    "sid": 176,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, “is” is missed in the output of IHMM- based model.",
                    "sid": 177,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, in the lattice-based system, “is working with” are aligned to “is combined with”, forming a phrase pair.",
                    "sid": 178,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.2 Effect of Dictionary Scale.",
                    "sid": 179,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The dictionary is important to the semantic similarity model in IHMM-based alignment method.",
                    "sid": 180,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluated the effect of the dictionary scale by using dictionaries extracted on different data sets.",
                    "sid": 181,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The dictionaries were respectively extracted on similar data sets: 30K sentence pairs, 60K sentence pairs, 289K sentence pairs (FBIS corpus) and 2500K sentence pairs.",
                    "sid": 182,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are illustrated in Table 4.",
                    "sid": 183,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to demonstrate the effect of the dictionary size clearly, the interpolation factor of similarity model was all set to α = 0.1.",
                    "sid": 184,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From Table 4, we can see that when the corpus size rise from 30k to 60k, the improvements were not obvious both on the dev set and on the test set.",
                    "sid": 185,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the corpus was expanded to 289K, although on the dev set, the result was only 0.2 BLEU point higher, on the test set, it was 0.63 BLEU point higher.",
                    "sid": 186,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the corpus size was up to 2500K, the BLEU scores both on the dev and test sets declined.",
                    "sid": 187,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason is that, on one hand, there are more noise on the 2500K sentence pairs; on the other hand, the 289K sentence pairs cover most of the words appearing on the test set.",
                    "sid": 188,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So we can conclude that in order to get better results, the dictionary scale must be up to some certain scale.",
                    "sid": 189,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the dictionary is much smaller, the result will be impacted dramatically.",
                    "sid": 190,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "M T0 2 B L E U % M T0 5 B L E U % 30 k 36 .9 4 35 .1 4 60 k 37 .0 9 35 .1 7 28 9k 37 .2 9 35 .8 0 25 00 k 37 .1 4 35 .6 2 Table 4: Effect of dictionary scale 6.3 Effect of Semantic Alignments.",
                    "sid": 191,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the IHMM-based alignment method, the translation probability of an English word pair is computed using a linear interpolation of the semantic similarity and the surface similarity.",
                    "sid": 192,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So the two similarity models decide the translation probability together and the proportion is controlled by the interpolation factor.",
                    "sid": 193,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluated the effect of the two similarity models by varying the interpolation factor α.",
                    "sid": 194,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the dictionaries extracted on the FBIS data set.",
                    "sid": 195,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result is shown in Table 5.",
                    "sid": 196,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We got the best result with α = 0.1.",
                    "sid": 197,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When we excluded the semantic similarity model (α = 0.0) or excluded the surface similarity model (α = 1.0), the performance became worse.",
                    "sid": 198,
                    "ssid": 48,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "7",
            "sents": [
                {
                    "text": "The alignment model plays an important role in system combination.",
                    "sid": 199,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of the expression limitation of confusion networks, only 1-to-1 mappings are employed in the confusion-network-based model.",
                    "sid": 200,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper proposes a lattice-based system combination model.",
                    "sid": 201,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a general form of confusion networks, lattices can express n-to-n mappings.",
                    "sid": 202,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So a lattice-based model processes phrase pairs while M T0 2 B L E U % M T0 5 B L E U % α = 1.",
                    "sid": 203,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 36 .4 1 34 .9 2 α = 0.",
                    "sid": 204,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 37 .2 1 35 .6 5 α = 0.",
                    "sid": 205,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 36 .4 3 35 .0 2 α = 0.",
                    "sid": 206,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 37 .1 4 35 .5 5 α = 0.",
                    "sid": 207,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 36 .7 5 35 .6 6 α = 0.",
                    "sid": 208,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 36 .8 1 35 .5 5 α = 0.",
                    "sid": 209,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 37 .2 9 35 .8 0 α = 0.",
                    "sid": 210,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 36 .4 5 35 .1 4 Table 5: Effect of semantic alignments a confusion-network-based model processes words only.",
                    "sid": 211,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, phrase pairs must be extracted before constructing a lattice.",
                    "sid": 212,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On NIST MT05 test set, the lattice-based system gave better results with an absolute improvement of 1.23 BLEU points over the confusion- network-based system (He et al., 2008) and 3.73 BLEU points over the best single system.",
                    "sid": 213,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On NIST MT08 test set, the lattice-based system outperformed the confusion-network-based system by 0.93 BLEU point and outperformed the best single.",
                    "sid": 214,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "system by 3.0 BLEU points.",
                    "sid": 215,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgement. ",
            "number": "8",
            "sents": [
                {
                    "text": "The authors were supported by National Natural Science Foundation of China Contract 60736014, National Natural Science Foundation of China Contract 60873167 and High Technology R&D Program Project No. 2006AA010108.",
                    "sid": 216,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thank Wenbin Jiang, Tian Xia and Shu Cai for their help.",
                    "sid": 217,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are also grateful to the anonymous reviewers for their valuable comments.",
                    "sid": 218,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}