{
    "ID": "D09-1138",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "The work presented in this paper explores a supervised method for learning a probabilistic model of a lexicon of VerbNet classes.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We intend for the probabilistic model to provide a probability distribution of verb-class associations, over known and unknown verbs, including pol- ysemous words.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our approach, training instances are obtained from an existing lexicon and/or from an annotated corpus, while the features, which represent syntactic frames, semantic similarity, and selectional preferences, are extracted from unannotated corpora.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our model is evaluated in type-level verb classification tasks: we measure the prediction accuracy of VerbNet classes for unknown verbs, and also measure the dissimilarity between the learned and observed probability distributions.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We empirically compare several settings for model learning, while we vary the use of features, source corpora for feature extraction, and disambiguated corpora.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the task of verb classification into all VerbNet classes, our best model achieved a 10.69% error reduction in the classification accuracy, over the previously proposed model.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Lexicons are invaluable resources for semantic processing.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In many cases, lexicons are necessary to restrict a set of semantic classes to be assigned to a word.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, a considerable number of works on semantic processing implicitly or explicitly presupposes the availability of a lexicon, such as in word sense disambiguation (WSD) (McCarthy et al., 2004), and in token-level verb class disambiguation (Lapata and Brew, 2004; Girju et al., 2005; Li and Brew, 2007; Abend et al., 2008).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, those methods are heavily dependent on the availability of a semantic lexicon.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, recent research efforts have invested in developing semantic resources, such as WordNet (Fellbaum, 1998), FrameNet (Baker et al., 1998), and VerbNet (Kipper et al., 2000; Kipper-Schuler, 2005), which greatly advanced research in semantic processing.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the construction of such resources is expensive, and it is unrealistic to presuppose the availability of full-coverage lexicons; this is the case because unknown words always appear in real texts, and word-semantics associations may vary (Abend et al., 2008).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper explores a method for the supervised learning of a probabilistic model for the VerbNet lexicon.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We target the automatic classification of arbitrary verbs, including polysemous verbs, into all VerbNet classes; further, we target the estimation of a probabilistic model, which represents the saliences of verb-class associations for polysemous verbs.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our approach, an existing lexicon and/or an annotated corpus are used as the training data.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since VerbNet classes are designed to represent the distinctions in the syntactic frames that verbs can take, features, representing the statistics of syntactic frames, are extracted from the unannotated corpora.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, as the classes represent semantic commonalities, semantically inspired features, like distributionally similar words, are used.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These features can be considered as a generalized representation of verbs, and we expect that the obtained probabilistic model predicts VerbNet classes of the unknown words.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our model is evaluated in two tasks of type- level verb classification: one is the classification of monosemous verbs into a small subset of the classes, which was studied in some previous works (Joanis and Stevenson, 2003; Joanis et al., 2008).",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other task is the classification of all verbs into the full set of VerbNet classes, which has not yet 1328 Proceedings of the 2009 Conference on Empirical Methods in Natural Language Processing, pages 1328–1337, Singapore, 67 August 2009.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2009 ACL and AFNLP been attempted.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the experiments, training instances are obtained from VerbNet and/or Sem- Link (Loper et al., 2007), while features are extracted from the British National Corpus or from Wall Street Journal.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We empirically compare several settings for model learning by varying the set of features, the source domain and the size of a corpus for feature extraction, and the use of the token-level statistics obtained from a manually disambiguated corpus.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also provide the analysis of the remaining errors, which will lead us to further improve the supervised learning of a probabilistic semantic lexicon.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Supervised methods for automatic verb classification have been extensively investigated (Stevenson et al., 1999; Stevenson and Merlo, 1999; Merlo and Stevenson, 2001; Stevenson and Joanis, 2003; Joanis and Stevenson, 2003; Joanis et al., 2008).",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, their focus has been limited to a small subset of verb classes, and a limited number of monosemous verbs.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main contributions of the present work are: i) to provide empirical results for the automatic classification of all verbs, including polysemous ones, into all VerbNet classes, and ii) to empirically explore the effective settings for the supervised learning of a probabilistic lexicon of verb semantic classes.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "background. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Verb lexicon.",
                    "sid": 28,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Levin’s (1993) work on verb classification has broadened the field of computational research that concerns the relationships between the syntactic and semantic structures of verbs.",
                    "sid": 29,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The principal idea behind the work is that the meanings of verbs can be identified by observing possible syntactic frames that the verbs can take.",
                    "sid": 30,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, with the knowledge of syntactic frames, verbs can be semantically classified.",
                    "sid": 31,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This idea provided the computational linguistics community with criteria for the definition and the classification of verb semantics; it has subsequently resulted in the research of the induction of verb classes (Korhonen and Briscoe, 2004), and the construction of a verb lexicon based on Levin’s criteria.",
                    "sid": 32,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VerbNet (Kipper et al., 2000; Kipper-Schuler, 2005) is a lexicon of verbs organized into classes that share the same syntactic behaviors and semantics.",
                    "sid": 33,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The design of classes originates from Levin (1993), though the design has been considerably reorganized and extends beyond the original clas 43 Emission.",
                    "sid": 34,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "43.1 Light Emission.",
                    "sid": 35,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "beam, glow, sparkle, . . .",
                    "sid": 36,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "43.2 Sound Emission.",
                    "sid": 37,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "blare, chime, jangle, . . .",
                    "sid": 38,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "44 Destroy.",
                    "sid": 39,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "annihilate, destroy, ravage, . . .",
                    "sid": 40,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "45 Change of State.",
                    "sid": 41,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "47 Existence.",
                    "sid": 42,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "47.1 Exist.",
                    "sid": 43,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "exist, persist, remain, . . .",
                    "sid": 44,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "47.2 Entity-Specific Modes Being.",
                    "sid": 45,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "bloom, breathe, foam, . . .",
                    "sid": 46,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "47.3 Modes of Being with Motion.",
                    "sid": 47,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "jiggle, sway, waft, . . .",
                    "sid": 48,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1: VerbNet classes 43.2 Sound Emission.",
                    "sid": 49,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Theme V Theme V P:loc Location P:loc Location V Theme there V Theme P:loc Location Agent V Theme Theme V Oblique Location V with Theme 47.3 Modes of Being with Motion.",
                    "sid": 50,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Theme V Theme V P:loc Location P:loc Location V Theme there V Theme Agent V Theme Figure 2: Syntactic frames for VerbNet classes sification.",
                    "sid": 51,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classes therefore cover more English verbs, and the classification should be more consistent (Korhonen and Briscoe, 2004; Kipper et al., 2006).",
                    "sid": 52,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The current version of VerbNet includes 270 classes.1 Figure 1 shows a part of the classes of VerbNet.",
                    "sid": 53,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The top-level categories, e.g. Emission and Destroy, represent a coarse classification of verb semantics.",
                    "sid": 54,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are further classified into verb classes, each of which expresses a group of verbs sharing syntactic frames.",
                    "sid": 55,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows an excerpt from VerbNet, which represents the possible syntactic frames for the Sound Emission class, including “chime” and “jangle,” and the Modes of Being with Motion class, including “jiggle” and “waft.” In this figure, each line represents a syntactic frame, where Agent, 1 Throughout this paper, we refer to VerbNet 2.3.",
                    "sid": 56,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sub- classes are ignored in this work, following the setting of Abend et al.",
                    "sid": 57,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008).",
                    "sid": 58,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the walls still shook;VN=47.3 and an evacuation alarm blared;VN=43.2 outside.",
                    "sid": 59,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suddenly the woman begins;VN=55.1 swaying ;VN=47.3 and then . . .",
                    "sid": 60,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3: An excerpt from SemLink Theme, and Location indicate the thematic roles, V denotes a verb, and P specifies a preposition.",
                    "sid": 61,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P:loc defines locative prepositions such as: “in” and “at.” For example, the second syntactic frame of Sound Emission, i.e., Theme V P:loc Location, corresponds to the following sentence: 1.",
                    "sid": 62,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The coins jangled in my pocket..",
                    "sid": 63,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Theme corresponds to “the coins,” V to “jangled,” P:loc to “in,” and Location to “my pocket.” While VerbNet provides associations between verbs and semantic classes, SemLink (Loper et al., 2007) additionally provides mappings among VerbNet, FrameNet (Baker et al., 1998), PropBank (Palmer et al., 2005), and WordNet (Fellbaum, 1998).",
                    "sid": 64,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since FrameNet and PropBank include annotated instances of sentences, SemLink can be considered as a corpus annotated with VerbNet classes.",
                    "sid": 65,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 presents some annotated sentences obtained from SemLink.",
                    "sid": 66,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the annotation “blared;VN=43.2” indicates that the occurrence of “blare” in this context is classified as Sound Emission.",
                    "sid": 67,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Related work.",
                    "sid": 68,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There has been much research effort invested in the automatic classification of verbs into lexical semantic classes, in a supervised or unsupervised way.",
                    "sid": 69,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The present work inherits the spirit of the supervised approaches to verb classification (Stevenson et al., 1999; Stevenson and Merlo, 1999; Merlo and Stevenson, 2001; Stevenson and Joanis, 2003; Joanis and Stevenson, 2003; Joanis et al., 2008).",
                    "sid": 70,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our learning framework basically follows the above listed works: features are obtained from an unannotated (automatically parsed) corpus, and gold verb-class associations are used as training instances for machine learning classifiers, such as decision trees and support vector machines.",
                    "sid": 71,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, those works targeted a small subset of Levin classes, and a limited number of monosemous verbs; for example, Merlo and Stevenson (2001) studied three classes and 59 verbs, and Joanis et al.",
                    "sid": 72,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) focused on 14 classes and 835 verbs.",
                    "sid": 73,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although these works provided a theoretical framework for supervised verb classification, their results were not readily available for practical applications, because of the limitation in the coverage of the targeted classes/verbs on real texts.",
                    "sid": 74,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the contrary, we target the classification of arbitrary verbs, including polysemous verbs, into all VerbNet classes (270 in total).",
                    "sid": 75,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this realistic situation, we will empirically compare settings for model learning, in order to explore effective conditions to obtain better models.",
                    "sid": 76,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another difference from the aforementioned works is that we aim at obtaining a probabilistic model, which represents saliences of classes of polysemous verbs.",
                    "sid": 77,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lapata and Brew (2004) and Li and Brew (2007) focused on this issue, and described methods for inducing probabilities of verb-class associations.",
                    "sid": 78,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The obtained probabilistic model was intended to be incorporated into a token-level disambiguation model.",
                    "sid": 79,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their methods claimed to be unsupervised, meaning that the induction of a probabilistic lexicon did not require any hand-annotated corpora.",
                    "sid": 80,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, however, their methods relied on the existence of a full-coverage lexicon, both in training and running time.",
                    "sid": 81,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In their methods, a lexicon was necessary for restricting possible classes to which each word belongs.",
                    "sid": 82,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since most verbs are associated with only a couple of classes, such a restriction significantly reduces the search space, and the problem becomes much easier to solve.",
                    "sid": 83,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This presupposition is implicitly or explicitly used in other semantic disambiguation tasks (McCarthy et al., 2004), but it is unrealistic for practical applications.",
                    "sid": 84,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clustering methods have also been extensively researched for verb classification (Stevenson and Merlo, 1999; Schulte im Walde, 2000; McCarthy, 2001; Korhonen, 2002; Korhonen et al., 2003; Schulte im Walde, 2003).",
                    "sid": 85,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extensive research is in large part due to the intuition that the set of classes could not be fixed beforehand.",
                    "sid": 86,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, it is often problematic to define a static set of semantic classes.",
                    "sid": 87,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it is reasonable to assume that the set of VerbNet classes is fixed, because Levin-type classes are more static than on- tological classes, like in WordNet synsets.",
                    "sid": 88,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we can apply supervised classification methods to our task.",
                    "sid": 89,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is true that the current VerbNet classes are imperfect and require revisions, but in this work we adopt them as they are, because as time advances, more stable classifications will become available.",
                    "sid": 90,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The problem focused in this work has a close relationship with automatic thesaurus/ontology expansion.",
                    "sid": 91,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, we evaluate our method in the task of automatic verb classification, which can be considered as lexicon expansion.",
                    "sid": 92,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most prominent difference of the present work from thesaurus/ontology expansion is that the number of classes is much smaller in our problem, and the set of verb classes can be assumed to be fixed.",
                    "sid": 93,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These characteristics indicate that our problem is easier and more well-defined than is the case for automatic thesaurus/ontology expansion.",
                    "sid": 94,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Supervised approaches to token-level verb class disambiguation have recently been addressed (Girju et al., 2005; Abend et al., 2008), largely owing to SemLink.",
                    "sid": 95,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their approaches fundamentally follow traditional supervised WSD methods: ex tic classes.",
                    "sid": 96,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do not presuppose the existence of a full-coverage lexicon; instead, we use an existing lexicon for the training data.",
                    "sid": 97,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Combined with features extracted from unannotated corpora, a probabilistic model is learned from the existing lexicon.",
                    "sid": 98,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Like other supervised learning applications, our probabilistic lexicon can predict classes for words that are not included in the original lexicon.",
                    "sid": 99,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our model is defined in the following way.",
                    "sid": 100,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We assume that the set, C , of verb classes is fixed, while a set of verbs is unfixed.",
                    "sid": 101,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With this assumption, probabilistic modeling can be reduced to a classification problem.",
                    "sid": 102,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, the goal is to obtain a probability distribution, p(c|v), of verb class c ∈ C for a given verb (lemma) v. We can therefore apply well-known supervised learning methods to estimate p(c|v).",
                    "sid": 103,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This probability is modeled in the form of a log- linear model.",
                    "sid": 104,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tracting features representing the context in which the target word appears, and training a classification model with an annotated corpus.",
                    "sid": 105,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While those 1 p(c|v) = Z exp ( \\ ) λifi(c, v) , i works achieved an impressive accuracy (more than 95%), the results may not necessarily indicate the method’s effectiveness; rather, it may imply the importance of a lexicon.",
                    "sid": 106,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, these works restrict their target to verb tokens, in which the correct class exists in a given lexicon, and they only consider candidate classes that are registered in the lexicon.",
                    "sid": 107,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This setting reduces the ambiguity significantly, and the problem becomes much easier to handle; for example, approximately half of verb tokens are monosemous in their setting.",
                    "sid": 108,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, a simple baseline achieves very high accuracy figures.",
                    "sid": 109,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, in our preliminary experiment on token-level verb classification with unknown verbs, we found that the accuracy for unknown verbs (i.e., lemmas not included in the VerbNet lexicon) is catastrophically low.",
                    "sid": 110,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This indicates that VerbNet and SemLink are insufficient for unknown verbs, and that we cannot expect the availability of a full-coverage lexicon in the real world.",
                    "sid": 111,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of a static lexicon, our probabilistic model is intended to be used as a prior distribution for the token-level disambiguation, as in Lapata and Brew (2004)’s model.",
                    "sid": 112,
                    "ssid": 85,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "a probabilistic model for verb ",
            "number": "3",
            "sents": [
                {
                    "text": "semantic classes In this work, supervised learning is applied to the probabilistic modeling of a lexicon of verb seman where fi(c, v) are features that represent characteristics of c and v, and λi are model parameters that express weights of the corresponding features.",
                    "sid": 113,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Model parameters can be estimated when training instances, i.e., pairs (c, v), and features, fi(c, v), for each instance are given.",
                    "sid": 114,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, what we have to do is to prepare the training in stances (c, v), and effective features fi(c, v) thatcontribute to the better estimation of probabili ties.",
                    "sid": 115,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In token tagging tasks, both training instances and features are extracted from annotated corpora.",
                    "sid": 116,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, since our goal is the probabilistic modeling of a lexicon, we have to determine how to derive the training instances and features for lexicon entries, to be discussed in the next section.",
                    "sid": 117,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the parameter estimation of log-linear models, we applied the stochastic gradient descent method.",
                    "sid": 118,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A hyperparameter for l2regularization was tuned to minimize the KL-divergence (see Section 4.4) for the development set.",
                    "sid": 119,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiment design. ",
            "number": "4",
            "sents": [
                {
                    "text": "In this work, we empirically compare several settings for the learning of the above probabilistic model, in the two tasks of automatic verb classification.",
                    "sid": 120,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In what follows, we explain the training/test data, corpora for extracting features, and the design of the features and evaluation tasks.",
                    "sid": 121,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The measures for evaluation are also introduced.",
                    "sid": 122,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the variance of the corpus domains, we vary the size of the corpus to observe the effect of increasing the corpus size.",
                    "sid": 123,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These corpora are automatically parsed by Enju 2.3.1 (Miyao and Tsujii, 2008), and the features are extracted from the parsing results.",
                    "sid": 124,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 4: Training instances obtained from Verb- Net (upper) and VerbNet+SemLink (lower) 4.1 Data.",
                    "sid": 125,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As our goal is the supervised learning of a lexicon of verb semantic classes, VerbNet is used as the training/test data.",
                    "sid": 126,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, since we aim at representing the saliences of verb-class associations with probabilities, the gold probabilities are necessary.",
                    "sid": 127,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this purpose, we count the occurrences of each verb-class association in the VerbNetPropBank token mappings in the subset of the SemLink corresponding to sections 2 through 21 of Penn Treebank (Marcus et al., 1994).",
                    "sid": 128,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Frequency counts are normalized for each lemma, with the Laplace smoothing (the parameter is 0.5).",
                    "sid": 129,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, we compare the two settings for creating training instances.",
                    "sid": 130,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By comparing the results of these settings, we evaluate the necessity of an annotated corpus for learning a probabilistic lexicon of verb semantic classes.",
                    "sid": 131,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VerbNet We collect all (c, v) pairs registered in VerbNet.",
                    "sid": 132,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each v, all of the associated classes are assigned equal weights (see the upper part of Figure 4).",
                    "sid": 133,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VerbNet+SemLink Each pair (c, v) in VerbNet is weighted by the normalized frequency obtained from SemLink (see the lower part of Figure 4).",
                    "sid": 134,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because VerbNet classes represent groups of syntactic frames, and it is impossible to guess the verb class by referring to only one occurrence in a text, it is necessary to have statistics over a sufficient amount of a corpus.",
                    "sid": 135,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, features are extracted from a large unannotated corpus.",
                    "sid": 136,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we use the following two corpora: WSJ Wall Street Journal newspaper articles (around 40 million words).",
                    "sid": 137,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BNC British National Corpus, which is a balanced corpus of around 100 million words.",
                    "sid": 138,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Features.",
                    "sid": 139,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Levin-like classes, including VerbNet, are designed to represent distinctions in syntactic frames and alternations.",
                    "sid": 140,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, if we were given the perfect knowledge of the possible syntactic frames, verbs can be classified into the correct classes almost perfectly (Dorr and Jones, 1996).",
                    "sid": 141,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous works thus proposed features that express the corpus statistics of syntactic frames.",
                    "sid": 142,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, class boundaries are subtle in some cases; several classes share syntactic frames with each other to a large extent.",
                    "sid": 143,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the classes shown in Figure 2 have very similar syntactic frames.",
                    "sid": 144,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The difference is indicated in the last two frames of Sound Emission, although they appear much less frequently in real texts.",
                    "sid": 145,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, it is difficult to accurately capture the distinctions between these classes, if we are only provided with the statistics of the syntactic frames that appear in real texts.",
                    "sid": 146,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, however, it is easy to observe that the verbs of these classes have different selectional preferences; that is, the Theme of Sound Emission verbs would be objects that make sounds, while the Theme of Modes of Being with Motion is likely to be objects that move.2 Although Levin’s classification initially focused on syntactic alternations, the resulting classes represent some semantic common- alities.",
                    "sid": 147,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, it would be reasonable to design features that capture such semantic characteristics.",
                    "sid": 148,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, we re-implemented the following features proposed by Joanis et al.",
                    "sid": 149,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) as the starting point.",
                    "sid": 150,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic slot Features to count the occurrences of each syntactic slot, such as subject, object, and prepositional phrases.",
                    "sid": 151,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the subject slot, we also count its transitive and intransitive usages separately.",
                    "sid": 152,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, we count the appearances of reflexive pronouns and semantically empty constituents (it and 2 Syntactic frames in VerbNet include specifications of selectional preferences, such as animate and place, although we do not explicitly use them, because it is not apparent to determine the members of these semantic classes.",
                    "sid": 153,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic slot subj:0.885 intranssubj:0.578 Slot overlap overlap-subj-obj:0.299 overlap-obj-in:0.074 Tense, voice, aspect posVBG:0.307 posVBD:0.290 Animacy animsubj:0.244 animobj:0.057 Slot POS subjPRP:0.270 subjNN:0.270 Syntactic frame NP_V:0.326 NP_V_NP:0.307 Similar word sim-rock:0.090 sim-swing:0.083 Slot class subjC82:0.219 objC12:0.081 Figure 5: Example of features for “sway” there).",
                    "sid": 154,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Differently from Joanis et al.",
                    "sid": 155,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008), we consider non-nominal arguments, such as sentential and adjectival complements.",
                    "sid": 156,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Slot overlap Features to measure the overlap in words (lemmas) between two syntactic slots of the verb.",
                    "sid": 157,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are intended to approximate argument alternations, such as the ergative alternation.",
                    "sid": 158,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, for the alternation “The sky cleared”/“The clouds cleared from the sky,” a feature to indicate the overlap between the subject slot and the from slot is added (Joanis et al., 2008).",
                    "sid": 159,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The value of this feature is computed by the method of Merlo and Stevenson (2001).",
                    "sid": 160,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tense, voice, aspect Features to approximate the tendency of the tense, voice, and aspect of the target verb.",
                    "sid": 161,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Penn Treebank POS tags for verbs (VB, VBP, VBZ, VBG, VBD, and VBN) are counted.",
                    "sid": 162,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, included are the frequency of the co-occurrences with an adverb or an auxiliary verb, and the count of usages as a noun or an adjective.",
                    "sid": 163,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Animacy Features to measure the frequency of animate arguments for each syntactic slot.",
                    "sid": 164,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Personal pronouns except it are counted as animate, following Joanis et al.",
                    "sid": 165,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008), while named entity recognition was not used.",
                    "sid": 166,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples of these features are shown in Figure 5.",
                    "sid": 167,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For details, refer to Joanis et al.",
                    "sid": 168,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008).",
                    "sid": 169,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The above features mainly represent syntactic behaviors of target verbs.",
                    "sid": 170,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since our target classes are broader than in the previous works, we further enhance the syntactic features.",
                    "sid": 171,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, as discussed above, semantically motivated features may present strong clues to distinguish among syntactically similar classes.",
                    "sid": 172,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We therefore include the following four types of feature; the first two are syntactic, while the other two are intended to capture semantic characteristics: Slot POS In addition to the syntactic slot features, we add features that represent a combination of a syntactic slot and the POS of its head word.",
                    "sid": 173,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since VerbNet includes extended classes that take verbal and adjectival arguments, the POSs of arguments would provide a strong clue to discriminate among these syntactic frames.",
                    "sid": 174,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic frame The number of arguments and their syntactic categories.",
                    "sid": 175,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This feature was mentioned as a baseline in Joanis et al.",
                    "sid": 176,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008), but we include it in our model.",
                    "sid": 177,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar word Similar words (lemmas) to the target verb.",
                    "sid": 178,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar words are automatically obtained from a corpus (the same corpus as used for feature extraction) by Lin (1998)’s method.",
                    "sid": 179,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This feature is motivated by the hypothesis that distributionally similar words tend to be classified into the same class.",
                    "sid": 180,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because Lin’s method is based on the similarity of words in syntactic slots, the obtained similar words are expected to represent a verb class that share selectional preferences.",
                    "sid": 181,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Slot class Semantic classes of the head words of the arguments.",
                    "sid": 182,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This feature is also intended to approximate selectional preferences.",
                    "sid": 183,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The semantic classes are obtained by clustering nouns, verbs, and adjectives into 200, 100, and 50 classes respectively, by using the k- medoid method with Lin (1998)’s similarity.",
                    "sid": 184,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 5 shows an example of the features for “sway,” extracted from the BNC corpus.3 Feature values are defined as relative frequencies for each lemma; while, for similar word features, feature values are weighted by Lin’s similarity measure.",
                    "sid": 185,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Tasks.",
                    "sid": 186,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluate our model in the tasks of automatic verb classification (a.k.a. lexicon expansion): given gold verb-class associations for some set of verbs, we predict the classes for unknown 3 “C82” and “C12” are automatically assigned cluster names.",
                    "sid": 187,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verb class Levin class number Recipient 13.1, 13.3 Admire 31.2 Amuse 31.1 Run 51.3.2 Sound Emission 43.2 Light and Substance Emission 43.1, 43.4 Cheat 10.6 Steal and Remove 10.5, 10.1 Wipe 10.4.1, 10.4.2 Spray/Load 9.7 Fill 9.8 Other Verbs of Putting 9.1–6 Change of State 45.1–4 Object Drop 26.1, 26.3, 26.7 Table 1: 14 classes used in Joanis et al.",
                    "sid": 188,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) and their corresponding Levin class numbers verbs.",
                    "sid": 189,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While our main target is the full set of Verb- Net classes, we also show results for the task studied in the previous work.",
                    "sid": 190,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "14-class task The task to classify (almost) monosemous verbs into 14 classes.",
                    "sid": 191,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Refer to Table 1 for the definition of the 14 classes.",
                    "sid": 192,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following Joanis et al.",
                    "sid": 193,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008)’s task definition, we removed verbs that belong to multiple classes in these 14 classes, and also removed overly polysemous verbs (in our experiment, verb-class associations that have the relative frequency that is less than 0.5 in SemLink are removed).",
                    "sid": 194,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each class, member verbs are randomly split into 50% (training), 25% (development), and 25% (final test) sets.",
                    "sid": 195,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All-class task The task to classify all target verbs into 268 classes.4 Any verbs that did not occur at least 100 times in the BNC corpus were removed.5 The remaining verbs (2517 words) are randomly split into 80% (training), 10% (development), and 10% (final test) sets, under the constraint that at least one instance for each class is included in the training set.6 4.4 Evaluation measures.",
                    "sid": 196,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the 14-class task, we simply measure the classification accuracy.",
                    "sid": 197,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the evaluation in the 4 Two classes (Being Dressed and Debone) are not used in the experiments because no lemmas belonged to these classes after filtering by the frequency in BNC.",
                    "sid": 198,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 This is the same preprocessing as Joanis et al.",
                    "sid": 199,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008), although we use VerbNet, while Joanis et al.",
                    "sid": 200,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) used the original Levin classifications.",
                    "sid": 201,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 Because polysemous verbs belong to multiple classes, the class-wise data split was not adopted for the all-class task.",
                    "sid": 202,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "all-class task is not trivial, because verbs may be assigned multiple classes.",
                    "sid": 203,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since our purpose is to obtain a probabilistic model rather than to classify monosemous verbs, the evaluation criterion should be sensitive to the probabilistic distribution on the test data.",
                    "sid": 204,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we adopt two evaluation measures.",
                    "sid": 205,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One is the top-N weighted accuracy; we count thenumber of correct pairs (c, v) in the N -best out puts from the model (where N is the number of gold classes for each lemma), where each count is weighted by the relative frequency (i.e., the counts in SemLink) of the pair in the test set.",
                    "sid": 206,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the case for “blare” in Figure 4, if the model states that Sound Emission has the largest probability, we get 0.7 points.",
                    "sid": 207,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If Manner Speaking has the largest probability, we instead obtain 0.3 points.",
                    "sid": 208,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intuitively, the score is higher when the model presents larger probabilities to classes with higher relative frequencies.",
                    "sid": 209,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This measure is similar to the top-N precision in information retrieval; it evaluates the ranked output by the model.",
                    "sid": 210,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is intuitively interpretable, but is insufficient for evaluating the quality of probability distributions.",
                    "sid": 211,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other measure is KL-divergence, which is popularly used for measuring the dissimilarity between two probability distributions.",
                    "sid": 212,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is defined as follows: K L(p||q) = ) p(x) log(p(x)) − p(x) log(q(x)).",
                    "sid": 213,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "x In the experiments, this measure is applied, with the assumption that p is the relative frequencyof (c, v) in the test set, and that q is the estimated probability distribution.",
                    "sid": 214,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the KL divergence is not a true distance metric, it is sufficient for measuring the fitting of the estimated model to the true distribution.",
                    "sid": 215,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We report the KL-divergence averaged over all verbs in the test set.",
                    "sid": 216,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since this measure indicates a dissimilarity, a smaller value is better.",
                    "sid": 217,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When p and q are equiva lent, K L(p||q) = 0.",
                    "sid": 218,
                    "ssid": 99,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental results. ",
            "number": "5",
            "sents": [
                {
                    "text": "Table 2 shows the accuracy obtained for the 14- class task.",
                    "sid": 219,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first column denotes the incorporated features (“Joanis et al.’s features” or “All features”), and the sources of the features (“WSJ” or “BNC”).",
                    "sid": 220,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two baseline results are also given: “Baseline (random)” indicates that classes are randomly output, and “Baseline (majority)” indicates Accuracy Baseline (random) 7.14 Baseline (majority) 26.47 Joanis et al.’s features/WSJ 56.86 Joanis et al.’s features/BNC 64.22 All features/WSJ 60.29 All features/BNC 68.14 Accuracy KL Baseline (random) 0.37 — Baseline (majority) 8.69 — Joanis et al.’s features/WSJ 29.65 3.67 Joanis et al.’s features/BNC 35.78 3.34 All features/WSJ 34.53 3.40 All features/BNC 42.38 3.02 Table 2: Accuracy for the 14-class task Table 4: Accuracy and KL-divergence for the all- class task (the VerbNet only setting) 50 Accuracy (Joanis et al.’s features, WSJ) Accuracy (Joanis et al.’s features, BNC) Accuracy (all features, WSJ) Accuracy (all features, BNC) 40 30 Table 3: Accuracy and KL-divergence for the all- 20 class task (the VerbNet+SemLink setting) 10 that the majority class (i.e., the class that has the largest number of member verbs) is output to every lemma.",
                    "sid": 221,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While these figures cannot be compared directly to the previous works due to the difference in the preprocessing, Joanis et al.",
                    "sid": 222,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) achieved 58.4% accuracy for the 14-class task.",
                    "sid": 223,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 and 4 present the results for the all-class task.",
                    "sid": 224,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 gives the accuracy and KL-divergence achieved by the model trained with the VerbNet+SemLink training instances, while Table 4 presents the same measures by the training instances created from VerbNet only.",
                    "sid": 225,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our models performed substantially better on both tasks than the baseline models.",
                    "sid": 226,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results also proved that the features we proposed in this paper contributed to the further improvement of the model from Joanis et al.",
                    "sid": 227,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008).",
                    "sid": 228,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the all-class task with the VerbNet+SemLink setting, our features achieved 10.69% error reduction in the accuracy over Joanis et al.",
                    "sid": 229,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008)’s features.",
                    "sid": 230,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another interesting fact is that the model with BNC consistently outperformed the model with WSJ.",
                    "sid": 231,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This outcome is somewhat surprising, provided that the relative frequencies in the training/test sets are created from the WSJ portion of SemLink.",
                    "sid": 232,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason for this is independent of the corpus size, as will be shown below.",
                    "sid": 233,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When comparing Table 3 and 4, we can see that using SemLink statistics resulted in a slightly better model.",
                    "sid": 234,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result is predictable, because the evaluation measures are sensitive to the relative frequencies estimated from SemLink.",
                    "sid": 235,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the difference remained small.",
                    "sid": 236,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In both of the tasks and the evaluation measures, the best model was achieved when we use 0 0 20 40 60 80 100 Corpus size (M words) Figure 6: Corpus size vs. accuracy all the features extracted from BNC, and create training instances from VerbNet+SemLink.",
                    "sid": 237,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 6 and 7 plot the accuracy and KL- divergence against the size of the unannotated corpus used for feature extraction.",
                    "sid": 238,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result clearly indicates that the learning curve still grows at the corpus size with 100 million words (especially for the all features + BNC setting), which indicates that better models are obtained by increasing the size of the unannotated corpora.",
                    "sid": 239,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we can claim that the differences between the domains and the size of the unannotated corpora are more influential than the availability of the annotated corpora.",
                    "sid": 240,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This indicates that learning only from a lexicon would be a viable solution, when a token-disambiguated corpus like SemLink is unavailable.",
                    "sid": 241,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 shows the contribution of each feature group.",
                    "sid": 242,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BNC is used for feature extraction, and VerbNet+SemLink is used for the creation of training instances.",
                    "sid": 243,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results demonstrated the effectiveness of the slot POS features, and in particular, for the all-class task, most likely because Verb- Net covers verbs that take non-nominal arguments.",
                    "sid": 244,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, the similar word features contributed equally or more in both of the tasks.",
                    "sid": 245,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result suggests that we were reasonable in hypothesizing that distributionally similar words tend to be clas 4.5 4 3.5 3 2.5 K L ( J o a n i s e t a l . ’ s f e a t u r e s , W S J ) K L ( J o a n i s e t a l . ’ s f e a t u r e s , B N C ) K L ( a l l f e a t u r e s , W S J ) K L ( a l l f e a t u r e s , B N C ) 0 2 0 4 0 6 0 8 0 1 00 C o r p u s s i z e ( M w o r d s ) Anot her majo r error is in class ifyin g verb s into O t h e r C h a n g e o f S t a t e . E x a m p l e s i n c l u d e : • Amu se verb s: “imp air,” “rec harg e.” • Her d verb s: “agg regat e,” “ma ss.” Becau se Other Chan ge of State is one of the bigges t classe s, superv ised learni ng tends to place a high proba bility to this class.",
                    "sid": 246,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Theref ore, when strong clues do not exist, verbs tend to be misclassif ied into this class.",
                    "sid": 247,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In additi on, this class is not syntac tically /sema nticall y homo geneo us, and Figure 7: Corpus size vs. KL-divergence 14-classes All classes Accuracy Accuracy KL Baseline (random) 7.14 0.37 — Baseline (majority) 26.47 8.69 — Joanis et al.’s features 64.22 35.66 3.32 + Slot POS 66.67 38.77 3.18 + Syntactic frame 64.71 35.99 3.29 + Similar word 68.14 37.88 3.10 + Slot class 64.71 36.51 3.26 All features 68.14 42.54 2.99 Table 5: Contribution of features sified into the same class.",
                    "sid": 248,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Slot classes also contributed to a slight improvement, indicating that selectional preferences are effective clues for predicting VerbNet classes.",
                    "sid": 249,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result of the “All features” model for the all-class task attests that these features worked collaboratively, and using them all resulted in a considerably better model.",
                    "sid": 250,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the analysis of the confusion matrix for the outputs by our best model, we identified several reasons for the remaining misclassification errors.",
                    "sid": 251,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A major portion of the errors were caused by confusing the classes that take the same prepositions.",
                    "sid": 252,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples of these errors include: • Other Change of State verbs were misclassified into the Butter class: “embalm,” “laminate.” (they take “with” phrases) • Judgement verbs were misclassified into the Characterize class: “acclaim,” “hail.” (they take “as” phrases) Since prepositions are strong features for automatic verb classification (Joanis et al., 2008), the classes that take the same prepositions remained confusing.",
                    "sid": 253,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The discovery of the features to discriminate among these classes would be crucial for further improvement.",
                    "sid": 254,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is likely to introduce noise in the machine learning classifier.",
                    "sid": 255,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A possible solution to this problem would be to exclude this class from the classification, and to process the class separately.",
                    "sid": 256,
                    "ssid": 38,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "6",
            "sents": [
                {
                    "text": "We presented a method for the supervised learning of a probabilistic model for a lexicon of Verb- Net classes.",
                    "sid": 257,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By combining verb-class associations from VerbNet and SemLink, and features extracted from a large unannotated corpus, we could successfully train a log-linear model in a supervised way.",
                    "sid": 258,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experimental results attested to our success that features proposed in this paper worked effectively in obtaining a better probability distribution.",
                    "sid": 259,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Not only syntactic features, but also semantic features were shown to be effective.",
                    "sid": 260,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While each of these features could increase the accuracy, they collaboratively contributed to a large improvement.",
                    "sid": 261,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the all-class task, we obtained 10.69% error reduction in the classification accuracy over Joanis et al.",
                    "sid": 262,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008)’s model.",
                    "sid": 263,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also observed the trend that a larger corpus for feature extraction led to a better model, indicating that a better model will be obtained by increasing the size of an unannotated corpus.",
                    "sid": 264,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We could identify the effective features and settings for this problem, but the classification into all VerbNet classes remained challenging.",
                    "sid": 265,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possible direction for this research topic would be to use our model for the semiautomatic construction of verb lexicons, with the help of human curation.",
                    "sid": 266,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, there is also a demand for exploring other types of features that can discriminate among confusing classes.",
                    "sid": 267,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This work was partially supported by Grant-in- Aid for Specially Promoted Research and Grant- in-Aid for Young Scientists (MEXT, Japan).",
                    "sid": 268,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}