{
    "ID": "D12-1003",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper proposes a novel method for lexicon extraction that extracts translation pairs from comparable corpora by using graph- based label propagation.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In previous work, it was established that performance drastically decreases when the coverage of a seed lexicon is small.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We resolve this problem by utilizing indirect relations with the bilingual seeds together with direct relations, in which each word is represented by a distribution of translated seeds.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The seed distributions are propagated over a graph representing relations among words, and translation pairs are extracted by identifying word pairs with a high similarity in the seed distributions.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose two types of the graphs: a co-occurrence graph, representing co-occurrence relations between words, and a similarity graph, representing context similarities between words.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluations using English and Japanese patent comparable corpora show that our proposed graph propagation method outperforms conventional methods.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, the similarity graph achieved improved performance by clustering synonyms into the same translation.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Bilingual lexicons are important resources for bilingual tasks such as machine translation (MT) and cross-language information retrieval (CLIR).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the automatic building of bilingual lexicons from corpora is one of the issues that have attracted many researchers.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a solution, a number of previous works proposed extracting bilingual lexicons from comparable corpora, in which documents were not direct translations but shared a topic or domain1.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of comparable corpora is motivated by the fact that large parallel corpora are only available for a few language pairs and for limited domains.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of the previous methods are based on assumption (I), that a word and its translation tend to appear in similar contexts across languages (Rapp, 1999).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on this assumption, many methods calculate word similarity using context and then extract word translation pairs with a high-context similarity.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We call these methods context-similarity- based methods.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The context similarities are usually computed using a seed bilingual lexicon (e.g. a general bilingual dictionary) by mapping contexts expressed in two different languages into the same space.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the mapping, information not represented by the seed lexicon is discarded.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the context-similarity-based methods could not find accurate translation pairs if using a small seed lexicon.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of the previous methods tried to alleviate the problem of the limited seed lexicon size (Koehn and Knight, 2002; Morin and Prochasson, 2011; Hazem et al., 2011), while others did not require any seed lexicon (Rapp, 1995; Fung, 1995; Haghighi et al., 2008; Ismail and Manandhar, 2010; Daume´ III and Jagarlamudi, 2011).",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, they suffer the problems of high computational cost (Rapp, 1995), sensitivity to parameters (Hazem et al., 2011), low accuracy (Fung, 1995; Ismail and Manandhar, 2010), and ineffectiveness for language pairs with 1 Although Vulic´ et al.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011) regarded document-aligned texts such as texts on Wikipedia as comparable corpora, we do not limit comparable corpora to these kinds of texts.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "24 Proceedings of the 2012 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning, pages 24–36, Jeju Island, Korea, 12–14 July 2012.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2012 Association for Computational Linguistics different types of characters (Koehn and Knight, 2002; Haghighi et al., 2008; Daume´ III and Jagarlamudi, 2011).",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In face of the above problems, we propose a novel method that uses a graph-based label propagation technique (Zhu and Ghahramani, 2002).",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed method is based on assumption (II), which is derived by recursively applying assumption (I) to the “contexts”: a word and its translation tend to have similar co-occurrence (direct and indirect) relations with all bilingual seeds across languages.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on assumption (II), we propose a three- step approach: (1) constructing a graph for each language with each edge indicating a direct co- occurrence relation, (2) representing every word as a seed translation distribution by iteratively propagating translated seeds in each graph, (3) finding two words in different languages with a high similarity with respect to the seed distributions.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By propagating all the seeds on the graph, indirect co-occurrence relations are also considered when computing bilingual relations, which have been neglected in previous methods.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the co-occurrence-based graph construction, we propose a similarity graph, which also takes into account context similarities between words.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main contributions of this paper are as follows: • We propose a bilingual lexicon extraction method that captures co-occurrence relations with all the seeds, including indirect relations, using graph-based label propagation.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, we confirm that the proposed method outperforms conventional context-similarity-based methods (Rapp, 1999; Andrade et al., 2010), and works well even if the coverage of a seed lexicon is low.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• We propose a similarity graph which represents context similarities between words.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, we confirm that a similarity graph is more effective than a co-occurrence-based graph.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "context-similarity-based extraction. ",
            "number": "2",
            "sents": [
                {
                    "text": "Method The bilingual lexicon extraction from comparable corpora was pioneered in (Rapp, 1995; Fung, 1995).",
                    "sid": 32,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The popular similarity-based methods consist of the following steps: modeling contexts, calculating context similarities, and finding translation pairs.",
                    "sid": 33,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 1.",
                    "sid": 34,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Modeling contexts: The context of each word is generally modeled by a vector where each dimension corresponds to a context word and each dimension has a value indicating occurrence correlation.",
                    "sid": 35,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Various definitions for the context have been used: distance-based context (e.g. in a sentence (Laroche and Langlais, 2010), in a paragraph (Fung and McKeown, 1997), in a predefined window (Rapp, 1999; Andrade et al., 2010)), and syntactic-based context (e.g. predecessors and successors in dependency trees (Garera et al., 2009), certain dependency position (Otero and Campos, 2008)).",
                    "sid": 36,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some treated context words equally regardless of their positions (Fung and Yee, 1998), while others treated the words separately for each position (Rapp, 1999).",
                    "sid": 37,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Various correlation measures have been used: log-likelihood ratio (Rapp, 1999; Chiao and Zweigenbaum, 2002), tfidf (Fung and Yee, 1998), pointwise mutual information (PMI) (Andrade et al., 2010), context heterogeneity (Fung, 1995), etc. Shao and Ng (2004) represented contexts using language models.",
                    "sid": 38,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Andrade et al.",
                    "sid": 39,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) used a set of words with a positive association as a context.",
                    "sid": 40,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Andrade et al.",
                    "sid": 41,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011a) used dependency relations instead of context words.",
                    "sid": 42,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ismail and Man- andhar (2010) used only in-domain words in contexts.",
                    "sid": 43,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pekar et al.",
                    "sid": 44,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006) constructed smoothed context vectors for rare words.",
                    "sid": 45,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Laws et al.",
                    "sid": 46,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) used graphs in which vertices correspond to words and edges indicate three types of syntactic relations such as adjectival modification.",
                    "sid": 47,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 2.",
                    "sid": 48,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Calculating context similarities: The contexts which are expressed in two different languages are mapped into the same space.",
                    "sid": 49,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous methods generally use a seed bilingual lexicon for this mapping.",
                    "sid": 50,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After that, similarities are calculated based on the mapped context vectors using various measures: city-block metric (Rapp, 1999), cosine similarity (Fung and Yee, 1998), weighted jaccard index (Hazem et al., 2011), JensenShannon divergence (Pekar et al., 2006), the number of overlapping context words (Andrade et al., 2010), Sim- Rank (Laws et al., 2010), euclidean distance (Fung, 1995), etc. Japanese English Quer y – Cont ext Wor d Asso ciatio n ピ ラ ニ ア – ア マ ゾ ン (pir an ha) (A ma zon ) ピラ ニア – ジャ ング ル (pira nha) (jung le) ピラ ニア – 淡 水 (pira nha) (fres hwat er) 淡 水 – 魚 (fres hwat er) (fish) 0 . 8 0 . 6 0 . 5 0 . 8 Seed Lexicon (Japanese – English) : アマゾン – Amazon, ジャングル – jungle, 魚 – fish Context-similarity-based Method the context vectors become sparser and its discriminative capability becomes lower, leading to extraction of incorrect translation equivalents.",
                    "sid": 51,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the example in Figure 1, where a context-similarity-based method and our proposed method find translation equivalents of the Japanese word “ピラニア (piranha)”.",
                    "sid": 52,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are three con text words for the query.",
                    "sid": 53,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the information on co-occurrence with “淡水 (freshwater)” dis Amazon jungle ピラニア ( 0.8 , 0.6 ) Amazon jungle piranha ( 0.8 , 0.6 ) anaconda ( 0.8 , 0.6 ) similarit y ピラニア – piranha 1.0 ピラニア – anaconda 1.0 appears after the context vector is mapped, because the seed lexicon does not include “淡水 (freshwa ter)”.",
                    "sid": 54,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same thing happens with the English word Proposed Method Japanese English Amazon jungle fish “piranha”.",
                    "sid": 55,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, the pair of “ピラニア (pi 淡水 0.8 魚 (fish) 0.8 fish freshwater 0.5 0.5 , 0.3 , 0.2 ranha)” and “anaconda” could be wrongly identified (freshwater) ジャングル jungle 0.6 piranha as a translation pair.",
                    "sid": 56,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0.5 ピラニア 0.6 (jungle) 0.8 0.6 ana con da Some previo us work focuse d on the proble m of seed lexicon limitation . Morin and Prochas-.",
                    "sid": 57,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(piranha) 0.8 アマゾン (Amazon) Amazon 0.8 Amazon jungle fish son (2011) compleme nted the seed lexicon with アマゾン ジャングル 魚 0.5 , 0.3 , 0.2 0.55 , 0.4 , 0.05 bilingual lexicon extracted from parallel sentences.",
                    "sid": 58,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Koehn and Knight (2002) used identically spelled words in two languages as a seed lexicon.",
                    "sid": 59,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However,Figure 1: An Example of a Previous Method and our Pro posed Method Andrade et al.",
                    "sid": 60,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011b) performed a linear transformation of context vectors in accordance with the notion that importance varies by context positions.",
                    "sid": 61,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gaussier et al.",
                    "sid": 62,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) mapped context vectors via latent classes to capture synonymy and polysemy in a seed lexicon.",
                    "sid": 63,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fisˇer et al.",
                    "sid": 64,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011) and Kaji (2005) calculated 2-way similarities.",
                    "sid": 65,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 3.",
                    "sid": 66,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finding translation pairs: A pair of words is treated as a translation pair when their context similarity is high.",
                    "sid": 67,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Various clues have been considered when computing the similarities: concept class information obtained from a multilingual thesaurus (De´jean et al., 2002), co-occurrence models generated from aligned documents (Prochasson and Fung, 2011), and transliteration information (Shao and Ng, 2004).",
                    "sid": 68,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Problems from Previous Works.",
                    "sid": 69,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of previous methods used a seed bilingual lexicon for mapping modeled contexts in two different the method is not applicable for language pairs with different types of characters such as English and Japanese.",
                    "sid": 70,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hazem et al.",
                    "sid": 71,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011) exploited k-nearest words for a query, which is very sensitive to the parameter k. Some previous work did not require any seed lexicon.",
                    "sid": 72,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rapp (1995) proposed a computationally demanding matrix permutation method which maximizes a similarity between co-occurrence matrices in two languages.",
                    "sid": 73,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ismail and Manandhar (2010) introduced a similarity measure between two words in different languages without requiring any seed lexicon.",
                    "sid": 74,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fung (1995) used context heterogeneity vectors where each dimension is independent on language types.",
                    "sid": 75,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, their performances are worse than those of conventional methods using a small seed lexicon.",
                    "sid": 76,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Haghighi et al.",
                    "sid": 77,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) and Daume´ III and Jagarlamudi (2011) proposed a generative model based on probabilistic canonical correlation analysis, where words are represented by context features and orthographic features2 . However, their experiments showed that orthographic features to be important for effectiveness, which means low per 2 In Haghighi et al.",
                    "sid": 78,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) and Daume´.",
                    "sid": 79,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "III and Jagarlalanguages into the same space.",
                    "sid": 80,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The mapping heav ily relies on the entries in a given bilingual lexicon.",
                    "sid": 81,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, if the coverage of the seed lexicon is low, mudi (2011), indirect relations with seeds are considered topologically, but our method utilizes degrees of indirect correlations with seeds.",
                    "sid": 82,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "formance for language pairs with different character types.",
                    "sid": 83,
                    "ssid": 52,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "lexicon extraction based on label. ",
            "number": "3",
            "sents": [
                {
                    "text": "Propagation As described in Section 2, the performance of previous work is significantly degraded when used with a small seed lexicon.",
                    "sid": 84,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This problem could be resolved by incorporating indirect relations with all the seeds when identifying translation pairs.",
                    "sid": 85,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in Figure 1, “ピラニア (piranha)” has some degree of association with the seed “魚 - fish” through “淡水 (freshwater)” in both the Japanese side and the English side, although “ピラニア (piranha)” and “魚 (fish)” do not co-occur in the same contexts.",
                    "sid": 86,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, “anaconda” has very little association with the seed “魚 - fish” in the English side.",
                    "sid": 87,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the indirect relation with the seed “魚 - fish” helpsto discriminate from between “piranha” and “ana Algorithm 1 Bilingual Lexicon Extraction Require: comparable corpora De and Df , a seed lexicon S consists of S e and S f Ensure: Output translation pairs T 11: Ge = {E e , V e , W e } ← construct-graph(De ) 12: Gf = {E f , V f , W f } ← construct-graph(Df ) 21: G˜e = {E e , V e , W e , Qe } ← propagate-seed (Ge , S e ) 22: G˜f = {E f , V f , W f , Qf } ← propagate-seed (Gf , S f ) 3: T ← extract-translation (Qe , Qf , S ) tion for each language, (2) seed propagation in each graph, (3) translation pair extraction.",
                    "sid": 88,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Graph Construction.",
                    "sid": 89,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We construct a graph representing the association between words for each language.",
                    "sid": 90,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each graph is an undirected graph because the association does not have direction.",
                    "sid": 91,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The graphs are constructed as follows: Step 1.",
                    "sid": 92,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Vertex assignment extracts words fromeach corpus, and assigns a vertex to each of the exconda” and could be an important clue for identify ing a correct translation pair.",
                    "sid": 93,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tracted words.",
                    "sid": 94,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let V = {v1, · · · , vn vertices.",
                    "sid": 95,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "} be a set ofTo utilize indirect relations, we introduce assump tion (II): a word and its translation tend to have similar co-occurrence (direct and indirect) relations with Step 2.",
                    "sid": 96,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Edge weight calculation calculates association strength between two words as the weights of edges.",
                    "sid": 97,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let E and W be a set of edges and that ofall bilingual seeds across languages3.",
                    "sid": 98,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on as sumption (II), we propose to identify a word pair as the weights respectively, and e ij ∈ E links vi and a translation pair when its co-occurrence (direct and indirect) relations with all the seeds are similar.",
                    "sid": 99,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To obtain co-occurrence relations with all the seeds, including indirect relations, we focus on a graph-based label propagation (LP) technique (Zhu and Ghahramani, 2002).",
                    "sid": 100,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LP transfers labels from labeled data points to unlabeled data points.",
                    "sid": 101,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the process, all vertices have soft labels that can be interpreted as label distributions.",
                    "sid": 102,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We apply LP to bilingual lexicon extraction by representing each word as a vertex in a graph with each edge encoding a direct co-occurrence relation.",
                    "sid": 103,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Translated seeds are propagated as labels, and seed distributions are obtained for each word.",
                    "sid": 104,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the seed distributions, we identify translation pairs.",
                    "sid": 105,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In summary, our proposed method consists of three steps (see Algorithm 1): (1) graph construc 3 Assumption (I) indicates direct co-occurrence relations between a word and its context words are preserved across different languages.",
                    "sid": 106,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, assumption (II) is derived by recursively applying assumption (I) to the “context words”.",
                    "sid": 107,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "vj , and wij ∈ W is the weight of eij . Note that |E | = |W |.",
                    "sid": 108,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 3.",
                    "sid": 109,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Edge pruning excludes edges whose weights are lower than threshold, in order to reduce the computational cost during seed propagations.",
                    "sid": 110,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose two types of graphs that differ in the association measure used in Step 2: a co-occurrence graph and a similarity graph4.",
                    "sid": 111,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1.1 Co-occurrence Graph A co-occurrence graph directly encodes assumption (II).",
                    "sid": 112,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each edge in the graph indicates correlation strength between occurrences of two linked words.",
                    "sid": 113,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example is shown in Figure 1.",
                    "sid": 114,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In edge weight calculation, the co-occurrence frequencies are first computed for each word pair in the same context, and then the correlation strength is estimated.",
                    "sid": 115,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are various definitions of a context or correlation measures that can be used (e.g. the 4 We can combine the association measures used in a co- occurrence graph and a similarity graph.",
                    "sid": 116,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will leave this combination approach for future work.",
                    "sid": 117,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "approaches used for modeling contexts in context- similarity-based methods).",
                    "sid": 118,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we use words in a predefined window (window size is 10 in our experiments) as the context and PMI as the correlation measure: paper: wij = C os(f⃗i , f⃗j ) = f⃗i · f⃗j , ∥f⃗i ∥∥f⃗j ∥ p(vi , vj ) where f⃗i (or f⃗j ) is the correlation vector of vi (or vj ).",
                    "sid": 119,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, in edge pruning, we preserve the edges wij = P M I (vi , vj ) = log p(v ) · p(v ) , with top 100 weight for each vertex.",
                    "sid": 120,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Seed Propagation.",
                    "sid": 121,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "where p(vi ) (or p(vj )) is the probability that vi (orvj ) occurs in a context, and p(vi , vj ) is the probabil ity that vi and vj co-occur within the same context.",
                    "sid": 122,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We estimate P M I (vi , vj ) by the Bayesian method proposed by Andrade et al.(2010).",
                    "sid": 123,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, edges with a negative association, P M I (vi , vj ) ≤ 0, are pruned in edge pruning.",
                    "sid": 124,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1.2 Similarity Graph Co-occurrence graphs are very sensitive to accidental relation caused by lower frequent co- occurrence.",
                    "sid": 125,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we propose a similarity graph where context similarities are employed as weights of edges instead of simple co-occurrence-based correlations.",
                    "sid": 126,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the context similarities are computed by the global correlation among words which co-occur, a similarity graph is less subject to accidental co-occurrence.",
                    "sid": 127,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of a similarity graph is inspired by assumption (III): a word and its translation tend to have similar context similarities with all bilingual seeds across languages5.",
                    "sid": 128,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In edge weight calculation, we first construct a LP is a graph-based technique which transfers the labels from labeled data to unlabeled data in order to infer labels for unlabeled data.",
                    "sid": 129,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is primarily used when there is scarce labeled data but abundant unlabeled data.",
                    "sid": 130,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LP has been successfully applied in common natural language processing tasks such as word sense disambiguation (Niu et al., 2005; Alexandrescu and Kirchhoff, 2007), multi-class lexicon acquisition (Alexandrescu and Kirchhoff, 2007), and part-of-speech tagging (Das and Petrov, 2011).",
                    "sid": 131,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LP iteratively propagates label information from any vertex to nearby vertices through weighted edges, and then a label distribution for each vertex is generated where the weights of all labels add up to 1.",
                    "sid": 132,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopt LP to obtain relations with all bilingual seeds including indirect relations by treating each seed as a label.",
                    "sid": 133,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, each translated seed is assigned to a label, and then the labels are propagated in the graph described in Section 3.1.",
                    "sid": 134,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The seed distribution for each word is initialized as follows:correlation vector representing co-occurrence rela tions for each word.",
                    "sid": 135,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The correlation vectors are constructed in the same way as the context vectors used  1 if vi ∈ Vs q0  and z = vi in context-similarity-based methods (see Section 2), i (z) = 0 if vi ∈ Vs and z ̸= vi ,  u(z) otherwisewhere context words are words in a predefined window (window size is 4 in our experiment), the as where Vs is the set of vertices corresponding to translated seeds, u is a uniform distribution, qk (i = sociation measure is PMI, and context words are treated separately for each position.",
                    "sid": 136,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A correlation 1 · · · |V | ) is the seed distribution for vi after ik prop agation, and qk (z) is the weight of a label (i.e., a vector for each position is computed separately, then translated i seed) z in qk . concatenated into a single vector within the window.",
                    "sid": 137,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After i initialization, we iteratively propagate theSecondly, we calculate similarities between correla tion vectors.",
                    "sid": 138,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are various similarity measures that can be used, and cosine similarity is used in this 5 This assumption is justified because context similarities are based on co-occurrence relations that are preserved across different languages.",
                    "sid": 139,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "seeds through weighted edges.",
                    "sid": 140,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In each propagation, seeds are probabilistically propagated from linked vertices under the condition that larger edge weights allow seeds to travel through easier.",
                    "sid": 141,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the closer vertices are, the more likely they have similar seed distributions.",
                    "sid": 142,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Figure 1, the balloons attached to vertices in the graphs show examples of the seed distributions generated by propagations.",
                    "sid": 143,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the English word “piranha” has the seed distribution where the weights of the seeds “Amazon”, “jungle”, and “fish” are 0.5, 0.3, and 0.2, respectively.",
                    "sid": 144,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, each of seed distributions is updated as follows: i (z) if vi ∈ Vs P a ir Ja pa ne se W or d En gli sh W or d Le xS 2, 7 4 2 2 , 5 6 6 2 , 3 2 6 Le xL 28 ,0 53 1 8 , 5 8 7 1 2 , 8 9 3 Table 1: Size of Seed Lexicons development data used in the NTCIR8 patent translation task, which is called NTCIR parallel data qm  ∑ m−1 hereafter) in the patent data.",
                    "sid": 145,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, a preliminary i (z) =  vj ∈N (vi ) wij · qj (z) v ∈N (v ) wij otherwise , examination showed that the NTCIR parallel data j i covers less than 3% of all words because there are where N (vi ) is the set of vertices linking to vi . Weran this procedure for 10 iterations in our experi ments.",
                    "sid": 146,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Translation Pair Extraction.",
                    "sid": 147,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After label propagations, we treat a pair of words in different languages with similar seed distributions as a translation pair.",
                    "sid": 148,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Seed distribution can be regarded as a vector where each dimension corresponds to each translated seed and each dimension has updated weight through label propagations.",
                    "sid": 149,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A similarity between seed distributions can therefore be calculated in the same way as a context-similarity- based method.",
                    "sid": 150,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we use the cosine similarity defined by the following: a number of technical terms and neologisms.",
                    "sid": 151,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the patent translation task is a task that requires bilingual lexicon extraction from non-parallel data.",
                    "sid": 152,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We selected documents belonging to the physics domain from each monolingual corpus based on International Patent Classification (IPC) code6 , and then used them as a comparable corpus in our experiments.",
                    "sid": 153,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, we used 1,479,831 Japanese documents and 438,227 English documents.",
                    "sid": 154,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason for selecting the physics domain is that this domain contains the most documents of all the domains.",
                    "sid": 155,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Japanese texts were segmented and part-of- speech tagged by ChaSen7, and the English texts were tokenized and part-of-speech tagged by Tree- Tagger (Schmid, 1994).",
                    "sid": 156,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, function words were ∑ f f e e C os(qf , qe ) = si ∈S qx (vi ) · qy (vi ) removed since function words with little seman , x y √∑ f f 2 √∑ e e 2 tic information spuriously co occurred with many si ∈S (qx (vi )) si ∈S (qy (vi )) words.",
                    "sid": 157,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, the number of distinct words where qf (or qe ) is the seed distribution for a word x in Japanese corpus and English corpus amounted to x y 1,111,302 and 4,099,8258, respectively.",
                    "sid": 158,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(or y) in the source language (or target language), S is the seed lexicon whose i-th entry si is a pairing of a translated seed in the source language vf and one We employed seed lexicons from two sources: (1) EDR bilingual dictionary (EDR, 1990), (2) automatic word alignments generated by running in the target language ve .",
                    "sid": 159,
                    "ssid": 76,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiment. ",
            "number": "4",
            "sents": [
                {
                    "text": "4.1 Experiment Data.",
                    "sid": 160,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used English and Japanese patent documents published between 1993 and 2005 by the US Patent & Trademark Office and the Japanese Patent Office respectively, which were a part of the data used in the NTCIR8 patent translation task (Fujii et al., 2010).",
                    "sid": 161,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that these documents are not aligned.",
                    "sid": 162,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are over three million EnglishJapanese parallel sentences (e.g. training data, test data, and GIZA++ (Och and Ney, 2003) with the NTCIR parallel data consisting of 3,190,654 parallel sentences.",
                    "sid": 163,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From each source, we extracted pairs of nouns appearing in our corpus.",
                    "sid": 164,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From (2), we excluded word pairs where the average of 2-way translation proba 6 SECTION G of IPC code indicates the physics domain..",
                    "sid": 165,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 http://chasen-legacy.sourceforge.jp/ 8 The English words contain words in tables or mathematical.",
                    "sid": 166,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "formula but the Japanese words do not because the data format differs between English and Japanese.",
                    "sid": 167,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is why the number of English words is larger than that of Japanese words, even though the number of English documents is smaller than that of Japanese documents.",
                    "sid": 168,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "bilities was lower than 0.5.",
                    "sid": 169,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pairs from (1) and (2) amounted to 27,353 and 2,853 respectively, and the two sets were not exclusive.",
                    "sid": 170,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to measure the impact of seed lexicon size, we prepared two seed lexicons: LexL , a large seed lexicon that is a union of all the extracted word pairs, and LexS , asmall seed lexicon that is a union of a random sam pling one-tenth of the pairs from (1) and one-tenth of the pairs from (2).",
                    "sid": 171,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 shows the size of each seed lexicon.",
                    "sid": 172,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that our seed lexicons include one-to-many or many-to-one translation pairs.",
                    "sid": 173,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We randomly selected 1,000 Japanese words as our test data which were identified as either a noun or an unknown by ChaSen and were not covered either by the EDR bilingual dictionary or by the NTCIR parallel data.",
                    "sid": 174,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because the purpose of our method is to complement existing bilingual dictionaries or parallel data.",
                    "sid": 175,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the Japanese words in our test data may not have translation equivalents in the English side.",
                    "sid": 176,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Competing Methods.",
                    "sid": 177,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluated two types of our label propagation based methods against two baselines.",
                    "sid": 178,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "C ooc employs co-occurrence graphs and S im uses similaritygraphs when constructing graphs for label propaga tion as described in Section 3.",
                    "sid": 179,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rapp is a typical context-similarity-based method described in Section 2 (Rapp, 1999).",
                    "sid": 180,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Context words are words in a window (window size is 10) and are treated separately for each position.",
                    "sid": 181,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Associations with context words are computed using the log-likelihood ratio (Dunning, 1993).",
                    "sid": 182,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The similarity measure between context vectors is the city-block metric.Andrade is a sophisticated method in context similarity-based methods (Andrade et al., 2010).",
                    "sid": 183,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Context is a set of words with a positive association in a window (window size is 10).",
                    "sid": 184,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The association is calculated using the PMI estimated by a Bayesian method, and a similarity between contexts is estimated based on the number of overlapping words (see the original paper for details).",
                    "sid": 185,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Experiment Results.",
                    "sid": 186,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows the performance of each method us ing LexS or LexL . Hereafter, M ethod(L) (or M ethod(S )) denotes the M ethod using LexL (or L e xS L e x L Ac c1 A cc 20 A c c1 A cc 20 R ap p 1.",
                    "sid": 187,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 % 3.",
                    "sid": 188,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 % 4.",
                    "sid": 189,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 % 17 .6 % A n dr ad e 1.",
                    "sid": 190,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 % 4.",
                    "sid": 191,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 % 5.",
                    "sid": 192,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 % 17 .6 % C oo c 3.",
                    "sid": 193,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 % 8.",
                    "sid": 194,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 % 9.",
                    "sid": 195,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 % 28 .3 % S i m 4.",
                    "sid": 196,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 % 11 .5 % 10 .8 % 30 .6 % Table 2: Performance on Bilingual Lexicon Extraction LexS ).",
                    "sid": 197,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We measure the performance on bilingual lexicon extraction as Top N accuracy (AccN ), which is the number of test words whose top N translation candidates contain a correct translation equivalent over the total number of test words (=1,000).",
                    "sid": 198,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows Top 1 and Top 20 accuracy.",
                    "sid": 199,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We manually9 evaluated whether translation candidates contained a correct translation equivalent.",
                    "sid": 200,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We did not use recall because we do not know if the translation equivalents of a test word appear in the corpus.Table 2 shows that the proposed methods outper form the baselines both when using LexS and using LexL . The improvements are statistically significantin the sign-test with 1% significance-level.",
                    "sid": 201,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The re sults show that capturing the relations with all the seeds including indirect relations is effective.",
                    "sid": 202,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The accuracies of the baselines in Table 2 are worse than the previous reports: 14% Acc1 and 46% Acc10 (Andrade et al., 2010), and 72% Acc1 (Rapp,1999).",
                    "sid": 203,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because previous works evalu ated only the queries whose translation equivalents existed in the experiment data, which is not always true in our experiments.",
                    "sid": 204,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, previous works evaluated only high-frequency words: common nouns (Rapp, 1999) and words with a document frequency of at least 50 (Andrade et al., 2010).",
                    "sid": 205,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our test data, on the other hand, includes many low- frequency words.",
                    "sid": 206,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is generally true that translation of high-frequency words is much easier than that of low frequency words.",
                    "sid": 207,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We discuss the impact of test word frequencies in detail in Section 5.3.",
                    "sid": 208,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 also shows that S im outperforms C ooc both when using LexS and using LexL . The improvements of Acc20 are statistically significant in the sign-test with 5% significance-level.",
                    "sid": 209,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 We could not evaluate using existing dictionaries because most of the test data are technical terms and neologisms not included in the dictionaries.",
                    "sid": 210,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "S i m ( L ) ( 2 ) C o o c ( L ) ( 5 ) An dr ad e(L ) (18 1) 1 2 3 4 5 p s y c h o s i s ma nic dep res sio n epi lep sy ins om nia de me nti a p o l y n e p h r o p a t h y n e u r o l e p t i c i r i d o c y c l i t i s T i c m a n i c d e p r e s s i o n d i s e a s e b o w e l d i s o r d e r s y m p t o m s c l e r o s i s S im (S ) (9 74 ) C o o c ( S ) ( 1 6 5 2 ) An dra de( S ) (17 47) 1 2 3 4 5 u l c e r a t i o n u l c e r n a p h t h o l d e m e n t i a g a s t r i t i s d y s l i n e s i a enc eph alo my elo pat hy gan gli oni c cor tic oba sal pra eco x b u l i m i a s p a s t i c i t y P a r k i n s o n A s y m m e t r i c a n o r e x i a Table 3: Translation Candidates for 躁 鬱 病 (manic- depression) 躁 鬱 病 C o o c ( L ) A n d r a d e( L ) C o o c ( S ) An dra de( S ) 1 2 3 4 5 睡 眠 薬 (0 .1 2) narc otic 精 神 病 (0.1 1) psy cho sis 神 経 症 (0.0 8) neur osis ホ ル モ ン (0.0 5) hor mon e 不 眠 症 (0.0 4) inso mni a 睡 眠 薬 ( 7 . 6 ) n a r c o t i c 老 年 ( 6 . 3 ) o l d 精 神 病 ( 6 . 3 ) p s y c h o s i s 気 管 支 炎 ( 5 . 6 ) b r o n c h i t i s 後 天 ( 5 . 0 ) p o s t e r i o r i 痴 呆 ( 0 . 0 1 6 ) dem enti a 継 子 (0.0 14) alie n,st epc hild 後 天 (0.0 12) post erio ri 陽 性 (0.0 12) elec trop ositi vity 潰 瘍 (0.0 11) ulce r 後 天 ( 5 . 0 ) p o s t e r i o r i 痴 呆 ( 3 . 7 ) d e m e n t i a 潰 瘍 ( 3 . 2 ) u l c e r ピ リ オ ド (2.9 ) peri od 重 度 (2.5 ) seri ous ness m a n i c d e p r e s s i o n C o o c ( L ) A n d r a d e( L ) C o o c ( S ) An dra de( S ) 1 2 3 4 5 i l l n e s s ( 0 . 1 5 ) n e u r o s i s ( 0 . 1 1 ) s e i z u r e ( 0 . 0 7 ) p s y c h o s i s ( 0 . 0 6 ) i n s o m n i a ( 0 . 0 4 ) i l l n e s s (8.6 ) psy chot hera peut ics (7.0 ) g a l o p ( 7 . 0 ) p s y c h o s i s ( 6 . 8 ) s o m n a m b u l i s m ( 6 . 7 ) g a n j a ( 0 . 0 1 2 ) c a r b a n i l i d e ( 0 . 0 1 1 ) p a l u d i s m ( 0 . 0 1 1 ) r e s i g n a t i o n ( 0 . 0 1 0 ) g a l o p ( 0 . 0 0 9 ) g a l o p ( 7 . 0 ) m a d n e s s ( 5 . 4 ) l i b i d o ( 5 . 2 ) v i t i l i g o ( 4 . 6 ) d e m e n t i a ( 4 . 3 ) Table 4: Seeds with the Highest Weight",
                    "sid": 211,
                    "ssid": 52,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discussion. ",
            "number": "5",
            "sents": [
                {
                    "text": "5.1 Effect of Indirect Relations with Seeds.",
                    "sid": 212,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows a list of the top 5 translation candidates for the Japanese word “躁 鬱 病 (manic depression)” for each method, where the ranks of the correct translations are shown in parentheses next to method names.",
                    "sid": 213,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 shows the top 5 translated seeds which characterize the query, where the values in parentheses indicate weight.",
                    "sid": 214,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows that C ooc(L) can find the correct translation equivalent but Andrade(L) cannot.",
                    "sid": 215,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 shows that C ooc(L) can utilize more seeds closely tied to thequery (e.g. “神経症 (neurosis)”, “不眠症 (insom nia)”), which did not occur in the context of the query in the experiment data.",
                    "sid": 216,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result shows that indirectly-related seeds are also important clues, and our proposed method can utilize these.",
                    "sid": 217,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Impact of Seed Lexicon Size.",
                    "sid": 218,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows that a reduction of seed lexicon size degrades performance.",
                    "sid": 219,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is natural for the base line methods because LexS cannot translate most ofcontext words, which are necessary for word charac terization.",
                    "sid": 220,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider Andrade(L) and Andrade(S ) in the example in Section 5.1.",
                    "sid": 221,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 shows that Andrade(S ) uses less relevant seeds with the query,and has to express the query by seeds with less association.",
                    "sid": 222,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “精神病 (psychosis)” can not be used in Andrade(S ) because LexS does not have the seed.",
                    "sid": 223,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, it is more difficult for Andrade(S ) to find correct translation pairs.The proposed methods also share the same ten dency, although each word is expressed by all the seeds in the seed lexicon.",
                    "sid": 224,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider C ooc(L) and C ooc(S ) in the above example.",
                    "sid": 225,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 shows that C ooc(S ) expresses the query by a smooth seed distribution, which is difficult to discriminate from oth ers.",
                    "sid": 226,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because LexS does not have relevant seeds for the query.",
                    "sid": 227,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is why C ooc(S ) cannot find the correct translation equivalent.",
                    "sid": 228,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the otherhand, C ooc(L) characterizes “躁鬱病” and “manic depression” by strongly relevant seeds (e.g. “精神 病 (psychosis)”,“神経症 (neurosis)”), and then finds the correct translation equivalent.",
                    "sid": 229,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To examine the robustness-to-seed lexicon size, we calculated the reduction rate of Acc20 with the following expression: (Acc20 with LexL − Acc20 with LexS ) / Acc20 with LexL . The reduction rates of Rapp, Andrade, C ooc, and S im are 78.4%, 76.1%, 69.6%, and 62.4% respectively.",
                    "sid": 230,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, the difference between degradation in C ooc and that in Andrade is statistically significant in the sign-test with 1% significance-level.",
                    "sid": 231,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results indicate that the proposed methods are more robust to seed lexicon size than the baselines.",
                    "sid": 232,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because the proposed methods can utilize seeds with indirect relations while the baselines utilize only seeds in the context.",
                    "sid": 233,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To verify our claim, we examined the number of test words which occurred with no seeds in the context.",
                    "sid": 234,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There were 570 such words in Rapp(S ), 387 in Rapp(L), 572 in Andrade(S ), and 388 inAndrade(L).",
                    "sid": 235,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baselines cannot find their trans Low Freq . Hig h Freq . Ac c1 Ac c2 0 A c c1 A cc 20 R ap p( L) 0.",
                    "sid": 236,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 % 2.",
                    "sid": 237,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 % 7.",
                    "sid": 238,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 % 25 .6 % A n dr ad e( L) 0.",
                    "sid": 239,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 % 1.",
                    "sid": 240,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 % 8.",
                    "sid": 241,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 % 26 .3 % C oo c( L) 0.",
                    "sid": 242,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 % 4.",
                    "sid": 243,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 % 13 .9 % 40 .7 % S i m (L ) 2.",
                    "sid": 244,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 % 6.",
                    "sid": 245,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 % 15 .0 % 42 .0 % Table 5: Comparison between Performance for High and Low Frequency Words lation equivalents.",
                    "sid": 246,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Words such as this occur even if using LexL, and that number increases when LexS is used.",
                    "sid": 247,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, the proposed methods are able to utilize all the seeds in order to find equivalents for words such as these.",
                    "sid": 248,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the proposed methods work well even if the coverage of a seed lexicon is low.",
                    "sid": 249,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.3 Impact of Word Frequencies.",
                    "sid": 250,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our test data includes many low-frequency words which are not covered by the EDR bilingual dictionary or the NTCIR parallel data.",
                    "sid": 251,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "624 words appear in the corpus less than 50 times.",
                    "sid": 252,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 shows AccN using LexL for 624 low-frequency words and376 high-frequency words.",
                    "sid": 253,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 shows that per formance for low-frequency words is much worse than that for high-frequency words.",
                    "sid": 254,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because translation of high-frequency words utilizes abundant and reliable context information, while the context information for low-frequency words is statistically unreliable.",
                    "sid": 255,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the proposed methods, edges linking rare words are sometimes generated based on accidental co-occurrences, and then unrelated seed information is transferred through the edges.",
                    "sid": 256,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, even our label propagation based meth ods, especially for C ooc, could not identify the correct translation equivalents for rare words.",
                    "sid": 257,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "S im al leviated the problem by using a similarity graph in which edges are generated based on global correlation among words, as indicated by Table 5.",
                    "sid": 258,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 also suggests that top 20 translation candidates for high-frequency words have potential to contribute to bilingual tasks such as MT and CLIR although the overall performance is still low.",
                    "sid": 259,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.4 Effect of Similarity Graphs.",
                    "sid": 260,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We examined AccN for synonyms of translated seeds in Japanese.",
                    "sid": 261,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Acc1 and Acc20 of S im(L) are 15.6% and 56.3%, respectively, and those of C ooc(L) are 9.4% and 37.5%, respectively.",
                    "sid": 262,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results show that similarity graphs are effective forclustering synonyms into the same translation equiv alents.",
                    "sid": 263,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, S im(L) extracted the correct translation pair of the English word “iodine” and the Japanese word “イオディン”, a synonym of the translated seed “ヨウ素 (iodine)” in Japanese.",
                    "sid": 264,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because synonyms tend to be linked in the similarity graph and have similar seed distributions.",
                    "sid": 265,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, in the co-occurrence graph, synonyms tend to be indirectly linked through mutual context words, so the seed distributions of the two could be far away from each other.",
                    "sid": 266,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are in particular many loanwords in patent documents, which are spelled in different ways from person to person.",
                    "sid": 267,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the loan word for the English word “user” is often written as “ユーザ”, but it is sometimes written as “ユーザー”, with an additional prolonged sound mark.",
                    "sid": 268,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, S im is particularly effective for the experiment data.",
                    "sid": 269,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.5 Error Analysis.",
                    "sid": 270,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We discuss errors of the proposed methods except the errors for low-frequency words (see Section 5.3).",
                    "sid": 271,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our test data includes words whose translation equivalents inherently cannot be found.",
                    "sid": 272,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first of these types are words whose equivalent does not exist in the English corpus.",
                    "sid": 273,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is an unavoidable problem for methods based on comparable corpora.",
                    "sid": 274,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second one are words whose English equivalents are compound words.",
                    "sid": 275,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Japanese morphological analyzer tends to group a compound word into a single word, while the English text analyzer does not perform a collocation of words divided by the delimiter space.",
                    "sid": 276,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the sin gle Japanese word “掌紋” is equivalent to “palm pattern” or “palm print”, which is composed of two words.",
                    "sid": 277,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This case was counted as an error even though the proposed methods found the word “palm” as a equivalent of “掌紋”.",
                    "sid": 278,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A main reason of errors other than those above is word sense ambiguity, which is different in ev ery language.",
                    "sid": 279,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the Japanese word “右” means “right” and “conservatism” in English.",
                    "sid": 280,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed methods merge different senses by propagating seeds through these polysemous words in only one language side.",
                    "sid": 281,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is why translation pairs could have wrong seed distributions and then the proposed methods could not identify correct translation pairs.",
                    "sid": 282,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will leave this word sense disambiguation problem for future work.",
                    "sid": 283,
                    "ssid": 72,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "6",
            "sents": [
                {
                    "text": "Besides the comparable corpora approach discussed in Section 2, many alternatives have been proposed for bilingual lexicon extraction.",
                    "sid": 284,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first is a method that finds translation pairs in parallel corpora (Wu and Xia, 1994; Fung and Church, 1994; Och and Ney, 2003).",
                    "sid": 285,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, large parallel corpora are only available for a few language pairs and for limited domains.",
                    "sid": 286,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, even the large parallel corpora are relatively smaller than comparable corpora.",
                    "sid": 287,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second is a method that exploits the Web.",
                    "sid": 288,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lu et al.",
                    "sid": 289,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) extracted translation pairs by mining web anchor texts and link structures.",
                    "sid": 290,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an alternative, mixed-language web pages are exploited by first retrieving texts including both source and target languages from the web by using a search engine or simple rules, and then extracting translation pairs from the mixed-language texts utilizing various clues: Zhang and Vines (2004) used co- occurrence statistics, Cheng et al.",
                    "sid": 291,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) used co- occurrences and context similarity information, and Huang et al.",
                    "sid": 292,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2005) used phonetic, semantic and frequency-distance features.",
                    "sid": 293,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lin et al.",
                    "sid": 294,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) proposed a method for extracting parenthetically translated terms, where a word alignment algorithm is used for establishing the correspondences between in-parenthesis and pre-parenthesis words.",
                    "sid": 295,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, those methods cannot find translation pairs when they are not connected with each other through link structures, or when they do not co-occur in the same text.",
                    "sid": 296,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Transliteration is a completely different way for bilingual lexicon acquisition, in which a word in one language is converted into another language using phonetic equivalence (Knight and Graehl, 1998; Karimi et al., 2011).",
                    "sid": 297,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although machine transliteration works particularly well for proper names and loan words, it cannot be employed for phonetically dissimilar translations.",
                    "sid": 298,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the methods mentioned above may potentially extract translation pairs more precisely than our comparable corpora approach when their underlying assumptions are satisfied.",
                    "sid": 299,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We might improve the performance of our method by augmenting a seed lexicon with translation pairs extracted using the above methods, as experimented with in Section 4, in which additional lexical entries are included from parallel data.",
                    "sid": 300,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "7",
            "sents": [
                {
                    "text": "We proposed a novel bilingual lexicon extraction method using label propagation for alleviating the limited seed lexicon size problem.",
                    "sid": 301,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed method captures relations with all the seeds including indirect relations by propagating seed information.",
                    "sid": 302,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, we proposed using similarity graphs in propagation process in addition to co- occurrence graphs.",
                    "sid": 303,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our experiments showed that the proposed method outperforms conventional context- similarity-based methods (Rapp, 1999; Andrade et al., 2010), and the similarity graphs improve the performance by clustering synonyms into the same translation.",
                    "sid": 304,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are planning to investigate the following open problems in future work: word sense disambiguation and translation of compound words as described in (Daille and Morin, 2005; Morin et al., 2007).",
                    "sid": 305,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, indirect relations have also been used in other tasks, such as paraphrase acquisition from bilingual parallel corpora (Kok and Brockett, 2010).",
                    "sid": 306,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will utilize their random walk approach or other graph-based techniques such as modified adsorption (Talukdar and Crammer, 2009) for generating seed distributions.",
                    "sid": 307,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are also planning an end-to- end evaluation, for instance, by employing the extracted bilingual lexicon into an MT system.",
                    "sid": 308,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "We thank anonymous reviewers of EMNLPCoNLL 2012 for helpful suggestions and comments on a first version of this paper.",
                    "sid": 309,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also thank anonymous reviewers of First Workshop on Multilingual Modeling (MM2012) for useful comments on this work.",
                    "sid": 310,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}