{
    "ID": "D12-1125",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We present an automatic method for mapping language-specific part-of-speech tags to a set of universal tags.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This unified representation plays a crucial role in cross-lingual syntactic transfer of multilingual dependency parsers.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Until now, however, such conversion schemes have been created manually.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our central hypothesis is that a valid mapping yields POS annotations with coherent linguistic properties which are consistent across source and target languages.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We encode this intuition in an objective function that captures a range of distributional and typological characteristics of the derived mapping.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the exponential size of the mapping space, we propose a novel method for optimizing over soft mappings, and use entropy regularization to drive those towards hard mappings.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our results demonstrate that automatically induced mappings rival the quality of their manually designed counterparts when evaluated in the context of multilingual parsing.1",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "In this paper, we explore an automatic method for mapping language-specific part-of-speech tags to a universal tagset.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In multilingual parsing, this unified input representation is required for cross-lingual syntactic transfer.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, the universal tagset annotations enable an unlexicalized parser to capitalize on annotations from one language when learning a model for another.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 The source code and data for the work presented in this paper is available at http://groups.csail.mit.edu/ rbg/code/unitag/emnlp2012 While the notion of a universal POS tagset is widely accepted, in practice it is hardly ever used for annotation of monolingual resources.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, available POS annotations are designed to capture language-specific idiosyncrasies and therefore are substantially more detailed than a coarse universal tagset.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To reconcile these cross-lingual annotation differences, a number of mapping schemes have been proposed in the parsing community (Zeman and Resnik, 2008; Petrov et al., 2011; Naseem et al., 2010).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all of these cases, the conversion is performed manually and has to be repeated for each language and annotation scheme anew.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Despite the apparent simplicity, deriving a mapping is by no means easy, even for humans.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, the universal tagsets manually induced by Petrov et al.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011) and by Naseem et al.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) disagree on 10% of the tags.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of such discrepancy is the mapping of the Japanese tag “PVfin” to the universal tag “particle” according to one scheme, and to “verb” according to another.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, the quality of this conversion has a direct implication on the parsing performance.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the Japanese example above, this difference in mapping yields a 6.7% difference in parsing accuracy.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The goal of our work is to induce the mapping for a new language, utilizing existing manually- constructed mappings as training data.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The existing mappings developed in the parsing community rely on gold POS tags for the target language.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A more realistic scenario is to employ the mapping technique to resource-poor languages where gold POS annotations are lacking.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In such cases, a mapping algorithm has to operate over automatically in 1368 Proceedings of the 2012 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning, pages 1368–1378, Jeju Island, Korea, 12–14 July 2012.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2012 Association for Computational Linguistics duced clusters on the target language (e.g., using the Brown algorithm) and convert them to universal tags.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are interested in a mapping approach that can effectively handle both gold tags and induced clusters.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our central hypothesis is that a valid mapping yields POS annotations with coherent linguistic properties which are consistent across languages.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since universal tags play the same linguistic role in source and target languages, we expect similarity in their global distributional statistics.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1a shows statistics for two close languages, English and German.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can see that their unigram frequencies on the five most common tags are very close.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other properties concern POS tag per sentence statistics – e.g., every sentence has to have at least one verb.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the mappings can be further constrained by typological properties of the target language that specify likely tag sequences.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This information is readily available even for resource poor language (Haspel- math et al., 2005).",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, since English and German are prepositional languages, we expect to observe adposition-noun sequences but not the reverse (see Figure 1b for sample sentences).",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We encode these heterogeneous properties into an objective function that guides the search for the optimal mapping.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Having defined a quality measure for mappings, our goal is to find the optimal mapping.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, such partition optimization problems2 are NP hard (Garey and Johnson, 1979).",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A naive approach to the problem is to greedily improve the map, but it turns out that this approach yields poor quality mappings.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We therefore develop a method for optimizing over soft mappings, and use entropy regularization to drive those towards hard mappings.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We construct the objective in a way that facilitates simple monotonically improving updates corresponding to solving convex optimization problems.",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluate our mapping approach on 19 languages that include representatives of IndoEuropean, Semitic, Basque, Japonic and Turkic families.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We measure mapping quality based on the target language parsing accuracy.",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to considering gold POS tags for the target language, 2 Instances of related hard problems are 3-partition and subset-sum.",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "we also evaluate the mapping algorithm on automatically induced POS tags.",
                    "sid": 45,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all evaluation scenarios, our model consistently rivals the quality of manually induced mappings.",
                    "sid": 46,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also demonstrate that the proposed inference procedure outperforms greedy methods by a large margin, highlighting the importance of good optimization techniques.",
                    "sid": 47,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We further show that while all characteristics of the mapping contribute to the objective, our largest gain comes from distributional features that capture global statistics.",
                    "sid": 48,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we establish that the mapping quality has a significant impact on the accuracy of syntactic transfer, which motivates further study of this topic.",
                    "sid": 49,
                    "ssid": 49,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Multilingual Parsing Early approaches for multilingual parsing used parallel data to bridge the gap between languages when modeling syntactic transfer.",
                    "sid": 50,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this setup, finding the mapping between various POS annotation schemes was not essential; instead, the transfer algorithm could induce it directly from the parallel data (Hwa et al., 2005; Xi and Hwa, 2005; Burkett and Klein, 2008).",
                    "sid": 51,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, more recent transfer approaches relinquish this data requirement, learning to transfer from non-parallel data (Zeman and Resnik, 2008; McDonald et al., 2011; Cohen et al., 2011; Naseem et al., 2010).",
                    "sid": 52,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These approaches assume access to a common input representation in the form of universal tags, which enables the model to connect patterns observed in the source language to their counterparts in the target language.",
                    "sid": 53,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Despite ongoing efforts to standardize POS tags across languages (e.g., EAGLES initiative (Eynde, 2004)), many corpora are still annotated with language-specific tags.",
                    "sid": 54,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In previous work, their mapping to universal tags was performed manually.",
                    "sid": 55,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yet, even though some of these mappings have been developed for the same CoNLL dataset (Buchholz and Marsi, 2006; Nivre et al., 2007), they are not identical and yield different parsing performance (Zeman and Resnik, 2008; Petrov et al., 2011; Naseem et al., 2010).",
                    "sid": 56,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The goal of our work is to automate this process and construct mappings that are optimized for performance on downstream tasks (here we focus on parsing).",
                    "sid": 57,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As our results show, we achieve this goal 0.35 0.3 0.25 0.2 0.15 0.1 0.05 Inves tors [are appe aling ] to the Secu rities and Exch ange Com missi on not to [limit ] their acces s to infor mati on [abo ut stock purc hase s] and sales [by corp orate insid ers] -Einer der sich [für den Millia rdär] [auss pricht ] [ist] Steve Jobs dem Perot [für den aufba u] der Com puter ﬁrma Next 20 Millio nen Dollar [berei tstellt e] 0 Noun Verb Det. Prep.",
                    "sid": 58,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adj.",
                    "sid": 59,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(a) (b) Figure 1: Illustration of similarities in POS tag statistics across languages.",
                    "sid": 60,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(a) The unigram frequency statistics on five tags for two close languages, English and German.",
                    "sid": 61,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(b) Sample sentences in English and German.",
                    "sid": 62,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verbs are shown in blue, prepositions in red and noun phrases in green.",
                    "sid": 63,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be seen that noun phrases follow prepositions.",
                    "sid": 64,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "on a broad range of languages and evaluation scenarios.",
                    "sid": 65,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic Category Refinement Our work also relates to work in syntactic category refinement in which POS categories and parse tree non-terminals are refined in order to improve parsing performance (Finkel et al., 2007; Klein and Manning, 2003; Matsuzaki et al., 2005; Petrov et al., 2006; Petrov and Klein, 2007; Liang et al., 2007).",
                    "sid": 66,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work differs from these approaches in two ways.",
                    "sid": 67,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, these methods have been developed in the monolingual setting, while our mapping algorithm is designed for multilingual parsing.",
                    "sid": 68,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, these approaches are trained on the syntactic trees of the target language, which enables them to directly link the quality of newly induced categories with the quality of syntactic parsing.",
                    "sid": 69,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, we are not given trees in the target language.",
                    "sid": 70,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, our model is informed by mappings derived for other languages.",
                    "sid": 71,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "task formulation. ",
            "number": "3",
            "sents": [
                {
                    "text": "The input to our task consists of a target corpus written in a language T , and a set of non-parallel source corpora written in languages {S1, . . .",
                    "sid": 72,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", Sn}.",
                    "sid": 73,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the source corpora, each word is annotated with both a language-specific POS tag and a universal POS tag (Petrov et al., 2011).",
                    "sid": 74,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the target corpus each word is annotated only with a language-specific POS tag, either gold or automatically induced.",
                    "sid": 75,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our goal is to find a map from the set of LT target language tags to the set of K universal tags.",
                    "sid": 76,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We as sume that each language-specific tag is only mapped to one universal tag, which means we never split a language-specific tag and LT ≥ K holds for every language.",
                    "sid": 77,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We represent the map by a matrix A of size K × LT where A(c|f ) = 1 if the target lan guage tag f is mapped to the universal tag c, and A(c|f ) = 0 otherwise.3 Note that each column of A should contain a single value of 1.",
                    "sid": 78,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will later relax the requirement that A(c|f ) ∈ {0, 1}.",
                    "sid": 79,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A candi date mapping A can be applied to the target language to produce sentences labeled with universal tags.",
                    "sid": 80,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "model. ",
            "number": "4",
            "sents": [
                {
                    "text": "In this section we describe an objective that reflects the quality of an automatic mapping.",
                    "sid": 81,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our key insight is that for a good mapping, the statistics over the universal tags should be similar for source and target languages because these tags play the same role cross-linguistically.",
                    "sid": 82,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, we should expect the frequency of a particular universal tag to be similar in the source and target languages.",
                    "sid": 83,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One choice to make when constructing an objective is the source languages to which we want to be similar.",
                    "sid": 84,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is clear that choosing all languages is not a good idea, since they are not all expected to have distributional properties similar to the target language.",
                    "sid": 85,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is strong evidence that projecting from single languages can lead to good parsing performance 3 We use c and f to reflect the fact that universal tags are a coarse version (hence c) of the language specific fine tags (hence f ).",
                    "sid": 86,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(McDonald et al., 2011).",
                    "sid": 87,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, our strategy is to choose a single source language for comparison.",
                    "sid": 88,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The choice of the source language is based on similarity between typological properties; we describe this in detail in Section 5.",
                    "sid": 89,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We must also determine which statistical properties we expect to be preserved across languages.",
                    "sid": 90,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our model utilizes three linguistic phenomena which are consistent across languages: POS tag global distributional statistics, POS tag per sentence statistics, and typology-based ordering statistics.",
                    "sid": 91,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We define each of these below.",
                    "sid": 92,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Mapping Characterization.",
                    "sid": 93,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We focus on three categories of mapping properties.",
                    "sid": 94,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each of the relevant statistics we define a function Fi(A) that has low values if the source and target statistics are similar.",
                    "sid": 95,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Global distributional statistics: The unigram and bigram statistics of the universal tags are expected to be similar across languages with close typological profiles.",
                    "sid": 96,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use pS (c1, c2) to denote the bigram distribution over universal tags in the source language, and pT (f1, f2) to denote the bigram distribution over language specific tags in the target language.",
                    "sid": 97,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bigram distribution over universal tags in the target language depends on A and pT (f1, f2) and is given by: pT (c1, c2; A) = A(c1|f1)A(c2|f2)pT (f1, f2) f1 ,f2 (1) To enforce similarity between source and target distributions, we wish to minimize the KL divergence between the two: 4 Fbi(A) = DK L[pS (c1, c2)|pT (c1, c2; A)] (2) We similarly define Funi(A) as the distance be To express this constraint, we use nv (s, A) to denote the number of verbs (i.e., the universal tags corresponding to verbs according to A) in sentence s. This is a linear function of A. We also use E[nv (s, A)] to denote the average number of verbs per sentence, and V [nv (s, A)] to denote the variance.",
                    "sid": 98,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We estimate these two statistics from the source language and denote them by ESv , VSv . Good mappings are expected to follow these patterns by having a variance upper bounded by VSv and an average lower bounded by ESv .5 This corresponds to minimizing the following objectives: FEv (A) = max [0, ESv − E[nv (s, A)]] FV v (A) = max [0, V [nv (s, A)] − VSv ] Note that the above objectives are convex in A, which will make optimization simpler.",
                    "sid": 99,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We refer to the two terms jointly as Fverb(A).",
                    "sid": 100,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typology-based ordering statistics: Typological features can be useful for determining the relative order of different tags.",
                    "sid": 101,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we know that the target language has a particular typological feature, we expect its universal tags to obey the given relative ordering.",
                    "sid": 102,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, we expect it to agree with ordering statistics for source languages with a similar typology.",
                    "sid": 103,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We consider two such features here.",
                    "sid": 104,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, in preposition languages the preposition is followed by the noun phrase.",
                    "sid": 105,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, if T is such a language, we expect the probability of a noun phrase following the adposition to be high, i.e., cross some threshold.",
                    "sid": 106,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Formally, we define C1 = {noun, adj, num, pron, det} and consider the set of bigram distributions Spre that satisfy the following constraint: pT (adp,c) ≥ apre (3) c∈C1 tween unigram distributions.",
                    "sid": 107,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "where apre = c∈C1 pS (adp,c) is calculated from Per sentence statistics: Another defining property of POS tags is their average count per sentence.",
                    "sid": 108,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, we focus on the verb count per sentence, which we expect be similar across languages.",
                    "sid": 109,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 We use the KL divergence because it assigns low weights to infrequent universal tags.",
                    "sid": 110,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, this choice results in a simple, EM-like parameter estimation algorithm as discussed in Section 5.the source language.",
                    "sid": 111,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This constraint set is non convex in A due to the bilinearity of the bi- gram term.",
                    "sid": 112,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To simplify optimization6 we take an 5 The rationale is that we want to put a lower bound on the number of verbs per sentence, and induce it from the source language.",
                    "sid": 113,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we expect the number of verbs to be well concentrated, and we induce its maximal variance from the source language.",
                    "sid": 114,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 In Section 5 we shall see that this makes optimization eas-.",
                    "sid": 115,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ier.",
                    "sid": 116,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "approach inspired by the posterior regularization method (Ganchev et al., 2010) and use the objective: The overall objective is then: F (A) = Fα(A) + λ · H [A], where λ is the weight of the entropy term.7 The resulting optimization problem is: Fc(A) = min r(c1 ,c2 )∈Spre DK L[r(c1, c2)|pT (c1, c2; A)] (4) min F (A) (7) A∈∆ The above objective will attain lower values for A such that pT (c1, c2; A) is close to the constraint set.",
                    "sid": 117,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, it will have a value of zero when the where ∆ is the set of non-negative matrices whose columns sum to one: bigram distribution induced by A has the property specified in Spre.",
                    "sid": 118,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We similarly define a set Spost for post-positional languages.",
                    "sid": 119,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "∆ = A : A(c|f ) ≥ 0 ∀c, f c=1 A(c|f ) = 1 ∀f (8) As a second typological feature, we consider the Demonstrative-Noun ordering.",
                    "sid": 120,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In DN languages we want the probability of a determiner to come be fore C2 = {noun, adj, num}, (i.e., frequent universalnoun-phrase tags), to cross a threshold.",
                    "sid": 121,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This con straint translates to: pT (det, c) ≥ adet (5) c∈C2 where adet = c∈C2 pS (det, c) is a threshold determined from the source language.",
                    "sid": 122,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We denote the set of distributions that have this property by SDN, and add them to the constraint in (4).",
                    "sid": 123,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall constraint set is denoted by S. 4.2 The Overall Objective.",
                    "sid": 124,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have defined a set of functions Fi(A) that are expected to have low values for good mappings.",
                    "sid": 125,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To combine those, we use a weighted sum: Fα(A) = i αi · Fi(A).",
                    "sid": 126,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(The weights in this equation are learned; we discussed the procedure in Section 5) Optimizing over the set of mappings is difficult since each mapping is a discrete set whose size is exponential size in LT . Technically, the difficulty comes from the requirement that elements of A are integral and its columns sum to one.",
                    "sid": 127,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To relax this",
                    "sid": 128,
                    "ssid": 48,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "parameter estimation. ",
            "number": "5",
            "sents": [
                {
                    "text": "In this section we describe the parameter estimation process for our model.",
                    "sid": 129,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We start by describing how to optimize A. Next, we discuss the weight selection algorithm, and finally the method for choosing source languages.",
                    "sid": 130,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Optimizing the Mapping A. Recall that our goal is to solve the optimization problem in Eq.",
                    "sid": 131,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(7).",
                    "sid": 132,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This objective is non convex since the function H [A] is concave, and the objective F (A) involves bilinear terms in A and logarithms of their sums (see Equations (1) and (2)).",
                    "sid": 133,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While we do not attempt to solve the problem globally, we do have a simple update scheme that monotonically decreases the objective.",
                    "sid": 134,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The update can be derived in a similar manner to expectation maximization (EM) (Neal and Hinton, 1999) and convex concave procedures (Yuille and Rangarajan, 2003).",
                    "sid": 135,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 describes our optimization algorithm.",
                    "sid": 136,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The key ideas in deriving it are using posterior distributions as in EM, and using a variational formulation of entropy.",
                    "sid": 137,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The term Fc(A) is handled in a similar way to the posterior regularization algorithm derivation.",
                    "sid": 138,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A detailed derivation is provided 8restriction, we will allow A(c|f ) ∈ [0, 1] and en courage A to correspond to a mapping by adding an entropy regularization term: in the supplementary file.",
                    "sid": 139,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The kth iteration of the algorithm involves several steps: H [A] = − f c A(c|f ) log A(c|f ) (6) • In step 1, we calculate the current estimate of the bigram distribution over tags, pT (c1, c2; Ak ).This term receives its minimal value when the con ditional probability of the universal tags given a language-specific tag is 1 for one universal tag and zero for the others.",
                    "sid": 140,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 Note that as λ → ∞, only valid maps will be selected by the objective.",
                    "sid": 141,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 The supplementary file is available at http://groups.",
                    "sid": 142,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "csail.mit.edu/rbg/code/unitag/emnlp2012.",
                    "sid": 143,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• In step 2, we find the bigram distribution in the constraint set S that is closest in K L di vergence to pT (c1, c2; Ak ), and denote it byrk (c1, c2).",
                    "sid": 144,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This optimization problem is con vex in r(c1, c2).",
                    "sid": 145,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initialize A0 . Repeat Step 1 (calculate current bigram estimate): pT (c1 , c2 ; Ak ) = ) Ak (c1 |f1 )Ak (c2 |f2 )pT (f1 , f2 ) f ,f 1 2 • In step 3, we calculate the bigram posteriorover language specific tags given a pair of uni versal tags.",
                    "sid": 146,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is analogous to the standard E-step in EM.",
                    "sid": 147,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• In step 4, we use the posterior in step 3 and the bigram distributions pS (c1, c2) and rk (c1, c2) to obtain joint counts over language specific and universal bigrams.",
                    "sid": 148,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• In step 5, we use the joint counts from step 4 to obtain counts over pairs of language specific Step 2 (incorporate constraints): rk (c1 , c2 ) = arg min DKL [r(c1 , c2 )|pT (c1 , c2 ; Ak )] r∈S Step 3 (calculate model posterior): p(f1 , f2 |c1 , c2 ; Ak ) ∝ Ak (c1 |f1 )Ak (c2 |f2 )pT (f1 , f2 ) Step 4: (complete joint counts): N k (c1 , c2 , f1 , f2 ) = p(f1 , f2 |c1 , c2 ; Ak ) rk (c1 , c2 ) + pS (c1 , c2 )\\ Step 5 (obtain pairwise): M k (c, f ) = N k k and universal tags.",
                    "sid": 149,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "where N k (c, f ) = 2:, c2 ,f2 1 (c, f ) + N2 (c, f ) N k (c, c2 , f, f2 ) and similarly for • In step 6, analogous to the M-step in EM, weoptimize over the mapping matrix A. The ob N k (c, f ).",
                    "sid": 150,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 6 (M step with entropy linearization): Set Ak+1 to be the solution of jective is similar to the Q function in EM, and also includes the Fverb(A) term, and a linear upper bound on the entropy term.",
                    "sid": 151,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The objec min − A∈∆ c,f M k (c, f ) log A(c|f ) + A(c|f ) log Ak (c|f )1 + Fverb (A) tive can be seen to be convex in A. As mentioned above, each of the optimization problems in steps 2 and 6 is convex, and can therefore be solved using standard convex optimization solvers.",
                    "sid": 152,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we use the CVX package (Grant and Boyd, 2008; Grant and Boyd, 2011).",
                    "sid": 153,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be shown that the algorithm improves F (A) at every iteration and converges to a local optimum.",
                    "sid": 154,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The above algorithm generates a mapping A that may contain fractional entries.",
                    "sid": 155,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To turn it into a hard mapping we round A by mapping each f to the cthat maximizes A(c|f ) and then perform greedy im provement steps (one f at a time) to further improve the objective.",
                    "sid": 156,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The regularization constant λ is tuned to minimize the Fα(A) value of the rounded A. 5.2 Learning the Objective Weights.",
                    "sid": 157,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our Fα(A) objective is a weighted sum of the individual Fi(A) functions.",
                    "sid": 158,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following, we describe how to learn the αi weights for every target language.",
                    "sid": 159,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would like Fα(A) to have low values when A is a good map.",
                    "sid": 160,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since our performance goal is parsing accuracy, we consider a map to be good Until Convergence of Ak Figure 2: An iterative algorithm for minimizing our objective in Eq.",
                    "sid": 161,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(7).",
                    "sid": 162,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For simplicity we assume that all the weights αi and λ are equal to one.",
                    "sid": 163,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be shown that the objective monotonically decreases in every iteration.",
                    "sid": 164,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "if it results in high parsing accuracy, as measured when projecting a parser from to S to T . Since we do not have annotated parses in T , we use the other source languages S = {S1, . . .",
                    "sid": 165,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", Sn} to learn the weight.",
                    "sid": 166,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each Si as the target, we first train a parser for each language in S \\ {Si} as if it was the source, using the map of Petrov et al.",
                    "sid": 167,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011), and choose S∗ ∈ S \\ {Si} which gives the highest parsing accuracy on Si.",
                    "sid": 168,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next we generate 7000 candidate mappings for Si by randomly perturbing the map of (Petrov et al., 2011).",
                    "sid": 169,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluate the quality of each candidate A by projecting theparser of S∗ to Si, and recording the parsing accu racy.",
                    "sid": 170,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among all the candidates we choose the highest accuracy one and denote it by A∗(Si).",
                    "sid": 171,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now want the score F (A∗(Si)) to be lower than that of all other candidates.",
                    "sid": 172,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To achieve this, we train a rankingSVM whose inputs are pairs of maps A∗(Si) and an other worse A(Si).",
                    "sid": 173,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These map pairs are taken from many different traget languages, i.e. many different Si.",
                    "sid": 174,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features given to the SVM are the terms of the score Fi(A).",
                    "sid": 175,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The goal of the SVM is to weight these terms such that the better map A∗(Si) has a lower score.",
                    "sid": 176,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The weights assigned by the SVM are taken as αi. 5.3 Source Language Selection.",
                    "sid": 177,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As noted in Section 4 we construct F (A) by choosing a single source language S. Here we describe the method for choosing S. Our goal is to choose S that is closest to T in terms of typology.",
                    "sid": 178,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Assume that languages are described by binary typological vectors vL.",
                    "sid": 179,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would like to learn a diagonal matrix D such that d(S, T ; D) = (vS − vT )T D(vS − vT ) reflects the similarity between the languages.",
                    "sid": 180,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our context, a good measure of similarity is the performance of a parser trained on S and projected on T (using the optimal map A).",
                    "sid": 181,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thus seek a matrix D such that d(S, T ; D) is ranked according to the parsing accuracy.",
                    "sid": 182,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The matrix D is trained using an SVM ranking algorithm that tries to follow the ranking of parsing accuracy.",
                    "sid": 183,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar to the technique for learning the objective weights, we train across many pairs of source languages.9 The typological features we use are a subset of the features described in “The World Atlas of Languages Structure” (WALS, (Haspelmath et al., 2005)), and are shown in Table 1.",
                    "sid": 184,
                    "ssid": 56,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "evaluation set-up. ",
            "number": "6",
            "sents": [
                {
                    "text": "Datasets We test our model on 19 languages: Arabic, Basque, Bulgarian, Catalan, Chinese, Czech, Danish, Dutch, English, German, Greek, Hungarian, Italian, Japanese, Portuguese, Slovene, Spanish, Swedish, and Turkish.",
                    "sid": 185,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our data is taken from the CoNLL 2006 and 2007 shared tasks (Buchholz and Marsi, 2006; Nivre et al., 2007).",
                    "sid": 186,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CoNLL datasets consist of manually created dependency trees and language-specific POS tags.",
                    "sid": 187,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following Petrov et al.",
                    "sid": 188,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011), our model maps these language-specific tags to a set of 12 universal tags: noun, verb, adjective, adverb, pronoun, determiner, adposition, numeral, conjunction, particle, punctuation mark and X (a general tag).",
                    "sid": 189,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 Ties are broken using the F (A) objective..",
                    "sid": 190,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation Procedure We perform a separate experiment for each of the 19 languages as the target and a source language chosen from the rest (using the method from Section 5.3).",
                    "sid": 191,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the selected source language, we assume access to the mapping of Petrov et al.",
                    "sid": 192,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011).",
                    "sid": 193,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation Measures We evaluate the quality of the derived mapping in the context of the target language parsing accuracy.",
                    "sid": 194,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In both the training and test data, the language-specific tags are replaced with universal tags: Petrov’s tags for the source languages and learned tags for the target language.",
                    "sid": 195,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We train two non-lexicalized parsers using source annotations and apply them to the target language.",
                    "sid": 196,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first parser is a non-lexicalized version of the MST parser (McDonald et al., 2005) successfully used in the multilingual context (McDonald et al., 2011).",
                    "sid": 197,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second parser, parameters of the target language are estimated as a weighted mixture of parameters learned from supervised source languages (Cohen et al., 2011).",
                    "sid": 198,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the parser of Cohen et al.",
                    "sid": 199,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011), we trained the model on the four languages used in the original paper — English, German, Czech and Italian.",
                    "sid": 200,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When measuring the performance on each of these four languages, we selected another set of four languages with a similar level of diversity.10 Following the standard evaluation practice in parsing, we use directed dependency accuracy as our measure of performance.",
                    "sid": 201,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Baselines We compare mappings induced by our model against three baselines: the manually constructed mapping of Petrov et al.",
                    "sid": 202,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011), a randomly constructed mapping and a greedy mapping.",
                    "sid": 203,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The greedy mapping uses the same objective as our full model, but optimizes it using a greedy method.",
                    "sid": 204,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In each iteration, this method makes |LT | passes over the language-specific tags, selecting a substitution that contributes the most to the objective.",
                    "sid": 205,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initialization To reduce the dimension of our algorithm’s search space and speed up our method, we start by clustering the language-specific POS tags ofthe target into |K | = 12 clusters using an unsuper 10 We also experimented with a version of the Cohen et al.",
                    "sid": 206,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011) model trained on all the source languages.",
                    "sid": 207,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This setup resulted in decreased performance.",
                    "sid": 208,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this reason, we chose to train the model on the four languages.",
                    "sid": 209,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ID Fea ture De scri pti on Val ue s 81 A 85 A 86 A 87 A 88 A Ord er of Sub ject , Obj ect and Ver b O r d e r o f A d p o s i t i o n a n d N o u n O r d e r o f G e n i t i v e a n d N o u n O r d e r o f A d j e c t i v e a n d N o u n Ord er of De mo nstr ativ e and No un SV O, SO V, VS O, VO S, OV S, OS V P o s t p o s i t i o n s , P r e p o s i t i o n s , I n p o s i t i o n s G e n i t i v e N o u n , N o u n G e n i t i v e A d j e c t i v e N o u n , N o u n A d j e c t i v e De mo nstr ative No un, Noun De mo nstr ativ e, bef ore and aft er Table 1: The set of typological features that we use for source language selection.",
                    "sid": 210,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first column gives the ID of the feature as listed in WALS.",
                    "sid": 211,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second column describes the feature and the last column enumerates the allowable values for each feature; besides these values each feature can also have a value of ‘No dominant order’.",
                    "sid": 212,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "vised POS induction algorithm (Lee et al., 2010).11 Our mapping algorithm then learns the connection between these clusters and universal tags.",
                    "sid": 213,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For initialization, we perform multiple random restarts and select the one with the lowest final objective score.",
                    "sid": 214,
                    "ssid": 30,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results. ",
            "number": "7",
            "sents": [
                {
                    "text": "We first present the results of our model using the gold POS tags for the target language.",
                    "sid": 215,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 summarizes the performance of our model and the baselines.",
                    "sid": 216,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparison against Baselines On average, the mapping produced by our model yields parsers with higher accuracy than all of the baselines.",
                    "sid": 217,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results are consistent for both parsers (McDonald et al., 2011; Cohen et al., 2011).",
                    "sid": 218,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As expected, random mappings yield abysmal results — 20.2% and 12.7% for the two parsers.",
                    "sid": 219,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The low accuracy of parsers that rely on the Greedy mapping — 29.9% and 25.4% — show that a greedy approach is a poor strategy for mapping optimization.",
                    "sid": 220,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Surprisingly, our model slightly outperforms the mapping of (Petrov et al., 2011), yielding an average accuracy of 56.7% as compared to the 55.4% achieved by its manually constructed counterpart for the direct transfer method (McDonald et al., 2011).",
                    "sid": 221,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar results are observed for the mixture weights parser (Cohen et al., 2011).",
                    "sid": 222,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main reason for these differences comes from mistakes introduced in the manual mapping.",
                    "sid": 223,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in Czech tag “R” is labeled as “pronoun”, while actually it should be mapped to “adposition”.",
                    "sid": 224,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By correcting this mistake, we gain 5% in parsing accuracy for the direct transfer parser.",
                    "sid": 225,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "11 This pre-clustering results in about 3% improvement, presumably since it uses contextual information beyond what our algorithm does.",
                    "sid": 226,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall, the manually constructed mapping and our model’s output disagree on 21% of the assignments (measured on the token level).",
                    "sid": 227,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the extent of disagreement is not necessarily predictive of the difference in parsing performance.",
                    "sid": 228,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the manual and automatic mappings for Catalan disagree on 8% of the tags and their parsing accuracy differs by 5%.",
                    "sid": 229,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Greek on the other hand, the disagreement between mappings is much higher — 17%, yet the parsing accuracy is very close.",
                    "sid": 230,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This phenomenon shows that not all mistakes have equal weight.",
                    "sid": 231,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, a confusion between “pronoun” and “noun” is less severe in the parsing context than a confusion between “pronoun” and “adverb”.",
                    "sid": 232,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Impact of Language Selection To assess the quality of our language selection method, we compare the model against an oracle that selects the best source for a given target language.",
                    "sid": 233,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As Table 2 shows our method is very close to the oracle performance, with only 0.7% gap between the two.",
                    "sid": 234,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, for 10 languages our method correctly predicts the best pairing.",
                    "sid": 235,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result is encouraging in other contexts as well.",
                    "sid": 236,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, McDonald et al.",
                    "sid": 237,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011) have demonstrated that projecting from a single oracle- chosen language can lead to good parsing performance, and our technique may allow such projection without an oracle.",
                    "sid": 238,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Relations between Objective Values and Optimization Performance The suboptimal performance of the Greedy method shows that choosing a good optimization strategy plays a critical role in finding the desired mapping.",
                    "sid": 239,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A natural question to ask is whether the objective value is predictive of the end goal parsing performance.",
                    "sid": 240,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 shows the objective values for the mappings computed by our method and the baselines for four languages.",
                    "sid": 241,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Over D i r e c t T r a n s f e r P a r s e r ( A c c u r a c y ) M i x t u r e W e i g h t P a r s e r ( A c c u r a c y ) Ta g Dif f. Ra nd om Greedy Petrov Model Best Pair Ra nd om Greedy Petrov Model.",
                    "sid": 242,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "C at al a n It al ia n P or tu g u es e S p a ni s h 1 5 . 9 32.5 74.8 79.3 79.3 1 2 . 6 24.6 65.6 73.9 8 . 8 1 6 . 4 41.0 68.7 68.3 71.4 1 1 . 7 33.5 64.2 61.9 6 . 7 1 5 . 1 0 . 7 14.1 70.4 72.6 1 2 . 2 1 1 . 5 27.4 72.1 68.9 68.9 6 . 4 26.5 58.8 62.8 7 . 5 Da nis h D u t c h E n g l i s h G e r m a n S w e d i s h 3 5 . 5 23.7 46.6 46.5 49.2 4 . 2 23.7 51.4 51.7 5 . 0 1 8 . 0 22.1 58.2 56.8 57.3 7 . 1 15.3 54.9 53.2 4 . 9 1 4 . 7 19.0 51.6 49.0 49.0 1 3 . 3 15.1 47.5 41.8 1 7 . 7 1 5 . 2 0 . 9 18.7 52.4 51.8 1 5 . 0 1 5 . 1 26.3 63.1 63.1 63.1 9 . 1 36.5 55.7 55.9 8 . 2 Bu lga ria n Cz ec h Slo ven e 1 7 . 4 28.0 51.6 63.4 63.4 2 2 . 6 39.9 64.6 60.4 3 5 . 7 1 9 . 0 34.4 47.7 57.3 57.3 1 2 . 7 26.2 48.3 55.7 2 8 . 5 1 5 . 6 21.8 43.5 51.4 52.8 1 1 . 3 20.7 42.2 53.0 3 8 . 8 Gr ee k 1 7 . 3 19.5 62.3 59.7 59.8 2 2 . 0 15.2 56.2 57.0 1 7 . 0 Hu ng ari an 2 8 . 4 44.1 53.8 52.3 52.3 4 . 0 43.8 46.4 51.7 1 8 . 1 Ar abi c 2 2 . 1 45.4 51.5 51.2 52.9 3 . 9 40.9 48.3 51.1 1 5 . 7 Ba sq ue 1 8 . 0 19.2 27.9 33.1 35.1 6 . 3 8.3 32.3 30.6 4 3 . 8 Ch ine se 2 2 . 4 34.1 46.0 47.6 49.5 1 7 . 7 34.9 44.0 40.4 3 8 . 1 Jap ane se 3 6 . 5 46.2 51.4 53.6 53.6 1 5 . 4 18.0 25.7 28.7 7 3 . 8 Tu rki sh 2 8 . 1 9 . 7 20.3 27.7 27.5 9 . 9 Av er ag e 2 0 . 2 29.9 55.4 56.7 57.4 1 2 . 7 25.4 50.8 51.7 2 1 . 3 Table 2: Directed dependency accuracy of our model and the baselines using gold POS tags for the target language.",
                    "sid": 243,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first section of the table is for the direct transfer of the MST parser (McDonald et al., 2011).",
                    "sid": 244,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second section is for the weighted mixture parsing model (Cohen et al., 2011).",
                    "sid": 245,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first two columns (Random and Greedy) of each section present the parsing performance with a random or a greedy mapping.",
                    "sid": 246,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third column (Petrov) shows the results when the mapping of Petrov et al.",
                    "sid": 247,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011) is used.",
                    "sid": 248,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fourth column (Model) shows the results when our mapping is used and the fifth column in the first section (Best Pair) shows the performance of our model when the best source language is selected for every target language.",
                    "sid": 249,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last column (Tag Diff.)",
                    "sid": 250,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "presents the difference between our mapping and the mapping of Petrov et al.",
                    "sid": 251,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011) by showing the percentage of target language tokens for which the two mappings select a different universal tag.",
                    "sid": 252,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "all, our method and the manual mappings reach similar values, both considerably better than other baselines.",
                    "sid": 253,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the parsing performance correlates with the objective, the correlation is not perfect.",
                    "sid": 254,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, on Greek our mapping has a better objective value, but lower parsing performance.",
                    "sid": 255,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ablation Analysis We next analyze the contribution of each component of our objective to the resulting performance.12 The strongest factor in our objective is the distributional features capturing global statistics.",
                    "sid": 256,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using these features alone achieves an average accuracy of 51.1%, only 5.6% less than the full model score.",
                    "sid": 257,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adding just the verb-related constraints to the distributional similarity objectives improves the average model performance by 2.1%.",
                    "sid": 258,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adding just the typological constraints yields a very modest performance gain of 0.5%.",
                    "sid": 259,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not surprising — the source language is selected to be typo- logically similar to the target language, and thus its distributional properties are consistent with typological features.",
                    "sid": 260,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, adding both the verb-related constraints and the typological constraints results in a synergistic performance gain of 5.6% over the dis- tributional similarity objective, a gain which is much better than the sum of the two individual gains.",
                    "sid": 261,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Application to Automatically Induced POS Tags A potential benefit of the proposed method is to relate automatically induced clusters in the target language to universal tags.",
                    "sid": 262,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, we induce such clusters using Brown clustering,13 which 12 The results are consistent for both parsers, here we report the accuracy for the direct transfer method (McDonald et al., 13 In our experiments, we employ Liang’s implementation http://cs.stanford.edu/∼pliang/software/.",
                    "sid": 263,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of clus 1.8 1.6 1.4 1.2 1 0.8 0.6 0.4 0.2 0 M o d e l P e t r o v G r e e d y R a n d o m Catalan German Greek Arabic b a s e l i n e b y a b o u t 5 % . 8 C o n c l u s i o n s We prese nt an autom atic metho d for mappi ng language specific part-of speech tags to a set of universal tags.",
                    "sid": 264,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work capitali zes on manua lly designed conver sion schem es to autom atically create mappi ngs for new langua ges.",
                    "sid": 265,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our experi mental results demon strate that autom atically induce d mappings rival the qualit y of their hand crafted counterpart s. We also establi sh that the mappi ng qualit y Figure 3: Objective values for the different mappings used in our experiments for four languages.",
                    "sid": 266,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the goal of the optimization procedure is to minimize the objective value.",
                    "sid": 267,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "has been successfully used for similar purposes in parsing research (Koo et al., 2008).",
                    "sid": 268,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then map these clusters to the universal tags using our algorithm.",
                    "sid": 269,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The average parsing accuracy on the 19 languages is 45.5%.",
                    "sid": 270,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Not surprisingly, automatically induced tags negatively impact parsing performance, yielding a decrease of 11% when compared to mappings obtained using manual POS annotations (see Table 2).",
                    "sid": 271,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To further investigate the impact of inaccurate tags on the mapping performance, we compare our model against the oracle mapping model that maps each cluster to the most common universal tag of its members.",
                    "sid": 272,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parsing accuracy obtained using this method is 45.1%, closely matching the performance of our mapping algorithm.",
                    "sid": 273,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An alternative approach to mapping words into universal tags is to directly partition words into K clusters (without passing through language specific tags).",
                    "sid": 274,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order for these clusters to be meaningful as universal tags, we can provide several prototypes for each cluster (e.g., “walk” is a verb etc.).",
                    "sid": 275,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To test this approach we used the prototype driven tagger of Haghighi and Klein (2006) with 15 prototypes per universal tag.14 The resulting universal tags yield an average parsing accuracy of 40.5%.",
                    "sid": 276,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our method (using Brown clustering as above) outperforms this 14 Oracle prototypes were obtained by taking the 15 most frequent words for each universal tag.",
                    "sid": 277,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This yields almost the same total number of prototypes as those in the experiment of (Haghighi and Klein, 2006).",
                    "sid": 278,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "has a significant impact on the accuracy of syntactic transfer, which motivates further study of this topic.",
                    "sid": 279,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, our experiments show that the choice of mapping optimization scheme plays a crucial role in the quality of the derived mapping, highlighting the importance of optimization for the mapping task.",
                    "sid": 280,
                    "ssid": 66,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "The authors acknowledge the support of the NSF (IIS0835445), the MURI program (W911NF10-1 0533) and the DARPA BOLT program.",
                    "sid": 281,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thank Tommi Jaakkola, the members of the MIT NLP group and the ACL reviewers for their suggestions and comments.",
                    "sid": 282,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Any opinions, findings, conclusions, or recommendations expressed in this paper are those of the authors, and do not necessarily reflect the views of the funding organizations.",
                    "sid": 283,
                    "ssid": 69,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}