{
    "ID": "E06-2012",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We present a novel application of NLP and text mining to the analysis of financial documents.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, we describe an implemented prototype, Maytag, which combines information extraction and subject classification tools in an interactive exploratory framework.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present experimental results on their performance, as tailored to the financial domain, and some forward-looking extensions to the approach that enables users to specify classifications on the fly.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Our goal is to support the discovery of complex events in text.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By complex events, we mean events that might be structured out of multiple occurrences of other events, or that might occur over a span of time.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In financial analysis, the domain that concerns us here, an example of what we mean is the problem of understanding corporate acquisition practices.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To gauge a company’s modus operandi in acquiring other companies, it isn’t enough to know just that an acquisition occurred, but it may also be important to understand the degree to which it was debt-leveraged, or whether it was performed through reciprocal stock exchanges.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, complex events are often composed of multiple facets beyond the basic event itself.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of our concerns is therefore to enable end users to access complex events through a combination of their possible facets.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another key characteristic of rich domains like financial analysis, is that facts and events are subject to interpretation in context.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To a financial analyst, it makes a difference whether a multi-million-dollar loss occurs in the context of recurring operations (a potentially chronic problem), or in the context of a onetime event, such as a merger or layoff.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A second concern is thus to enable end users to interpret facts and events through automated context assessment.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The route we have taken towards this end is to model the domain of corporate finance through an interactive suite of language processing tools.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Maytag, our prototype, makes the following novel contribution.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rather than trying to model complex events monolithically, we provide a range of multipurpose information extraction and text classification methods, and allow the end user to combine these interactively.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Think of it as Boolean queries where the query terms are not keywords but extracted facts, events, entities, and contextual text classifications.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the maytag prototype. ",
            "number": "2",
            "sents": [
                {
                    "text": "Figure 1, below, shows the Maytag prototype in action.",
                    "sid": 17,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this instance, the user is browsing a particular document in the collection, the 2003 securities filings for 3M Corporation.",
                    "sid": 18,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The user has imposed a context of interpretation by selecting the “Legal matters” subject code, which causes the browser to only retrieve those portions of the document that were statistically identified as pertaining to law suits.",
                    "sid": 19,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The user has also selected retrieval based on extracted facts, in this case monetary expenses greater than $10 million.",
                    "sid": 20,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This in turn causes the browser to further restrict retrieval to those portions of the document that contain the appropriate linguistic expressions, e.g., “$73 million pre-tax charge.” As the figure shows, the granularity of these operations in our browser is that of the paragraph, which strikes a reasonable compromise between providing enough context to interpret retrieval results, but not too much.",
                    "sid": 21,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also ef Figure 1: The Maytag interface fective at enabling combination of query terms.",
                    "sid": 22,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whereas the original document contains 5161 paragraphs, the number of these that were tagged with the “Legal matters” code is 27, or .5 percent of the overall document.",
                    "sid": 23,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Likewise, the query for expenses greater than $10 million restricts the return set to 26 paragraphs (.5 percent).",
                    "sid": 24,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The conjunction of both queries yields a common intersection of only 4 paragraphs, thus precisely targeting .07 percent of the overall document.",
                    "sid": 25,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Under the hood, Maytag consists of both an online component and an off-line one.",
                    "sid": 26,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The online part is a web-based GUI that is connected to a relational database via CGI scripts (html, JavaScript, and Python).",
                    "sid": 27,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The off-line part of the system hosts the bulk of the linguistic and statistical processing that creates document meta-data: name tagging, relationship extraction, subject identification, and the like.",
                    "sid": 28,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These processes are applied to documents entering the text collection, and the results are stored as meta-data tables.",
                    "sid": 29,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tables link the results of the off-line processing to the paragraphs in which they were found, thereby supporting the kind of extraction- and classification-based retrieval shown in Figure 1.",
                    "sid": 30,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "extraction in maytag. ",
            "number": "3",
            "sents": [
                {
                    "text": "As is common practice, Maytag approaches extraction in stages.",
                    "sid": 31,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We begin with atomic named entities, and then detect structured entities, relationships, and events.",
                    "sid": 32,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To do so, we rely on both rule-based and statistical means.",
                    "sid": 33,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Named entities.",
                    "sid": 34,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Maytag, we currently extract named entities with a tried-but-true rule-based tagger based on the legacy Alembic system (Vilain, 1999).",
                    "sid": 35,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although we’ve also developed more modern statistical methods (Burger et al, 1999, Wellner & Vilain, 2006), we do not currently have adequate amounts of hand-marked financial data to train these systems.",
                    "sid": 36,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We therefore found it more convenient to adapt the Alembic name tagger by manual hill climbing.",
                    "sid": 37,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because this tagger was originally designed for a similar newswire task, we were able to make the port using relatively small amounts of training data.",
                    "sid": 38,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We relied on two 100+ page-long Securities filings (singly annotated), one for training, and the other for test, on which we achieve an accuracy of F=94.",
                    "sid": 39,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found several characteristics of our financial data to be especially challenging.",
                    "sid": 40,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first is the widespread presence of company name lookalikes, by which we mean phrases like “Health Care Markets” or “Business Services” that may look like company names, but in fact denote business segments or the like.",
                    "sid": 41,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To circumvent this, we had to explicitly model non-names, in effect creating a business segment tagger that captures company name lookalikes and prevents them from being tagged as companies.",
                    "sid": 42,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another challenging characteristic of these financial reports is their length, commonly reaching hundreds of pages.",
                    "sid": 43,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This poses a quandary for the way we handle discourse effects.",
                    "sid": 44,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As with most name taggers, we keep a “found names” list to compensate for the fact that a name may not be clearly identified throughout the entire span of the input text.",
                    "sid": 45,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This list allows the tagger to propagate a name from clear identifying contexts to non-identified occurrences elsewhere in the discourse.",
                    "sid": 46,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In newswire, this strategy boosts recall at very little cost to precision, but the sheer length of financial reports creates a disproportionate opportunity for found name lists to introduce precision errors, and then propagate them.",
                    "sid": 47,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Structured entities, relations, and events.",
                    "sid": 48,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another way in which financial writing differs from general news stories is the prevalence of what we’ve called structured entities, i.e., name- like entities that have key structural attributes.",
                    "sid": 49,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most common of these relate to money.",
                    "sid": 50,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In financial writing, one doesn’t simply talk of money: one talks of a loss, gain or expense, of the business purpose associated therewith, and of the time period in which it is incurred.",
                    "sid": 51,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider: Worldwide expenses for environmental compliance [were] $163 million in 2003.",
                    "sid": 52,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To capture such cases as this, we’ve defined a repertoire of structured entities.",
                    "sid": 53,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fine-grained distinctions about money are encoded as color of money entities, with such attributes as their color (in this case, an operating expense), time stamp, and so forth.",
                    "sid": 54,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also have structured entities for expressions of stock shares, assets, and debt.",
                    "sid": 55,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we’ve included a number of constructs that are more properly understood as relations (job title) or events (acquisitions).",
                    "sid": 56,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Statistical training.",
                    "sid": 57,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because we had no existing methods to address financial events or relations, we took this opportunity to develop a trainable approach.",
                    "sid": 58,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recent work has begun to address relation and event extraction through trainable means, chiefly SVM classification (Zelenko et al, 2003, Zhou et al, 2005).",
                    "sid": 59,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach we’ve used here is classifier-based as well, but relies on maximum entropy modeling instead.",
                    "sid": 60,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most trainable approaches to event extraction are entity-anchored: given a pair of relevant entities (e.g., a pair of companies), the object of the endeavor is to identify the relation that holds between them (e.g., acquisition or subsidiary).",
                    "sid": 61,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We turn this around: starting with the head of the relation, we try to find the entities that fill its constituent roles.",
                    "sid": 62,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is, unavoidably, a strongly lexicalized approach.",
                    "sid": 63,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To detect an event such as a merger or acquisition, we start from indicative head words, e.g., “acquire,” “purchases,” “acquisition,” and the like.",
                    "sid": 64,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The process proceeds in two stages.",
                    "sid": 65,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once we’ve scanned a text to find instances of our indicator heads, we classify the heads to determine whether their embedding sentence represents a valid instance of the target concept.",
                    "sid": 66,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of acquisitions, this filtering stage eliminates such non-acquisitions as the use of the word “purchases” in “the company purchases raw materials.” If a head passes this filter, we find the fillers of its constituent roles through a second classification stage The role stage uses a shallow parser to chunk the sentence, and considers the nominal chunks and named entities as candidate role fillers.",
                    "sid": 67,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For acquisition events, for example, these roles include the object of the acquisition, the buying agent, the bought assets, the date of acquisition, and so forth (a total of six roles).",
                    "sid": 68,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "E.g. In the fourth quarter of 2000 (WHEN), 3M [AGENT] also acquired the multi-layer integrated circuit packaging line [ASSETS] of W.L. Gore and Associates [OBJECT].",
                    "sid": 69,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The maximum entropy role classifier relies on a range of feature types: the semantic type of the phrase (for named entities), the phrase vocabulary, the distance to the target head, and local context (words and phrases).",
                    "sid": 70,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our initial evaluation of this approach has given us encouraging first results.",
                    "sid": 71,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on a hand-annotated corpus of acquisition events, we’ve measured filtering performance at F=79, and role assignment at F=84 for the critical case of the object role.",
                    "sid": 72,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A more recent round of experiments has produced considerably higher performance, which we will report on later this year.",
                    "sid": 73,
                    "ssid": 43,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "subject classification. ",
            "number": "4",
            "sents": [
                {
                    "text": "Financial events with similar descriptions can mean different things depending on where these events appear in a document or in what context they appear.",
                    "sid": 74,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We attempt to extract this important contextual information using text classification methods.",
                    "sid": 75,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also use text classification methods to help users to more quickly focus on an area where interesting transactions exist in an interactive environment.",
                    "sid": 76,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, we classify each paragraph in our document collection into one of several interested financial areas.",
                    "sid": 77,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples include: Accounting Rule Change, Acquisitions and Mergers, Debt, Derivatives, Legal, etc. 4.1 Experiments.",
                    "sid": 78,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, we picked 3 corporate annual reports as the training and test document set.",
                    "sid": 79,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paragraphs from these 3 documents, which are from 50 to 150 pages long, were annotated with the types of financial transactions they are most related to.",
                    "sid": 80,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paragraphs that did not fall into a category of interest were classified as “other”.",
                    "sid": 81,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The annotated paragraphs were divided into random 4x4 test/training splits for this test.",
                    "sid": 82,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The “other” category, due to its size, was sub- sampled to the size of the next-largest category.",
                    "sid": 83,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in the work of Nigam et al (2002) or Lodhi et al (2002), we performed a series of experiments using maximum entropy and support vector machines.",
                    "sid": 84,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides including the words that appeared in the paragraphs as features, we also experimented with adding named entity expressions (money, date, location, and organization), removal of stop words, and stemming.",
                    "sid": 85,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, each of these variations resulted in little difference compared with the baseline features consisting of only the words in the paragraphs.",
                    "sid": 86,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall results ranged from F-measures of 7075 for more frequent categories down to above 30 40 for categories appearing less frequently.",
                    "sid": 87,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Online Learning.",
                    "sid": 88,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have embedded our text classification method into an online learning framework that allows users to select text segments, specify categories for those segments and subsequently receive automatically classified paragraphs similar to those already identified.",
                    "sid": 89,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The highest confidence paragraphs, as determined by the classifier, are presented to the user for verification and possible re-classification.",
                    "sid": 90,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1, at the start of this paper, shows the way this is implemented in the Maytag interface.",
                    "sid": 91,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Checkboxes labeled pos and neg are provided next to each displayed paragraph: by selecting one or the other of these checkboxes, users indicate whether the paragraph is to be treated as a positive or a negative example of the category they are elaborating.",
                    "sid": 92,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our preliminary studies, we were able to achieve the peak performance (the highest F1 score) within the first 20 training examples using 4 different categories.",
                    "sid": 93,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discussion and future work. ",
            "number": "5",
            "sents": [
                {
                    "text": "The ability to combine a range of analytic processing tools, and the ability to explore their results interactively are the backbone of our approach.",
                    "sid": 94,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we’ve covered the frame work of our Maytag prototype, and have looked under its hood at our extraction and classification methods, especially as they apply to financial texts.",
                    "sid": 95,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Much new work is in the offing.Many experiments are in progress now to as sess performance on other text types (financial news), and to pin down performance on a wider range of events, relations, and structured entities.",
                    "sid": 96,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another question we would like to address is how best to manage the interaction between classification and extraction: a mutual feedback process may well exist here.",
                    "sid": 97,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are also concerned with supporting financial analysis across multiple documents.",
                    "sid": 98,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This has implications in the area of cross-document coreference, and is also leading us to investigate visual ways to define queries that go beyond the paragraph and span many texts over many years.",
                    "sid": 99,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we are hoping to conduct user studies to validate our fundamental assumption.",
                    "sid": 100,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, this work presupposes that interactive application of multipurpose classification and extraction techniques can model complex events as well as monolithic extraction tools à la MUC.",
                    "sid": 101,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "This research was performed under a MITRE Corporation sponsored research project.",
                    "sid": 102,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}