{
    "ID": "E12-1054",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We evaluate measures of contextual fitness on the task of detecting real-word spelling errors.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For that purpose, we extract naturally occurring errors and their contexts from the Wikipedia revision history.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that such natural errors are better suited for evaluation than the previously used artificially created errors.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, the precision of statistical methods has been largely overestimated, while the precision of knowledge-based approaches has been underestimated.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, we show that knowledge-based approaches can be improved by using semantic relatedness measures that make use of knowledge beyond classical taxonomic relations.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we show that statistical and knowledge- based methods can be combined for increased performance.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Measuring the contextual fitness of a term in its context is a key component in different NLP applications like speech recognition (Inkpen and De´silets, 2005), optical character recognition (Wick et al., 2007), co-reference resolution (Bean and Riloff, 2004), or malapropism detection (Bolshakov and Gelbukh, 2003).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main idea is always to test what fits better into the current context: the actual term or a possible replacement that is phonetically, structurally, or semantically similar.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are going to focus on malapropism detection as it allows evaluating measures of contextual fitness in a more direct way than evaluating in a complex application which always entails influence from other components, e.g. the quality of the optical character recognition module (Walker et al., 2010).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A malapropism or real-word spelling error occurs when a word is replaced with another correctly spelled word which does not suit the context, e.g. “People with lots of honey usually live in big houses.”, where ‘money’ was replaced with ‘honey’.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides typing mistakes, a major source of such errors is the failed attempt of automatic spelling correctors to correct a misspelled word (Hirst and Budanitsky, 2005).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A real-word spelling error is hard to detect, as the erroneous word is not misspelled and fits syntactically into the sentence.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, measures of contextual fitness are required to detect words that do not fit their contexts.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Existing measures of contextual fitness can be categorized into knowledge-based (Hirst and Budanitsky, 2005) and statistical methods (Mays et al., 1991; WilcoxOHearn et al., 2008).",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both test the lexical cohesion of a word with its context.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For that purpose, knowledge-based approaches employ the structural knowledge encoded in lexical-semantic networks like WordNet (Fellbaum, 1998), while statistical approaches rely on co-occurrence counts collected from large corpora, e.g. the Google Web1T corpus (Brants and Franz, 2006).",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So far, evaluation of contextual fitness measures relied on artificial datasets (Mays et al., 1991; Hirst and Budanitsky, 2005) which are created by taking a sentence that is known to be correct, and replacing a word with a similar word from the vocabulary.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This has a couple of disadvantages: (i) the replacement might be a synonym of the original word and perfectly valid in the given context, (ii) the generated error might 529 Proceedings of the 13th Conference of the European Chapter of the Association for Computational Linguistics, pages 529–538, Avignon, France, April 2327 2012.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2012 Association for Computational Linguistics be very unlikely to be made by a human, and (iii) inserting artificial errors often leads to unnatural sentences that are quite easy to correct, e.g. if the word class has changed.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, even if the word class is unchanged, the original word and its replacement might still be variants of the same lemma, e.g. a noun in singular and plural, or a verb in present and past form.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This usually leads to a sentence where the error can be easily detected using syntactical or statistical methods, but is almost impossible to detect for knowledge-based measures of contextual fitness, as the meaning of the word stays more or less unchanged.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To estimate the impact of this issue, we randomly sampled 1,000 artificially created real-word spelling errors1 and found 387 singular/plural pairs and 57 pairs which were in another direct relation (e.g. adjective/adverb).",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that almost half of the artificially created errors are not suited for an evaluation targeted at finding optimal measures of contextual fitness, as they overestimate the performance of statistical measures while underestimating the potential of semantic measures.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to investigate this issue, we present a framework for mining naturally occurring errors and their contexts from the Wikipedia revision history.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the resulting English and German datasets to evaluate statistical and knowledge-based measures.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We make the full experimental framework publicly available2 which will allow reproducing our experiments as well as conducting follow-up experiments.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The framework contains (i) methods to extract natural errors from Wikipedia, (ii) reference implementations of the knowledge-based and the statistical methods, and (iii) the evaluation datasets described in this paper.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "mining errors from wikipedia. ",
            "number": "2",
            "sents": [
                {
                    "text": "Measures of contextual fitness have previously been evaluated using artificially created datasets, as there are very few sources of sentences with naturally occurring errors and their corrections.",
                    "sid": 28,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently, the revision history of Wikipedia has been introduced as a valuable knowledge source for NLP (Nelken and Yamangil, 2008; Yatskar et al., 2010).",
                    "sid": 29,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also a possible source of natural errors, as it is likely that Wikipedia editors make real-word spelling errors at some point, which are then corrected in subsequent revisions of the same article.",
                    "sid": 30,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The challenge lies in discriminating real-word spelling errors from all sorts of other changes, including non-word spelling errors, re- formulations, or the correction of wrong facts.",
                    "sid": 31,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For that purpose, we apply a set of precision- oriented heuristics narrowing down the number of possible error candidates.",
                    "sid": 32,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such an approach is feasible, as the high number of revisions in Wikipedia allows to be extremely selective.",
                    "sid": 33,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Accessing the Revision Data.",
                    "sid": 34,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We access the Wikipedia revision data using the freely available Wikipedia Revision Toolkit (Ferschke et al., 2011) together with the JWPL Wikipedia API (Zesch et al., 2008a).3 The API outputs plain text converted from Wiki-Markup, but the text still contains a small portion of leftover markup and other artifacts.",
                    "sid": 35,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we perform additional cleaning steps removing (i) tokens with more than 30 characters (often URLs), (ii) sentences with less than 5 or more than 200 tokens, and (iii) sentences containing a high fraction of special characters like ‘:’ usually indicating Wikipedia-specific artifacts like lists of language links.",
                    "sid": 36,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining sentences are part-of- speech tagged and lemmatized using TreeTagger (Schmid, 2004).",
                    "sid": 37,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using these cleaned and annotated articles, we form pairs of adjacent article revisions (ri and ri+1).",
                    "sid": 38,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Sentence Alignment.",
                    "sid": 39,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fully aligning all sentences of the adjacent revisions is a quite costly operation, as sentences can be split, joined, replaced, or moved in the article.",
                    "sid": 40,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we are only looking for sentence pairs which are almost identical except for the real-word spelling error and its correction.",
                    "sid": 41,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we form all sentence pairs and then apply an aggressive but cheap filter that rules out all sentences which (i) are equal, or (ii) whose lengths differ more than a small number of characters.",
                    "sid": 42,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the resulting much smaller subset of sentence pairs, we compute the Jaro distance (Jaro, 1995) between each pair.",
                    "sid": 43,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the distance exceeds a certain threshold tsim (0.05 in this case), we do not further consider the pair.",
                    "sid": 44,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The small amount of remaining sentence pairs is passed to the sentence pair filter for in-depth inspection.",
                    "sid": 45,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 The same artificial data as described in Section 3.2..",
                    "sid": 46,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 http://code.google.com/p/dkpro-spelling-asl/ 3 http://code.google.com/p/jwpl/ 2.3 Sentence Pair Filtering.",
                    "sid": 47,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sentence pair filter further reduces the number of remaining sentence pairs by applying a set of heuristics including surface level and semantic level filters.",
                    "sid": 48,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Surface level filters include: Replaced Token Sentences need to consist of identical tokens, except for one replaced token.",
                    "sid": 49,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No Numbers The replaced token may not be a number.",
                    "sid": 50,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "UPPER CASE The replaced token may not be in upper case.",
                    "sid": 51,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Case Change The change should not only involve case changes, e.g. changing ‘english’ into ‘English’.",
                    "sid": 52,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Edit Distance The edit distance between the replaced token and its correction need to be below a certain threshold.",
                    "sid": 53,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After applying the surface level filters, the remaining sentence pairs are well-formed and contain exactly one changed token at the same position in the sentence.",
                    "sid": 54,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the change does not need to characterize a real-word spelling error, but could also be a normal spelling error or a semantically motivated change.",
                    "sid": 55,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we apply a set of semantic filters: Vocabulary The replaced token needs to occur in the vocabulary.",
                    "sid": 56,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found that even quite comprehensive word lists discarded too many valid errors as Wikipedia contains articles from a very wide range of domains.",
                    "sid": 57,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we use a frequency filter based on the Google Web1T n-gram counts (Brants and Franz, 2006).",
                    "sid": 58,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We filter all sentences where the replaced token has a very low unigram count.",
                    "sid": 59,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We experimented with different values and found 25,000 for English and 10,000 for German to yield good results.",
                    "sid": 60,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Same Lemma The original token and the replaced token may not have the same lemma, e.g. ‘car’ and ‘cars’ would not pass this filter.",
                    "sid": 61,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Stopwords The replaced token should not be in a short list of stopwords (mostly function words).",
                    "sid": 62,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Named Entity The replaced token should not be part of a named entity.",
                    "sid": 63,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this purpose, we tions, the change is likely to be semantically motivated, e.g. if “house” was replaced with “hut”.",
                    "sid": 64,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we do not consider cases, where we detect a direct semantic relation between the original and the replaced term.",
                    "sid": 65,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this purpose, we use Word- Net (Fellbaum, 1998) for English and GermaNet (Lemnitzer and Kunze, 2002) for German.",
                    "sid": 66,
                    "ssid": 39,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "resulting datasets. ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 Natural Error Datasets.",
                    "sid": 67,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using our framework for mining real-word spelling errors in context, we extracted an English dataset5, and a German dataset6.",
                    "sid": 68,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the output generally was of high quality, manual post-processing was necessary7, as (i) for some pairs the available context did not provide enough information to decide which form was correct, and (ii) a problem that might be specific to Wikipedia – vandalism.",
                    "sid": 69,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The revisions are full of cases where words are replaced with similar sounding but greasy alternatives.",
                    "sid": 70,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A relatively mild example is “In romantic comedies, there is a love story about a man and a woman who fall in love, along with silly or funny comedy farts.”, where ‘parts’ was replaced with ‘farts’ only to be changed back shortly afterwards by a Wikipedia vandalism hunter.",
                    "sid": 71,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We removed all cases that resulted from obvious vandalism.",
                    "sid": 72,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For further experiments, a small list of offensive terms could be added to the stopword list to facilitate this process.",
                    "sid": 73,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A connected problem is correct words that get falsely corrected by Wikipedia editors (without the malicious intend from the previous examples, but with similar consequences).",
                    "sid": 74,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the initially correct sentence “Dung beetles roll it into a ball, sometimes being up to 50 times their own weight.” was ‘corrected’ by exchanging weight with wait.",
                    "sid": 75,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We manually removed such obvious mistakes, but are still left with some borderline cases.",
                    "sid": 76,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the sentence “By the 1780s the goals of England were so full that convicts were often chained up in rotting old ships.” the obvious error applied the Stanford NER (Finkel et al., 2005).",
                    "sid": 77,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normal Spelling Error We apply the Jazzy spelling detector4 and rule out all cases in which it is able to detect the error.",
                    "sid": 78,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantic Relation If the original token and the replaced token are in a close lexical-semantic rela 4 http://jazzy.sourceforge.net/ 5 Using a revision dump from April 5, 2011..",
                    "sid": 79,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 Using a revision dump from August 13, 2010..",
                    "sid": 80,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 The most efficient and precise way of finding real-word spelling errors would of course be to apply measures of contextual fitness.",
                    "sid": 81,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the resulting dataset would then only contain errors that are detectable by the measures we want to evaluate – a clearly unacceptable bias.",
                    "sid": 82,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, a certain amount of manual validation is inevitable.",
                    "sid": 83,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘goal’ was changed by some Wikipedia editor to ‘jail’.",
                    "sid": 84,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, actually it should have been the old English form for jail ‘gaol’ which can be deduced when looking at the full context and later versions of the article.",
                    "sid": 85,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We decided to not remove these rare cases, because ‘jail’ is a valid correction in this context.",
                    "sid": 86,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After manual inspection, we are left with 466 English and 200 German errors.",
                    "sid": 87,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given that we restricted our experiment to 5 million English and German revisions, much larger datasets can be extracted if the whole revision history is taken into account.",
                    "sid": 88,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our snapshot of the English Wikipedia contains 305·106 revisions.",
                    "sid": 89,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even if not all of them correspond to article revisions, it is safe to assume that more than 10,000 real-word spelling errors can be extracted from this version of Wikipedia.",
                    "sid": 90,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using the same amount of source revisions, we found significantly more English than German errors.",
                    "sid": 91,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This might be due to (i) English having more short nouns or verbs than German that are more likely to be confused with each other, and (ii) the English Wikipedia being known to attract a larger amount of non-native editors which might lead to higher rates of real-word spelling errors.",
                    "sid": 92,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, this issue needs to be further investigated e.g. based on comparable corpora build on the basis of different language editions of Wikipedia.",
                    "sid": 93,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further refining the identification of real-word errors in Wikipedia would allow evaluating how frequent such errors actually occur, and how long it takes the Wikipedia editors to detect them.",
                    "sid": 94,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If errors persist over a long time, using measures of contextual fitness for detection would be even more important.",
                    "sid": 95,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another interesting observation is that the average edit distance is around 1.4 for both datasets.",
                    "sid": 96,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that a substantial proportion of errors involve more than one edit operation.",
                    "sid": 97,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given that many measures of contextual fitness allow at most one edit, many naturally occurring errors will not be detected.",
                    "sid": 98,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, allowing a larger edit dis corpus that is known to be free of spelling errors, sentences are randomly sampled.",
                    "sid": 99,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each sentence, a random word is selected and all strings with edit distance smaller than a given threshold (2 in our case) are generated.",
                    "sid": 100,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If one of those generated strings is a known word from the vocabulary, it is picked as the artificial error.",
                    "sid": 101,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous work on evaluating real-word spelling correction (Hirst and Budanitsky, 2005; WilcoxOHearn et al., 2008; Islam and Inkpen, 2009) used a dataset sampled from the Wall Street Journal corpus which is not freely available.",
                    "sid": 102,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we created a comparable English dataset of 1,000 artificial errors based on the easily available Brown corpus (Francis W. Nelson and Kuc¸era, 1964).8 Additionally, we created a German dataset with 1,000 artificial errors based on the TIGER corpus.9",
                    "sid": 103,
                    "ssid": 37,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "measuring contextual fitness. ",
            "number": "4",
            "sents": [
                {
                    "text": "There are two main approaches for measuring the contextual fitness of a word in its context: the statistical (Mays et al., 1991) and the knowledge- based approach (Hirst and Budanitsky, 2005).",
                    "sid": 104,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Statistical Approach.",
                    "sid": 105,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mays et al.",
                    "sid": 106,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1991) introduced an approach based on the noisy-channel model.",
                    "sid": 107,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The model assumes that the correct sentence s is transmitted through a noisy channel adding ‘noise’ which results in a word w being replaced by an error e leading thewrong sentence sf which we observe.",
                    "sid": 108,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The prob ability of the correct word w given that we observe the error e can be computed as P (w|e) = P (w) · P (e|w).",
                    "sid": 109,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The channel model P (e|w) describes how likely the typist is to make an error.",
                    "sid": 110,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is modeled by the parameter α.10 The remaining probability mass (1 − α) is distributed equally among all words in the vocabulary within an edit distance of 1 (edits(w)): α if e = w tance enormously increases the search space resulting in increased run-time and possibly de P (e|w) = (1 − α)/|edits(w)| if e =I w creased detection precision due to more false positives.",
                    "sid": 111,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Artificial Error Datasets.",
                    "sid": 112,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast to the quite challenging process of mining naturally occurring errors, creating artificial errors is relatively straightforward.",
                    "sid": 113,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From a The source model P (w) is estimated using a trigram language model, i.e. the probability of the 8 http://www.archive.org/details/BrownCorpus (CC-by-na).",
                    "sid": 114,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 http://www.ims.unistuttgart.de/projekte/TIGER/ The corpus contains 50,000 sentences of German newspaper text, and is freely available under a noncommercial license.",
                    "sid": 115,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10 We optimize α on a held-out development set of errors..",
                    "sid": 116,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "inte nde d wor d wi is co mp ute d as the co ndi tio nal Da tas et P R F pro ba bilit y P (wi |wi −1 wi −2) . He nce , the proba Art ificial En gli sh .77 .50 .60 bilit y of the corr ect sen ten ce s = w1 . . .",
                    "sid": 117,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "wn ca n Na tural En gli sh .54 .26 .35 be esti mat ed as Art ificial Ge rm an .90 .49 .63 n + 2 Na tural Ge rm an .77 .20 .32 P (s) = TI P (wi|wi−1wi−2) i=1 The set of candidate sentences Sc contains all versions of the observed sentence sf derived by re placing one word with a word from edits(w), while all other words in the sentence remain unchanged.",
                    "sid": 118,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The correct sentence s is those sentence from Sc that maximizes P (s|sf) = arg maxs∈Sc P (s) · P (sf|s).",
                    "sid": 119,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Knowledge Based Approach.",
                    "sid": 120,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hirst and Budanitsky (2005) introduced a knowledge-based approach that detects real-word spelling errors by checking the semantic relations of a target word with its context.",
                    "sid": 121,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this purpose, they apply WordNet as the source of lexical- semantic knowledge.",
                    "sid": 122,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm flags all words as error candidates and then applies filters to remove those words from further consideration that are unlikely to be errors.",
                    "sid": 123,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the algorithm removes all closed-class word candidates as well as candidates which cannot be found in the vocabulary.",
                    "sid": 124,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Candidates are then tested for having lexical cohesion with their context, by (i) checking whether the same surface form or lemma appears again in the context, or (ii) a semantically related concept is found in the context.",
                    "sid": 125,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In both cases, the candidate is removed from the list of candidates.",
                    "sid": 126,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each remaining possible real-word spelling error, edits are generated by inserting, deleting, or replacing characters up to a certain edit distance (usually 1).",
                    "sid": 127,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each edit is then tested for lexical cohesion with the context.",
                    "sid": 128,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If at least one of it fits into the context, the candidate is selected as a real- word error.",
                    "sid": 129,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hirst and Budanitsky (2005) use two additional filters: First, they remove candidates that are “common non-topical words”.",
                    "sid": 130,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is unclear how the list of such words was compiled.",
                    "sid": 131,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their list of examples contains words like ‘find’ or ‘world’ which we consider to be perfectly valid candidates.",
                    "sid": 132,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, they also applied a filter using a list of known multi-words, as the probability for words to accidentally form multi-words is low.",
                    "sid": 133,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1: Performance of the statistical approach using a trigram model based on Google Web1T.",
                    "sid": 134,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is unclear which list was used.",
                    "sid": 135,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We could use multi-words from WordNet, but coverage would be rather limited.",
                    "sid": 136,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We decided not to use both filters in order to better assess the influence of the underlying semantic relatedness measure on the overall performance.",
                    "sid": 137,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The knowledge based approach uses semantic relatedness measures to determine the cohesion between a candidate and its context.",
                    "sid": 138,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the experiments by Budanitsky and Hirst (2006), the measure by (Jiang and Conrath, 1997) yields the best results.",
                    "sid": 139,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, a wide range of other measures have been proposed, cf.",
                    "sid": 140,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Zesch and Gurevych, 2010).",
                    "sid": 141,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some measures using a wider definition of semantic relatedness (Gabrilovich and Markovitch, 2007; Zesch et al., 2008b) instead of only using taxonomic relations in a knowledge source.",
                    "sid": 142,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As semantic relatedness measures usually return a numeric value, we need to determine a threshold θ in order to come up with a binary related/unrelated decision.",
                    "sid": 143,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Budanitsky and Hirst (2006) used a characteristic gap in the standard evaluation dataset by Rubenstein and Good- enough (1965) that separates unrelated from related word pairs.",
                    "sid": 144,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do not follow this approach, but optimize the threshold on a held-out development set of real-word spelling errors.",
                    "sid": 145,
                    "ssid": 42,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results & discussion. ",
            "number": "5",
            "sents": [
                {
                    "text": "In this section, we report on the results obtained in our evaluation of contextual fitness measures using artificial and natural errors in English and German.",
                    "sid": 146,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Statistical Approach.",
                    "sid": 147,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 summarizes the results obtained by the statistical approach using a trigram model based on the Google Web1T data (Brants and Franz, 2006).",
                    "sid": 148,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the English artificial errors, we observe a quite high F-measure of .60 that drops to Da tas et N-gram model Size P R F Da tas et P R F 7 · 1011 . 7 7 .50 .60 Art ificial En gli sh .26 .15 .19 1 0 Art-En Google Web 7 · 10 .78 .48 .59 7 · 1 0 9 . 7 6 . 4 2 . 5 4 Wikipedia 2 · 109 .72 .37 .49 Na tural En gli sh .29 .18 .23 Art ificial Ge rm an .47 .16 .24 Na tural Ge rm an .40 .13 .19 7 · 1011 .54 .26 .35 10 Table 3: Performance of the knowledge-based ap NatEn Google Web 7 · 10 .51 .23 .31 7 · 109 .46 .19 .27 Wikipedia 2 · 109 .49 .19 .27 8 · 1010 .90 .49 .63 proach using the JiangConrath semantic relatedness measure.",
                    "sid": 149,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Art-De Google Web 8 · 109 .90 .47 .61 not targeted towards the Wikipedia articles from 8 · 108 .88 .36 .51 Wikipedia 7 · 108 .90 .37 .52 8 · 1010 .77 .20 .32 which we sampled the natural errors.",
                    "sid": 150,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we also tested a trigram model based on Wikipedia.",
                    "sid": 151,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it is much smaller than the Web model, NatDe Google Web 8 · 109 .68 .14 .23 which leads us to additionally testing smaller Web 8 · 108 .65 .10 .17 Wikipedia 7 · 108 .70 .13 .22 Table 2: Influence of the n-gram model on the performance of the statistical approach.",
                    "sid": 152,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": ".35 when switching to the naturally occurring errors which we extracted from Wikipedia.",
                    "sid": 153,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the German dataset, we observe almost the same performance drop (from .63 to .32).",
                    "sid": 154,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These observations correspond to our earlier analysis where we showed that the artificial data contains many cases that are quite easy to correct using a statistical model, e.g. where a plural form of a noun is replaced with its singular form (or vice versa) as in “I bought a car.” vs. “I bought a cars.”.",
                    "sid": 155,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The naturally occurring errors often contain much harder contexts, as shown in the following example: “Through the open window they heard sounds below in the street: cartwheels, a tired horse’s plodding step, vices.” where ‘vices’ should be corrected to ‘voices’.",
                    "sid": 156,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the lemma ‘voice’ is clearly semantically related to other words in the context like ‘hear’ or ‘sound’, the position at the end of the sentence is especially difficult for the trigram-based statistical approach.",
                    "sid": 157,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The only trigram that connects the error to the context is (‘step’, ‘,’, vices/voices) which will probably yield a low frequency count even for very large trigram models.",
                    "sid": 158,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Higher order n-gram models would help, but suffer from the usual data- sparseness problems.",
                    "sid": 159,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Influence of the N-gram Model For building the trigram model, we used the Google Web1T data, which has some known quality issues and is models.",
                    "sid": 160,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 summarizes the results.",
                    "sid": 161,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We observe that “more data is better data” still holds, as the largest Web model always outperforms the Wikipedia model in terms of recall.",
                    "sid": 162,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we reduce the size of the Web model to the same order of magnitude as the Wikipedia model, the performance of the two models is comparable.",
                    "sid": 163,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would have expected to see better results for the Wikipedia model in this setting, but its higher quality does not lead to a significant difference.",
                    "sid": 164,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even if statistical approaches quite reliably detect real-word spelling errors, the size of the required n-gram models remains a serious obstacle for use in real-world applications.",
                    "sid": 165,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The English Web1T trigram model is about 25GB, which currently is not suited for being applied in settings with limited storage capacities e.g. for intelligent input assistance in mobile devices.",
                    "sid": 166,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we have seen above, using smaller models will decrease recall to a point where hardly any error will be detected anymore.",
                    "sid": 167,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we will now have a look on knowledge-based approaches which are less demanding in terms of the required resources.",
                    "sid": 168,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Knowledge-based Approach.",
                    "sid": 169,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows the results for the knowledge-based measure.",
                    "sid": 170,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast to the statistical approach, the results on the artificial errors are not higher than on the natural errors, but almost equal for German and even lower for English; another piece of evidence supporting our view that the properties of artificial datasets overestimate the performance of statistical measures.",
                    "sid": 171,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Influence of the Relatedness Measure As was pointed out before, Budanitsky and Hirst (2006) Dataset Measure θ P R F JiangConrath 0.5 .26 .15 .19 Dataset Comb.-Strategy P R F Best-Single .77 .50 .60 Art-En Lin 0.5 .22 .17 .19 Lesk 0.5 .19 .16 .17ESA Wikipedia 0.05 .43 .13 .20ESA Wiktionary 0.05 .35 .20 .25ESA Wordnet 0.05 .33 .15 .21 JiangConr ath 0.5 .29 .18 .23Artificial EnglishNatural English Union .52 .55 .54 Intersectio n .91 .15 .25Best Single .54 .26 .35 Union .40 .36 .38 Intersectio n .82 .11 .19 NatEn Lin 0.5 .26 .21 .23 Lesk 0.5 .19 .19 .19ESA Wikipedia 0.05 .48 .14 .22ESA Wiktionary 0.05 .39 .21 .27ESA Wordnet 0.05 .36 .15 .21 Table 5: Results obtained by a combinati on of the best statistical and knowledg e-based configurat ion.",
                    "sid": 172,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘Best- Single’ is the best precision or recall obtained by a single measure.",
                    "sid": 173,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘Union’ merges the detection s of both approach es.",
                    "sid": 174,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘Intersect ion’ only detects an error if both methods agree on a detectio n. Table 4: Performance of knowledge-based approach using different relatedness measures.",
                    "sid": 175,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "show that the measure by Jiang and Conrath (1997) yields the best results in their experiments on malapropism detection.",
                    "sid": 176,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we test another path-based measure by Lin (1998), the gloss-based measure by Lesk (1986), and the ESA measure (Gabrilovich and Markovitch, 2007) based on concept vectors from Wikipedia, Wiktionary, and WordNet.",
                    "sid": 177,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 summarizes the results.",
                    "sid": 178,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast to the findings of Budanit- sky and Hirst (2006), JiangConrath is not the best path-based measure, as Lin provides equal or better performance.",
                    "sid": 179,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even more importantly, other (non path-based) measures yield better performance than both path-based measures.",
                    "sid": 180,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Especially ESA based on Wiktionary provides a good overall performance, while ESA based on Wikipedia provides excellent precision.",
                    "sid": 181,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The advantage of ESA over the other measure types can be explained with its ability to incorporate semantic relationships beyond classical taxonomic relations (as used by path-based measures).",
                    "sid": 182,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.3 Combining the Approaches.",
                    "sid": 183,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The statistical and the knowledge-based approach use quite different methods to assess the contextual fitness of a word in its context.",
                    "sid": 184,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This makes it worthwhile trying to combine both approaches.",
                    "sid": 185,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We ran the statistical method (using the full Wikipedia trigram model) and the knowledge- based method (using the ESAWiktionary related- ness measure) in parallel and then combined the resulting detections using two strategies: (i) we merge the detections of both approaches in order to obtain higher recall (‘Union’), and (ii) we only count an error as detected if both methods agree on a detection (‘Intersection’).",
                    "sid": 186,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When comparing the combined results in Table 5 with the best precision or recall obtained by a single measure (‘Best-Single’), we observe that precision can be significantly improved using the ‘Union’ strategy, while recall is only moderately improved using the ‘Intersect’ strategy.",
                    "sid": 187,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that (i) a large subset of errors is detected by both approaches that due to their different sources of knowledge mutually reinforce the detection leading to increased precision, and (ii) a small but otherwise undetectable subset of errors requires considering detections made by one approach only.",
                    "sid": 188,
                    "ssid": 43,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "6",
            "sents": [
                {
                    "text": "To our knowledge, we are the first to create a dataset of naturally occurring errors based on the revision history of Wikipedia.",
                    "sid": 189,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Max and Wisniewski (2010) used similar techniques to create a dataset of errors from the French Wikipedia.",
                    "sid": 190,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, they target a wider class of errors including non-word spelling errors, and their class of real-word errors conflates malapropisms as well as other types of changes like reformulations.",
                    "sid": 191,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, their dataset cannot be easily used for our purposes and is only available in French, while our framework allows creating datasets for all major languages with minimal manual effort.",
                    "sid": 192,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another possible source of real-word spelling errors are learner corpora (Granger, 2002), e.g. the Cambridge Learner Corpus (Nicholls, 1999).",
                    "sid": 193,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, annotation of errors is difficult and costly (Rozovskaya and Roth, 2010), only a small fraction of observed errors will be real-word spelling errors, and learners are likely to make dif ferent mistakes than proficient language users.",
                    "sid": 194,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Islam and Inkpen (2009) presented another statistical approach using the Google Web1T data (Brants and Franz, 2006) to create the n-gram model.",
                    "sid": 195,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It slightly outperformed the approach by Mays et al.",
                    "sid": 196,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1991) when evaluated on a corpus of artificial errors based on the WSJ corpus.",
                    "sid": 197,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the results are not directly comparable, as Mays et al.",
                    "sid": 198,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1991) used a much smaller n-gram model and our results in Section 5.1 show that the size of the n-gram model has a large influence on the results.",
                    "sid": 199,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Eventually, we decided to use the Mays et al.",
                    "sid": 200,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1991) approach in our study, as it is easier to adapt and augment.",
                    "sid": 201,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a re-evaluation of the statistical model by Mays et al.",
                    "sid": 202,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1991), WilcoxOHearn et al.",
                    "sid": 203,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) found that it outperformed the knowledge-based method by Hirst and Budanitsky (2005) when evaluated on a corpus of artificial errors based on the WSJ corpus.",
                    "sid": 204,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is consistent with our findings on the artificial errors based on the Brown corpus, but - as we have seen in the previous section - evaluation on the naturally occurring errors shows a different picture.",
                    "sid": 205,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They also tried to improve the model by permitting multiple corrections and using fixed-length context windows instead of sentences, but obtained discouraging results.",
                    "sid": 206,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All previously discussed methods are unsupervised in a way that they do not rely on any training data with annotated errors.",
                    "sid": 207,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, real-word spelling correction has also been tackled by supervised approaches (Golding and Schabes, 1996; Jones and Martin, 1997; Carlson et al., 2001).",
                    "sid": 208,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Those methods rely on predefined confusion-sets, i.e. sets of words that are often confounded e.g. {peace, piece} or {weather, whether}.",
                    "sid": 209,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each set, the methods learn a model of the context in which one or the other alternative is more probable.",
                    "sid": 210,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This yields very high precision, but only for the limited number of previously defined confusion sets.",
                    "sid": 211,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our framework for extracting natural errors could be used to increase the number of known confusion sets.",
                    "sid": 212,
                    "ssid": 24,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions and future work. ",
            "number": "7",
            "sents": [
                {
                    "text": "In this paper, we evaluated two main approaches for measuring the contextual fitness of terms: the statistical approach by Mays et al.",
                    "sid": 213,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1991) and the knowledge-based approach by Hirst and Budanitsky (2005) on the task of detecting real word spelling errors.",
                    "sid": 214,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For that purpose, we extracted a dataset with naturally occurring errors and their contexts from the Wikipedia revision history.",
                    "sid": 215,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that evaluating measures of contextual fitness on this dataset provides a more realistic picture of task performance.",
                    "sid": 216,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, using artificial datasets overestimates the performance of the statistical approach, while it underestimates the performance of the knowledge- based approach.",
                    "sid": 217,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that n-gram models targeted towards the domain from which the errors are sampled do not improve the performance of the statistical approach if larger n-gram models are available.",
                    "sid": 218,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We further show that the performance of the knowledge-based approach can be improved by using semantic relatedness measures that incorporate knowledge beyond the taxonomic relations in a classical lexical-semantic resource like WordNet.",
                    "sid": 219,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, by combining both approaches, significant increases in precision or recall can be achieved.",
                    "sid": 220,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In future work, we want to evaluate a wider range of contextual fitness measures, and learn how to combine them using more sophisticated combination strategies.",
                    "sid": 221,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both - the statistical as well as the knowledge-based approach - will benefit from a better model of the typist, as not all edit operations are equally likely (Kernighan et al., 1990).",
                    "sid": 222,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the side of the error extraction, we are going to further improve the extraction process by incorporating more knowledge about the revisions.",
                    "sid": 223,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, vandalism is often reverted very quickly, which can be detected when looking at the full set of revisions of an article.",
                    "sid": 224,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We hope that making the experimental framework publicly available will foster future research in this field, as our results on the natural errors show that the problem is still quite challenging.",
                    "sid": 225,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This work has been supported by the Volkswagen Foundation as part of the Lichtenberg- Professorship Program under grant No.",
                    "sid": 226,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I/82806.",
                    "sid": 227,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We Andreas Kellner and Tristan Miller for checking the datasets, and the anonymous reviewers for their helpful feedback.",
                    "sid": 228,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}