{
    "ID": "E93-1008",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Substantial efforts have been made in order to cope with disjunctions in constraint based grammar formalisms (e.g. [Kasper, 1987; Maxwell and Kaplan, 1991; DSrre and Eisele, 1990].).",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper describes the roles of disjunctions and inheritance in the use of feature structures and their formal semantics.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the notion of contexts we abstract from the graph structure of feature structures and properly define the search space of alternatives.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The graph unification algorithm precomputes nogood combinations, and a specialized search procedure which we propose here uses them as a controlling factor in order to delay decisions as long as there is no logical necessity for deciding.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The Context Feature Structure System (CFS) [BSttcher and KSnyvesTdth, 1992] is a unification based system which evaluates feature structures with distributed disjunctions and dynamically definable types for structure inheritance.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CFS is currently used to develop and to test a dependency grammar for German in the text analysis project KONTEXT.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper disjunctions and inheritance will be investigated with regard to both, their application dimension and their efficient computational treatment.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The unification algorithm of CFS and the concept of virtual agreements for structure sharing has been introduced in [BSttcher and KSnyvesTSth, 1992].",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm handles structure inheritance by structure sharing and constraint sharing which avoids copying of path structures and constraints completely.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Disjunctions are evaluated concurrently without backtracking and without combinatoric multiplication of the path structure.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For that purpose the path structure is separated from the structure of disjunctions by the introduction of contexts.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Contexts are one of the key concepts for maintaining disjunctions in feature terms.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They describe readings of disjunctive feature structures.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We define them slightly different from the definitions in [DSrre and Eisele, 1990] and [Backofen et ai., 1991], with a technical granularity which is more appropriate for their efficient treatment.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CFS unification algorithm computes a set of nogood contexts for all conflicts which occur during unification of structures.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An algorithm for contexts which computes from a set of nogoods whether a structure is valid, will be described in this paper.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is a specialized search procedure which avoids the investigation of the full search space of contexts by clustering disjunctions.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We start with some examples how disjunctions and inheritance are used in the CFS environment.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then contexts are formally defined on the basis of the semantics of CFS feature structures.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally the algorithm computing validity of contexts is outlined.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the use of disjunctions and. ",
            "number": "2",
            "sents": [
                {
                    "text": "Inheritance Disjunctions Disjunctions are used to express ambiguity and capability.",
                    "sid": 21,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A first example is provided by the lexicon entry for German die (the, that, ...)",
                    "sid": 22,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "in Figure 1.",
                    "sid": 23,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It may be nominative or accusative, and if it is singular the gender has to be feminine.",
                    "sid": 24,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Those parts of the term which are not inside a dis- junction are required in any case.",
                    "sid": 25,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such parts shall be shared by all \"readings\" of the term.",
                    "sid": 26,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The internal die := L_definit-or-relativ@ <> graph : die (nom} Cas \" acc syil : categ : ( Ilum : pl tnum : sg ]} gen : fern Figure 1: Lexicon Entry for die representation shall provide for mechanisms which prevent from multiplication of independent disjunctions (into dnf).",
                    "sid": 27,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tr&ns :.~-~ trails : • dom : syn : categ : gvb : aktiv syn : categ : [cas : acc j { I [categ [class :nomn]ssentj [lexem : hypo' ] syil : : class : [prn none <tree-filler> = <role-filler trails> \" . [ gvb : passiv ] dom:syn: ca~eg: Lrel #1 J . [ class : prpo ] categ : rel • #1 syn: [ \" ] lexem : {~::ch } <tree-filler> = <role-filler agens> •v-verb-trails-slote<> Figure 2: The Type trans As a second example Figure 2 shows a type describing possible realizations of a transitive object.",
                    "sid": 28,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The outermost disjunction distinguishes whether the dominating predicate is in active or in passive voice.",
                    "sid": 29,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For active predicates either a noun (syn : categ : class : nomn)or a subsentence (syn : categ : class : ssent) is allowed• This way disjunctions describe and restrict the possibility of combinations of constituents• External Treatment of Disjunctions The KONTEXT grammar is a lexicalized grammar.",
                    "sid": 30,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that the possibility of combinations of constituents is described with the entries in the lexicon rather than in a separated, general grammar.",
                    "sid": 31,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A chart parser is used in order to decide which constituents to combine and maintain the combinations• This means that some of the disjunctions concerning concrete combinations are handled not by the unification formalism, but by the chart• Therefore structure sharing for inheritance which is extensively used by the parser is even more important.",
                    "sid": 32,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inheritance Inheritance is used for two purposes: abstraction in the lexicon and non-destructive combination of chart entries• Figure 3 together with the type trans of Figure 2 shows an example of abstraction: The feature structure of trans is inherited (marked by $<>) to the structure for the lexeme spielen (to play) at the destination of the path syn : slots :.",
                    "sid": 33,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A virtual copy of the type structure is inserted• The type trans will be inherited to all the verbs which allow (or require) a transitive object.",
                    "sid": 34,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is obvious that it makes sense not only to inherit the structure to all the verbs on the level of grammar description but also to share the structure in the internal representation, without copying it.",
                    "sid": 35,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "L_spielen := lexem : spielen . [ fie_verb : schwach syn : ca~eg : [ pfk : habeil slots : trans@<> v-verbt~<> Figure 3: Lexicon Entry for spielen Inheritance is also extensively used by the parser.",
                    "sid": 36,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It works bottom-up and has to try different combinations of constituents.",
                    "sid": 37,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For single words it just looks up the structures in the lexicon.",
                    "sid": 38,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then it combines a slot of a functor with a filler.",
                    "sid": 39,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example is given in Figure 4 which shows a trace of the chart for the sentence Kinder spielen eine Rolle im Theater.",
                    "sid": 40,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Children play a part in the theatre.)",
                    "sid": 41,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the 6'th block, in the line starting with ...",
                    "sid": 42,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 the parser combines type _16 (for the lexicon entry of im) with the type _17 (for Theater) and defines this combination dynamically as type _18.",
                    "sid": 43,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "_16 is the functor, _17 the filler, and caspn the name of the slot.",
                    "sid": 44,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The combination is done by unification of feature structures by the CFS system.",
                    "sid": 45,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The point here is that the parser tries to combine the result _18 of this step more than once with different other structures, but unification is a destructive operation!",
                    "sid": 46,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, instead of directly unifying the structures of say _7 and _18 (_11 and _18, .•.), _7 and _18 are inherited into the new structure of _20.",
                    "sid": 47,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This way virtual copies of the structures are produced, and these are unified• It is essential for efficiency that a virtual copy does not mean that the structure of the type has to be copied.",
                    "sid": 48,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lazy copying approach ([Kogure, 1990], and [Emele, 1991] for lazy copying in TFS with historical backtracking) copies only overlapping parts of the structure.",
                    "sid": 49,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CFS avoids even this by structure- and constraint-sharing.",
                    "sid": 50,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For common sentences in German, which tend to be rather long, a lot of types will be generated• They supply only a small part of structure themselves (just the path from the functor to the filler and a simple slot-filler combination structure).",
                    "sid": 51,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bulk of the i: Kinder _I : Kinder open/sat 2: spielen ...I _2 : spielen open _3 : spielen _2 subje Kinder _I open/sat _4 : spielen _2 trans Kinder _I open 3: eine ...2 _S : eine open/sat 4: Rolle ...3 _6 : Rolle open/sat ...2 _7 : Rolle _6 refer eine _5 open/sat _II: spielen _3 trans Rolle _7 open/sat ...1 _14: spielen _2 trans Rolle _7 open 5: im ...4 _16: im open 6: Theater • ..5 _17: Theater open/sat ...4 _18: im _16 caspnTheater _17 open/sat ...3 _19: Rolle _6 caspp im _18 open/sat • ..2 _20: Rolle _7 ˘aspp im _18 open/sat _21: spielen _11 caspp im _18 open/sat ...I _22:spielen_14 caspp im_18 open _26: spielen _3 trans Rolle _20 open/sat ...I _29: spielen _2 trans Rolle _20 open 7: • °°.6 _30: open _31: • _30 praed spielen _26 sat _32: . _30 praed spielen _21 sat Figure 4: Chart for Kinder spielen ... structure is shared among the lexicon and all the different combinations produced by the parser.",
                    "sid": 52,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Avoiding Recursive Inheritance Recursive inheritance would be a means to combine phrases in order to analyze (and generate) without a parser (as in TFS).",
                    "sid": 53,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand a parser is a controlled device which e.g. knows about important paths in feature structures describing constituents, and which can do steps in a certain sequence, while unification in principle is sequence- invariant.",
                    "sid": 54,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We think that recursion is not in principle impossible in spite of CFS' concurrent treatment of disjunctions, but we draw the borderline between the parser and the unification formalism such that the cases for recursion and iteration are handled by the parser.",
                    "sid": 55,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This seems to be more efficient.",
                    "sid": 56,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Connection between Disjunctions and Types The similarity of the relation between disjunctive structure and disjunct and the relation between type and instance is, that in a set theoretic semantics (see below) the denotation of the former is a superset of the denotation of the latter.",
                    "sid": 57,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The difference is that a disjunctive structure is invalid, i.e. has the empty set as denotation, if each disjunct is invalid.",
                    "sid": 58,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A type, however, stays valid even when all its currently known instances are invalid.",
                    "sid": 59,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This distinction mirrors the uses of the two: inheritance for abstraction, disjunctions for complete enumeration of alternatives.",
                    "sid": 60,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When an external system, like the chart of the parser, keeps track of the relation between types and instances disjunctions might be replaced by inheritance.",
                    "sid": 61,
                    "ssid": 41,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "contexts and inheritance. ",
            "number": "3",
            "sents": [
                {
                    "text": "This chapter introduces the syntax and semantics of CFS feature terms, defines contexts, and investigates the relation between type and instance concerning the validity of contexts.",
                    "sid": 62,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We want to define contexts such that they describe a certain reading of a (dis- junctive) term, i.e. chooses a disjunct for some or all of the disjunctions.",
                    "sid": 63,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will define validity of a context such that the intended reading has a nonempty denotation.",
                    "sid": 64,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CFS unification algorithm as described in [BSttcher, KSnyvesTSth 92] computes a set of in- vMid contexts for all unification conflicts, which are Mways conflicts between constraints expressed in the feature term (or in types).",
                    "sid": 65,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The purpose of the definition of contexts is to cover all possible conflicts, and to define an appropriate search space for the search procedure described in the last part of this paper.",
                    "sid": 66,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore our definition of contexts differ from those in [DSrre and Eisele, 1990] or [Backofen et al., 1991].",
                    "sid": 67,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntax and Semantics of Feature Terms Let A = {a,...}",
                    "sid": 68,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "be a set of atoms, F = {f, fi, gi,...}",
                    "sid": 69,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a set of feature names, D --{d,...}",
                    "sid": 70,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a set of disjunction names, X = {x, y, z,...}",
                    "sid": 71,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a set of type names, I = {i,...}",
                    "sid": 72,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a set of instantiation names.",
                    "sid": 73,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The set of terms T -{t, tl,...}",
                    "sid": 74,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is defined by the recursive scheme in Figure 5.",
                    "sid": 75,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A sequence of type definitions is X := ~1 y := t2 Z := t3 .... a atom f : t feature value pair It1... t,] unification {tl...tn}d disjunction <fl.--fn > = <gl..-gm> path equation zQ<>i type inheritance Figure 5: The Set of Feature Terms T The concrete syntax of CFS is richer than this definition.",
                    "sid": 76,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Variables are allowed to express path equations, and types can be unified destructively.",
                    "sid": 77,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cyclic path equations (e.g. <> = <gl.",
                    "sid": 78,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• •gm >) are supported, but recursive type definition and negation are not supported, yet.",
                    "sid": 79,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to define contexts we define the set of dis- junctions of a term, the disjuncts of a disjunction, and deciders as (complete) functions from disjunctions to disjuncts.",
                    "sid": 80,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mi is a mapping substituting all disjunction names d by i(d), where i is unique for each instantiation.",
                    "sid": 81,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "dis : T ~ 2 D, sub : D ~ 2 N, dis(a) := {} dis(<p> --<q>) :-{} dis(f : t) :-dis(t) dis(x~<>i) := dis(Mi(t))lz := t dis([tl, ..,tn]) := U.i dis(tj) dis({tl,..,tn}a) := {d} U Uj dis(tj), sub(d) := {1, ..., n} deciders(t) := {choice: dis(t) -o Nlchoice(d) E sub(d)} Figure 6 defines the interpretation [tiC of deciders i c w.r.t, terms t as subsets of some universe U (similar to [Smolka, 1988], without sorts, but with named disjunctions and instantiations).",
                    "sid": 82,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a I E U, yz : g±, yZ(a = ±, = ±, [a]]c :={a I } If: tic :--{s e Ulfl(s) E It],} [ It1..",
                    "sid": 83,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "t,] :=N, [t ]o [{q..t.}d]o :=l[t<d)L i<fl..fn > = <gl-..qm>]e:----{Se Ulf (..ft (s)) = gi(..gl(s)) # ±} :={s e := t s e Figure 6: Decider Interpretation Similar to deciders we define specializers as partial functions from disjunctions to disjuncts.",
                    "sid": 84,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also define a partial order _t on specializers of a term: c1 ~ c~ iff Vdedis(t) (c~ is defined on dA c2(d) = j) ==~cz(d) = j The interpretation function can be extended to specializers now: If c is a specializer of t, then ˘~6deeiders(t)Ae'-g~˘ A specializer is valid iff it's denotation is not empty.",
                    "sid": 85,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the most general specializer, the function ca-which is undefined on each disjunction, we get the interpretation of the term: It] := [fLy Contexts Contexts will be objects of computation and representation.",
                    "sid": 86,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are used in order to record validity for distributed disjunctions.",
                    "sid": 87,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We give our definition first, and a short discussion afterwards.",
                    "sid": 88,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the purpose of explanation we restrict the syntax concerning the composition of disjunctions.",
                    "sid": 89,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We say that a disjunctive subterm {..-}d oft is outwards in t if there is no subterm {.., tj, ..}a, of t with {...}n subterm of tj.",
                    "sid": 90,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We require for each disjunctive sub- term {...}a oft and each subterm {..,tj, ..}d' oft: if {...}d is outwards in t i then each subterm {...}a of t is outwards in tj.",
                    "sid": 91,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This relation between d ~ and d we define as subdis(d~,j, d).",
                    "sid": 92,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 7 shows the definition of contexts.",
                    "sid": 93,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A specializer c of t is a context of t, iff Vd, d / E dis(t) : (e is defined on d ^ snbdis( d', j, d) ) =~(e is defined on d ~ ^ e(d ~) = j) Figure 7: Definition of Contexts The set of contexts and a bottom element ± form a lattice (__t, Ct±).",
                    "sid": 94,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The infimum operator of this lattice we write as At.",
                    "sid": 95,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We drop the index ~ from operators whenever it is clear which term is meant.",
                    "sid": 96,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discussion: E.g. for the term f : t\" t lIt d2 dl (dl --~ 2, d2 ~ 1) is a specializer but not a context.",
                    "sid": 97,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We exclude such specializers which have more general specializers (dl --~ 2) with the same denotation.",
                    "sid": 98,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the same term (d2 ~ 1) is not a context.",
                    "sid": 99,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This makes sense due to the fact that there is no constraint expressed in the term required in (d2 ~ 1), but e.g. a at the destination of f is required in (dl --* 1, d2 ~ 1).",
                    "sid": 100,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will utilize this information about the dependency of disjunctions as it is expressed in our definition of contexts.",
                    "sid": 101,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to show what contexts are used for we define the relation is required in (requi) of subterms and contexts of t by the recursive scheme: t requi cT f : t ~ requie =~ t' requic z~<>i requi e A z := t' :˘, Mi(t/) requi c [..,t I, ..]",
                    "sid": 102,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "requi e ~ t' requi c / {..,tj,..}d requi c :~ tj requi (d-+ j c(a/)] The contexts in which some subterms of t are required, we call input contexts of t. Each value constraint at the destination of a certain path and each path equation is required in a certain input context.",
                    "sid": 103,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: In e a is required in (dl --+ 1) at the destination of f, and e is required in (d2 --+ 2) at the destination of f, and the conflict is in the infimum context (dl --* 1) n (d~ --, 2) = (dl ---, 1, d2 ---, 2).",
                    "sid": 104,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This way each conflict is always in one context, and any context might be a context of a conflict.",
                    "sid": 105,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So the contexts are defined with the necessary differentiation and without superfluous elements.",
                    "sid": 106,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We call the contexts of conflicts nogoods.",
                    "sid": 107,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not a trivial problem to compute the validity of a term or a context from the set of nogoods in the general case.",
                    "sid": 108,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This will be the topic of the last part (4).",
                    "sid": 109,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instantiation If z := t is a type, and x is inherited to some term x©<>i then for each context c of z there is a corresponding context d of z©<>i with the same denotation.",
                    "sid": 110,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[z©<>i]c, = [Mi(t)]c, = [tic c' : dis(M~(t) ~ N, c'(i(d)) = c(d) Therefore each nogood of t also implies that the corresponding context of the instance term z©<>i has the empty denotation.",
                    "sid": 111,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not necessary to detect the conflicts again.",
                    "sid": 112,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The nogoods can be inherited.",
                    "sid": 113,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(In fact they have to because CFS will never compute a conflict twice.)",
                    "sid": 114,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the instance is a larger term, the instance usually will be more specific than the type, and there might be conflicts between constraints in the type and constraints in the instance.",
                    "sid": 115,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case there are valid contexts of the type with invalid corresponding contexts of the instance.",
                    "sid": 116,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore the inheritance can occur in the scope of disjunctions of the instance.",
                    "sid": 117,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We summarize this by the definition of contezt mapping mi in Figure 8.",
                    "sid": 118,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "z := t, c E contexts(t) t I --..x@<>i.., zQ<>i is required in d E contezts(t') mi : contezts( t ) ~ eontezts( t'), ( i(d)---* c(d) ) mi(c) := d' --.* c'(d') Figure 8: Context Mappings Computing Validity Given a set of nogood contexts, the disjunctions and the subdis-relation of a term, the question is whether the term is valid, i.e. whether it has a nonempty denotation.",
                    "sid": 119,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A nogood context n means that [t]n = {}.",
                    "sid": 120,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The answer to this question in this section will be an algorithm, which in CFS is run after all conflicts are computed, because an incremental version of the algorithm seems to be more expensive.",
                    "sid": 121,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We start with an example in order to show that simple approaches are not effective.",
                    "sid": 122,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "{fi it }, { [i it }.",
                    "sid": 123,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "{ [i (dl --, 1, --, 1), (dl 2, 2), (d2 --+ 1, d3 --* 1), (d2 --* 2, d3 --* 2), (d3 --* 1, dl ---* 1), (d3 \"-~ 2, dl --~ 2) Figure 9: Term and Nogood Contexts For the term in Figure 9 the unification algorithm of CFS computes the shown nogoods.",
                    "sid": 124,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The term is invalid because each decider's denotation is empty.",
                    "sid": 125,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A strategy which looks for similar nogoods and tries to replace them by a more general one will fail.",
                    "sid": 126,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This example shows that it is necessary at least in some cases to look at (a covering of) more specific contexts.",
                    "sid": 127,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But before we start to describe an algorithm for this purpose we want to explain why the algorithm we describe does a little bit more.",
                    "sid": 128,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It computes all most general invalid contexts from the set of given nogoods.",
                    "sid": 129,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This border of invalid contexts, the computed nogoods, allows us afterwards to test at a low rate whether a context is invalid or not.",
                    "sid": 130,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is just the test Bn G Computed-Nogoods : c ~_t n. This test is frequently required during inspection of a result and during output.",
                    "sid": 131,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover nogoods are inherited, and if these nogoods are the most general invalid contexts, computations for instances will be reduced.",
                    "sid": 132,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The search procedure for the most general invalid contexts starts from the most general context cv.",
                    "sid": 133,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It descends through the context lattice and modifies the set of nogoods.",
                    "sid": 134,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We give a rough description first and a refinement afterwards: Recursive procedure n-1 1.",
                    "sid": 135,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "if 3n E Nogoods : c -4 n then return 'bad'.",
                    "sid": 136,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 137,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "select a disjunction d with c undefined on d and such that the specializer (d -* j, d ~ --~ c(d~)) is a context, if no such disjunction exists, return 'good'.",
                    "sid": 138,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 139,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "for each j E sub(d) recursively call n-1 with (d --+ j, d ~ -.+ c( d~) ).",
                    "sid": 140,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 141,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "if each call returns 'bad', then replace all n E Nogoods : n ~_ c by c and return 'bad'.",
                    "sid": 142,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.",
                    "sid": 143,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "continue with step 2 selecting a different disjunction.",
                    "sid": 144,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we replace the fifth step by 5.",
                    "sid": 145,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "return 'good' n-1 will be a test procedure for validity.",
                    "sid": 146,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "n-1 is not be very efficient since it visits contexts more than once and since it descends down to most specific contexts even in cases without nogoods.",
                    "sid": 147,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to describe the enhancements we write: Cl is relevant for c2, iff cl I-1 c2 ~ .1..",
                    "sid": 148,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm implemented for CFS is based on the following ideas: (a) select nogoods relevant for c, return 'good' if there are none (b) specialize c only by disjunctions for which at least some of the relevant nogoods is defined.",
                    "sid": 149,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(c) order the disjunctions, select in this order in the step 2.-4.",
                    "sid": 150,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "cycle.",
                    "sid": 151,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(d) prevent multiple visits of contexts by different specialization sequences: if the selected disjunction is lower than some disjunction c is defined on, do not select any disjunction in the recursive calls (do step 1 only).",
                    "sid": 152,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The procedure will be favorably parametrized not only by the context c, but also by the selection of relevant nogoods, which is reduced in each recursive call (because only 'relevant' disjunctions are selected due to enhencement (b)).",
                    "sid": 153,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This makes the procedure stop at depth linear to the number of disjunctions a nogood is defined on.",
                    "sid": 154,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Together with the ordering (c,d) every context which is more general than any nogood is visited once (step 1 visits due to enhencement (d) not counted), because they are candidates for most general nogood contexts.",
                    "sid": 155,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For very few no- goods it might be better to use a different procedure searching 'bottom-up' from the nogoods (as [de Kleer, 1986, second part] proposed for ATMS).",
                    "sid": 156,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(a) reduces spreading by recognizing contexts without more specific invalid contexts.",
                    "sid": 157,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(b) might be further restricted in some cases: select only such d with Vj G sub(d) : 3n E relevant-nogoods : n(d) = j.",
                    "sid": 158,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(b) in fact clusters disjunctions into mutually independent sets of disjunctions.",
                    "sid": 159,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This also ignores dis- junctions for which there are currently no nogoods thereby reducing the search space exponentially.",
                    "sid": 160,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Eliminating Irrelevant Disjunctions The algorithm implemented in CFS is also capable of a second task: It computes whether disjunctions are no longer relevant.",
                    "sid": 161,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is the case if either the context in which the disjunctive term is required is invalid, or the contexts of all but one disjunct is invalid.",
                    "sid": 162,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Why is this an interesting property?",
                    "sid": 163,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are two reasons: This knowledge reduces the search space of the algorithm computing the border of most general nogoods.",
                    "sid": 164,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And during inheritance neither the dis- junction nor the nogoods for such disjunctions need to be inherited.",
                    "sid": 165,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is most often during inheritance that a disjunction of a type becomes irrelevant in the instance.",
                    "sid": 166,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Nobody would write down a disjunction which becomes irrelevant in the instance itself.)",
                    "sid": 167,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Structure- and constraint sharing in CFS makes it necessary to keep this information because contexts of shared constraints in the type are still defined on this disjunction, i.e. the disjunction stays relevant in the type.",
                    "sid": 168,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let the only valid disjunct of d be k. The information that either the constraint can be ignored (c(d) ~ k) or the disjunction can be ignored (c(d) = k) is stored with the instantiation.",
                    "sid": 169,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The context mapping for the instantiation filters out either the whole context or the disjunction.",
                    "sid": 170,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm is extended in the following way: 4a.",
                    "sid": 171,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "if e is an input context of t and d is a disjunction specializing e and the subcontexts are also input contexts, and if all but one specialization delivers 'bad' the disjunction is irrelevant for t. All subdisjunctions of subterms other than the one which is not 'bad' are irrelevant, too.",
                    "sid": 172,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequences One consequence of the elimination of irrelevant dis- junctions during inheritance is, that an efficient implementation of contexts by bitvectors (as proposed in e.g. [de Kleer, 1986]) with a simple shift operation for context mappings will waste a lot of space.",
                    "sid": 173,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Either sparse coding of these bit vectors or a difficult compactifying context mapping is required.",
                    "sid": 174,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sparse coding are just vectors of pairs of disjunction names and choices.",
                    "sid": 175,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Maybe someone finds a good solution to this problem.",
                    "sid": 176,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless the context mapping is not consuming much of the resources, and the elimination of irrelevant disjunctions is worth it.",
                    "sid": 177,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Conclusion.",
                    "sid": 178,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the tasks outlined in the first part, the efficient treatment of disjunctions and inheritance, we introduced contexts.",
                    "sid": 179,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Contexts have been defined on the basis of a set theoretic semantics for CFS feature structures, such that they describe the space of possible unification conflicts adequately.",
                    "sid": 180,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The unification formalism of CFS computes a set of nogood contexts, from which the algorithm outlined in the third part computes the border of most general nogood contexts, which is also important for inspection and output.",
                    "sid": 181,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clearly we cannot find a polynomial algorithm for an exponential problem (number of possible no- goods), but by elaborated techniques we can reduce the effort exponentially in order to get usable systems in the practical case.",
                    "sid": 182,
                    "ssid": 121,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}