{
    "ID": "E99-1001",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "It is often claimed that Named Entity recognition systems need extensive gazetteers--lists of names of people, or- ganisations, locations, and other named entities.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, the compilation of such gazetteers is sometimes mentioned as a bottleneck in the design of Named Entity recognition systems.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We report on a Named Entity recognition system which combines rule-based grammars with statistical (maximum entropy) models.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We report on the system's performance with gazetteers of different types and different sizes, using test material from the MUC7 competition.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that, for the text type and task of this competition, it is sufficient to use relatively small gazetteers of well-known names, rather than large gazetteers of low-frequency names.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We conclude with observations about the domain independence of the competition and of our experiments.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Named Entity recognition involves processing a text and identifying certain occurrences of words or expressions as belonging to particular categories of Named Entities (NE).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NE recognition software serves as an important preprocessing tool for tasks such as information extraction, information retrieval and other text processing applications.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What counts as a Named Entity depends on the application that makes use of the annotations.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One such application is document retrieval or automated document forwarding: documents an-noted with NE information can be searched more \"Now also at Harlequin Ltd.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Edinburgh office) accurately than raw text.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, NE annotation allows you to search for all texts that mention the company \"Philip Morris\", ignoring documents about a possibly unrelated person by the same name.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Or you can have all documents forwarded to you about a person called \"Gates\", without receiving documents about things called gates.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a document collection annotated with Named Entity information you can more easily find documents about Java the programming language without getting documents about Java the country or Java the coffee.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most common among marked categories are names of people, organisations and locations as well as temporal and numeric expression.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here is an example of a text marked up with Named Entity information: <ENAMEX TYPE='PERSON' >Flavel Donne</ENAMEX> is an analyst with <ENAMEX TYPE= 'ORGANIZATION ' >General Trends </ENAMEX>, which has been based in <ENAMEX TYPE='LOCATION'>Little Spring</ENAMEX> since <TIMEX TYPE='DATE' >July 1998</TIMEX>.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In an article on the Named Entity recognition competition (part of MUC6)Sundheim (1995) remarks that \"common organization names, first names of people and location names can be handled by recourse to list lookup, although there are drawbacks\" (Sundheim 1995: 16).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, participants in that competition from the University of Durham (Morgan et al., 1995) and from SRA (Krupka, 1995) report that gazetteers did not make that much of a difference to their system.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, in a recent article Cucchiarelli et al.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1998) report that one of the bottlenecks in designing NE recognition systems is the limited availability of large gazetteers, particularly gazetteers for different languages (Cucchiarelli et al. 1998: 291).",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "People also use gazetteers of very different sizes.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic gazetteers in the Iso- quest system for MUC°7 contain 110,000 names, but Krupka and Hausman (1998) show that system performance does not degrade much when the gazetteers are reduced to 25,000 and 9,000 names; conversely, they also show that the addition of an extra 42 entries to the gazetteers improves performance dramatically.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This raises several questions: how important are gazetteers?",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is it important that they are big?",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "if gazetteers are important but their size isn't, then what are the criteria for building gazetteers?",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One might think that Named Entity recognition could be done by using lists of (e.g.) names of people, places and organisations, but that is not the case.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To begin with, the lists would be huge: it is estimated that there are 1.5 million unique surnames just in the U.S. It is not feasible to list all possible surnames in the world in a Named Entity recognition system.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is a similar problem with company names.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A list of all current companies worldwide would be huge, if at all available, and would immediately be out of date since new companies are formed all the time.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, company names can occur in variations: a list of company names might contain \"The Royal Bank of Scotland plc\", but that company might also be referred to as \"The Royal Bank of Scotland\", \"The Royal\" or \"The Royal plc\".",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These variations would all have to be listed as well.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even if it was possible to list all possible or ganisations and locations and people, there would still be the problem of overlaps between the lists.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Names such as Emerson or Washington could be names of people as well as places; Philip Morris could be a person or an organisation.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, such lists would also contain words like \"Hope\" and \"Lost\" (locations) and \"Thinking Machines\" and \"Next\" (companies), whereas these words could also occur in contexts where they don't refer to named entities.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, names of companies can be complex entities, consisting of several words.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Especially where conjunctions are involved, this can create problems.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In \"China International Trust and Investment Corp decided to do something\", it's not obvious whether there is a reference here to one company or two.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the sentence \"Mason, Daily and Partners lost their court case\" it is clear that \"Mason, Daily and Partners\" is the name of a company.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the sentence \"Unfortunately, Daily and Partners lost their court case\" the name of the company does not include the word \"unfortunately\", but it still includes the word \"Daily\", which is just as common a word as \"unfortunately\".",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we report on a Named Entity recognition system which was amongst the highest scoring in the recent MUC7 Message Understanding Conference/Competition (MUC).",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the features of our system is that even when it is run without any lists of name.,; of organisations or people it still performs at a level comparable to that of many other MUC-systems.",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We report on experiments which show the di[fference in performance between the NE system with gazetteers of different sizes for three types of named entities: people, organisations and locations.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the muc competition. ",
            "number": "2",
            "sents": [
                {
                    "text": "The MUC competition for which we built our system took place in March 1998.",
                    "sid": 43,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prior to the competition, participants received a detailed coding manual which specified what should and should not be marked up, and how the markup should proceed.",
                    "sid": 44,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They also received a few hundred articles from the New York Times Service, marked up by the organisers according to the rules of the coding manual.",
                    "sid": 45,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the competition itself, participants received 100 articles.",
                    "sid": 46,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They then had 5 days to perform the chosen information extraction tasks (in our case: Named Entity recognition) without human intervention, and markup the text with the Named Entities found.",
                    "sid": 47,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting marked up file then had to be returned to the organisers for scoring.",
                    "sid": 48,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Scoring of the results is done automatically by the organisers.",
                    "sid": 49,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The scoring software compares a participant's answer file against a carefully prepared key file; the key file is considered to be the \"correctly\" annotated file.",
                    "sid": 50,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Amongst many other things, the scoring software calculates a system's recall and precision scores: Recall: Number of correct tags in the answer file over total number of tags in the key file.",
                    "sid": 51,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Precision: Number of correct tags in the answer file over total number of tags in the answer file.",
                    "sid": 52,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recall and precision are generally accepted ways of measuring system performance in this field.",
                    "sid": 53,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, suppose you have a text which is 1000 words long, and 20 of these words express a location.",
                    "sid": 54,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now imagine a system which assigns the LOCATION tag to every single word in the text.",
                    "sid": 55,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This system will have tagged correctly all 20 locations, since it tagged everything as LOCATION; its recall score is 20/20, or 100%.",
                    "sid": 56,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But of the 1000 LOCATION tags it assigned, only those 20 were correct; its precision is therefore only 20/1000, or 2%.",
                    "sid": 57,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "category learned lists common lists combined lists recall I precision recall lprecision recall lprecision organization 49 75 3 51 50 72 person 26 92 31 81 47 85 location 76 93 74 94 86 90 Figure 1: NE recognition with simple list lookup.",
                    "sid": 58,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "finding named entities. ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 A simple system We decided first to test to what extent NE recognition can be carried out merely by recourse to list lookup.",
                    "sid": 59,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such a system could be domain and language independent.",
                    "sid": 60,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It would need no grammars or even information about tokenization but simply mark up known strings in the text.",
                    "sid": 61,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of course, the development and maintenance of the name lists would become more labour intensive.",
                    "sid": 62,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Palmer and Day, 1997) evaluated the performance of such a minimal NE recognition system equipped with name lists derived from MUC6 training texts.",
                    "sid": 63,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system was tested on news- wire texts for six languages.",
                    "sid": 64,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It achieved a recall rate of about 70% for Chinese, Japanese and Portuguese and about 40% for English and French.",
                    "sid": 65,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The precision of the system was not calculated but can be assumed to be quite high because it would only be affected by cases where a capitalized word occurs in more than one list (e.g. \"Columbia\" could occur in the list of organisations as well as locations) or where a capitalised word occurs in a list but could also be something completely different (e.g. \"Columbia\" occurs in the list of locations but could also be the name of a space shuttle).",
                    "sid": 66,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We trained a similar minimal system using the MUC7 training data (200 articles) and ran it on the test data set (100 articles).",
                    "sid": 67,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus we used in our experiments were the training and test corpora for the MUC7 evaluation.",
                    "sid": 68,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the training data we collected 1228 person names, 809 names of organizations and 770 names of locations.",
                    "sid": 69,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting name lists were the only resource used by the minimal NE recognition system.",
                    "sid": 70,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It nevertheless achieved relatively high precision (around 90%) and recall in the range 4070%.",
                    "sid": 71,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are summarised in Figure 1 in the \"learned lists\" column.",
                    "sid": 72,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Despite its simplicity, this type of system does presuppose the existence of training texts, and these are not always available.",
                    "sid": 73,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To cope with the absence of training material we designed and tested another variation of the minimal system.",
                    "sid": 74,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of collecting lists from training texts we instead collected lists of commonly known entities-- we collected a list of 5000 locations (countries and American states with their five biggest cities) from the CIA World Fact Book, a list of 33,000 organization names (companies, banks, associations, universities, etc.) from financial Web sites, and a list of 27,000 famous people from several websites.",
                    "sid": 75,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of this run can be seen in Figure 1 in the \"common lists\" column.",
                    "sid": 76,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In essence, this system's performance was comparable to that of the system using lists from the training set as far as location was concerned; it performed slightly worse on the person category and performed badly on organisations.",
                    "sid": 77,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a final experiment we combined the two gazetteers, the one induced from the training texts with the one acquired from public resources, and achieved some improvement in recall at the expense of precision.",
                    "sid": 78,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of this test run are given in the \"combined lists\" column in Figure 1.",
                    "sid": 79,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can conclude that the pure list lookup approach performs reasonably well for locations (precision of 9094%; recall of 7585%).",
                    "sid": 80,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the person category and especially for the organization category this approach does not yield good performance: although the precision was not extremely bad (around 7585%), recall was too low (lower than 50%)--i.e. every second person name or organization failed to be assigned.",
                    "sid": 81,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For document retrieval purposes low recall is not necessarily a major problem since it is often sufficient to recognize just one occurrence of each distinctive entity per document, and many of the unassigned person and organization names were just repetitions of their full variants.",
                    "sid": 82,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But for many other applications, and for the MUC competition, higher recall and precision are necessary.",
                    "sid": 83,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Combining rules and statistics The system we fielded for MUC7 makes extensive use of what McDonald (1996) calls internal (phrasal) and external (contextual) evidence.",
                    "sid": 84,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "in named entity recognition.",
                    "sid": 85,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic philosophy underlying our approach is as follows.",
                    "sid": 86,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Context Rule Assign Example Xxxx+ is? a? JJ* PROF PERS Yuri Gromov, a former director Xxxx+ is? a? JJ* KEL PERS John White is beloved brother Xxxx+ himself PERS White himself Xxxx+, DD+, PERS White, 33, shares in Xxxx+ 0RG shares in Trinity Motors PROF of/at/with Xxxx+ 0RG director of Trinity Motors Xxxx+ area L0C Beribidjan area Figure 2: Examples of surefire transduction material for NE.",
                    "sid": 87,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Xxxx+ is a sequence of capitalized words; DD is a digit; PROF is a profession; REL is a relative; J J* is a sequence of zero or more adjectives; LOC is a known location.",
                    "sid": 88,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "string of words like \"Adam Kluver\" has an internal (phrasal) structure which suggests that this is a person name; but we know that it can also be used as a shortcut for a name of organization (\"Adam Kluver Ltd.\") or location (\"Adam Kluver Country Park\").",
                    "sid": 89,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Looking it up on a list will not necessarily help: the string may not be on a list, may be on more than one list, or may be on the wrong list.",
                    "sid": 90,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, somewhere in the text, there is likely to be some contextual material which makes it clear what type of named entity it is. Our strategy is to only make a decision once we have identified this bit of contextual information.",
                    "sid": 91,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We further assume that, once we have identified contextual material which makes it clear that \"Adam Kluver\" is (e.g.) the name of a company, then any other mention of \"Adam Kluver\" in that document is likely to refer to that company.",
                    "sid": 92,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the author at some point in the same text also wants to refer to (e.g.) a person called \"Adam Kluver\", s/he will provide some extra context to make this clear, and this context will be picked up in the first step.",
                    "sid": 93,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fact that at first it is only an assumption rather than a certainty that \"Adam Kluver\" is a company, is represented explicitly, and later processing components try to resolve the uncertainty.",
                    "sid": 94,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If no suitable context is found anywhere in the text to decide what sort of Named Entity \"Adam Kluver\" is, the system can check other resources, e.g. a list of known company names and apply compositional phrasal grammars for different categories.",
                    "sid": 95,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such grammars for instance can state that if a sequence of capitalized words ends with the word \"Ltd.\" it is a name of organization or if a known first name is followed by an unknown capitalized word this is a person name.",
                    "sid": 96,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our MUC system, we implemented this approach as a staged combination of a rule-based system with probabilistic partial matching.",
                    "sid": 97,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describe each stage in turn.",
                    "sid": 98,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Step 1.",
                    "sid": 99,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Surefire Rules.",
                    "sid": 100,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first step, the system applies surefire grammar rules.",
                    "sid": 101,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These rules combine internal and external evidence, and only fire when a possible candidate expression is surrounded by a suggestive context.",
                    "sid": 102,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Surefire rules rely on known corporate designators (Ltd., Inc., etc.), person titles (Mr., Dr., Sen.), and definite contexts such as those in Figure 2.",
                    "sid": 103,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The surefire rules apply after POS tagging and simple semantic tagging, so at this stage words like \"former\" have already been identified as JJ (adjective), words like \"analyst\" have been identified as PROF (professions), and words like \"brother\" as REL (relatives).",
                    "sid": 104,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At this stage our MUC system treats information from the lists as likely rather than definite and always checks if the context is either suggestive or non-contradictive.",
                    "sid": 105,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, a likely company name with a conjunction (e.g. \"China International Trust and Investment Corp\") is left untagged at this stage if the company is not listed in a list of known companies.",
                    "sid": 106,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, the system postpones the markup of unknown organizations whose name starts with a sentence initial common word, as in \"Suspended Ceiling Contractors Ltd denied the charge\".",
                    "sid": 107,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Names of possible locations found in our gazetteer of place names are marked as LOCATION only if they appear with a context that is suggestive of location.",
                    "sid": 108,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"Washington\", for example, can just as easily be a surname or the name of an organization.",
                    "sid": 109,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only in a suggestive context, like \"in Washington\", will it be marked up as location.",
                    "sid": 110,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Step 2.",
                    "sid": 111,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Partial Match 1 After the surefire symbolic transduction the system performs a probabiiistic partial match of the.",
                    "sid": 112,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "identified entities.",
                    "sid": 113,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the system collects all named entities already identified in the document.",
                    "sid": 114,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the composing words preserving their order, and marks them if found elsewhere in the text.",
                    "sid": 115,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, if \"Adam Kluver Ltd\" had already been recognised as an organisation by the surefire rule, in this second step any occurrences of \"Kluver Ltd\", \"Adam Ltd\" and \"Adam Kluver\" are also tagged as possible organizations.",
                    "sid": 116,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This assignment, however, is not definite since some of these words (such as \"Adam\") could refer to a different entity.",
                    "sid": 117,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This information goes to a pre-trained maximum entropy model (see Mikheev (1998) for more details on this aproach).",
                    "sid": 118,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This model takes into account contextual information for named entities, such as their position in the sentence, whether they exist in lowercase in general, whether they were used in lowercase elsewhere in the same document, etc. These features are passed to the model as attributes of the partially matched words.",
                    "sid": 119,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the model provides a positive answer for a partial match, the system makes a definite assignment.",
                    "sid": 120,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.5 Step 3.",
                    "sid": 121,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rule Relaxation.",
                    "sid": 122,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once this has been done, the system again applies the grammar rules.",
                    "sid": 123,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But this time the rules have much more relaxed contextual constraints and extensively use the information from already existing markup and from the lexicon compiled during processing, e.g. containing partial orders of already identified named entities.",
                    "sid": 124,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At this stage the system will mark word sequences which look like person names.",
                    "sid": 125,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this it uses a grammar of names: if the first capitalized word occurs in a list of first names and the following word(s) are unknown capitalized words, then this string can be tagged as a PERSON.",
                    "sid": 126,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that it is only at this late stage that a list of names is used.",
                    "sid": 127,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At this point we are no longer concerned that a person name can refer to a company.",
                    "sid": 128,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the name grammar had applied earlier in the process, it might erroneously have tagged \"Adam Kluver\" as a PERSON instead of an ORGANIZATION.",
                    "sid": 129,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But at this point in the chain of N~.",
                    "sid": 130,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "processing, that is not a problem anymore: \"Adam Kluver\" will by now already have been identified as an ORGANIZATION by the surefire rules or during partial matching.",
                    "sid": 131,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If it hasn't, then it is likely to be the name of a person.",
                    "sid": 132,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At this stage the system will also attempt to resolve conjunction problems in names of organisations.",
                    "sid": 133,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in \"China International Trust and Investment Corp\", the system checks if possible parts of the conjunctions were used in the text on their own and thus are names of different organizations; if not, the system has no reason to assume that more than one company is being In a similar vein, the system resolves the attachment of sentence initial capitalized modifiers, the problem alluded to above with the \"Suspended Ceiling Contractors Ltd\" example: if the modifier was seen with the organization name elsewhere in the text, then the system has good evidence that the modifier is part of the company name; if the modifier does not occur anywhere else in the text with the company name, it is assumed not to be part of it.",
                    "sid": 134,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This strategy is also used for expressions like \"Murdoch's News Corp'.",
                    "sid": 135,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The genitival \"Murdoch's\" could be part of the name of the organisation, or could be a possessive.",
                    "sid": 136,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further inspection of the text reveals that Rupert Murdoch is referred to in contexts which support a person interpretation; and \"News Corp\" occurs on its own, without the genitive.",
                    "sid": 137,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the basis of evidence like this, the system decides that the name of the organisation is \"News Corp', and that \"Murdoch\" should be tagged separately as a person.",
                    "sid": 138,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At this stage known organizations and locations from the lists available to the system are marked in the text, again without checking the context in which they occur.",
                    "sid": 139,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.6 Step 4.",
                    "sid": 140,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Partial Match 2 At this point, the system has exhausted its resources (rules about internal and external evidence for named entities, as well as its gazetteers).",
                    "sid": 141,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system then performs another partial match to annotate names like \"White\" when \"James White\" had already been recognised as a person, and to annotate company names like \"Hughes\" when \"Hughes Communications Ltd.\" had already been identified as an organisation.",
                    "sid": 142,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in Partial Match 1, this process of partial matching is again followed by a probabilistic assignment supported by the maximum entropy model.",
                    "sid": 143,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, conjunction resolution makes use of the fact that in this type of text it is more common to have conjunctions of like entities.",
                    "sid": 144,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In \"he works for Xxx and Yyy\", if there is evidence that Xxx and Yyy are two entities rather than one, then it is more likely that Xxx and Yyy are two entities of the same type, i.e. both organisations or are both people, rather than a mix of the two.",
                    "sid": 145,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that, even if only one of the entities in the conjunction has been recognised as definitely of a certain type, the conjunction rule will help decide on the type of the other entity.",
                    "sid": 146,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the texts in the competition contained the string \"UTited States and Russia\".",
                    "sid": 147,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of the typo.",
                    "sid": 148,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "in \"UTited States\", it wasn't found in a gazetteer.",
                    "sid": 149,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But there was internal evidence that it could be Stage Surefire Rules Partial Match 1 Relaxed Rules Partial Match 2 Title Assignment ORGANIZATION PERSON LOCATION R: 42 P: 98 R: 75 P: 98 R: 83 P: 96 R: 85 P: 96 R: 91 P: 95 R: 40 P: 99 R: 80 P: 99 R: 90 P: 98 R: 93 P: 97 R: 95 P: 97 R: 36 P: 96 R: 69 P: 93 R: 86 P: 93 R: 88 P: 93 R: 95 P: 93 Figure 3: Scores obtained by the system through different stages of the analysis.",
                    "sid": 150,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "R - recall P - precision.",
                    "sid": 151,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a location (the fact that it contained the word \"States\"); and there was external evidence that it could be a location (the fact that it occurred in a conjunction with \"Russia\", a known location).",
                    "sid": 152,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These two facts in combination meant that the system correctly identified \"UTited States\" as a location.",
                    "sid": 153,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.7 Step 5.",
                    "sid": 154,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Title Assignment.",
                    "sid": 155,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because titles of news wires are in capital letters, they provide little guidance for the recognition of names.",
                    "sid": 156,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the final stage of NE processing, entities in the title are marked up, by matching or partially matching the entities found in the text, and checking against a maximum entropy model trained on document titles.",
                    "sid": 157,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in \"GENERAL TRENDS ANALYST PREDICTS LITTLE SPRING EXPLOSION\" \"GENERAL TRENDS\" will be tagged as an organization because it partially matches \"General Trends Inc\" elsewhere in the text, and \"LITTLE SPRING\" will be tagged as a location because elsewhere in the text there is supporting evidence for this hypothesis.",
                    "sid": 158,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the headline \"MURDOCH SATELLITE EXPLODES ON TAKEOFF\", \"Murdoch\" is correctly identified as a person because of mentions of Rupert Murdoch elsewhere in the text.",
                    "sid": 159,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Applying a name grammar on this kind of headline without checking external evidence might result in erroneously tagging \"MURDOCH SATELLITE\" as a person (because \"Murdoch\" is also a first name, and \"Satellite\" in this headline starts with a capital letter).",
                    "sid": 160,
                    "ssid": 102,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "muc results. ",
            "number": "4",
            "sents": [
                {
                    "text": "In the MUC competition, our system's combined precision and recall score was 93.39%.",
                    "sid": 161,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This was the highest score, better in a statistically significant way than the score of the next best system.",
                    "sid": 162,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Scores varied from 93.39% to 69.67%.",
                    "sid": 163,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further details on this can be found in (Mikheev et al., 1998).",
                    "sid": 164,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The table in Figure 3 shows the progress of the performance of the system we fielded for the MUC competition through the five stages.",
                    "sid": 165,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As one would expect, the surefire rules give very high precision (around 9698%), but very low recall--in other words, they don't find many named entities, but the ones they find are correct.",
                    "sid": 166,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subsequent phases of processing add gradually more and more named entities (recall increases from around 40% to around 90%), but on occasion introduce errors (resulting in a slight drop in precision).",
                    "sid": 167,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our final score for 0RGhNISATION, PERSON and LOCATION is given in the bottom line of Figure 3.",
                    "sid": 168,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the role of gazetteers. ",
            "number": "5",
            "sents": [
                {
                    "text": "Our system fielded for the MUC competition made extensive use of gazetteers, containing around 4,900 names of countries and other place names, some 30,000 names of companies and other organ° isations, and around 10,000 first names of people.",
                    "sid": 169,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As explained in the previous section, these lists were used in a judicious way, taking into account other internal and external evidence before making a decision about a named entity.",
                    "sid": 170,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only in step 3 is information from the gazetteers used without context-checking.",
                    "sid": 171,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not immediately obvious from Figure 3 what exactly the impact is of these gazetteers.",
                    "sid": 172,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To try and answer this question, we ran our system over 70 articles of the MUC competition in different modes; the remaining 30 articles were used to compile a limited gazetteer as described below and after that played no role in the experiments.",
                    "sid": 173,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Full gazetteers.",
                    "sid": 174,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first ran the system again with the full gazetteers, i.e. the gazetteers used in the official MUC system.",
                    "sid": 175,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are minor differences in Recall and Precision compared to the official MUC results, due to the fact that we were using a slightly different (smaller) corpus.",
                    "sid": 176,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No gazetteers.",
                    "sid": 177,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then ran the system without any gazetteers.",
                    "sid": 178,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this mode, the system can still use internal evidence (e.g. indicators such as \"Mr\" for people or \"Ltd\" for organisations) as well as external evidence (contexts such as \"XXX, the chairman of YYY\" as evidence that XXX is a person and YYY an organisation).",
                    "sid": 179,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hypothesis was that names of organisations Full gazetteer Ltd gazetteer Some locations No gazetteers recall prec'n recall prec'n recall prec'n recall prec'n organisation 90 93 87 90 87 89 86 85 person 96 98 92 97 90 97 90 95 location 95 94 91 92 85 90 46 59 Figure 4: Our MUC system with extensive gazetteers, with limited gazetteers, with short list of locations, and without gazetteers, tested on 70 articles from the MUC7 competition.",
                    "sid": 180,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and names of people should still be handled relatively well by the system, since they have much internal and external evidence, whereas names of locations have fewer reliable contextual clues.",
                    "sid": 181,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, expressions such as \"XXX is based in YYY\" is not surefire evidence that YYY is a location -it could also be an organisation.",
                    "sid": 182,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And since many locations are so well-known, they receive very little extra context (\"in China\", \"in Paris\", vs \"in the small town of Ekeren\").",
                    "sid": 183,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some locations.",
                    "sid": 184,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then ran the system with some locational information: about 200 names of countries and continents from www.",
                    "sid": 185,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "yahoo, corn/ Regional/and, because MUC rules say explicitly that names of planets should be marked up as locations, the names of the 8 planets of our solar system.",
                    "sid": 186,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hypothesis was that even with those reasonably common location names, Named Entity recognition would already dramatically improve.",
                    "sid": 187,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This hypothesis was confirmed, as can be seen in Figure 4.",
                    "sid": 188,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inspection of the errors confirms that the system makes most mistakes when there is no internal or external evidence to decide what sort of Named Entity is involved.",
                    "sid": 189,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in a reference to \"a Hamburg hospital\", \"Hamburg\" no longer gets marked up as a location, because the word occurs nowhere else in the text, and that context is not sufficient to assume it indicates a location (cf.",
                    "sid": 190,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a Community Hospital, a Catholic Hospital, an NHS Hospital, a Trust-Controlled Hospital, etc).",
                    "sid": 191,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, in a reference to \"the Bonn government\", \"Bonn\" is no longer marked up as a location, because of lack of supportive context (cf.",
                    "sid": 192,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the Clinton government, the Labour government, etc).",
                    "sid": 193,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And in financial newspaper articles NYSE will be used without any indication that this is an organisation (the New York Stock Exchange).",
                    "sid": 194,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Limited gazetteers.",
                    "sid": 195,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results so far suggest that the most useful gazetteers are those that contain very common names, names which the authors can expect their audience already to know about, rather than far-fetched examples of little known places or organisations.",
                    "sid": 196,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that it should be possible to tune a system to the kinds of Named Entities that occur in its particular genre of text.",
                    "sid": 197,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To test this hypothesis, we wanted to know how the system would perform if it started with no gazetteers, started processing texts, then built up gazetteers as it goes along, and then uses these gazetteers on a new set of texts in the same domain.",
                    "sid": 198,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We simulated these conditions by taking 30 of the 100 official MUC articles and extracting all the names of people, organisations and locations and using these as the only gazetteers, thereby ensuring that we had extracted Named Entities from articles in the same domain as the test domain.",
                    "sid": 199,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since we wanted to test how easy it was to build gazetteers automatically, we wanted to minimise the amount of processing done on Named Entities already found.",
                    "sid": 200,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We decided to only used first names of people, and marked them all as \"likely\" first names: the fact that \"Bill\" actually occurs as a first name does not guarantee it will definitely be a first name next time you see it.",
                    "sid": 201,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Company names found in the 30 articles were put in the company gazetteer, irrespective of whether they were full company names (e.g. \"MCI Communications Cor- p\" as well as \"MCI\" and \"MCI Communications\").",
                    "sid": 202,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Names of locations found in the 30 texts were simply added to the list of 200 location names already used in the previous experiments.",
                    "sid": 203,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hope was that, despite the little effort involved in building these limited gazetteers, there would be an improved performance of the Named Entity recognition system.",
                    "sid": 204,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 4 summarises the Precision and Recall results for each of these modes and confirms the hypotheses.",
                    "sid": 205,
                    "ssid": 37,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discussion. ",
            "number": "6",
            "sents": [
                {
                    "text": "The hypotheses were correct: without gazetteers the system still scores in the high eighties for names of orga~isations and people.",
                    "sid": 206,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Locations come out badly.",
                    "sid": 207,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But even with a very small number of country names performance for those named entities also goes up into the mid- eighties.",
                    "sid": 208,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And simple techniques for extending the gazetteers on the basis of a sample of just 30 articles already makes the system competitive again.",
                    "sid": 209,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These experiments suggest that the collection of gazetteers need not be a bottleneck: through a judicious use of internal and external evidence relatively small gazetteers are sufficient to give good Precision and Recall.",
                    "sid": 210,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, when collecting these gazetteers one can concentrate on the obvious examples of locations and organisations, since these are exactly the ones that will be introduced in texts without much helpful context.",
                    "sid": 211,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, our experiments only show the usefulness of gazetteers on a particular type of text, viz.",
                    "sid": 212,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "journalistic English with mixed case.",
                    "sid": 213,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rules as well as the maximum entropy models make use of internal and external evidence in that type of text when trying to identify named entities, and it is obvious that this system cannot be applied without modification to a different type of text, e.g. scientific articles.",
                    "sid": 214,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Without further formal evaluations with externally supplied evaluation corpora it is difficult to judge how general this text type is. It is encouraging to note that Krupka and Hausman (1998) point out that the MUC7 articles which we used in our experiments have less external evidence than do Wall Street Journal articles, which suggests that on Wall Street Journal articles our system might perform even better than on MUC7 articles.",
                    "sid": 215,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "The work reported in this paper was supported in part by grant GR/L21952 (Text Tokenisation Tool) from the Engineering and Physical Sciences Research Council, UK.",
                    "sid": 216,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would like to thank Steve Finch and Irina Nazarova as well as Colin Matheson and other members of the Language Technology Group for help in building various tools and other resources that were used in the development of the MUC system.",
                    "sid": 217,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}