{
    "ID": "H01-1062",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper gives an overview of our work on statistical machine translation of spoken dialogues, in particular in the framework of the Verbmobil project.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The goal of the Verbmobil project is the translation of spoken dialogues in the domains of appointment scheduling and travel planning.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Starting with the Bayes decision rule as in speech recognition, we show how the required probability distributions can be structured into three parts: the language model, the alignment model and the lexicon model.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describe the components of the system and report results on the Verbmobil task.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experience obtained in the Verbmobil project, in particular a large-scale end-to-end evaluation, showed that the statistical approach resulted in significantly lower error rates than three competing translation approaches: the sentence error rate was 29% in comparison with 52% to 62% for the other translation approaches.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "In comparison with written language, speech and especially spontaneous speech poses additional difficulties for the task of automatic translation.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typically, these difficulties are caused by errors of the recognition process, which is carried out before the translation process.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, the sentence to be translated is not necessarily well-formed from a syntactic point-of-view.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even without recognition errors, speech translation has to cope with a lack of conventional syntactic structures because the structures of spontaneous speech differ from that of written language.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The statistical approach shows the potential to tackle these problems for the following reasons.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the statistical approach is able to avoid hard decisions at any level of the translation process.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, for any source sentence, a translated sentence in the target language is guaranteed to be generated.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In most cases, this will be hopefully a syntactically perfect sentence in the target language; but even if this is not the case, in most cases, the translated sentence will convey the meaning of the spoken sentence.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whereas statistical modelling is widely used in speech recognition, there are so far only a few research groups that apply statistical modelling to language translation.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The presentation here is based on work carried out in the framework of the EuTrans project [8] and the Verbmobil project [25].",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "statistical\tdecision\ttheory. ",
            "number": "2",
            "sents": [
                {
                    "text": "AND LINGUISTICS 2.1 The Statistical Approach.",
                    "sid": 16,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of statistics in computational linguistics has been extremely controversial for more than three decades.",
                    "sid": 17,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The controversy is very well summarized by the statement of Chomsky in 1969 [6]: “It must be recognized that the notion of a ‘probability of a sentence’ is an entirely useless one, under any interpretation of this term”.",
                    "sid": 18,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This statement was considered to be true by the majority of experts from artificial intelligence and computational linguistics, and the concept of statistics was banned from computational linguistics for many years.",
                    "sid": 19,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What is overlooked in this statement is the fact that, in an automatic system for speech recognition or text translation, we are faced with the problem of taking decisions.",
                    "sid": 20,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is exactly here where statistical decision theory comes in.",
                    "sid": 21,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In speech recognition, the success of the statistical approach is based on the equation: Speech Recognition = Acoustic–Linguistic Modelling + Statistical Decision Theory Similarly, for machine translation, the statistical approach is expressed by the equation: Machine Translation = Linguistic Modelling + Statistical Decision Theory For the ‘low-level’ description of speech and image signals, it is widely accepted that the statistical framework allows an efficient coupling between the observations and the models, which is often described by the buzz word ‘subsymbolic processing’.",
                    "sid": 22,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But there is another advantage in using probability distributions in that they offer an explicit formalism for expressing and combining hypothesis scores: • The probabilities are directly used as scores: These scores are normalized, which is a desirable property: when increasing the score for a certain element in the set of all hypotheses, there must be one or several other elements whose scores are reduced at the same time.",
                    "sid": 23,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• It is straightforward to combine scores: depending on the task, the probabilities are either multiplied or added.",
                    "sid": 24,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Weak and vague dependencies can be modelled easily.",
                    "sid": 25,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Especially in spoken and written natural language, there are nuances and shades that require ‘grey levels’ between 0 and 1.",
                    "sid": 26,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Source Language Text Transformation J 1 Global Search: 1 1 I J I 2.2 Bayes Decision Rule and.",
                    "sid": 27,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "maximize Pr( e 1 ) I Pr( f 1 | e 1 ) System Architecture In machine translation, the goal is the translation of a text given in a source language into a target language.",
                    "sid": 28,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We over e 1 Pr( e I ) Language Model are given a source string f J = f ...f ...f , which is to be 1 1 j Jtranslated into a target string eI = e ...e ...e . In this arti 1 1 i I Transformation cle, the term word always refers to a full-form word.",
                    "sid": 29,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among all possible target strings, we will choose the string with the highest probability which is given by Bayes decision rule [5]: Target Language Text eˆI = arg max {P r(eI |f J )} 1 1 1 I 1 Figure 1: Architecture of the translation approach = arg max {P r(eI ) · P r(f J |eI )} . 1 1 1 I 1 Here, P r(eI ) is the language model of the target language, and P r(f J |eI ) is the string translation model which will be based on Bayes decision rule.",
                    "sid": 30,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 1 decomposed into lexicon and alignment models.",
                    "sid": 31,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The argmax operation denotes the search problem, i.e. the generation of the output sentence in the target language.",
                    "sid": 32,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall architecture of the statistical translation approach is sum To arrive at a quantitative specification, we define the alignment mapping: j → i = aj , which assigns a word fj in position j to a word ei in position i = aj . We rewrite the probability for the translation model by introducing the marized in Figure 1.",
                    "sid": 33,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘hidden’ alignments aJ := a ...a ...a for each sentence pair 1 1 j J In general, as shown in this figure, there may be additional (f J ;eI ).",
                    "sid": 34,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To structure this probability distribution, we fac transformations to make the translation task simpler for the algorithm.",
                    "sid": 35,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The transformations may range from the categorization of single words and word groups to more complex preprocessing steps that require some parsing of the source torize it over the positions in the source sentence and limit the alignment dependencies to a first-order dependence: J P r(f J I string.",
                    "sid": 36,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have to keep in mind that in the search procedure both the language and the translation model are applied af 1 |e1 ) = p(J |I ) · [p(aj |aj−1 , I , J ) · p(fj |eaj )] . J j=1 1 ter the text transformation steps.",
                    "sid": 37,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, to keep the notation simple, we will not make this explicit distinction in the subsequent exposition.",
                    "sid": 38,
                    "ssid": 23,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "alignment modelling. ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 Concept.",
                    "sid": 39,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A key issue in modelling the string translation probabil Here, we have the following probability distributions: • the sentence length probability: p(J |I ), which is included here for completeness, but can be omitted without loss of performance; • the lexicon probability: p(f |e); • the alignment probability: p(aj |aj−1 , I , J ).ity P r(f J |eI ) is the question of how we define the corre By making the alignment probability p(a |a, I , J ) depen 1 1 j j−1 spondence between the words of the target sentence and the words of the source sentence.",
                    "sid": 40,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In typical cases, we can assume a sort of pairwise dependence by considering all word pairs (fj , ei ) for a given sentence pair (f J ; eI ).",
                    "sid": 41,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we will dent on the jump width aj − aj−1 instead of the absolute positions aj , we obtain the so-called homogeneous hidden Markov model, for short HMM [24].",
                    "sid": 42,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can also use a zero-order model p(a |j, I , J ), where 1 1 j further constrain this model by assigning each source word there is only a dependence on the absolute position index j to exactly one target word.",
                    "sid": 43,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Later, this requirement will be relaxed.",
                    "sid": 44,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Models describing these types of dependencies are referred to as alignment models [5, 24].",
                    "sid": 45,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When aligning the words in parallel texts, we typically observe a strong localization effect.",
                    "sid": 46,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 illustrates this effect for the language pair German–English.",
                    "sid": 47,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In many cases, although not always, there is an additional property: over large portions of the source string, the alignment is monotone.",
                    "sid": 48,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of the source string.",
                    "sid": 49,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is the so-called model IBM2 [5].",
                    "sid": 50,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Assuming a uniform alignment probability p(aj |j, I , J ) = 1/I , we arrive at the so-called model IBM1.",
                    "sid": 51,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These models can be extended to allow for source words having no counterpart in the translation.",
                    "sid": 52,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Formally, this is incorporated into the alignment models by adding a so- called ‘empty word’ at position i = 0 to the target sentence and aligning all source words without a direct translation to this empty word.",
                    "sid": 53,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "days both on eight at it make can we if think I well ? a f t e r n o o n t h e i n o ’ c l o c k t w o , m a y b e a t n i n e t e e n t h t h e a b o u t h o w , o k a y Figure 2: Word-to-word alignment.",
                    "sid": 54,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In [5], more refined alignment models are introduced by using the concept of fertility.",
                    "sid": 55,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idea is that often a word in the target language may be aligned to several words in the source language.",
                    "sid": 56,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is the so-called model IBM3.",
                    "sid": 57,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using, in addition, first-order alignment probabilities along the positions of the source string leads us to model IBM4.",
                    "sid": 58,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although these models take one-to-many alignments explicitly into account, the lexicon probabilities p(f |e) are still based on single words in each of the two languages.",
                    "sid": 59,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In systematic experiments, it was found that the quality of the alignments determined from the bilingual training corpus has a direct effect on the translation quality [14].",
                    "sid": 60,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Alignment Template Approach.",
                    "sid": 61,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A general shortcoming of the baseline alignment models is that they are mainly designed to model the lexicon dependences between single words.",
                    "sid": 62,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we extend the approach to handle word groups or phrases rather than sin Figure 3: Example of a word alignment and of extracted alignment templates.",
                    "sid": 63,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of them must contribute in the final decision about the words in the target language.",
                    "sid": 64,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To illustrate the specific details of the search problem, we slightly change the definitions of the alignments: • we use inverted alignments as in the model IBM4 [5] which define a mapping from target to source positions rather the other way round.",
                    "sid": 65,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• we allow several positions in the source language to be covered, i.e. we consider mappings B of the form: B : i → Bi ⊂ {1, ...j, ...J } We replace the sum over all alignments by the best alignment, which is referred to as maximum approximation in speech recognition.",
                    "sid": 66,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using a trigram language model p(ei |, ei−2 , ei−1 ), we obtain the following search criterion: gle words as the basis for the alignment models [15].",
                    "sid": 67,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, a whole group of adjacent words in the source max I [p(ei |ei−1 ) · p(Bi |Bi 1 , I , J ) · p(f |e )] sentence may be aligned with a whole group of adjacent words in the target language.",
                    "sid": 68,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, the context of words tends to be explicitly taken into account, and the BI ,eI 1 1 i=1 i−2 − j i j∈Bi differences in local word orders between source and target languages can be learned explicitly.",
                    "sid": 69,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 shows some of the extracted alignment templates for a sentence pair from the Verbmobil training corpus.",
                    "sid": 70,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training algorithm for the alignment templates extracts all phrase pairs which are aligned in the training corpus up to a maximum length of 7 words.",
                    "sid": 71,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To improve the generalization capability of the alignment templates, the templates are determined for bilingual word classes rather than words directly.",
                    "sid": 72,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These word classes are determined by an automatic clustering procedure [13].",
                    "sid": 73,
                    "ssid": 35,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "search. ",
            "number": "4",
            "sents": [
                {
                    "text": "The task of the search algorithm is to generate the most likely target sentence eI of unknown length I for an observed source sentence f J . The search must make use of all three knowledge sources as illustrated by Figure 4: the alignment model, the lexicon model and the language model.",
                    "sid": 74,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All three Considering this criterion, we can see that we can build up hypotheses of partial target sentences in a bottom-to- top strategy over the positions i of the target sentence ei as illustrated in Figure 5.",
                    "sid": 75,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An important constraint for the alignment is that all positions of the source sentence should be covered exactly once.",
                    "sid": 76,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This constraint is similar to that of the travelling salesman problem where each city has to be visited exactly once.",
                    "sid": 77,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Details on various search strategies can be found in [4, 9, 12, 21].",
                    "sid": 78,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to take long context dependences into account, we use a class-based five-gram language model with backing- off.",
                    "sid": 79,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Beam-search is used to handle the huge search space.",
                    "sid": 80,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To normalize the costs of partial hypotheses covering different parts of the input sentence, an (optimistic) estimation of the remaining cost is added to the current accumulated cost as follows.",
                    "sid": 81,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each word in the source sentence, a lower bound on its translation cost is determined beforehand.",
                    "sid": 82,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using this SENTENCE IN SOURCE LANGUAGE TRANSFORMATION WORD REORDERING ALIGNMENT HYPOTHESES LEXICAL CHOICE WORD + POSITION HYPOTHESES SYNTACTIC AND SEMANTIC ANALYSIS SENTENCE HYPOTHESES SEARCH: INTERACTION OF KNOWLEDGE SOURCES TRANSFORMATION SENTENCE GENERATED IN TARGET LANGUAGE ALIGNMENT MODEL BILINGUAL LEXICON LANGUAGE MODEL KNOWLEDGE SOURCES rather long.",
                    "sid": 83,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, there is no one-to-one correspondence between source and target sentences.",
                    "sid": 84,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To achieve a one-to-one correspondence, the dialogue turns are split into shorter segments using punctuation marks as potential split points.",
                    "sid": 85,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the punctuation marks in source and target sentences are not necessarily identical, a dynamic programming approach is used to find the optimal segmentation points.",
                    "sid": 86,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of segments in the source sentence and in the test sentence can be different.",
                    "sid": 87,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The segmentation is scored using a word-based alignment model, and the segmentation with the best score is selected.",
                    "sid": 88,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This segmented corpus is the starting point for the training of translation and language models.",
                    "sid": 89,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alignment models of increasing complexity are trained on this bilingual corpus [14].",
                    "sid": 90,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A standard vocabulary had been defined for the various speech recognizers used in Verbmobil.",
                    "sid": 91,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, not all words of this vocabulary were observed in the training corpus.",
                    "sid": 92,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the translation vocabulary was extended semi-automatically by adding about 13 000 German–English word pairs from.",
                    "sid": 93,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "an online bilingual lexicon available on the web.",
                    "sid": 94,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting lexicon contained not only word-word entries, but also multi-word translations, especially for the large number of German compound words.",
                    "sid": 95,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To counteract the sparseness of the training data, a couple of straightforward rule-based preprocessing steps were applied before any other type of processing: Figure 4: Illustration of search in statistical translation.",
                    "sid": 96,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "lower bound, it is possible to achieve an efficient estimation of the remaining cost.",
                    "sid": 97,
                    "ssid": 24,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental results. ",
            "number": "5",
            "sents": [
                {
                    "text": "5.1 The Task and the Corpus.",
                    "sid": 98,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Within the Verbmobil project, spoken dialogues were recorded.",
                    "sid": 99,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These dialogues were manually transcribed and later manually translated by Verbmobil partners (Hildesheim for Phase I and Tu¨bingen for Phase II).",
                    "sid": 100,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since different human translators were involved, there is great variability in the translations.",
                    "sid": 101,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each of these so-called dialogues turns may consist of several sentences spoken by the same speaker and is sometimes i i-1 j SOURCE POSITION • categorization of proper names for persons and cities, • normalization of: – numbers, – time and date phrases, – spelling: don’t → do not,... • splitting of German compound words.",
                    "sid": 102,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 gives the characteristics of the training corpus and the lexicon.",
                    "sid": 103,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 58 000 sentence pairs comprise about half a million running words for each language of the bilingual training corpus.",
                    "sid": 104,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The vocabulary size is the number of distinct full-form words seen in the training corpus.",
                    "sid": 105,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Punctuation marks are treated as regular words in the translation approach.",
                    "sid": 106,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice the large number of word singletons, i. e. words seen only once.",
                    "sid": 107,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extended vocabulary is the vocabulary after adding the manual bilingual lexicon.",
                    "sid": 108,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Offline Results.",
                    "sid": 109,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During the progress of the Verbmobil project, different variants of statistical translation were implemented, and ex Table 1: Bilingual training corpus, recognition lexicon and translation lexicon (PM = punctuation mark).",
                    "sid": 110,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 5: Illustration of bottom-to-top search.",
                    "sid": 111,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "perimental tests were performed for both text and speech input.",
                    "sid": 112,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To summarize these experimental tests, we briefly report experimental offline results for the following translation approaches: • single-word based approach [20]; • alignment template approach [15]; • cascaded transducer approach [23]:unlike the other two-approaches, this approach re quires a semiautomatic training procedure, in which the structure of the finite state transducers is designed manually.",
                    "sid": 113,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For more details, see [23].",
                    "sid": 114,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The offline tests were performed on text input for the translation direction from German to English.",
                    "sid": 115,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The test set consisted of 251 sentences, which comprised 2197 words and 430 punctuation marks.",
                    "sid": 116,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are shown in Table 2.",
                    "sid": 117,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To judge and compare the quality of different translation approaches in offline tests, we typically use the following error measures [11]: • mWER (multi-reference word error rate): For each test sentence sk in the source language, there are several reference translations Rk = {rk1 , . . .",
                    "sid": 118,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", rknk } in the target language.",
                    "sid": 119,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each translation of the test sentence sk , the edit distances (number of substitutions, deletions and insertions as in speech recognition) to all sentences in Rk are calculated, and the smallest distance is selected and used as error measure.",
                    "sid": 120,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• SSER (subjective sentence error rate):Each translated sentence is judged by a human exam iner according to an error scale from 0.0 (semantically and syntactically correct) to 1.0 (completely wrong).",
                    "sid": 121,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both error measures are reported in Table 2.",
                    "sid": 122,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the experiments with the cascaded transducers [23] were not fully optimized yet, the preliminary results indicated that this semiautomatic approach does not generalize as well as the other two fully automatic approaches.",
                    "sid": 123,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among these two, the alignment template approach was found to work consistently better across different test sets (and also tasks different from Verbmobil).",
                    "sid": 124,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the alignment template approach was used in the final Verbmobil prototype system.",
                    "sid": 125,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.3 Disambiguation Examples.",
                    "sid": 126,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the statistical translation approach as we have presented it, no explicit word sense disambiguation is performed.",
                    "sid": 127,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, a kind of implicit disambiguation is possible due to the context information of the alignment templates and the language model as shown by the examples in Table 3.",
                    "sid": 128,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first two groups of sentences contain the Table 2: Comparison of three statistical translation approaches (test on text input: 251 sentences = 2197 words + 430 punctuation marks).",
                    "sid": 129,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "verbs ‘gehen’ and ‘annehmen’ which have different translations, some of which are rather collocational.",
                    "sid": 130,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The correct translation is only possible by taking the whole sentence into account.",
                    "sid": 131,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some improvement can be achieved by applying morpho-syntactic analysis, e.g handling of the separated verb prefixes in German [10].",
                    "sid": 132,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last two sentences show the implicit disambiguation of the temporal and spatial sense for the German preposition ‘vor’.",
                    "sid": 133,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the system has not been tailored to handle such types of disambiguation, the translated sentences are all acceptable, apart from the sentence: The meeting is to five.",
                    "sid": 134,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.4 Integration into the Verbmobil Prototype.",
                    "sid": 135,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "System The statistical approach to machine translation is embodied in the stattrans module which is integrated into the Verbmobil prototype system.",
                    "sid": 136,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We briefly review those aspects of it that are relevant for the statistical translation approach.",
                    "sid": 137,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The implementation supports the translation directions from German to English and from English to German.",
                    "sid": 138,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In regular processing mode, the stattrans module receives its input from the repair module [18].",
                    "sid": 139,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At that time, the word lattices and best hypotheses from the speech recognition systems have already been prosodically annotated, i.e. information about prosodic segment boundaries, sentence mode and accentuated syllables are added to each edge in the word lattice [2].",
                    "sid": 140,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation is performed on the single best sentence hypothesis of the recognizer.",
                    "sid": 141,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The prosodic boundaries and the sentence mode information are utilized by the stattrans module as follows.",
                    "sid": 142,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If there is a major phrase boundary, a full stop or question mark is inserted into the word sequence, depending on the sentence mode as indicated by the prosody module.",
                    "sid": 143,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additional commas are inserted for other types of segment boundaries.",
                    "sid": 144,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The prosody module calculates probabilities for segment boundaries, and thresholds are used to decide if the sentence marks are to be inserted.",
                    "sid": 145,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These thresholds have been selected in such a way that, on the average, for each dialogue turn, a good segmentation is obtained.",
                    "sid": 146,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The segment boundaries restrict possible word reordering between source and target language.",
                    "sid": 147,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This not only improves translation quality, but also restricts the search space and thereby speeds up the translation process.",
                    "sid": 148,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.5 Large-Scale End-to-End Evaluation.",
                    "sid": 149,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whereas the offline tests reported above were important for the optimization and tuning of the system, the most important evaluation was the final evaluation of the Verb- mobil prototype in spring 2000.",
                    "sid": 150,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This end-to-end evaluation of the Verbmobil system was performed at the University of Hamburg [19].",
                    "sid": 151,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In each session of this evaluation, two native speakers conducted a dialogue.",
                    "sid": 152,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They did not have any direct contact and could only interact by speaking and listening to the Verbmobil system.",
                    "sid": 153,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Three other translation approaches had been integrated into the Verbmobil prototype system: • a classical transfer approach [3, 7, 22],which is based on a manually designed analysis gram mar, a set of transfer rules, and a generation grammar, • a dialogue act based approach [16], which amounts to a sort of slot filling by classifying Table 3: Disambiguation examples (∗: using morpho-syntactic analysis).",
                    "sid": 154,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Am big uo us W ord Te xt In pu t Tr an sla tio n ge he n Wi r ge he n ins Th eat er.",
                    "sid": 155,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "M i r g e h t e s g u t . E s g e h t u m G e l d . G e h t e s b e i I h n e n a m M o n t a g ? D a s T r e f f e n g e h t b i s 5 U h r . We will go to the the ate r. I am fin e. It is ab out mo ne y. I s it p o s si bl e f o r y o u o n M o n d a y ? T h e m e e ti n g is t o fi v e . an ne hm en Wi r sol lte n da s An ge bot an ne hm en.",
                    "sid": 156,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ich ne hm e da s Sc hli m ms te an.",
                    "sid": 157,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "W e s h o u l d a c c e p t t h a t o f f e r . I w i l l a s s u m e t h e w o r s t . ∗ vor Wi r tref fen un s vor de m Fru ¨h stu¨ ck.",
                    "sid": 158,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Wi r tref fen un s vor de m Ho tel.",
                    "sid": 159,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We me et bef ore the bre akf ast . We will me et in fro nt of the hot el.",
                    "sid": 160,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "each sentence into one out of a small number of possible sentence patterns and filling in the slot values, • an example-based approach [1], where a sort of nearest neighbour concept is applied to the set of bilingual training sentence pairs after suitable preprocessing.",
                    "sid": 161,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the final end-to-end evaluation, human evaluators judged the translation quality for each of the four translation results using the following criterion: Is the sentence approximatively correct: yes/no? The evaluators were asked to pay particular attention to the semantic information (e.g. date and place of meeting, participants etc) contained in the translation.",
                    "sid": 162,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A missing translation as it may happen for the transfer approach or other approaches was counted as wrong translation.",
                    "sid": 163,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evaluation was based on 5069 dialogue turns for the translation from German to English and on 4136 dialogue turns for the translation from English to German.",
                    "sid": 164,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The speech recognizers used had a word error rate of about 25%.",
                    "sid": 165,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall sentence error rates, i.e. resulting from recognition and translation, are summarized in Table 4.",
                    "sid": 166,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we can see, the error rates for the statistical approach are smaller by a factor of about 2 in comparison with the other approaches.",
                    "sid": 167,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In agreement with other evaluation experiments, these experiments show that the statistical modelling approach may be comparable to or better than the conventional rule-based approach.",
                    "sid": 168,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, the statistical approach seems to have the advantage if robustness is important, e.g. when the input string is not grammatically correct or when it is corrupted by recognition errors.",
                    "sid": 169,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although both text and speech input are translated with good quality on the average by the statistical approach, Table 4: Sentence error rates of end-to-end evaluation (speech recognizer with WER=25%; corpus of 5069 and 4136 dialogue turns for translation German to English and English to German, respectively).",
                    "sid": 170,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "there are examples where the syntactic structure of the produced sentence is not correct.",
                    "sid": 171,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of these syntactic errors are related to long range dependencies and syntactic structures that are not captured by the m-gram language model used.",
                    "sid": 172,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To cope with these problems, morpho-syntactic analysis [10] and grammar-based language models [17] are currently being studied.",
                    "sid": 173,
                    "ssid": 76,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "summary. ",
            "number": "6",
            "sents": [
                {
                    "text": "In this paper, we have given an overview of the statistical approach to machine translation and especially its implementation in the Verbmobil prototype system.",
                    "sid": 174,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The statistical system has been trained on about 500 000 running words from a bilingual German–English corpus.",
                    "sid": 175,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Translations are performed for both directions, i.e. from German to English and from English to German.",
                    "sid": 176,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparative evaluations with other translation approaches of the Verbmobil prototype system show that the statistical translation is superior, especially in the presence of speech input and ungrammatical input.",
                    "sid": 177,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgment",
            "number": "",
            "sents": [
                {
                    "text": "The work reported here was supported partly by the Verb- mobil project (contract number 01 IV 701 T4) by the German Federal Ministry of Education, Science, Research and Technology and as part of the EuTrans project (ESPRIT project number 30268) by the European Community.",
                    "sid": 178,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training Toolkit In a follow-up project of the statistical machine translation project during the 1999 Johns Hopkins University workshop, we have developped a publically available toolkit for the training of different alignment models, including the models IBM1 to IBM5 [5] and an HMM alignment model [14, 24].",
                    "sid": 179,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The software can be downloaded at http://wwwi6.Informatik.RWTHAachen.DE/ ~och/software/GIZA++.html.",
                    "sid": 180,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tra nsl ati on Me tho d Err or [%] Se ma nti c Tr an sfe r Di alo gu e Act Ba se d Ex am ple Ba se d 6 2 6 0 5 2 St ati sti cal 2 9",
                    "sid": 181,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}