{
    "ID": "H89-2014",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Augmenting a Hidden Markov Model for Phrase-Dependent Word Tagging",
                    "sid": 0,
                    "ssid": null,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The paper describes refinements that are currently being investigated in a model for part-of-speech assignment to words in unrestricted text.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The model has the advantage that a pre-tagged training corpus is not required.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Words are represented by equivalence classes to reduce the number of parameters required and provide an essentially vocabulary-independent model.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "State chains are used to model selective higher-order conditioning in the model, which obviates the proliferation of parameters attendant in uniformly higher-order models.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The structure of the state chains is based on both an analysis of errors and linguistic knowledge.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples show how word dependency across phrases can be modeled.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The determination of part-of-speech categories for words is an important problem in language modeling, because both the syntactic and semantic roles of words depend on their part-of-speech category (henceforth simply termed \"category\").",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Application areas include speech recognition/synthesis and information retrieval.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several workers have addressed the problem of tagging text.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Methods have ranged from locally-operating rules (Greene and Rubin, 1971), to statistical methods (Church, 1989; DeRose, 1988; Garside, Leech and Sampson, 1987; Jelinek, 1985) and back-propagation (Benello, Mackie and Anderson, 1989; Nakamura and Shikano, 1989).",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The statistical methods can be described in terms of Markov models.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "States in a model represent categories {cl...c=} (n is the number of different categories used).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a first order model, Ci and Ci_l are random variables denoting the categories of the words at position i and (i - 1) in a text.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The transition probability P(Ci = cz ] Ci_~ = %) linking two states cz and cy, represents the probability of category cx following category %.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A word at position i is represented by the random variable Wi, which ranges over the vocabulary {w~ ...wv} (v is the number of words in the vocabulary).",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "State-dependent probabilities of the form P(Wi = Wa ] Ci = cz) represent the probability that word Wa is seen, given category c~.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the word \"dog\" can be seen in the states noun and verb, and only has a nonzero probability in those states.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A word sequence is considered as being generated from an underlying sequence of categories.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of all the possible category sequences from which a given word sequence can be generated, the one which maximizes the probability of the words is used.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Viterbi algorithm (Viterbi, 1967) will find this category sequence.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The systems previously mentioned require a pre-tagged training corpus in order to collect word counts or to perform back-propagation.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Brown Corpus (Francis and Kucera, 1982) is a notable example of such a corpus, and is used by many of the systems cited above.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An alternative approach taken by Jelinek, (Jelinek, 1985) is to view the training problem in terms of a \"hidden\" Markov model: that is, only the words of the training text are available, their corresponding categories are not known.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this situation, the Baum-Welch algorithm (Baum, 1972) can be used to estimate the model parameters.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This has the great advantage of eliminating the pre-tagged corpus.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It minimizes the resources required, facilitates experimentation with different word categories, and is easily adapted for use with other languages.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The work described here also makes use of a hidden Markov model.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One aim of the work is to investigate the quality and performance of models with minimal parameter descriptions.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this regard, word equivalence classes were used (Kupiec, 1989).",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There it is assumed that the distribution of the use of a word depends on the set of categories it can assume, and words are partitioned accordingly.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the words \"play\" and \"touch\" are considered to behave identically, as members of the class noun-or-verb, and \"clay\" and \"zinc\"are members of the class noun.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This partitioning drastically reduces the number of parameters required in the model, and aids reliable estimation using moderate amounts of training data.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Equivalence classes {Eqvl ...Eqvm} replace the words {wl...Wv} (m << v) and P(Eqvi I Ci) replace the parameters P(Wi I Ci).",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the 21 category model reported in Kupiec (1989) only 129 equivalence classes were required to cover a 30,000 word dictionary.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, the number of equivalence classes is essentially independent of the size of the dictionary, enabling new words to be added without any modification to the model.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obviously, a trade-off is involved.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, \"dog\" is more likely to be a noun than a verb and \"see\" is more likely to be a verb than a noun.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However they are both members of the equivalence class noun-or-verb, and so are considered to behave identically.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is then local word context (embodied in the transition probabilities) which must aid disambiguation of the word.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In practice, word context provides significant constraint, so the trade-off appears to be a remarkably favorable one.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Basic Model The development of the model was guided by evaluation against a simple basic model (much of the development of the model was prompted by an analysis of the errors in its hehaviour).",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic model contained states representing the following categories: Determiner Noun Singular Including mass nouns Noun Plural Proper Noun Pronoun Adverb Conjunction Coordinating and subordinating Preposition Adjective Including comparative and superlative Verb Uninflected Verb 3rd Pers.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sing.",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Auxiliary Am, is, was, has, have, should, must, can, might, etc. Present Participle Including gerund Past Participle Including past tense Question Word When, what, why, etc. Unknown Words whose stems could not be found in dictionary.",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lisp Used to tag common symbols in the the Lisp programming language (see below:) To-inf.",
                    "sid": 45,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"To\" acting as an infinitive marker Sentence Boundary The above states were arranged in a first-order, fully connected network, each state having a transition to every other state, allowing all possible sequences of categories.",
                    "sid": 46,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training corpus was a collection of electronic mail messages concerning the design of the Common-Lisp programming language -a somewhat less than ideal representation of English.",
                    "sid": 47,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many Lisp-specific words were not in the vocabulary, and thus tagged as unknown, however the lisp category was nevertheless created for frequently occurring Lisp symbols in an attempt to reduce bias in the estimation.",
                    "sid": 48,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is interesting to note that the model performs very well, despite such \"noisy\" training data.",
                    "sid": 49,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training was sentence-based, and the model was trained using 6,000 sentences from the corpus.",
                    "sid": 50,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Eight iterations of the Baum-Welch algorithm were used.",
                    "sid": 51,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The implementation of the hidden Markov model is based on that of Rabiner, Levinson and Sondhi (1983).",
                    "sid": 52,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By exploiting the fact that the matrix of probabilities P(Eqvi I Ci) is sparse, a considerable improvement can be gained over the basic training algorithm in which iterations are made over all states.",
                    "sid": 53,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The initial values of the model parameters are calculated from word occurrence probabilities, such that words are initially assumed to function equally probably as any of their possible categories.",
                    "sid": 54,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Superlative and comparative adjectives were collapsed into a single adjective category, to economize on the overall number of categories.",
                    "sid": 55,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(If desired, after tagging the finer category can be replaced).",
                    "sid": 56,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the basic model all punctuation except sentence boundaries was ignored.",
                    "sid": 57,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An interesting observation is worth noting with regard to words that can act both as auxiliary and main verbs.",
                    "sid": 58,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Modal auxiliaries were consistently tagged as auxiliary whereas the tagging for other auxiliaries (e.g. \"is .... have\" etc.) was more variable.",
                    "sid": 59,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This indicates that modal auxiliaries can be recognized as a natural class via their pattern of usage.",
                    "sid": 60,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extending the Basic Model The basic model was used as a benchmark for successive improvements.",
                    "sid": 61,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first addition was the correct treatment of all non-words in a text.",
                    "sid": 62,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This includes hyphenation, punctuation, numbers and abbreviations.",
                    "sid": 63,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "New categories were added for number, abbreviation, and comma.",
                    "sid": 64,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All other punctuation was collapsed into the single new punctuation category.",
                    "sid": 65,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Refinement of Basic Categories The verb states of the basic model were found to be too coarse.",
                    "sid": 66,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, many noun/verb ambiguities in front of past participles were incorrectly tagged as verbs.",
                    "sid": 67,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The replacement of the auxiliary category by the following categories greatly improved this: Category Name Words included in Category Be be Been been Being being Have have Have* has, have, had, having be* is, am, are, was, were do* do, does, did modal Modal auxiliaries Unique Equivalence Classes for Common Words Common words occur often enough to be estimated reliably.",
                    "sid": 68,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a ranked list of words in the corpus the most frequent 100 words account for approximately 50% of the total tokens in the corpus, and thus data is available to estimate them reliably.",
                    "sid": 69,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most frequent 100 words of the corpus were assigned individually in the model, thereby enabling them to have different distributions over their categories.",
                    "sid": 70,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This leaves 50% of the corpus for training all the other equivalence classes.",
                    "sid": 71,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Editing the Transition Structure A common error in the basic model was the assignment of the word \"to\" to the to-infcategory (\"to\" acting as an infinitive marker) instead of preposition before noun phrases.",
                    "sid": 72,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not surprising, because \"to\" is the only member of the to-inf category, P(Wi = \"to\" [ Ci = to-in]) = 1.0.",
                    "sid": 73,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, P(Wi = \"to\" I Ci = preposition) = 0.086, because many other words share the preposition state.",
                    "sid": 74,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unless transition probabilities are highly constraining, the higher probability paths will tend to go through the to-infstate.",
                    "sid": 75,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This situation may be addressed in several ways, the simplest being to initially assign zero transition probabilities from the to-infstate to states other than verbs and the adverb state.",
                    "sid": 76,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ADJECTIVE DETERMINER To all states NOUN in Basic Network \"Transitions to • To all states all states in in Basic Network Basic Network except NOUN and ADJECTIVE AUGMENTED NETWORK BASIC NETWORK FULLY-CONNECTED NETWORK CONTAINING ALL STATES EXCEPT DETERMINER Figure 1: Extending the Basic Model Augmenting the Model by Use of Networks The basic model consists of a first-order fully connected network.",
                    "sid": 77,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lexical context available for modeling a word's category is solely the category of the preceding word (expressed via the transition probabilities P(Ci [ Ci1).",
                    "sid": 78,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such limited context does not adequately model the constraint present in local word context.",
                    "sid": 79,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A straightforward method of extending the context is to use second-order conditioning which takes account of the previous two word categories.",
                    "sid": 80,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Transition probabilities are then of the form P(Ci [ Ci1, Ci2).",
                    "sid": 81,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For an n category model this requires n 3 transition probabilities.",
                    "sid": 82,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Increasing the order of the conditioning requires exponentially more parameters.",
                    "sid": 83,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In practice, models have been limited to second-order, and smoothing methods are normally required to deal with the problem of estimation with limited data.",
                    "sid": 84,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The conditioning just described is uniform- all possible two-category contexts are modeled.",
                    "sid": 85,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many of these neither contribute to the performance of the model, nor occur frequently enough to be estimated properly: e.g. P(Ci = determiner [ el1 -~ determiner, Ci2 = determiner).",
                    "sid": 86,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An alternative to uniformly increasing the order of the conditioning is to extend it selectively.",
                    "sid": 87,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mixed higher- order context can be modeled by introducing explicit state sequences.",
                    "sid": 88,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the arrangement the basic first-order network remains, permitting all possible category sequences, and modeling first-order dependency.",
                    "sid": 89,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic network is then augmented with the extra state sequences which model certain category sequences in more detail.",
                    "sid": 90,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The design of the augmented network has been based on linguistic considerations and also upon an analysis of tagging errors made by the basic network.",
                    "sid": 91,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an example, we may consider a systematic error made by the basic model.",
                    "sid": 92,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It concerns the disambiguation of the equivalence class adjective-or-noun following a determiner.",
                    "sid": 93,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The error is exemplified by the sentence fragment \"The period of...\", where \"period\" is tagged as an adjective.",
                    "sid": 94,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To model the context necessary to correct the error, two extra states are used, as shown in Figure 1.",
                    "sid": 95,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The \"augmented network\" uniquely models all second-order dependencies of the type determiner -noun - X, and determiner -adjective -X (X ranges over {cl...cn}).",
                    "sid": 96,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training a hidden Markov model having this topology corrected all nine instances of the error in the test data.",
                    "sid": 97,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An important point to note is that improving the model detail in this manner does not forcibly correct the error.",
                    "sid": 98,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The actual patterns of category usage must be distinct in the language.",
                    "sid": 99,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "95 To complete the description of the augmented model it is necessary to mention tying of the model states (Jelinek and Mercer, 1980).",
                    "sid": 100,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whenever a transition is made to a state, the state-dependent probability distribution P(Eqvi I Ci) is used to obtain the probability of the observed equivalence class.",
                    "sid": 101,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A state is generally used in several places (E.g. in Figure 1.",
                    "sid": 102,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "there are two noun states, and two adjective states: one of each in the augmented network, and in the basic network).",
                    "sid": 103,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distributions P(Eqvi I Ci) are considered to be the same for every instance of the same state.",
                    "sid": 104,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their estimates are pooled and reassigned identically after each iteration of the Baum-Welch algorithm.",
                    "sid": 105,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Modeling Dependencies across Phrases Linguistic considerations can be used to correct errors made by the model.",
                    "sid": 106,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section two illustrations are given, concerning simple subject/verb agreement across an intermediate prepositional phrase.",
                    "sid": 107,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are exemplified by the following sentence fragments: 1.",
                    "sid": 108,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"Temperatures in the upper mantle range apparently from....\".",
                    "sid": 109,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 110,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"The velocity of the seismic waves rises to...\".",
                    "sid": 111,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic model tagged these sentences correctly, except for- \"range\" and \"rises\" which were tagged as noun and plural-noun respectively 1.",
                    "sid": 112,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic network cannot model the dependency of the number of the verb on its subject, which precedes it by a prepositional phrase.",
                    "sid": 113,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To model such dependency across the phrase, the networks shown in Figure 2 can be used.",
                    "sid": 114,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be seen that only simple forms of prepositional phrase are modeled in the networks; a single noun may be optionally preceded by a single adjective and/or determiner.",
                    "sid": 115,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final transitions in the networks serve to discriminate between the correct and incorrect category assignment given the selected preceding context.",
                    "sid": 116,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in the previous section, the corrections are not programmed into the model.",
                    "sid": 117,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only context has been supplied to aid the training procedure, and the latter is responsible for deciding which alternative is more likely, based on the training data.",
                    "sid": 118,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Approximately 19,000 sentences were used to train the networks used in this example).",
                    "sid": 119,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discussion and Results In Figure 2, the two copies of the prepositional phrase are trained in separate contexts (preceding singu- lax/plural nouns).",
                    "sid": 120,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This has the disadvantage that they cannot share training data.",
                    "sid": 121,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This problem could be resolved by tying corresponding transitions together.",
                    "sid": 122,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alternatively, investigation of a trainable grammar (Baker, 1979; Fujisaki et al., 1989) may be a fruitful way to further develop the model in terms of grammatical components.",
                    "sid": 123,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A model containing all of the refinements described, was tested using a magazine article containing 146 sentences (3,822 words).",
                    "sid": 124,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A 30,000 word dictionary was used, supplemented by inflectional analysis for words not found directly in the dictionary.",
                    "sid": 125,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the document, 142 words were tagged as unknown (their possible categories were not known).",
                    "sid": 126,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A total of 1,526 words had ambiguous categories (i.e. 40% of the document).",
                    "sid": 127,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Critical examination of the tagging provided by the augmented model showed 168 word tagging errors, whereas the basic model gave 215 erroneous word tags.",
                    "sid": 128,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The former represents 95.6% correct word tagging on the text as a whole (ignoring unknown words), and 89% on the ambiguous words.",
                    "sid": 129,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of a tagging program depends on the choice and number of categories used, and the correct tag assignment for words is not always obvious.",
                    "sid": 130,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In cases where the choice of tag was unclear (as often occurs in idioms), the tag was ruled as incorrect.",
                    "sid": 131,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, 9 errors are from 3 instances of \"... as well as ...\" that arise in the text.",
                    "sid": 132,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It would be appropriate to deal with idioms separately, as done by Gaxside, Leech and Sampson (1987).",
                    "sid": 133,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typical errors beyond the scope of the model described here are exemplified by incorrect adverbial and prepositional assignment.",
                    "sid": 134,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 It is easy to construct counterexamples to the sentences presented here, where the tagging would be correct.",
                    "sid": 135,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the training procedure affirms that counterexamples occur less frequently in the corpus than the cases shown here..",
                    "sid": 136,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "96 NOUN PREPOSITION ADJECTIVE NO UN~ PLURAL NOUN PLURAL NOUN PREPOSITION A E?TIVE NO2NJC) NOUN ~ j VERB TRANSITIONS TO/FROM ~ 3RD.",
                    "sid": 137,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SINGULAR ALL STATES IN BASIC NETWORK NOT SHOWN Figure 2: Augmented Networks for Example of Subject/Verb Agreement For example, consider the word \"up\" in the following sentences: \"He ran up a big bill\".",
                    "sid": 138,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"He ran up a big hill\".",
                    "sid": 139,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extra information is required to assign the correct tagging.",
                    "sid": 140,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In these examples it is worth noting that even if a model was based on individual words, and trained on a pre-tagged corpus, the association of \"up\" (as adverb) with \"bill\" would not be captured by trigrams.",
                    "sid": 141,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Work on phrasal verbs, using mutual information estimates (Church et ai., 1989b) is directly relevant to this problem).",
                    "sid": 142,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tagger could be extended by further category refinements (e.g. inclusion of a gerund category), and the single pronoun category currently causes erroneous tags for adjacent words.",
                    "sid": 143,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With respect to the problem of unknown words, alternative category assignments for them could be made by using the context embodied in transition probabilities.",
                    "sid": 144,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A stochastic method for assigning part-of-speech categories to unrestricted English text has been described.",
                    "sid": 145,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It minimizes the resources required for high performance automatic tagging.",
                    "sid": 146,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A pre-tagged training corpus is not required, and the tagger can cope with words not found in the training text.",
                    "sid": 147,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be trained reliably on moderate amounts of training text, and through the use of selectively augmented networks it can model high-order dependencies without requiring an excessive number of parameters.",
                    "sid": 148,
                    "ssid": 148,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "I would like to thank Meg Withgott and Lanri Karttunen of Xerox PARC, for their helpful contributions to this work.",
                    "sid": 149,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I am also indebted to Sheldon Nicholl of the Univ. of Illinois, for his comments and valuable insight.",
                    "sid": 150,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work was sponsored in part by the Defense Advanced Research Projects Agency (DOD), under the Information Science and Technology Office, contract #N0014086-C-8996.",
                    "sid": 151,
                    "ssid": 151,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}