{
    "ID": "H92-1022",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Automatic part of speech tagging is an area of natural lan­ guage processing where statistical techniques have been more successful than rule-based methods.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inthis paper, we present a simple rule-based part of speech tagger which automati­ cally acquires its rules and tags with accuracy comparable to stochastic taggers.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rule-based tagger has many ad­ vantages over these taggers, including: a vast reduction in stored information required, the perspicuity of a small set of meaningful rules, ease of finding and implementing im­ provements to the tagger, and better portability from one tag set, corpus genre or language to another.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Perhaps the biggest contribution of this work is in demonstrating that the stochastic method is not the only viable method for part of speech tagging.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fact that a simple rule-based tagger that automatically learns its rules can perform so well should offer encouragement for researchers to further explore rule­ based tagging, searching for a better and more expressive set of rule templates and other variations on the simple but effective theme described below.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "There has been a dramatic increase in the application of probabilistic models to natural language processing over the last few years.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The appeal of stochastic techniques over traditional rule-based techniques comes from the ease with which the necessary statistics can be automat­ ically acquired and the fact that very little handcrafted knowledge need be built into the system.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, the rules in rule-based systems are usually difficult to construct and are typically not very robust.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One area in which the statistical approach has done par­ ticularly well is automatic part of speech tagging, as­ signing each word in an input sentence its proper part of speech (1, 2, 3, 4, 6, 9, 11, 12].",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Stochastic taggers have •A version of this paper appears in Proceedings of the Third Conference on Applied Computational Linguistics (ACL), Trento, Italy, 1!)92.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Used by permission of the Association for Computa­ tional Linguistics; copies of the publication from which this ma­ terial is derived can can be obtained from Dr. Donald E. Walker (ACL), Bellcore, MRE 2A379, 445 South Street, Box 1910, Morris­ town, NJ 079601910, USA.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The author would like to thank Mitch Marcus and Rich Pito for valuable input.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work was supported by DARPA and AFOSR jointly under grant No.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "AFOSR90-0066, and by ARO grant No.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DAAL 0389-C0031 PRI.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "obtained a high degree of accuracy without performing any syntactic analysis on the input.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These stochastic part of speech taggers make use of a Markov model which captures lexical and contextual information.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parameters of the model can be estimated from tagged (1, 3, 4, 6, 12] or untagged [2, 9, 11] text.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once the parameters of the model are estimated, a sentence can then be automatically tagged by assigning it the tag se­ quence which is assigned the highest probability by the model.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance is often enhanced with the aid of various higher level pre- and postprocessing procedures or by manually tuning the model.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A number of rule-based taggers have been built (10, 7, 8].",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[10] and [7] bot h have error rates substantially higher than state of the art stochastic taggers.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[8] disam­ biguates words within a deterministic parser.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We wanted to determine whether a simple rule-based tagger with­ out any knowledge of syntax can perform as well as a stochastic tagger, or if part of speech tagging really is a domain to which stochastic techniques are better suited.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we describe a rule-based tagger which per­ forms as well as taggers based upon probabilistic models.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rule-based tagger overcomes the limitations common in rule-based approaches to language processing: it is robust, and the rules are automatically acquired.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In ad­ dition, the tagger has many advantages over stochastic taggers, including: a vast reduction in stored informa­ tion required, the perspicuity of a small set of meaningful rules as opposed to the large tables of statistics needed for stochastic taggers, ease of finding and implementing improvements to the tagger, and better portability from one tag set or corpus genre to another.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the tagger. ",
            "number": "2",
            "sents": [
                {
                    "text": "The tagger works by automatically recognizing and rem­ edying its weaknesses, thereby incrementally improving its performance.",
                    "sid": 28,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tagger initially tags by assigning each word its most likely tag, estimated by examining a large tagged corpus, without regard to context.",
                    "sid": 29,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In both sentences below, run would be tagged as a verb: The run lasted thirty minutes.",
                    "sid": 30,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We run three miles every day.",
                    "sid": 31,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The initial tagger has two procedures built in to improve performance; both make use of no contextual informa­ tion.",
                    "sid": 32,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One procedure is provided with information that words that were not in the training corpus and are cap­ italized tend to be proper nouns, and attempts to fix tagging mistakes accordingly.",
                    "sid": 33,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This information could be acquired automatically (see below), but is prespecified in the current implementation.",
                    "sid": 34,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, there is a procedure which attempts to tag words not seen in the training corpus by assigning such words the tag most common for words ending in the same three letters.",
                    "sid": 35,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, blahblahous would be tagged as an adjective, because this is the most common tag for words ending in ous.",
                    "sid": 36,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This information is derived automatically from the training corpus.",
                    "sid": 37,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This very simple algorithm has an error rate of about 7.9% when trained on 90% of the tagged Brown Corpus1 [5], and tested on a separate 5% of the corpus.2 Training consists of compiling a list of the most common tag for each word in the training corpus.",
                    "sid": 38,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tagger then acquires patches to improve its perfor­ mance.",
                    "sid": 39,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Patch templates are of the form: • If a word is tagged a and it is in context C, then change that tag to b, or • If a word is tagged a and it has lexical property P, then change that tag to b, or • If a word is tagged a and a word in region R has lexical property P, then change that tag to b. The initial tagger was trained on 90% of the corpus (the training corpus).",
                    "sid": 40,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5% was held back to be used for the patch acquisition procedure (the patch corpus) and 5% for testing.",
                    "sid": 41,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once the initial tagger is trained, it is used to tag the patch corpus.",
                    "sid": 42,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A list of tagging errors is compiled by comparing the output of the tagger to the correct tagging of the patch corpus.",
                    "sid": 43,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This list consists of triples < taga , tagb , number >, indicating the number of times the tagger mistagged a word with taga when it should 1The Brown Corpus contains about 1.1 million words from a variety of genres of written English.",
                    "sid": 44,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are 192 tags in the tag set, 96 of which occur more than one hundred times in the corpus.",
                    "sid": 45,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 The test set contained text from all genres in the Brown.",
                    "sid": 46,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Corpus.",
                    "sid": 47,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "have been tagged with tagb in the patch corpus.",
                    "sid": 48,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next , for each error triple, it is determined which instantiation of a template from the prespecified set of patch templates results in the greatest error reduction.",
                    "sid": 49,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Currently, the patch templates are: Change tag a to tag b when: 1.",
                    "sid": 50,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The preceding (following) word is tagged z..",
                    "sid": 51,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 52,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word two before (after) is tagged z..",
                    "sid": 53,
                    "ssid": 26,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "one of the two preceding (following) words is tagged. ",
            "number": "3",
            "sents": [
                {
                    "text": "z.",
                    "sid": 54,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "one of the three preceding (following) words is. ",
            "number": "4",
            "sents": [
                {
                    "text": "tagged z.",
                    "sid": 55,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the preceding word is tagged z and the following. ",
            "number": "5",
            "sents": [
                {
                    "text": "word is tagged w.",
                    "sid": 56,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the preceding (following) word is tagged z and the. ",
            "number": "6",
            "sents": [
                {
                    "text": "word two before (after) is tagged w.",
                    "sid": 57,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the current word is (is not) capitalized.. ",
            "number": "7",
            "sents": [
                {
                    "text": "For each error triple < taga , tagb , number > and patch, we compute the reduction in error which results from applying the patch to remedy the mistagging of a word as taga when it should have been tagged tagb . We then compute the number of new errors caused by applying the patch; that is, the number of times the patch results in a word being tagged as tagb when it should be tagged taga . The net improvement is calculated by subtracting the latter value from the former.",
                    "sid": 58,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, when the initial tagger tags the patch cor­ pus, it mistags 159 words as verbs when they should be nouns.",
                    "sid": 59,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the patch change the tag from verb to noun if one of the two preceding words is tagged as a determiner is applied, it corrects 98 of the 159 errors.",
                    "sid": 60,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it results in an additional 18 errors from changing tags which really should have been verb to noun.",
                    "sid": 61,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This patch results in a net decrease of 80 errors on the patch corpus.",
                    "sid": 62,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The patch which results in the greatest improvement to the patch corpus is added to the list of patches.",
                    "sid": 63,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The patch is then applied in order to improve the tagging of the patch corpus, and the patch acquisition procedure continues.",
                    "sid": 64,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first ten patches found by the system are listed below 3.",
                    "sid": 65,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) TO IN NEXT-TAG AT (2) VBN VBD PREY-WORD-IS-CAP YES (3) VBD VBN PREV1-0R2-0R3-TAG HVD (4) VB N N PREV1-0R2-TAG AT (5) N N VB PREY-TAG TO (6) TO IN NEXT-WORD-IS-CAP YES (7) N N VB PREY-TAG MD (8) PPS PPO NEXT-TAG .",
                    "sid": 66,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(9) VBN VBD PREY-TAG PPS (10) NP NN CURRENT-WORD-IS-CAP NO The first patch states that if a word is tagged TO and the following word is tagged AT, then switch the tag from TO to IN.",
                    "sid": 67,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because a noun phrase is much more likely to immediately follow a preposition than to im­ mediately follow infinitive TO.",
                    "sid": 68,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second patch states that a tag should be switched from VBN to VBD if the preceding word is capitalized.",
                    "sid": 69,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This patch arises from two facts: the past verb tag is more likely than the past par­ ticiple verb tag after a proper noun, and is also the more likely tag for the second word of the sentence.4 The third patch states that VBD should be changed to VBN if any of the preceding three words are tagged HVD.",
                    "sid": 70,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once the list of patches has been acquired, new text can be tagged as follows.",
                    "sid": 71,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, tag the text using the basic lexical tagger.",
                    "sid": 72,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, apply each patch in tum to the corpus to decrease the error rate.",
                    "sid": 73,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A patch which changes the tagging of a word from a to b only applies if the word has been tagged b somewhere in the training corpus.",
                    "sid": 74,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that one need not be too careful when constructing the list.",
                    "sid": 75,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of patch templates.",
                    "sid": 76,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adding a bad template to the list will not worsen performance.",
                    "sid": 77,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a template is bad, then no rules which are instantiations of that template will appear in the final list of patches learned by the tagger.",
                    "sid": 78,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This makes it easy to experiment with extensions to the tagger.",
                    "sid": 79,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 AT = article, HVD = had, IN = preposition, MD = modal, NN = sing.",
                    "sid": 80,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "noun, NP = proper noun, PPS = 3rd sing.",
                    "sid": 81,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "nom.",
                    "sid": 82,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Patch Application and Error Reduction 0 20 40 60 Number of Patches 3.",
                    "sid": 83,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "RESULTS.",
                    "sid": 84,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tagger was tested on 5% of the Brown Corpus in­ cluding sections from every genre.",
                    "sid": 85,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the test corpus was tagged by the simple lexical tagger.",
                    "sid": 86,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, each of the patches was in turn applied to the corpus.",
                    "sid": 87,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Below is a graph showing the improvement in accuracy from apply­ ing patches.",
                    "sid": 88,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is significant that with only 71 patches, an error rate of 5.1% was obtained 5 . Of the 71 patches, 66 resulted in a reduction in the number of errors in the test corpus, 3 resulted in no net change, and 2 resulted in a higher number of errors.",
                    "sid": 89,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Almost all patches which were effective on the training corpus were also effective on the test corpus.",
                    "sid": 90,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, it is difficult to compare our results with other published results.",
                    "sid": 91,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In [12], an error rate of 34% on one domain, Wall Street Journal articles and 5.6% on another domain, texts on terrorism in Latin Amer­ ican countries, is quoted.",
                    "sid": 92,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, both the domains and the tag set are different from what we use.",
                    "sid": 93,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[l] re­ ports an accuracy of \"9599% correct, depending on the definition of correct\".",
                    "sid": 94,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We implemented a version of the pronoun, PPO = obj.",
                    "sid": 95,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "personal pronoun, TO = infinitive to, VB = verb, VBN = past part.",
                    "sid": 96,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "verb, VBD = past verb.",
                    "sid": 97,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 Both the first word of a sentence and proper nouns are capitalized.",
                    "sid": 98,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "swe ran the experiment three times.",
                    "sid": 99,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each time we divided the corpus into training, patch and test sets in a different way.",
                    "sid": 100,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All three runs gave an error rate of 5%.",
                    "sid": 101,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "algorithm described in [1] which did not make use of a dictionary to extend its lexical knowledge.",
                    "sid": 102,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When trained and tested on the same samples used in our experiment, we found the error rate to be about 4.5%.",
                    "sid": 103,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[3) quotes a 4% error rate when testing and training on the same text.",
                    "sid": 104,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[6) reports an accuracy of 9697%.",
                    "sid": 105,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their proba­ bilistic tagger has been augmented with a handcrafted procedure to pretag problematic \"idioms\".",
                    "sid": 106,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This proce­ dure, which requires that a list of idioms be laboriously created by hand, contributes 3% toward the accuracy of their tagger, according to [3).",
                    "sid": 107,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idiom list would have to be rewritten if one wished to use this tagger for a different tag set or a different corpus.",
                    "sid": 108,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is interesting to note that the information contained in the idiom list can be automatically acquired by the rule-based tagger.",
                    "sid": 109,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, their tagger had difficulty tagging as old as.",
                    "sid": 110,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An explicit rule was written to pretag as old as with the proper tags.",
                    "sid": 111,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to the tagging scheme of the Brown Corpus, the first as should be tagged as a quali­ fier, and the second as a subordinating conjunction.",
                    "sid": 112,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the rule-based tagger, the most common tag for as is subordinating conjunction.",
                    "sid": 113,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So initially, the second as is tagged correctly and the first as is tagged incorrectly.",
                    "sid": 114,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To remedy this, the system acquires the patch: if the cur­ rent word is tagged as a subordinating conjunction, and so is the word two positions ahead, then change the tag of the current word to qualifier.6 The rule-based tagger has was divided into a training corpus of about one million words, a patch corpus of about 65,000 words and a test corpus of about 65,000 words.",
                    "sid": 115,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Patches were acquired as described above.",
                    "sid": 116,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When tested on the test corpus, with lexical information derived solely from the training corpus, the error rate was 5%.",
                    "sid": 117,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, the same patches we1e used, but lexical information was gathered from the entire Brown Corpus.",
                    "sid": 118,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This reduced the error rate to 4.1%.",
                    "sid": 119,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the same experiment was run with lexical information gathered solely from the test corpus.",
                    "sid": 120,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This resulted in a 3.5% error rate.",
                    "sid": 121,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the patches used in the two experiments with no unknown words were not the optimal patches for these tests, since they were derived from a corpus that contained unknown words.",
                    "sid": 122,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 123,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CONCLUSIONS.",
                    "sid": 124,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have presented a simple rule-based part of speech tagger which performs as well as existing stochastic tag­ gers, but has significant advantages over these taggers.",
                    "sid": 125,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tagger is extremely portable.",
                    "sid": 126,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many of the higher level procedures used to improve the performance of stochastic taggers would not readily transfer over to a different tag set or genre, and certainly would not trans­ fer over to a different language.",
                    "sid": 127,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Everything except for the proper noun discovery procedure is automatically ac­ quired by the rule-based tagger 7 automatically learned how to properly tag this \"idiom.\"",
                    "sid": 128,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Regardless of the precise rankings of the various taggers, we have demonstrated that a simple rule-based tagger with very few rules performs on par with stochastic tag­ gers.",
                    "sid": 129,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It should be mentioned that our results were ob­ tained without the use of a dictionary.",
                    "sid": 130,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Incorporating a large dictionary into the system would improve perfor­ , making it much more portable than a stochastic tagger.",
                    "sid": 131,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the tagger were trained on a different corpus, a different set of patches suitable for that corpus would be found automatically.",
                    "sid": 132,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Large tables of statistics are not needed for the rule­ based tagger.",
                    "sid": 133,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a stochastic tagger, tens of thousands of lines of statistical information are needed to capture contextual information.",
                    "sid": 134,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This information is usually a ta­ mance in two ways.",
                    "sid": 135,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, it would increase the accuracy ble of trigram statistics, indicating for all tags tag0 , tagb in tagging words not seen in the training corpus, since and tagc the probability that tagc follows tag0 and tagb . part of speech information for some words not appearing in the training corpus can be obtained from the dictio­ nary.",
                    "sid": 136,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, it would increase the error reduction re­ sulting from applying patches.",
                    "sid": 137,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When a patch indicates that a word should be tagged with tagb instead of tag0 , the tag is only switched if the word was tagged with tagb somewhere in the training corpus.",
                    "sid": 138,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using a dictionary would provide more accurate knowledge about the set of permissible part of speech tags for a particular word.",
                    "sid": 139,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We plan to incorporate a dictionary into the tagger in the future.",
                    "sid": 140,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an estimate of the improvement possible by using a dictionary, we ran two experiments where all words were known by the system.",
                    "sid": 141,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the Brown Corpus In the rule-based tagger, contextual information is cap­ tured in fewer than eighty rules.",
                    "sid": 142,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This makes for a much more perspicuous tagger, aiding in better understanding and simplifying further development of the tagger.",
                    "sid": 143,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Con­ textual information is expressed in a much more compact and understandable form.",
                    "sid": 144,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As can be seen from compar­ ing error rates, this compact representation of contextual information is just as effective as the information hidden in the large tables of contextual probabilities.",
                    "sid": 145,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Perhaps the biggest contribution of this work is in demonstrating that the stochastic method is not the only viable approach for part of speech tagging.",
                    "sid": 146,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fact that the simple rule-based tagger can perform so well should offer encouragement for researchers to further explore rule-based tagging, searching for a better and more ex 6This was one of the 71 patches acquired by the rule-based tagger.",
                    "sid": 147,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 And.",
                    "sid": 148,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "even this could be learne d by the tagger . pressive set of patch templates and other variations on this simple but effective theme.",
                    "sid": 149,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 150,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Church, K. A Stochastic Parts Program and Noun.",
                    "sid": 151,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Phrase Parser for Unrestricted Text.",
                    "sid": 152,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Proceedings of th1: Second Conference on Applied Natural Language Processing, AGL, 136143, 1988.",
                    "sid": 153,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 154,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cutting, D., Kupiec, J., Pederson, J. and Sibun, P. A. Practical Part-of-Speech Tagger.",
                    "sid": 155,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Proceedings of the Third Conference on Applied Natural Language Process­ ing, AGL, 1992.",
                    "sid": 156,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 157,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DeRose, S.J. Grammatical Category Disambiguation by.",
                    "sid": 158,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Statistical Optimization.",
                    "sid": 159,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Computational Linguistics 14: 31 39, 1988.",
                    "sid": 160,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 161,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Deroualt, A. and Merialdo, B. Natural language mod­.",
                    "sid": 162,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "eling for phoneme-to-text transcription.",
                    "sid": 163,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "IEEE Transac­ tions on Pattern Anal ysis and M achine Intelligence, Vol.",
                    "sid": 164,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PAMl8, No. 6, 742749, 1986.",
                    "sid": 165,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.",
                    "sid": 166,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Francis, W. Nelson and Kucera, Henry, Frequenc y anal­.",
                    "sid": 167,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ysis of English usage.",
                    "sid": 168,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexicon and grammar.",
                    "sid": 169,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Houghton Mifflin, Boston, 1982.",
                    "sid": 170,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.",
                    "sid": 171,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Garside, R., Leech, G. & Sampson, G. The Computa­.",
                    "sid": 172,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tional Anal ysis of English: A Corpus-Based Approach.",
                    "sid": 173,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Longman: London, 1987.",
                    "sid": 174,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.",
                    "sid": 175,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Green, B. and Rubin, G. Automated Grammatical Tag­.",
                    "sid": 176,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ging of English.",
                    "sid": 177,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Department of Linguistics, Brown Uni­ versity, 1971.",
                    "sid": 178,
                    "ssid": 121,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "hindle, d. acquiring disambiguation rules from text.. ",
            "number": "8",
            "sents": [
                {
                    "text": "Proceedings of the 27th Annual Meeting of the Associ­ ation for Computational Linguistics, 1989.",
                    "sid": 179,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "jelinek, f. markov source modeling of text generation.. ",
            "number": "9",
            "sents": [
                {
                    "text": "In J. K . Skwirzinski, ed., Impact of Processing Tech­ niques on Communication, Dordrecht, 1985.",
                    "sid": 180,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "klein, s. and simmons, r.f. a computational ap­. ",
            "number": "10",
            "sents": [
                {
                    "text": "proach to Grammatical Coding of English Words.",
                    "sid": 181,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "J A CM 10: 33447.",
                    "sid": 182,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1963.",
                    "sid": 183,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "kupiec, j. augmenting a hidden markov model for phrase-. ",
            "number": "11",
            "sents": [
                {
                    "text": "dependent word tagging.",
                    "sid": 184,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Proceedings of the DARPA Speech and Natural Language Workshop, Mor­ gan Kaufmann, 1989.",
                    "sid": 185,
                    "ssid": 2,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}