{
    "ID": "I05-3013",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Informal language is actively used in network-mediated communication, e.g. chat room, BBS, email and text message.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We refer the anomalous terms used in such context as network informal language (NIL) expressions.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “஧(ou3)” is used to replace “ ᚒ(wo3)” in Chinese ICQ.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Without unconventional resource, knowledge and techniques, the existing natural language processing approaches exhibit less effectiveness in dealing with NIL text.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose to study NIL expressions with a NIL corpus and investigate techniques in processing NIL expressions.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two methods for Chinese NIL expression recognition are designed in NILER system.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experimental results show that pattern matching method produces higher precision and support vector machines method higher F-1 measure.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results are encouraging and justify our future research effort in NIL processing.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The rapid global proliferation of Internet applications has been showing no deceleration since the new millennium.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in commerce more and more physical customer services/call centers are replaced by Internet solutions, e.g. via MSN, ICQ, etc. Network informal language (NIL) is actively used in these applications.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following this trend, we forecast that NIL would become a key language for human communication via network.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Today NIL expressions are ubiquitous.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They appear, for example, in chat rooms, BBS, email, text message, etc. There is growing importance in understanding NIL expressions from both technology and humanity research points of view.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, comprehension of customer-operator dialogues in the aforesaid commercial application would facilitate effective Customer Relationship Management (CRM).",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently, sociologists showed many interests in studying impact of network-mediated communication on language evolution from psychological and cognitive perspectives (Danet, 2002; McElhearn, 2000; Nishimura, 2003).",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Researchers claim that languages have never been changing as fast as today since inception of the Internet; and the language for Internet communication, i.e. NIL, gets more concise and effective than formal language.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Processing NIL text requires unconventional linguistic knowledge and techniques.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, developed to handle formal language text, the existing natural language processing (NLP) approaches exhibit less effectiveness in dealing with NIL text.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, we use ICTCLAS (Zhang et al., 2003) tool to process sentence “Ҫ㒚 ܿ㒚㽕ᓔӮଞ˛(Is he going to attend a meeting?)”.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word segmentation result is “Ҫ|㒚|ܿ|㒚|㽕|ᓔӮ|ଞ|˛”.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this sentence , “㒚 ܿ 㒚 (xi4 ba1 xi4)” is a NIL expression which means ‘is he ….?’ in this case.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be concluded that without identifying the expression, further Chinese text processing techniques are not able to produce reasonable result.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This problem leads to our recent research in “NIL is Not Nothing” project, which aims to produce techniques for NIL processing, thus avails understanding of change patterns and behaviors in language (particularly in Internet language) evolution.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The latter could make us more adaptive to the dynamic language environment in the cyber world.Recently some linguistic works have been car ried out on NIL for English.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A shared dictionary has been compiled and made available online.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It contains 308 English NIL expressions including English abbreviations, acronyms and emoticons.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar efforts for Chinese are rare.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because Chinese language has not been widely used on the Internet until ten years ago.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, Chinese NIL expression involves processing of Chinese Pinyin and dialects, which results in higher complexity in Chinese NIL processing.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In “NIL is Not Nothing” project, we develop a comprehensive Chinese NIL dictionary.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a difficult task because resource of NIL text is rather restricted.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We download a collection of BBS text from an Internet BBS system and construct a NIL corpus by annotating NIL expressions in this collection by hand.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An empirical study is conducted on the NIL expressions with the NIL corpus and a knowledge mining tool is designed to construct the NIL dictionary and generate statistical NIL features automatically.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With these knowledge and resources, the NIL processing system, i.e. NILER, is developed to extract NIL expressions from NIL text by employing state-of-the-art information extraction techniques.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining sections of this paper are organized as follow.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 2, we observe formation of NIL expressions.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 3 we present the related works.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 4, we describe NIL corpus and the knowledge engineering component in NIL dictionary construction and NIL features generation.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 5 we present the methods for NIL expression recognition.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We outline the experiments, discussions and error analysis in Section 6, and finally Section 7 concludes the paper.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the ways nil expressions are typi-. ",
            "number": "2",
            "sents": [
                {
                    "text": "cally Formed NIL expressions were first introduced for expediting writing or computer input, especially for online chat where the input speed is crucial to prompt and effective communication.",
                    "sid": 41,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, it is rather annoying to input full Chinese sentences in text- based chatting environment, e.g. over the mobile phone.",
                    "sid": 42,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus abbreviations and acronyms are then created by forming words in capital with the first letters of a series of either English words or Chinese Pinyin.",
                    "sid": 43,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chinese Pinyin is a popular approach to Chinese character input.",
                    "sid": 44,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some Pinyin input methods incorporate lexical intelligence to support word or phrase input.",
                    "sid": 45,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This improves input rate greatly.",
                    "sid": 46,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, Pinyin input is not error free.",
                    "sid": 47,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Firstly, options are usually prompted to user and selection errors result in homophone, e.g. “ ᭥ ネ (ban1 zu2)” and “ ⠜ Џ (ban1 zhu3)”.",
                    "sid": 48,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondly, input with incorrect Pinyin or dialect produces wrong Chinese words with similar pronunciation, e.g. “⿔佁(xi1 fan4)” and “୰⃶(xi3 huan1)”.",
                    "sid": 49,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nonetheless, prompt communication spares little time to user to correct such a mistake.",
                    "sid": 50,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same mistake in text is constantly repeated, and the wrong word thus becomes accepted by the chat community.",
                    "sid": 51,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This, in fact, is one common way that a new Chinese NIL expression is created.",
                    "sid": 52,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We collect a large number of “sentences” (strictly speaking, not all of them are sentences) from a Chinese BBS system and identify NIL expressions by hand.",
                    "sid": 53,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An empirical study on NIL expressions in this collection shows that NIL expressions can be classified into four classes as follow based on their origins.",
                    "sid": 54,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1) Abbreviation (A).",
                    "sid": 55,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many Chinese NIL expressions are derived from abbreviation of Chinese Pinyin.",
                    "sid": 56,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “PF” equals to “Խ ᳡(pei4 fu2)” which means “admire”.",
                    "sid": 57,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2) Foreign expression (F).",
                    "sid": 58,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Popular Informal expressions from foreign languages such as English are adopted, e.g. “ASAP” is used for “as soon as possible”.",
                    "sid": 59,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3) Homophone (H).",
                    "sid": 60,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A NIL expression is sometimes generated by borrowing a word with similar sound (i.e. similar Pinyin).",
                    "sid": 61,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example “ ⿔ 佁 ” equals “ ୰ ⃶ ” which means “like”.",
                    "sid": 62,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“⿔佁” and “୰⃶” hold homophony in a Chinese dialect.",
                    "sid": 63,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4) Transliteration (T) is a transcription from one alphabet to another and a letter-for-letter or sound-for-letter spelling is applied to represent a word in another language.",
                    "sid": 64,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “ᢰᢰ(bai4 bai4)” is transliteration of “bye-bye”.",
                    "sid": 65,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A thorough observation, in turn, reveals that, based on the ways NIL expressions are formed and/or their part of speech (POS) attributes, we observe a NIL expression usually takes one of the forms presented in Table 1 and Table 2.",
                    "sid": 66,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The above empirical study is essential to NIL lexicography and feature definition.",
                    "sid": 67,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1: NIL expression forms based on word formation.",
                    "sid": 68,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word Formation # of NIL Expressions Examples Chinese Word or Phrase 33 “⿔佁” represents “୰⃶” and means “like”.",
                    "sid": 69,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sequence of English Capitals 341 “PF” represents “Խ᳡” and means “admire”.",
                    "sid": 70,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Number 8 “94(jiu3 si4)” represents “ህᰃ(jiu4 shi4)” and means “exactly be”.",
                    "sid": 71,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mixture of the Above Forms 30“8 䫭(ba1 cuo4)” repre sents “ϡ䫭(bu3 cuo4)” and means “not bad”.",
                    "sid": 72,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Emoticons 239 “:-(” represents a sad emotion.",
                    "sid": 73,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2: NIL expression forms based on POS attribute.",
                    "sid": 74,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "POS Attribute # of NIL Expressions Examples Number 1 “W” represents “ϛ(wan4)” and means “ten thousand”.",
                    "sid": 75,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pronoun 9 “ي” represents “៥” and means “I”.",
                    "sid": 76,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun 29 “LG” represents “㗕݀(lao3 gong1)” and means “hus band”.",
                    "sid": 77,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adjective 250 “FB” represents “㜤䋹(fu3 bai4)” and means “corrupt”.",
                    "sid": 78,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verb 34“㩅ⱑ(cong1 bai2)” repre sents “ዛᢰ(chong3 bai4)” and means “adore”.",
                    "sid": 79,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adverb 10 “㉝(fen3)” represents “ᕜ (hen3)” and means “very”.",
                    "sid": 80,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Exclamation 9 “ᤣ(nie0)” represents “ਸ਼ (ne0)” and equals a descriptive exclamation.",
                    "sid": 81,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Phrase 309 “AFK” represents “Away From Keyboard”.",
                    "sid": 82,
                    "ssid": 42,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related works. ",
            "number": "3",
            "sents": [
                {
                    "text": "NIL expression recognition, in particular, can be considered as a subtask of information extraction (IE).",
                    "sid": 83,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Named entity recognition (NER) happens to hold similar objective with NIL expression recognition, i.e. to extract meaningful text segments from unstructured text according to certain predefined criteria.",
                    "sid": 84,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NER is a key technology for NLP applications such as IE and question & answering.",
                    "sid": 85,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It typically aims to recognize names for person, organization, location, and expressions of number, time and cur rency.",
                    "sid": 86,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The objective is achieved by employing either handcrafted knowledge or supervised learning techniques.",
                    "sid": 87,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The latter is currently dominating in NER amongst which the most popular methods are decision tree (Sekine et al., 1998; Pailouras et al., 2000), Hidden Markov Model (Zhang et al., 2003; Zhao, 2004), maximum entropy (Chieu and Ng, 2002; Bender et al., 2003), and support vector machines (Isozaki and Kazawa, 2002; Takeuchi and Collier, 2002; Mayfield, 2003).From the linguistic perspective, NIL expres sions are rather different from named entities in nature.",
                    "sid": 88,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Firstly, named entity is typically noun or noun phrase (NP), but NIL expression can be any kind, e.g. number “94” in NIL represents “ህᰃ” which is a verb meaning “exactly be”.",
                    "sid": 89,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondly, named entities often have well-defined meanings in text and are tractable from a standard dictionary; but NIL expressions are either unknown to the dictionary or ambiguous.",
                    "sid": 90,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “ ⿔佁” appears in conventional dictionary with the meaning of Chinese porridge, but in NIL text it represents “ ୰⃶” which surprisingly represents “like”.",
                    "sid": 91,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The issue that concerns us is that these expressions like “ ⿔佁” may also appear in NIL text with their formal meaning.",
                    "sid": 92,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This leads to ambiguity and makes it more difficult in NIL processing.",
                    "sid": 93,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another notable work is the project of “Normalization of Nonstandard Words” (Sproat et al., 2001) which aims to detect and normalize the “NonStandard Words (NSW)” such as digit sequence; capital word or letter sequence; mixed case word; abbreviation; Roman numeral; URL and email address.",
                    "sid": 94,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our work, we consider most types of the NSW in English except URL and email address.",
                    "sid": 95,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, we consider Chinese NIL expressions that contain same characters as the normal words.",
                    "sid": 96,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “ ⿔ 佁 ” and “㩅ⱑ” both appear in common dictionaries, but they carry anomalous meanings in NIL text.",
                    "sid": 97,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ambiguity arises and basically brings NIL expressions recognition beyond the scope of NSW detection.",
                    "sid": 98,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to the above observations, we propose to employ the existing IE techniques to handle NIL expressions.",
                    "sid": 99,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our goal is to develop a NIL expression recognition system to facilitate network-mediated communication.",
                    "sid": 100,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this purpose, we first construct the required NIL knowledge resources, namely, a NIL dictionary and n-gram statistical features.",
                    "sid": 101,
                    "ssid": 19,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "knowledge engineering. ",
            "number": "4",
            "sents": [
                {
                    "text": "Recognition of NIL expressions relies on unconventional linguistic knowledge such as NIL dictionary and NIL features.",
                    "sid": 102,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We construct a NIL corpus and develop a knowledge engineering component to obtain these knowledge by running a knowledge mining tool on the NIL corpus.",
                    "sid": 103,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The knowledge mining tool is a text processing program that extracts NIL expressions and their attributes and contextual information, i.e. n-grams, from the NIL corpus.",
                    "sid": 104,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Workflow for this component is presented in Figure 1.",
                    "sid": 105,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NIL expressions are marked up with SGML.",
                    "sid": 106,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The typical example, i.e. “Ҫ㒚ܿ㒚㽕ᓔ Ӯଞ˛” in Section 1, is annotated as follows.",
                    "sid": 107,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ҫ<NILEX string=“㒚ܿ㒚” class=“H” normal=“ᰃ ϡᰃ” pinyin=“xi4 ba1 xi4” segments=“㒚|ܿ|㒚” pos=“VERB” posseg=“ADJ|NUM|ADJ”>㒚ܿ㒚 </NILEX>㽕ᓔӮଞ˛ where NILEX is the SGML tag to label a NIL expression, which entails NIL linguistic attributes including class, normal, pinyin, segments, pos, and posseg (see Section 4.2).",
                    "sid": 108,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "H is a value of class (see Section 2).",
                    "sid": 109,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Value VERB demotes verb, ADJ adjective, NUM number and AUX auxiliary.",
                    "sid": 110,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Original Text Collection Extract A Sentence 4.2 NIL Dictionary.",
                    "sid": 111,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NIL dictionary is a structured databank that Word Segmentation & POS Tagging (ICTCLAS) contains NIL expression entries.",
                    "sid": 112,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each entity in turn entails nine attributes described as follow.",
                    "sid": 113,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 114,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ID: an unique identification.",
                    "sid": 115,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "number for the NIL Corpus NILE Annotation NIL expression, e.g. 915800; 2.",
                    "sid": 116,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "string: string of the NIL expression, e.g. “㒚 Knowledge Mining Tool ܿ㒚”; 3.",
                    "sid": 117,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "class: class of the NIL expression (see Section 2), e.g. “H” for homophony; NIL Dictionary NIL Features 4.",
                    "sid": 118,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "pinyin: Chinese Pinyin for the NIL expression, e.g. “xi4 ba1 xi4”; 5.",
                    "sid": 119,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "normal: corresponding normal text for the Figure 1: Workflow for NIL knowledge engineering component.",
                    "sid": 120,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NILE refers to NIL expression, which is identified and annotated by human annotator.",
                    "sid": 121,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 NIL Corpus.",
                    "sid": 122,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NIL corpus is a collection of network informal sentences which provides training data for NIL dictionary and statistical NIL features.",
                    "sid": 123,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NIL corpus is constructed by annotating a collection of NIL text manually.",
                    "sid": 124,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obtaining real chat text is difficult because of the privacy restriction.",
                    "sid": 125,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fortunately, we find BBS text within “໻ఈऎ(da4 zui3 qu1)” zone in YESKY system (http://bbs.yesky.com/bbs/) reflects remarkable colloquial characteristics and contains a vast amount of NIL expressions.",
                    "sid": 126,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We download BBS text posted from December 2004 and February 2005 in this zone.",
                    "sid": 127,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentences with NIL expressions are selected by human annotators, and NIL expressions are manually identified and annotated with their attributes.",
                    "sid": 128,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We finally collected 22,432 sentences including 451,193 words and 22,648 NIL expressions.",
                    "sid": 129,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NIL expression, e.g. “ᰃϡᰃ”; 6.",
                    "sid": 130,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "segments: word segments of the NIL expression, e.g. “㒚|ܿ|㒚”; 7.",
                    "sid": 131,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "pos: POS tag associated with the expression, e.g. “VERB” denoting a verb;8.",
                    "sid": 132,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "posseg: a POS tag list for the word seg ments, e.g. “VERB|AUX|VERB”; 9.",
                    "sid": 133,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "frequency: number of occurrences of the NIL expression.",
                    "sid": 134,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We run the knowledge mining tool to extract all annotated NIL expressions together with their attributes from the NIL corpus.",
                    "sid": 135,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NIL expressions are then each assigned an ID number and inserted into an indexed data file, i.e. the NIL dictionary.",
                    "sid": 136,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Current NIL dictionary contains 651 NIL entries.",
                    "sid": 137,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 NIL Feature Set.",
                    "sid": 138,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NIL features are required by support vector machines method in NIL expression recognition.",
                    "sid": 139,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We define two types of statistical features for NIL expressions, i.e. Chinese word n-grams and POS tag n-grams.",
                    "sid": 140,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bigger n leads to more contextual information, but results in higher computational complexity.",
                    "sid": 141,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To compromise, we generate n-grams with n = 1, 2, 3, 4.",
                    "sid": 142,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “ૢӀ/㒚ܿ㒚” is a bi-gram for “㒚ܿ㒚” in terms of word segmentation, and its POS tag bi-gram is “PRONOUN/ VERB”.",
                    "sid": 143,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We run the knowledge mining tool on the NIL corpus to produce all n-grams for Chinese words and their POS tags in which NIL expression appears.",
                    "sid": 144,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8379 features were generated including 7416 word-based n-grams and 963 POS tag-based n-grams.",
                    "sid": 145,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These statistical NIL features are linked to the corresponding NIL dictionary entries by their global NIL expression IDs.Besides, we consider some morphological fea tures including being/containing a number, some 5.2.1 Method I: Pattern Matching Pattern matching (PM) is a traditional method in information extraction systems.",
                    "sid": 146,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It uses a handcrafted rule set and dictionary for this purpose.",
                    "sid": 147,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because it’s simple, fast and independent of corpus, this method is widely used in IE tasks.",
                    "sid": 148,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By applying NIL dictionary, candidates of NIL expressions are first extracted from the input text with longest matching.",
                    "sid": 149,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As ambiguity occurs constantly, 24 patterns are produced and employed to disambiguate.",
                    "sid": 150,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first extract those word and POS tag n-grams from the NIL corpus and create patterns by generalizing them manually.",
                    "sid": 151,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An illustrative pattern is presented as follows.",
                    "sid": 152,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[< v _ any !] 8 < not(v _ unit) ! [< v _ any !] \u009f ਇEnglish capitals or Chinese characters.",
                    "sid": 153,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These fea tures can be extracted by parsing string of the NIL where v _ any and v _ unit are variables denoting expressions.",
                    "sid": 154,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "any word and any unit word respectively; not (x)",
                    "sid": 155,
                    "ssid": 54,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "niler system. ",
            "number": "5",
            "sents": [
                {
                    "text": "5.1 Architecture.",
                    "sid": 156,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We develop NILER system to recognize NIL expressions in NIL text and convert them to normal language text.",
                    "sid": 157,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The latter functionality is discussed in other literatures.",
                    "sid": 158,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Architecture of NILER system is presented in Figure 2.",
                    "sid": 159,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word Segmentation is the negation operator.",
                    "sid": 160,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The illustrative pattern determines “8” to be a NIL expression if it is succeeded by a unit word.",
                    "sid": 161,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With this pattern, “8” within sentence “ҪᎹ԰њ 8 ϾᇣᯊǄ (He has been working for eight hours.)” is not recognized as a NIL expression.",
                    "sid": 162,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2.2 Method II: Support Vector Machines Support vector machines (SVM) method produces high performance in many classification tasks Chat Text NIL Features Word POS Tagging (ICTCLAS) NIL Expression Recognizer (Joachims, 1998; Kudo and Matsumoto, 2001).",
                    "sid": 163,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As SVM can handle large numbers of features efficiently, we employ SVM classification method to NIL expression recognition.",
                    "sid": 164,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suppose we have a set of training data for a two-class classification problem {(x1,y1), (x2, NIL Dictionary NIL Expression List y2),…,(xN, yN)}, where xi \u008f R D (i 1,2,...N ) is a fea ture vector of the i-th order sample in the training Figure 2: Architecture of NILER system.",
                    "sid": 165,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "set and yi \u008f {+1,-1} is the label for the sample.",
                    "sid": 166,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The input chat text is first segmented and POS tagged with ICTCLAS tool.",
                    "sid": 167,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because ICTCLAS is The goal of SVM is to find a decision function that accurately predicts y for unseen x. A non-linear SVM classifier gives a decision functionnot able to identify NIL expressions, some expres sions are broken into several segments.",
                    "sid": 168,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NIL expression recognizer processes the segments and f (x) sign( g ( x)) for an input vector x, where l POS tags and identifies the NIL expressions.",
                    "sid": 169,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "g ( x) Y i K ( x, zi ) + b i 1 5.2 NIL Expression Recognizer.",
                    "sid": 170,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The zi s are so-called support vectors, and We implement two methods in NIL expression recognition, i.e. pattern matching and support vecrepresents the training samples.",
                    "sid": 171,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Y i and b are pa rameters for SVM motel.",
                    "sid": 172,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "l is number of training tor machines.",
                    "sid": 173,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "samples.",
                    "sid": 174,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "K ( x, z) is a kernel function that implic itly maps vector x into a higher dimensional space.",
                    "sid": 175,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A typical kernel is defined as dot products, i.e. mental results with criteria including precision, recall and F1-measure.",
                    "sid": 176,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "K ( x, z) k ( x x z) . 6.2 Experi mental ResultsBased on the training process, the SVM algo rithm constructs the support vectors and parameters.",
                    "sid": 177,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When text is input for classification, it is first converted into feature vector x. The SVM method then classifies the vector x by determining sign of We present experimental results of the two methods on the five corpora in Table 3.",
                    "sid": 178,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3: Experimental results for the two methods on the five corpora.",
                    "sid": 179,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PRE denotes precision, REC denotes recall, and F1 g(x), in which f ( x) 1 means that word x is posi denotes F1-Measure.",
                    "sid": 180,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tive and otherwise if f ( x)-1 . The SVM algo rithm was later extended in SVMmulticlass to predict multivariate outputs (Joachims, 1998).",
                    "sid": 181,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In NIL expression recognition, we consider NIL corpus as training set and the annotated NIL expressions as samples.",
                    "sid": 182,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NIL expression recognition is achieved with the five-class SVM classification task, in which four classes are those defined in Section 2 and reflected by class attribute within NIL annotation scheme.",
                    "sid": 183,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fifth class is NOCLASS, which means the input text is not any NIL expression class.",
                    "sid": 184,
                    "ssid": 29,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "6",
            "sents": [
                {
                    "text": "6.3 Discussion I: The Two Methods.",
                    "sid": 185,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To compare performance of the two methods, we present the experimental results with smoothed curves for precision, recall and F1Mesure in Figure 3, Figure 4 and Figure 5 respectively.",
                    "sid": 186,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0.95 6.1 Experiment Description.",
                    "sid": 187,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We conduct experiments to evaluate the two methods in performing the task of NIL expression recognition.",
                    "sid": 188,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In training phase we use NIL corpus to construct NIL dictionary and pattern set for PM 0.9 0.85 0.8 0.75 0.7 0.65 Pattern Matching SVM 0 1 2 3 4 5 6 method, and generate statistical NIL features, support vectors and parameters for SVM methods.",
                    "sid": 189,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To observe how performance is influenced by the volume of training data, we create five NIL corpora, i.e. C#1~C#5, with five numbers of NIL sentences, i.e. 10,000, 13,000, 16,000, 19,000 and 22,432, by randomly selecting sentence from NIL corpus de Figure 3: Smoothed precision curves over the five corpora.",
                    "sid": 190,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0.9 0.85 0.8 0.75 0.7 0.65 0.6 Pattern Matching.",
                    "sid": 191,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "scribed in Section 4.1.To generate test set, we download 5,690 sen 0.55 0.5 SVM 0 1 2 3 4 5 6 tences from YESKY system which cover BBS text in March 2005.",
                    "sid": 192,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We identify and annotate NIL expressions within these sentences manually and consider the annotation results as gold standard.",
                    "sid": 193,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first train the system with the five corpora to produce five versions of NIL dictionary, pattern set, statistical NIL feature set and SVM model.",
                    "sid": 194,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then run the two methods with each version of the above knowledge over the test set to produce recognition results automatically.",
                    "sid": 195,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compare these results against the gold stand and present experi Figure 4: Smoothed recall curves over the five corpora.",
                    "sid": 196,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 reveals that PM method produces higher precision, i.e. 91.5%, and SVM produces higher recall, i.e. 79.3%, and higher F1-Measure, i.e. 87.1%, with corpus C#5.",
                    "sid": 197,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be inferred that PM method is self-restrained.",
                    "sid": 198,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, if a NIL expression is identified with this method, it is very likely that the decision is right.",
                    "sid": 199,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the weakness is that more NIL expressions are neglected.",
                    "sid": 200,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, SVM method outper forms PM method regarding overall capability, i.e. F1-Measure, according to Figure 5.",
                    "sid": 201,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0.9 0.85 0.8 0.75 0.7 The smoothed quality curves in Figure 6 and Figure 7 reveal the tendency that bigger volume of training data leads to better processing quality.",
                    "sid": 202,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Meanwhile, the improvement tends to decrease along with increasing of volume.",
                    "sid": 203,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It thus predicts that there exists a corpus with a certain volume that produces the best quality according to the ten 0.65 0.6 P a t t e r n M a t c h i n g S V M 0 1 2 3 4 5 6 dency.",
                    "sid": 204,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although current corpus is not big enough to prove the optimal volume, the tendency revealed by the curves is obvious.",
                    "sid": 205,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 5: Smoothed F1-Measure curves over the five corpora.",
                    "sid": 206,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We argue that each method holds strength and weakness.",
                    "sid": 207,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different methods should be adopted to cater to different application demands.",
                    "sid": 208,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in CRM text processing, we might favor precision.",
                    "sid": 209,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So PM method may be the better choice.",
                    "sid": 210,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, to perform the task of chat room security monitoring, recall is more important.",
                    "sid": 211,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then SVM method becomes the better option.",
                    "sid": 212,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We claim that there exists an optimized approach which combines the two methods and yields higher precision and better robustness at the same time.",
                    "sid": 213,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.4 Discussion II: How Volume Influences Per-.",
                    "sid": 214,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "formance To observe how training corpus influences performance in the two methods regarding volume, we present experimental results with smoothed quality curves for the two method in Figure 6 and Figure 7 respectively.",
                    "sid": 215,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0.95 0.9 0.85 0.8 0.75 0.7 6.5 Error Analysis.",
                    "sid": 216,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present two examples to analyze errors occur within our experiments.",
                    "sid": 217,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Err.1 Ambiguous NIL Expression Example 1: [Sentence]: ៥䖬ᰃ 8 ㉇ⱑ [Meaning]: I still don’t understand.",
                    "sid": 218,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[NIL expression found(Y/N)?",
                    "sid": 219,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "]: Y [Normal language text]: ៥䖬ᰃϡᯢⱑ Error in Example 1 is caused by failure in identifying “ ㉇ ⱑ (mi3 bai2)”.",
                    "sid": 220,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because “ ㉇ (mi3)” succeeds “8(ba1)” in the word segments, i.e. “៥|䖬ᰃ|8|㉇|ⱑ”, and it can be used as a unit word, PM method therefore refuses to iden tify “8(ba)” as a NIL expression according to the pattern described in Section 5.2.1.",
                    "sid": 221,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, “㉇ⱑ” is an unseen NIL expression.",
                    "sid": 222,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SVM method suc cessfully recognizes “ ㉇ ⱑ ” to be “ ㉇ ᳝ (mi3 you3)”, thus recognizes “8”.",
                    "sid": 223,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments 56 errors in PM method suffer the same failure, while SVM method identifies 48 of them.",
                    "sid": 224,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This demonstrates that PM method is self-restrained and SVM method is relatively scalable in process 0.65 0.6 0.55 0.5 PRE REC F1 0 1 2 3 4 5 6 ing NIL text.",
                    "sid": 225,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Err.2 Unseen NIL express ion Exampl e 2: Figure 6: Smoothed quality curves for PM method over the five corpora.",
                    "sid": 226,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0.9 0.85 0.8 PRE [Sentence]: ߮ ߮ ੼ 4U ࿁᧪ [Meaning]: Just came back from 4U.",
                    "sid": 227,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[NIL expression found (Y/N)?]",
                    "sid": 228,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": ": N Actually, there is no NIL expression in example 2.",
                    "sid": 229,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But because of a same 1-gram with “4D”,.",
                    "sid": 230,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "i.e. “4”, SVM outputs “4U” as a NIL expression.",
                    "sid": 231,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, it is the name for a mobile dealer.",
                    "sid": 232,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are 0.75 0.7 0.65 REC F1 0 1 2 3 4 5 6 78 same errors in SVM method in our experiments, which reveals that SVM method is sometimes over predicting . In other.",
                    "sid": 233,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "words, some NIL Figure 7: Smoothed quality curves for SVM method over the five corpora.",
                    "sid": 234,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "expressions are recognized with SVM method by mistake, which results in lower precision.",
                    "sid": 235,
                    "ssid": 51,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions and future works. ",
            "number": "7",
            "sents": [
                {
                    "text": "Network informal language processing is a new NLP research application, which seeks to recognize and normalize NIL expressions automatically in a robust and adaptive manner.",
                    "sid": 236,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This research is crucial to improve capability of NLP techniques in dealing with NIL text.",
                    "sid": 237,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With empirical study on Chinese network informal text and NIL expressions, we propose two NIL expression recognition methods, i.e. pattern matching and support vector machines.",
                    "sid": 238,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experimental results show that PM method produces higher precision, i.e. 91.5%, and SVM method higher F-1 measure, i.e. 87.1%.",
                    "sid": 239,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results are encouraging and justify our future research effort in NIL processing.",
                    "sid": 240,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Research presented in this paper is preliminary but significant.",
                    "sid": 241,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We address future works as follow.",
                    "sid": 242,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Firstly, NIL corpus constructed in our work is fundamental.",
                    "sid": 243,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Not only will difficulty in seeking for text resource be overcome, but a large quantity of manpower will be allocated to this laborious and significant work.",
                    "sid": 244,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondly, new NIL expressions will appear constantly with booming of network- mediated communication.",
                    "sid": 245,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A powerful NIL expression recognizer will be designed to improve adaptivity of the recognition methods and handle the unseen NIL expressions effectively.",
                    "sid": 246,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we state that research in this paper targets in special at NIL expressions in China mainland.",
                    "sid": 247,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to cultural/geographical variance, NIL expressions in Hong Kong and Taiwan could be different.",
                    "sid": 248,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further research will be conducted to adapt our methods to other NIL communities.",
                    "sid": 249,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}