{
    "ID": "I05-3030",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper presents our recent work for participation in the Second International Chinese Word Segmentation Bakeoff.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to difficulties, we divide word segmentation into several sub-tasks, which are solved by mixed language models, so as to take advan2 ELUS Segmenter All the words are categorized into five types: Lexicon words (LW), Factoid words (FT), Morphologically derived words (MDW), Named entities (NE), and New words (NW).",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accordingly, four main modules are included to identify each kind of words, as shown in Figure 1.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tage of each approach in addressing special problems.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiment indicated that this system achieved 96.7% and 97.2% in F-measure in PKU and MSR open test respectively.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Word is a logical semantic and syntactic unit in natural language.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So word segmentation is the foundation of most Chinese NLP tasks.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Though much progress has been made in the last two decades, there is no existing model that can solve all the problems perfectly at present.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So we try to apply different language models to Sentence Basic Segmentation NE Recognization NW Detection Disambiguation String Factoid Detect Lexicon words Morphology Word Result solve each special sub-task, due to “No Free Lunch Theorem” and “Ugly Duckling Theorem”.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our system participated in the Second International Chinese Word Segmentation Bakeoff (henceforce, the bakeoff) held in 2005.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently, we have done more work in dealing with three main sub-tasks: (1) Segmentation disambigua Figure 1 ELUS Segmenter Class-based trigram model (Gao 2004) is adopted in the Basic Segmentation to convert the sentence into a word sequence.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let w = w1 w2 …wn be a word class sequence, then the most likely word class sequence w* in trigram is: n w* arg max P(w | w w ) , tion; (2) Named entities recognition; (3) New w w w \u0096 i i 2 i 1 words1 detection.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We apply different approachs to solve above three problems, and all the mod ules are integrated into a pragmatic system (ELUS).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the limitation of available resource, some kinds of features, e.g. POS, have been erased in our participation system.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This segmenter will be briefly describled in this paper.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 New words refer to this kind of out-of –vocabulary words.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "that are neither recognized named entities or factoid words nor morphological words.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 2 n i 1 where let P(w0|w-2 w-1) be P(w0) and let P(w1|w-1 w0) be P(w1|w0).",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And wi represents LW or a type of FT or MDW.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Viterbi algorithm is used to search the best candidate.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Absolute smoothing algorithm is applied to overcome the data sparseness.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, LW, FT and MDW are idendified (Zhao Yan 2005).",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the Factoid words can be represented as regular expressions.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, the detection of factoid words can be archieved by Finite State Machines.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Four kinds of Named entities are detected, i.e. Chinese person name, foreign person name, location name and orgnization name.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is the most complicated module in ELUS.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Three kinds of models are applied here.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "HMM model (one order) is described as: n ELUS, the most segmentation errors are one segmentation errors (about 95%).",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "i.e. the two words on both sides of current segmentation errors are right.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These include LW ambiguities and FT ambiguities etc. Here, we adopt Maximum Entropy model.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same as other modules, it is defined over HhT in segmentation T # arg max P(W | T )P(T | T ) , i i T1T2 Tn i 1 i i 1 disambiguation, where H is the set of possible contexts around target word that will be tagged, where Ti represents the tag of current word, and T is the set of allowable tags.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then the Viterbi algorithm is used to search the best path.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "model’s conditional probability is defined as Another model is Maximum Entropy (Zhao Jian 2005, Hai Leong Chieu 2002).",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Take Chinese person name as example.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Firstly, we combine p(t | h) p(h, t ) ¦t '\u008fT p(h, t ' ) , where HMM and Maximum Entropy (ME) model to lable the person name tag, e.g. “ྮ/CPB 䪰/CPI ṙ/CPI” (Tongmei Yao); Secondly, the tagged p(h, t) k SP D j 1 f j ( h,t ) j name is merged by combining ME Model and Support Vector Machine (SVM) and some aided rules, e.g. merged into “ྮ/䪰ṙ” in PKU test.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some complex features are added into ME model (described in Zhao Jian 2005), in addition, we also collect more than 110,000 person names, and acquire the statistic about common name characters, these kinds of features are also fused into the ME model to detect NE.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other kinds of NE recognition adopt similar method, except for individual features.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "New Words is another important kind of OOV words, especially in closed test.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Take PKU test as example, we collect NW suffixes, such as “Ꮦ”(city),”♃”(lamp).",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Those usually construct new words, e.g. “᱃㾖♃”(sighting lamp).",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A variance-based method is used to collect suffixes.",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And three points need to be considered:(1) It is tail of many words;(2) It has large variance in constructing word;(3) It is seldom used alone.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We acquire about 25 common suffixes in PKU training corpus by above method.",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use Local Maximum Entropy model, e.g. “ 咘ݜ/1 Ꮦ/1”(Huanggang city), i.e. only the nearer characters are judged before the suffix “Ꮦ” (city).",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By our approach, the training corpus can be generated via given PKU corpus in thebakeoff.",
                    "sid": 45,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features come from the nearer con text, besides, common single words and punctuations are not regarded as a part of New Word.",
                    "sid": 46,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last module is Word Disambiugation.",
                    "sid": 47,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word segmentation ambiguities are usually classified into two classes: overlapping ambiguity and combination ambiguity.",
                    "sid": 48,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By evaluating where h is current context and t is one of the possible tags.",
                    "sid": 49,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ambiguous words are mainly collected by evaluating our system.",
                    "sid": 50,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In NE module and Word Disambiguation module, we introduce rough rule features, which are extracted by Rough Set (Wang Xiaolong 2004), e.g. “ᮑሩÆᠡ㛑”(display ability), “া ᳝Æᠡ/㛑”(onlyÆ can just), “䆄㗙+person+᡹ 䘧” (the reporter+person+report).",
                    "sid": 51,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous ex periment had indicated word disambiguation could achieve better performance by applying Rough Set.",
                    "sid": 52,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 Performance and.",
                    "sid": 53,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "analysis The performance of ELUS in the bakeoff is presented in Table 1 and Table 2 respectively, in terms of recall(R), precision(P) and F score in percentages.",
                    "sid": 54,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 Closed test, in percentages (%) Table 2 Open test, in percentages (%) Our system has good performance in terms of F-measure in simplified Chinese open test, including PKU and MSR open test.",
                    "sid": 55,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, its IV word identification performance is remarkable, ranging from 97.7% to 99.1%, stands at the top or nearer the top in all the tests in which we have participated.",
                    "sid": 56,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This good performance owes to class-based trigram, absolute smoothing and word disambiguation module and rough rules.",
                    "sid": 57,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is almost the same IV performance between open test and closed test in MSR, CITYU and AS respectively, because we adopt the same Lexicon between open test and closed test respectively.",
                    "sid": 58,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While in open test of PKU, we adopt another Lexicon that comes from six-month corpora of Peoples’ Daily (China) in 1998, which were also annotated by Peking University.",
                    "sid": 59,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The OOV word identification performance seems uneven, compared with PKU, the other tests seem lower, due to the following reasons: (1) Because of our resource limitation, NE training resource is six-month corpora of Peoples’ Daily (China) in 1998, which came from Peking University, and some newspapers and web pages annotated by our laboratory; (2) We have no traditional Chinese corpus, so the NE training resource for CITYU and AS is acquired via converting above corpora.",
                    "sid": 60,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since these corpora are converted from simplified Chinese, they are not well suitable to traditional Chinese corpora; (3) The different corpora have different criterions in NE detection, especially in location name and organization name, e.g. “የᴥ䬛/佭ූ / ⣾എ” (Cuicun Town Xiangtang Hogpen) in PKU and “የᴥ䬛佭ූ⣾എ” in MSR criterion.",
                    "sid": 61,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even if our system recognizes the “የᴥ䬛/佭/ ූ/⣾എ” as a orgnization name, we are not easily to regard “ 佭 ූ ” as one word in PKU, since ”佭ූ” isn’t a lexical word.",
                    "sid": 62,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However in MSR, that is easy, because its criterion regard the whole Orgnization as a word; (4) We need do more to comply with the segmentation criterion, e.g. “䴆ᆓ㗙”(outlier) in CITYU come from “䴆ᆓ” + “㗙”, while this kind of false segment is due to our bad understanding to CITYU criterion.",
                    "sid": 63,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Though there are above problems, our system does well in regonization precision, since we adopt two steps in recognizing NE, especial in recognizing Chinese person name.",
                    "sid": 64,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And from the result of evalution in the bakeoff, we need to improve the NE recall in the future.",
                    "sid": 65,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to make our New words comply with the criterion, we conservatively use New Word Detection module, in order to avoid having bad recognition result, since each corpus has its own New Word criterion.",
                    "sid": 66,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 Conclusion and Future work.",
                    "sid": 67,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have briefly describled our system based on mixed models.",
                    "sid": 68,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different approachs are adopted to solve each special sub-task, since there is “No Free Lunch Theorem”.",
                    "sid": 69,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And mixed models are used in NE detection.",
                    "sid": 70,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This sytem has a good performance in the simplified Chinese in the bakeoff.",
                    "sid": 71,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The future work is mainly concentrating on two directions: finding effective features and delicately adjusting internal relations among different modules, in order to improve segmentation performance.",
                    "sid": 72,
                    "ssid": 72,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}