{
    "ID": "I05-5011",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Automatic Paraphrase Discovery based on Context and Keywords between NE Pairs",
                    "sid": 0,
                    "ssid": null,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Automatic paraphrase discovery is an important but challenging task.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose an unsupervised method to discover paraphrases from a large untagged corpus, without requiring any seed phrase or other cue.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We focus on phrases which connect two Named Entities (NEs), and proceed in two stages.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first stage identifies a keyword in each phrase and joins phrases with the same keyword into sets.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second stage links sets which involve the same pairs of individual NEs.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A total of 13,976 phrases were grouped.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The accuracy of the sets in representing paraphrase ranged from 73% to 99%, depending on the NE categories and set sizes; the accuracy of the links for two evaluated domains was 73% and 86%.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "One of the difficulties in Natural Language Processing is the fact that there are many ways to express the same thing or event.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the expression is a word or a short phrase (like “corporation” and “company”), it is called a “synonym”.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There has been a lot of research on such lexical relations, along with the creation of resources such as WordNet.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the expression is longer or complicated (like “A buys B” and “A’s purchase of B”), it is called “paraphrase”, i.e. a set of phrases which express the same thing or event.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently, this topic has been getting more attention, as is evident from the Paraphrase Workshops in 2003 and 2004, driven by the needs of various NLP applications.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in Information Retrieval (IR), we have to match a user’s query to the expressions in the desired documents, while in Question Answering (QA), we have to find the answer to the user’s question even if the formulation of the answer in the document is different from the question.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, in Information Extraction (IE), in which the system tries to extract elements of some events (e.g. date and company names of a corporate merger event), several event instances from different news articles have to be aligned even if these are expressed differently.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We realize the importance of paraphrase; however, the major obstacle is the construction of paraphrase knowledge.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, we can easily imagine that the number of paraphrases for “A buys B” is enormous and it is not possible to create a comprehensive inventory by hand.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, we don’t know how many such paraphrase sets are necessary to cover even some everyday things or events.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Up to now, most IE researchers have been creating paraphrase knowledge (or IE patterns) by hand and for specific tasks.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, there is a limitation that IE can only be performed for a predefined task, like “corporate mergers” or “management succession”.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to create an IE system for a new domain, one has to spend a long time to create the knowledge.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, it is too costly to make IE technology “open- domain” or “on-demand” like IR or QA.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we will propose an unsupervised method to discover paraphrases from a large untagged corpus.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are focusing on phrases which have two Named Entities (NEs), as those types of phrases are very important for IE applications.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After tagging a large corpus with an automatic NE tagger, the method tries to find sets of paraphrases automatically without being given a seed phrase or any kinds of cue.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "algorithm. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Overview.",
                    "sid": 25,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Before explaining our method in detail, we present a brief overview in this subsection.",
                    "sid": 26,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, from a large corpus, we extract all the NE instance pairs.",
                    "sid": 27,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, an NE instance pair is any pair of NEs separated by at most 4 syntactic chunks; for example, “IBM plans to acquire Lotus”.",
                    "sid": 28,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each pair we also record the context, i.e. the phrase between the two NEs (Step1).",
                    "sid": 29,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, for each pair of NE categories, we collect all the contexts and find the keywords which are topical for that NE category pair.",
                    "sid": 30,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use a simple TF/IDF method to measure the topicality of words.",
                    "sid": 31,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hereafter, each pair of NE categories will be called a domain; e.g. the “Company – Company” domain, which we will call CC- domain (Step 2).",
                    "sid": 32,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each domain, phrases which contain the same keyword are gathered to build a set of phrases (Step 3).",
                    "sid": 33,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we find links between sets of phrases, based on the NE instance pair data (for example, different phrases which link “IBM” and “Lotus”) (Step 4).",
                    "sid": 34,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we shall see, most of the linked sets are paraphrases.",
                    "sid": 35,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This overview is illustrated in Figure 1.",
                    "sid": 36,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Corpus Step 1 NE pair instances Step 2 Step 1.",
                    "sid": 37,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extract NE instance pairs with contexts First, we extract NE pair instances with their context from the corpus.",
                    "sid": 38,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sentences in the corpus were tagged by a transformation-based chunker and an NE tagger.",
                    "sid": 39,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NE tagger is a rule-based system with 140 NE categories [Sekine et al. 2004].",
                    "sid": 40,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These 140 NE categories are designed by extending MUC’s 7 NE categories with finer sub-categories (such as Company, Institute, and Political Party for Organization; and Country, Province, and City for Location) and adding some new types of NE categories (Position Title, Product, Event, and Natural Object).",
                    "sid": 41,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the NE pair instances which co-occur separated by at most 4 chunks are collected along with information about their NE types and the phrase between the NEs (the ‘context’).",
                    "sid": 42,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows examples of extracted NE pair instances and their contexts.",
                    "sid": 43,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The data is sorted based on the frequency of the context (“a unit of” appeared 314 times in the corpus) and the NE pair instances appearing with that context are shown with their frequency (e.g. “NBC” and “General Electric Co.” appeared 10 times with the context “a unit of”).",
                    "sid": 44,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 2.",
                    "sid": 45,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Find keywords for each NE pair When we look at the contexts for each domain, we noticed that there is one or a few important words which indicate the relation between the NEs (for example, the word “unit” for the phrase “a unit of”).",
                    "sid": 46,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once we figure out the important word (e.g. keyword), we believe we can capture the meaning of the phrase by the keyword.",
                    "sid": 47,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the TF/ITF metric to identify keywords.",
                    "sid": 48,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "keywords Step 3 Sets of phrases based on keywords Step 4 Links between sets of phrases All the contexts collected for a given domain are gathered in a bag and the TF/ITF scores are calculated for all the words except stopwords in the bag.",
                    "sid": 49,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, the term frequency (TF) is the frequency of a word in the bag and the inverse term frequency (ITF) is the inverse of the log of the frequency in the entire corpus.",
                    "sid": 50,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 Figure 1.",
                    "sid": 51,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overview of the method 2.2 Step by Step Algorithm.",
                    "sid": 52,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we will explain the algorithm step by step with examples.",
                    "sid": 53,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of their size, the examples (Figures 2 to 4) appear at the end of the paper.",
                    "sid": 54,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "shows some keywords with their scores.",
                    "sid": 55,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 3.",
                    "sid": 56,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gather phrases using keywords Next, we select a keyword for each phrase – the top-ranked word based on the TF/IDF metric.",
                    "sid": 57,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(If the TF/IDF score of that word is below a threshold, the phrase is discarded.)",
                    "sid": 58,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then gather all phrases with the same keyword.",
                    "sid": 59,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 4 shows some such phrase sets based on keywords in the CC-domain.",
                    "sid": 60,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 4.",
                    "sid": 61,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cluster phrases based on Links We now have a set of phrases which share a keyword.",
                    "sid": 62,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, there are phrases which express the same meanings even though they do not share the same keyword.",
                    "sid": 63,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in Figure 3, we can see that the phrases in the “buy”, “acquire” and “purchase” sets are mostly paraphrases.",
                    "sid": 64,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At this step, we will try to link those sets, and put them into a single cluster.",
                    "sid": 65,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our clue is the NE instance pairs.",
                    "sid": 66,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the same pair of NE instances is used with different phrases, these phrases are likely to be paraphrases.",
                    "sid": 67,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the two NEs “Eastern Group Plc” and “Hanson Plc” have the following contexts.",
                    "sid": 68,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, “EG” represents “Eastern Group Plc”.",
                    "sid": 69,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and “H” represents “Hanson Plc”.",
                    "sid": 70,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "x EG, has agreed to be bought by H x EG, now owned by H x H to acquire EG x H’s agreement to buy EG Three of those phrases are actually paraphrases, but sometime there could be some noise; such as the second phrase above.",
                    "sid": 71,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, we set a threshold that at least two examples are required to build a link.",
                    "sid": 72,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More examples are shown in Figure 5.",
                    "sid": 73,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice that the CC-domain is a special case.",
                    "sid": 74,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the two NE categories are the same, we can’t differentiate phrases with different orders of par ticipants – whether the buying company or the to-be-bought company comes first.",
                    "sid": 75,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The links can solve the problem.",
                    "sid": 76,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As can be seen in the example, the first two phrases have a different order of NE names from the last two, so we can determine that the last two phrases represent a reversed relation.",
                    "sid": 77,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In figure 4, reverse relations are indicated by `*’ next to the frequency.",
                    "sid": 78,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now we have sets of phrases which share a keyword and we have links between those sets.",
                    "sid": 79,
                    "ssid": 55,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 Corpora.",
                    "sid": 80,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the experiments, we used four newswire corpora, the Los Angeles Times/Washington Post, The New York Times, Reuters and the Wall Street Journal, all published in 1995.",
                    "sid": 81,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They contain about 200M words (25M, 110M, 40M and 19M words, respectively).",
                    "sid": 82,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the sentences have been analyzed by our chunker and NE tag- ger.",
                    "sid": 83,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The procedure using the tagged sentences to discover paraphrases takes about one hour on a 2GHz Pentium 4 PC with 1GB of memory.",
                    "sid": 84,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Results.",
                    "sid": 85,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this subsection, we will report the results of the experiment, in terms of the number of words, phrases or clusters.",
                    "sid": 86,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will report the evaluation results in the next subsection.",
                    "sid": 87,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 1.",
                    "sid": 88,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extract NE pair instances with contexts From the four years of newspaper corpus, we extracted 1.9 million pairs of NE instances.",
                    "sid": 89,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most frequent NE category pairs are “Person - Person (209,236), followed by “Country - Coun- try” (95,123) and “Person - Country” (75,509).",
                    "sid": 90,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The frequency of the Company – Company domain ranks 11th with 35,567 examples.",
                    "sid": 91,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As lower frequency examples include noise, we set a threshold that an NE category pair should appear at least 5 times to be considered and an NE instance pair should appear at least twice to be considered.",
                    "sid": 92,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This limits the number of NE category pairs to 2,000 and the number of NE pair instances to 0.63 million.",
                    "sid": 93,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 2.",
                    "sid": 94,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Find keywords for each NE pair The keywords are found for each NE category pair.",
                    "sid": 95,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the CC-domain, 96 keywords are found which have TF/ITF scores above a threshold; some of them are shown in Figure 3.",
                    "sid": 96,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is natural that the larger the data in the domain, the more keywords are found.",
                    "sid": 97,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the “Person – Person” domain, 618 keywords are found, and in the “Country – Country” domain, 303 keywords are found.",
                    "sid": 98,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In total, for the 2,000 NE category pairs, 5,184 keywords are found.",
                    "sid": 99,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 3.",
                    "sid": 100,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gather phrases using keywords Now, the keyword with the top TF/ITF score is selected for each phrase.",
                    "sid": 101,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a phrase does not contain any keywords, the phrase is discarded.",
                    "sid": 102,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, out of 905 phrases in the CC- domain, 211 phrases contain keywords found in step 2.",
                    "sid": 103,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In total, across all domains, we kept 13,976 phrases with keywords.",
                    "sid": 104,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 4.",
                    "sid": 105,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Link phrases based on instance pairs Using NE instance pairs as a clue, we find links between sets of phrases.",
                    "sid": 106,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the CC-domain, there are 32 sets of phrases which contain more than 2 phrases.",
                    "sid": 107,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We concentrate on those sets.",
                    "sid": 108,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among these 32 sets, we found the following pairs of sets which have two or more links.",
                    "sid": 109,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here a set is represented by the keyword and the number in parentheses indicates the number of shared NE pair instances.",
                    "sid": 110,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "buy - acquire (5) buy - agree (2) buy - purchase (5) buy - acquisition (7) buy - pay (2)* buy - buyout (3) buy - bid (2) acquire - purchase (2) acquire - acquisition (2) acquire - pay (2)* purchase - acquisition (4) purchase - stake (2)* acquisition - stake (2)* unit - subsidiary (2) unit - parent (5) It is clear that these links form two clusters which are mostly correct.",
                    "sid": 111,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will describe the evaluation of such clusters in the next subsection.",
                    "sid": 112,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Evaluation Results.",
                    "sid": 113,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluated the results based on two metrics.",
                    "sid": 114,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One is the accuracy within a set of phrases which share the same keyword; the other is the accuracy of links.",
                    "sid": 115,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We picked two domains, the CC-domain and the “Person – Company” domain (PC-domain), for the evaluation, as the entire system output was too large to evaluate.",
                    "sid": 116,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not easy to make a clear definition of “paraphrase”.",
                    "sid": 117,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sometimes extracted phrases by themselves are not meaningful to consider without context, but we set the following criteria.",
                    "sid": 118,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If two phrases can be used to express the same relationship within an information extraction application (“scenario”), these two phrases are paraphrases.",
                    "sid": 119,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although this is not a precise criterion, most cases we evaluated were relatively clear-cut.",
                    "sid": 120,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, different modalities (“planned to buy”, “agreed to buy”, “bought”) were considered to express the same relationship within an extraction setting.",
                    "sid": 121,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We did have a problem classifying some modified noun phrases where the modified phrase does not represent a qualified or restricted form of the head, like “chairman” and “vice chairman”, as these are both represented by the keyword “chairman”.",
                    "sid": 122,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this specific case, as these two titles could fill the same column of an IE table, we regarded them as paraphrases for the evaluation.",
                    "sid": 123,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation within a set The evaluation of paraphrases within a set of phrases which share a keyword is illustrated in Figure 4.",
                    "sid": 124,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each set, the phrases with bracketed frequencies are considered not paraphrases in the set.",
                    "sid": 125,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the phrase “'s New York-based trust unit,” is not a paraphrase of the other phrases in the “unit” set.",
                    "sid": 126,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As you can see in the figure, the accuracy for the domain is quite high except for the “agree” set, which contains various expressions representing different relationships for an IE application.",
                    "sid": 127,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The accuracy is calculated as the ratio of the number of paraphrases to the total number of phrases in the set.",
                    "sid": 128,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results, along with the total number of phrases, are shown in Table 1.",
                    "sid": 129,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "D o m ai n # of ph ras es t o t a l p h r a s e s ac cu ra cy C C 7 o r m o r e 1 0 5 8 7 . 6 % 6 o r l e s s 1 0 6 6 7 . 0 % P C 7 o r m o r e 3 5 9 9 9 . 2 % 6 o r l e s s 2 5 5 6 5 . 1 % Table 1.",
                    "sid": 130,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation results within sets Table 1 shows the evaluation result based on the number of phrases in a set.",
                    "sid": 131,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The larger sets are more accurate than the small sets.",
                    "sid": 132,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can make several observations on the cause of errors.",
                    "sid": 133,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One is that smaller sets sometime have meaningless keywords, like “strength” or “add” in the CC-domain, or “compare” in the PC-domain.",
                    "sid": 134,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Eight out of the thirteen errors in the high frequency phrases in the CC-domain are the phrases in “agree”.",
                    "sid": 135,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As can be seen in Figure 3, the phrases in the “agree” set include completely different relationships, which are not paraphrases.",
                    "sid": 136,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other errors include NE tagging errors and errors due to a phrase which includes other NEs.",
                    "sid": 137,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the phrase “Company-A last week purchased rival Marshalls from Company-B”, the purchased company is Marshalls, not Company-B.",
                    "sid": 138,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also there are cases where one of the two NEs belong to a phrase outside of the relation.",
                    "sid": 139,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, from the sentence “Mr.",
                    "sid": 140,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Smith estimates Lotus will make a profit this quarter…”, our system extracts “Smith esti mates Lotus” as an instance.",
                    "sid": 141,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obviously “Lotus” is part of the following clause rather than being the object of “estimates” and the extracted instance makes no sense.",
                    "sid": 142,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will return to these issues in the discussion section.",
                    "sid": 143,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation of links A link between two sets is considered correct if the majority of phrases in both sets have the same meaning, i.e. if the link indicates paraphrase.",
                    "sid": 144,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the links in the “CC-domain are shown in Step 4 in subsection 3.2.",
                    "sid": 145,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Out of those 15 links, 4 are errors, namely “buy - pay”, “acquire - pay”, “purchase - stake” “acquisition - stake”.",
                    "sid": 146,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When a company buys another company, a paying event can occur, but these two phrases do not indicate the same event.",
                    "sid": 147,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The similar explanation applies to the link to the “stake” set.",
                    "sid": 148,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We checked whether the discovered links are listed in WordNet.",
                    "sid": 149,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only 2 link in the CC- domain (buy-purchase, acquire-acquisition) and 2 links (trader-dealer and head-chief) in the PC- domain are found in the same synset of Word- Net 2.1 (http://wordnet.princeton.edu/).",
                    "sid": 150,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result suggests the benefit of using the automatic discovery method.",
                    "sid": 151,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "D o m ai n Li n k ac cu ra cy W N c o v e r a g e C C 7 3 . 3 % 2 / 1 1 P C 8 8 . 9 % 2 / 8 Table 2.",
                    "sid": 152,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation results for links",
                    "sid": 153,
                    "ssid": 74,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "4",
            "sents": [
                {
                    "text": "The work reported here is closely related to [Ha- segawa et al. 04].",
                    "sid": 154,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we will describe their method and compare it with our method.",
                    "sid": 155,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They first collect the NE instance pairs and contexts, just like our method.",
                    "sid": 156,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the next step is clearly different.",
                    "sid": 157,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They cluster NE instance pairs based on the words in the contexts using a bag- of-words method.",
                    "sid": 158,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to create good-sized vectors for similarity calculation, they had to set a high frequency threshold, 30.",
                    "sid": 159,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of this threshold, very few NE instance pairs could be used and hence the variety of phrases was also limited.",
                    "sid": 160,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, we focused on phrases and set the frequency threshold to 2, and so were able to utilize a lot of phrases while minimizing noise.",
                    "sid": 161,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[Hasegawa et al. 04] reported only on relation discovery, but one could easily acquire para phrases from the results.",
                    "sid": 162,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of NE instance pairs used in their experiment is less than half of our method.",
                    "sid": 163,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There have been other kinds of efforts to discover paraphrase automatically from corpora.",
                    "sid": 164,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of such approaches uses comparable documents, which are sets of documents whose content are found/known to be almost the same, such as different newspaper stories about the same event [Shinyama and Sekine 03] or different translations of the same story [Barzilay 01].",
                    "sid": 165,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The availability of comparable corpora is limited, which is a significant limitation on the approach.",
                    "sid": 166,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another approach to finding paraphrases is to find phrases which take similar subjects and objects in large corpora by using mutual information of word distribution [Lin and Pantel 01].",
                    "sid": 167,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach needs a phrase as an initial seed and thus the possible relationships to be extracted are naturally limited.",
                    "sid": 168,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There has also been work using a bootstrap- ping approach [Brin 98; Agichtein and Gravano 00; Ravichandran and Hovy 02].",
                    "sid": 169,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic strategy is, for a given pair of entity types, to start with some examples, like several famous book title and author pairs; and find expressions which contains those names; then using the found expressions, find more author and book title pairs.",
                    "sid": 170,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be repeated several times to collect a list of author / book title pairs and expressions.",
                    "sid": 171,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, those methods need initial seeds, so the relation between entities has to be known in advance.",
                    "sid": 172,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This limitation is the obstacle to making the technology “open domain”.",
                    "sid": 173,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discussion. ",
            "number": "5",
            "sents": [
                {
                    "text": "Keywords with more than one word In the evaluation, we explained that “chairman” and “vice chairman” are considered paraphrases.",
                    "sid": 174,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it is desirable if we can separate them.",
                    "sid": 175,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This problem arises because our keywords consist of only one word.",
                    "sid": 176,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sometime, multiple words are needed, like “vice chairman”, “prime minister” or “pay for” (“pay” and “pay for” are different senses in the CC-domain).",
                    "sid": 177,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possibility is to use n-grams based on mutual information.",
                    "sid": 178,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If there is a frequent multi-word sequence in a domain, we could use it as a keyword candidate.",
                    "sid": 179,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Keyword detection error Even if a keyword consists of a single word, there are words which are not desirable as keywords for a domain.",
                    "sid": 180,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As was explained in the results section, “strength” or “add” are not desirable keywords in the CC-domain.",
                    "sid": 181,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiment, we set the threshold of the TF/ITF score empirically using a small development corpus; a finer adjustment of the threshold could reduce the number of such keywords.",
                    "sid": 182,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, “agree” in the CC-domain is not a desirable keyword.",
                    "sid": 183,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is a relatively frequent word in the domain, but it can be used in different extraction scenarios.",
                    "sid": 184,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this domain the major scenarios involve the things they agreed on, rather than the mere fact that they agreed.",
                    "sid": 185,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“Agree” is a subject control verb, which dominates another verb whose subject is the same as that of “agree”; the latter verb is generally the one of interest for extraction.",
                    "sid": 186,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have checked if there are similar verbs in other major domains, but this was the only one.",
                    "sid": 187,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using structural information As was explained in the results section, we extracted examples like “Smith estimates Lotus”, from a sentence like “Mr.",
                    "sid": 188,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Smith estimates Lotus will make profit this quarter…”.",
                    "sid": 189,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to solve this problem, a parse tree is needed to understand that “Lotus” is not the object of “estimates”.",
                    "sid": 190,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chunking is not enough to find such relationships.",
                    "sid": 191,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This remains as future work.",
                    "sid": 192,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Limitations There are several limitations in the methods.",
                    "sid": 193,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The phrases have to be the expressions of length less than 5 chunks, appear between two NEs.",
                    "sid": 194,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, the method of using keywords rules out phrases which don’t contain popular words in the domain.",
                    "sid": 195,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are not claiming that this method is almighty.",
                    "sid": 196,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rather we believe several methods have to be developed using different heuristics to discover wider variety of paraphrases.",
                    "sid": 197,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Applications The discovered paraphrases have multiple applications.",
                    "sid": 198,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One obvious application is information extraction.",
                    "sid": 199,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In IE, creating the patterns which express the requested scenario, e.g. “management succession” or “corporate merger and acquisition” is regarded as the hardest task.",
                    "sid": 200,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The discovered paraphrases can be a big help to reduce human labor and create a more comprehensive pattern set.",
                    "sid": 201,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, expanding on the techniques for the automatic generation of extraction patterns (Riloff 96; Sudo 03) using our method, the extraction patterns which have the same meaning can be automatically linked, enabling us to produce the final table fully automatically.",
                    "sid": 202,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While there are other obstacles to completing this idea, we believe automatic paraphrase discovery is an important component for building a fully automatic information extraction system.",
                    "sid": 203,
                    "ssid": 30,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "6",
            "sents": [
                {
                    "text": "We proposed an unsupervised method to discover paraphrases from a large untagged corpus.",
                    "sid": 204,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are focusing on phrases which have two Named Entities (NEs), as those types of phrases are very important for IE applications.",
                    "sid": 205,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After tagging a large corpus with an automatic NE tagger, the method tries to find sets of paraphrases automatically without being given a seed phrase or any kind of cue.",
                    "sid": 206,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In total 13,976 phrases are assigned to sets of phrases, and the accuracy on our evaluation data ranges from 65 to 99%, depending on the domain and the size of the sets.",
                    "sid": 207,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The accuracies for link were 73% and 86% on two evaluated domains.",
                    "sid": 208,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results are promising and there are several avenues for improving on these results.",
                    "sid": 209,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements. ",
            "number": "7",
            "sents": [
                {
                    "text": "This research was supported in part by the Defense Advanced Research Projects Agency as part of the Translingual Information Detection, Extraction and Summarization (TIDES) program, under Grant N66001001-18917 from the Space and Naval Warfare Systems Center, San Diego, and by the National Science Foundation under Grant IIS00325657.",
                    "sid": 210,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper does not necessarily reflect the position of the U.S. Government.",
                    "sid": 211,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would like to thank Prof. Ralph Grish- man, Mr. Takaaki Hasegawa and Mr. Yusuke Shinyama for useful comments, discussion and evaluation.",
                    "sid": 212,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}