{
    "ID": "I08-4030",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper presents systems submitted to the close track of Fourth SIGHAN Bakeoff.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We built up three systems based on Conditional Random Field for Chinese Word Segmentation, Named Entity Recognition and Part-Of-Speech Tagging respectively.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our systems employed basic features as well as a large number of linguistic features.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For segmentation task, we adjusted the BIO tags according to confidence of each character.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our final system achieve a F-score of 94.18 at CTB, 92.86 at NCC, 94.59 at SXU on Segmentation, 85.26 at MSRA on Named Entity Recognition, and 90.65 at PKU on Part-Of-Speech Tagging.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Fourth SIGHAN Bakeoff includes three tasks, that is, Word Segmentation, Named Entity Recognition (NER) and Part-Of-Speech (POS) Tagging.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the POS Tagging task, the testing corpora are pre- segmented.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word Segmentation, NER and POSTagging could be viewed as classification prob We attended the close track of CTB, NCC, SXU on Segmentation, MSRA on NER and PKU on POS Tagging.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the close track, we cannot use any external resource, and thus we extracted several word lists from training corpora to form multiple features beside basic features.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we trained CRF models based on these feature sets.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In CRF models, a margin of each character can be gotten, and the margin could be considered as the confidence of that character.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the Segmentation task, we performed the Maximum Probability Segmentation first, through which each character is assigned a BIO tag (B represents the Beginning of a word, I represents In a word and O represents Out of a word).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the confidence of a character is lower than the threshold, the tag of that character will be adjusted to the tag assigned by the Maximum Probability Segmentation (R. Zhang et al., 2006).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conditional random fields. ",
            "number": "2",
            "sents": [
                {
                    "text": "Conditional Random Fields (CRFs) are a class of undirected graphical models with exponent distribution (Lafferty et al., 2001).",
                    "sid": 14,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A common used special case of CRFs is linear chain, which has a distribution of: T lems.",
                    "sid": 15,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a Segmentation task, each character P ( yr | xr) = 1 exp(∑ ∑ λ f k ( y t −1 , y , xr, t )) (1)should be classified into three classes, B, I, O, in Z xr t =1 k r dicating whether this character is the Beginning of a word, In a word or Out of a word.",
                    "sid": 16,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For NER, each wheref k ( yt −1 , yt x, t ) is a function which is usu character is assigned a tag indicating what kind of ally an indicator function; λk is the learned weight Named Entity (NE) this character is (Beginning of of feature f k ; and Z xr is the normalization factor.a Person Name (PN), In a PN, Beginning of a Lo cation Name (LN), In a LN, Beginning of an Organization Name (ON), In an ON or not-a-NE).",
                    "sid": 17,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In POS tagging task defined by Fourth SIGHAN Bakeoff, we only need to give a POS tag for each given word in a context.",
                    "sid": 18,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The feature function actually consists of two kinds of features, that is, the feature of single state and the feature of transferring between states.",
                    "sid": 19,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Features will be discussed in section 3.",
                    "sid": 20,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several methods (e.g. GIS, IIS, L-BFGS) could be used to estimate λk , and L-BFGS has been showed to converge faster than GIS and IIS.",
                    "sid": 21,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To build up our system, we used Pocket CRF1.",
                    "sid": 22,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "feature representation. ",
            "number": "3",
            "sents": [
                {
                    "text": "We used three feature sets for three tasks respectively, and will describe them respectively.",
                    "sid": 23,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Word Segmentation.",
                    "sid": 24,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We mainly adopted features from (H. T. Ng et al., 2004, Y. Shi et al., 2007), as following: a) Cn(n=-2, -1, 0, 1, 2) b) CnCn+1(n=-2,-1,0,1) c) C-1C1 d) CnCn+1Cn+2 (n=-1, 0, 1) e) Pu(C0) f) T(C-2)T(C-1)T(C0)T(C1)T(C2) g) LBegin(C0), Lend(C0) h) Single(C0) where C0 represents the current character and Cn represents the nst character from the current character.",
                    "sid": 25,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pu(C0) indicates whether current word is a punctuation.",
                    "sid": 26,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "this feature template helps to indicate the end of a sentence.",
                    "sid": 27,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "T(C) represents the type of character C. There are four types we used: (1) Chi nese Number (“一/one”, “二/two”, “十/ten”); (2) Chinese Dates (“日/day”, “月/month”, “年/year”); (3) English letters; and (4) other characters.",
                    "sid": 28,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The (f) feature template is used to recognize the Chinese dates for the construction of Chinese dates may cause the sparseness problem.",
                    "sid": 29,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LBegin(C0) represents the maximum length of the word beginning with the character C0, and Lend(C0) presents the maximum length of the word ending with the character C0.",
                    "sid": 30,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The (g) feature template is used to decide the boundary of a word.",
                    "sid": 31,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Single(C0) shows whether current character can form a word solely.",
                    "sid": 32,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Named Entity Recognition.",
                    "sid": 33,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most features described in (Y. Wu et al., 2005) are used in our systems.",
                    "sid": 34,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, the following is the feature templates we used: a) Surname(C0): Whether current character is in a Surname List, which includes all first characters of PNs in the training corpora.",
                    "sid": 35,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 http://sourceforge.net/project/showfiles.php?group_id=201943 b) PersonName(C0C1C2, C0C1): Whether C0C1C2, C0C1 is in the Person Name List, which contains all PNs in the training corpora.",
                    "sid": 36,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "c) PersonTitle(C-2C-1): Whether C-2C-1 is in the Person Title List, which is extracted from the previous two characters of each PN in the training corpora.",
                    "sid": 37,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "d) LocationName(C0C1,C0C1C2,C0C1C2C3): Whether C0C1,C0C1C2,C0C1C2C3 is in the Location Name List, which includes all LNs in the training corpora.",
                    "sid": 38,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "e) LocationSuffix(C0): Whether current character is in the Location Suffix List, which is constructed using the last character of each LN in the training corpora.",
                    "sid": 39,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f) OrgSuffix(C0): Whether current character is in the Organization Suffix List, which contains the last-two-character of each ON in the training corpora.",
                    "sid": 40,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Part-Of-Speech Tagging.",
                    "sid": 41,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We employed part of feature templates described in (H. T. Ng et al., 2004, Y. Shi et al., 2007).",
                    "sid": 42,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since we are in the close track, we cannot use morphological features from external resources such as HowNet, and we used features that are available just from the training corpora.",
                    "sid": 43,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a) Wn, (n=-2,-1,0,1,2) b) WnWn+1, (n=-2,-1,0,1) c) W-1W1 d) Wn1WnWn+1 (n=-1, 1) e) Cn(W0) (n=0,1,2,3) f) Length(W0) where Cn represents the nth character of the current word, and Length(W0) indicates the length of the current word.",
                    "sid": 44,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "reliability evaluation. ",
            "number": "4",
            "sents": [
                {
                    "text": "In the task of Word Segmentation, the label of each character is adjusted according to their reliability.",
                    "sid": 45,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each sentence, we perform Maximum Probability Segmentation first, through which we can get a BIO tagging for each character in the sentence.",
                    "sid": 46,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After that, the features are extracted according to the feature templates, and the weight of each feature has already been estimated in the step of training.",
                    "sid": 47,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then marginal probability for each character can be computed as follows: p( y | xr) = 1 Z ( x) exp(λi f ( xr, y)) (2) The value of p( y | x ) becomes the original re liability value of BIO label y for the current character under the current contexts.",
                    "sid": 48,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the probability of y with the largest probability is lower than 0.75, which is decided according to the experiment results, the tag given by Maximum Probability Seg mentation will be used instead of tag given by CRF.",
                    "sid": 49,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The motivation of this method is to use the Maximum Probability method to enhance the F-measure of In-Vocabulary (IV) Words.",
                    "sid": 50,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to the results reported in (R. Zhang et al., 2006), CRF performs relatively better on Out-of-Vocabulary (OOV) words while Maximum Probability performs well on IV words, so a model combining the advantages of these two methods is appealing.",
                    "sid": 51,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One simplest way to combine them is the method we described.",
                    "sid": 52,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides, there are some complex methods, such as estimation using Support Vector Machine (SVM) for CRF, CRF combining boosting and combining Margin Infused Relaxed Algorithm (MIRA) with CRF, that might perform better.",
                    "sid": 53,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we did not have enough time to implement these methods, and we will compare them detailedly in the future work.",
                    "sid": 54,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "5",
            "sents": [
                {
                    "text": "5.1 Results on Fourth SIGHAN Bakeoff.",
                    "sid": 55,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We participated in the close track on Word Segmentation on CTB, NCC and SXU corpora, NER on MSRA corpora and POS Tagging on PKU corpora.",
                    "sid": 56,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Word Segmentation and NER, our memory was enough to use all features.",
                    "sid": 57,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, for POS tagging, we did not have enough memory to use all features, and we set a frequency cutoff of 10; that is, we could only estimate variables for those features that occurred more than ten times.",
                    "sid": 58,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our results of Segmentation are listed in the Tabel 1, the results of NER are listed in the Tabel 2, and the results of POS Tagging are listed in the Tabel 3.",
                    "sid": 59,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tabel 1.",
                    "sid": 60,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results of Word Segmentation Tabel 2.",
                    "sid": 61,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results of NER To tal -A I V R O OV R MT R P K U 0.",
                    "sid": 62,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 0 6 5 0.",
                    "sid": 63,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 2 5 9 0.",
                    "sid": 64,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 8 3 6 0.",
                    "sid": 65,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "89 03 Tabel 3.",
                    "sid": 66,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results of POS Tagging 5.2 Errors Analysis.",
                    "sid": 67,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Observing our results of Word Segmentation and POS Tagging, we found that the recall of OOV is relatively low, this may be improved through introducing features aiming to enhance the performance of OOV.",
                    "sid": 68,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On NER task, we noticed that precision of PN recognition is relative low, and we found that our system may classify some ONs as PNs, such as “吉 尼斯(Guinness)/ORG” and “世界记录(World Re cord)/)”.",
                    "sid": 69,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides, the bound of PN is sometimes confusing and may cause problems.",
                    "sid": 70,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “胡绳/PER 曾/ 有/ 题词” may be segmented as“胡绳曾/PER 有/ 题词”.",
                    "sid": 71,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, some words be ginning with Chinese surname, such as “丁丑盛 夏”, may be classified as PN.",
                    "sid": 72,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For List may not be the real suffix.",
                    "sid": 73,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “玉峰山麓” should be a LN, but it is very likely that “玉峰山” is recognized as a LN for its suffix “山”.",
                    "sid": 74,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another problem involves the characters in the Location Name list may not a LN all the time.",
                    "sid": 75,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the context “华裔/ 作家/”, for example, “华” means Chinese rather than China.",
                    "sid": 76,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For ONs, the correlative dictionary also exists.",
                    "sid": 77,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider sequence “人大代表”, which should be a single word, “人大” is in the Organization Name List and thus it is recognized as an ON in our system.",
                    "sid": 78,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another involves the subsequence of a word.",
                    "sid": 79,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the sequence “湖北钟祥市工业局 长”, which should be a person title, but “湖北钟祥 市工业局” is an ON.",
                    "sid": 80,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides, our recall of ON is low for the length of an ON could be very long.",
                    "sid": 81,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions and future works. ",
            "number": "6",
            "sents": [
                {
                    "text": "We built up our systems based on the CRF model and employed multiple linguistics features based on the knowledge extracted from training corpora.",
                    "sid": 82,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found that these features could greatly improve the performance of all tasks.",
                    "sid": 83,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides, we adjusted the tag of segmentation result according to the reliability of each character, which also helped to enhance the performance of segmentation.",
                    "sid": 84,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As many other NLP applications, feature plays a very important role in sequential labeling tasks.",
                    "sid": 85,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our POS tagging task, we could only use features with high frequency, but some low-frequency fea tures may also play a vital role in the task; good non-redundant features could greatly improve classification performance while save memory re quirement of classifiers.",
                    "sid": 86,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our further research, we will focus on feature selection on CRFs.",
                    "sid": 87,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgement",
            "number": "",
            "sents": [
                {
                    "text": "This research was sponsored by National Natural Science Foundation of China (No. 60773124, No. 60503070).",
                    "sid": 88,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}