{
    "ID": "I08-1070",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "In a broad range of natural language processing tasks, large-scale knowledge-base of paraphrases is anticipated to improve their performance.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The key issue in creating such a resource is to establish a practical method of computing semantic equivalence and syntactic substitutability, i.e., paraphrasability, between given pair of expressions.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper addresses the issues of computing paraphrasability, focusing on syntactic variants of predicate phrases.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our model estimates paraphrasability based on traditional distributional similarity measures, where the Web snippets are used to overcome the data sparseness problem in handling predicate phrases.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several feature sets are evaluated through empirical experiments.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "One of the common characteristics of human languages is that the same concept can be expressed by various linguistic expressions.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such linguistic variations are called paraphrases.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Handling paraphrases is one of the key issues in a broad range of natural language processing (NLP) tasks.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In information retrieval, information extraction, and question answering, technology of recognizing if or not the given pair of expressions are paraphrases is desired to gain a higher coverage.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, a system which generates paraphrases for given expressions is useful for text-transcoding tasks, such as machine translation and summarization, as well as beneficial to human, for instance, in text-to-speech, text simplification, and writing assistance.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paraphrase phenomena can roughly be divided into two groups according to their compositionality.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples in (1) exhibit a degree of compositionality, while each example in (2) is composed of totally different lexical items.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) a. be in our favor ⇔ be favorable for us b. show a sharp decrease ⇔ decrease sharply (Fujita et al., 2007) (2) a. burst into tears ⇔ cried b. comfort ⇔ console (Barzilay and McKeown, 2001) A number of studies have been carried out on both compositional (morpho-syntactic) and non compositional (lexical and idiomatic) paraphrases (see Section 2).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In most research, paraphrases have been represented with the similar templates, such as shown in (3) and (4).",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) a. N1 V N2 ⇔ N1 ’s V -ing of N2 b. N1 V N2 ⇔ N2 be V -en by N1 (Harris, 1957) (4) a. X wrote Y ⇔ X is the author of Y b. X solves Y ⇔ X deals with Y (Lin and Pantel, 2001) The weakness of these templates is that they should be applied only in some contexts.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, the lack of applicability conditions for slot fillers may lead incorrect paraphrases.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One way to specify the applicability condition is to enumerate correct slot fillers.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Pantel et al.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) have harvested instances for the given paraphrase templates based on the co-occurrence statistics of slot fillers and lexicalized part of templates (e.g. “deal with” in (4b)).",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yet, there is no method which assesses semantic equivalence and syntactic substitutability of resultant pairs of expressions.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we propose a method of directly computing semantic equivalence and syntactic sub- stitutability, i.e., paraphrasability, particularly focusing on automatically generated compositional paraphrases (henceforth, syntactic variants) of predicate phrases.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While previous studies have mainly targeted at words or canned phrases, we treat predicate phrases having a bit more complex structures.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper addresses two issues in handling phrases.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first is feature engineering.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generally speaking, phrases appear less frequently than single words.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This implies that we can obtain only a small amount of information about phrases.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To overcome the data sparseness problem, we investigate if the Web snippet can be used as a dense corpus for given phrases.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second is the measurement of paraphrasability.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We assess how well the traditional distributional similarity measures approximate the paraphrasability of predicate phrases.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Representation of paraphrases.",
                    "sid": 30,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several types of compositional paraphrases, such as passivization and nominalization, have been represented with some grammar formalisms, such as transformational generative grammar (Harris, 1957) and synchronous tree adjoining grammar (Dras, 1999).",
                    "sid": 31,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These grammars, however, lack the information of applicability conditions.",
                    "sid": 32,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word association within phrases has been an attractive topic.",
                    "sid": 33,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Meaning-Text Theory (MTT) is a framework which takes into account several types of lexical dependencies in handling paraphrases (Mel’cˇuk and Polgue`re, 1987).",
                    "sid": 34,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A bottleneck of MTT is that a huge amount of lexical knowledge is required to represent various relationships between lexical items.",
                    "sid": 35,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Jacquemin (1999) has represented the syntagmatic and paradigmatic correspondences between paraphrases with context-free transformation rules and morphological and/or semantic relations between lexical items, targeting at syntactic variants of technical terms that are typically noun phrases consisting of more than one word.",
                    "sid": 36,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have proposed a framework of generating syntactic variants of predicate phrases (Fujita et al., 2007).",
                    "sid": 37,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following the previous work, we have been developing three sorts of resources for Japanese.",
                    "sid": 38,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Acquiring paraphrase rules.",
                    "sid": 39,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the late 1990’s, the task of automatic acquisition of paraphrase rules has drawn the attention of an increasing number of researchers.",
                    "sid": 40,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although most of the proposed methods do not explicitly eliminate compositional paraphrases, their output tends to be non-compositional paraphrase.",
                    "sid": 41,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous approaches to this task are twofold.",
                    "sid": 42,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first group espouses the distributional hypothesis (Harris, 1968).",
                    "sid": 43,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among a number of models based on this hypothesis, two algorithms are referred to as the state-of-the-art.",
                    "sid": 44,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DIRT (Lin and Pantel, 2001) collects paraphrase rules consisting of a pair of paths between two nominal slots based on point-wise mutual information.",
                    "sid": 45,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TEASE (Szpektor et al., 2004) discovers binary relation templates from the Web based on sets of representative entities for given binary relation templates.",
                    "sid": 46,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These systems often output directional rules such as exemplified in (5).",
                    "sid": 47,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5) a. X is charged by Y ⇒ Y announced the arrest of X b. X prevent Y ⇒ X lower the risk of Y They are actually called inference/entailment rules, and paraphrase is defined as bidirectional inference/entailment relation1 . While the similarity score in DIRT is symmetric for given pair of paths, the algorithm of TEASE considers the direction.",
                    "sid": 48,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other utilizes a sort of parallel texts, such as multiple translation of the same text (Barzilay and McKeown, 2001; Pang et al., 2003), corresponding articles from multiple news sources (Barzilay and Lee, 2003; Dolan et al., 2004), and bilingual corpus (Wu and Zhou, 2003; Bannard and CallisonBurch,2005).",
                    "sid": 49,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach is, however, limited by the dif ficulty of obtaining parallel/comparable corpora.",
                    "sid": 50,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Acquiring paraphrase instances.",
                    "sid": 51,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As reviewed in Section 1, paraphrase rules generate incorrect paraphrases, because their applicability conditions are not specified.",
                    "sid": 52,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To avoid the drawback, several linguistic clues, such as fine-grained classification of named entities and coordinated sentences, have been utilized (Sekine, 2005; Torisawa, 2006).",
                    "sid": 53,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although these clues restrict phenomena to those appearing in particular domain or those describing coordinated events, they have enabled us to collect 1 See http://nlp.cs.nyu.edu/WTEP/.",
                    "sid": 54,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "paraphrases accurately.",
                    "sid": 55,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The notion of Inferential Selectional Preference (ISP) has been introduced by Pantel et al.",
                    "sid": 56,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007).",
                    "sid": 57,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ISP can capture more general phenomena than above two; however, it lacks abilities to distinguish antonym relations.",
                    "sid": 58,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4 Computing semantic equivalence.",
                    "sid": 59,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantic equivalence between given pair of expressions has so far been estimated under the distributional hypothesis (Harris, 1968).",
                    "sid": 60,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Geffet and Dagan (2005) have extended it to the distributional inclusion hypothesis for recognizing the direction of lexical entailment.",
                    "sid": 61,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Weeds et al.",
                    "sid": 62,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2005), on the other hand, have pointed out the limitations of lexical similarity and syntactic transformation, and have proposed to directly compute the distributional similarity of pair of sub-parses based on the distributions of their modifiers and parents.",
                    "sid": 63,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We think it is worth examining if the Web can be used as the source for extracting features of phrases.",
                    "sid": 64,
                    "ssid": 35,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "computing paraphrasability between. ",
            "number": "3",
            "sents": [
                {
                    "text": "predicate phrases using Web snippets We define the concept of paraphrasability as follows: A grammatical phrase s is paraphrasablewith another phrase t, iff t satisfies the fol lowing three: • t is grammatical • t holds if s holds • t is substitutable for s in some context Most previous studies on acquiring paraphrase rules have evaluated resultant pairs from only the second viewpoint, i.e., semantic equivalence.",
                    "sid": 65,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, we assume that one of a pair (t) of syntactic variants is automatically generated from the other (s).",
                    "sid": 66,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, grammaticality of t should also be assessed.",
                    "sid": 67,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also take into account the syntactic substitutability, because headwords of syntactic variants sometimes have different syntactic categories.",
                    "sid": 68,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a pair of predicate phrases, we compute their paraphrasability in the following procedure: Step 1.",
                    "sid": 69,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Retrieve Web snippets for each phrase.",
                    "sid": 70,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 2.",
                    "sid": 71,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extract features for each phrase.",
                    "sid": 72,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 3.",
                    "sid": 73,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compute their paraphrasability as distributional similarity between their features.",
                    "sid": 74,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of this section elaborates on each step in turn, taking Japanese as the target language.",
                    "sid": 75,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Retrieving Web snippets.",
                    "sid": 76,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, phrases appear less frequently than single words.",
                    "sid": 77,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This raises a crucial problem in computing paraphrasability of phrases, i.e., the sparseness of features for given phrases.",
                    "sid": 78,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possible way to overcome the problem is to take back-off statistics assuming the independence between constituent words (Torisawa, 2006; Pantel et al., 2007).",
                    "sid": 79,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach, however, has a risk of involving noises due to ambiguity of words.",
                    "sid": 80,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We take another approach, which utilizes the Web as a source of examples instead of a limited size of corpus.",
                    "sid": 81,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each of the source and target phrases, we retrieve snippets via the Yahoo API2.",
                    "sid": 82,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of snippets is set to 500.",
                    "sid": 83,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Extracting features.",
                    "sid": 84,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second step extracts the features for each phrase from Web snippets.",
                    "sid": 85,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have some options for feature set, feature weighting, and snippet collection.",
                    "sid": 86,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feature sets To assess a given pair of phrases against the definition of paraphrasability, the following three sets of features are examined.",
                    "sid": 87,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "HITS: A phrase must appear in the Web if it is grammatical.",
                    "sid": 88,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The more frequently a phrase appears, the more likely it is grammatical.",
                    "sid": 89,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BOW: A pair of phrases are likely to be semantically similar, if the distributions of words surrounding the phrases are similar.",
                    "sid": 90,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MOD: A pair of phrases are likely to be substitutable with each other, if they share a number of instances of modifiers and modifiees.",
                    "sid": 91,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To extract BOW features from sentences including the given phrase within Web snippets, a morphological analyzer MeCab3 was firstly used; however, it resulted wrong POS tags for unknown words, and hurt statistics.",
                    "sid": 92,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, finally ChaSen4 is used.",
                    "sid": 93,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To collect MOD features, a dependency parser CaboCha5 is used.",
                    "sid": 94,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 depicts an example of extracting MOD features from a sentence within Web snippet.",
                    "sid": 95,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A feature is generated from a bun- setsu, the Japanese base-chunk, which is either mod 2 http://developer.yahoo.co.jp/search/ 3 http://mecab.sourceforge.net/ 4 http://chasen.naist.jp/hiki/ChaSen/ 5 http://chasen.org/˜taku/software/cabocha/ Sentence within snippet (dependency tree) yoteeiida Features Modifiee/D: yotei the source phrase.",
                    "sid": 96,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The “anchored version” of Web snippets is retrieved in the following steps: kenshhoouu--ssuurruu (plan) Step 21.",
                    "sid": 97,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Determine the anchor using Web snip pets for the given source phrase.",
                    "sid": 98,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We regarded saaiiggeenn--sseeii-o kuwasshhiikkuu Modifier/D: kuwashii a noun which most frequently modifies the jjiikkkkeenn--kkeekkkkaa--nnoo kkaarree--nnoo Given phrase (in detail) Modifier/D: kare_no (his) source phrase as its anchor.",
                    "sid": 99,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example s of source phrases and their anchors are shown in (6).",
                    "sid": 100,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 22.",
                    "sid": 101,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Retrieve Web snippets by querying the (I am) planning to verify the reproducibility of his experimental result in detail.",
                    "sid": 102,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1: An example of MOD feature extraction.",
                    "sid": 103,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An oval in the dependency tree denotes a bunsetsu.",
                    "sid": 104,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ifier or modifiee of the given phrase.",
                    "sid": 105,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each feature is composed of three or more elements: (i) modifier or modifiee, (ii) dependency relation types (direct dependency, appositive, or parallel, c.f., RASP and MINIPAR), (iii) base form of the headword, and (iv) case marker following noun, auxiliary verb and verbal suffixes if they appear.",
                    "sid": 106,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last feature is employed to distinguish the subtle difference of meaning of predicate phrases, such as voice, tense, aspect, and modality.",
                    "sid": 107,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While Lin and Pantel (2001) have calculated similarities of paths based on slot fillers of subject and object slots, MOD targets at sub-trees and utilizes any modifiers and modifiees.",
                    "sid": 108,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "anchor for the source phrase AND each of source and target phrases, respectively.",
                    "sid": 109,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 23.",
                    "sid": 110,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extract features for HITS, BOW, MOD.",
                    "sid": 111,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Those sets are referred to as Anc.∗, while the normal versions are referred to as Nor.∗.",
                    "sid": 112,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(6) a. “emi:o:ukaberu” ··· “manmen” (be smiling ··· from ear to ear) b. “doriburu:de:kake:agaru” ··· “saido” (overlap by dribbling ··· side) c. “yoi:sutaato:o:kiru” ··· “saisaki” (make a good start ··· good sign) 3.3 Computing paraphrasability.",
                    "sid": 113,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paraphrasability is finally computed by two conventional distributional similarity measures.",
                    "sid": 114,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first is the measure proposed in (Lin and Pantel, 2001): Lf ∈Fs ∩Ft (w(s, f )+ w(t, f )) Feature weighting ParLin (s⇒t)= L f ∈Fs w(s, f )+ L f ∈Ft w(t, f ) , Geffet and Dagan (2004) have reported on that the better quality of feature vector (weighting function) leads better results.",
                    "sid": 115,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So far, several weighting functions have been proposed, such as point-wise mutual information (Lin and Pantel, 2001) and Relative Feature Focus (Geffet and Dagan, 2004).",
                    "sid": 116,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While these functions compute weights using a small corpus for merely re-ranking samples, we are developing a measure that assesses the paraphrasability of arbitrary pair of phrases, where a more robust weighting function is necessary.",
                    "sid": 117,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore we directly use frequencies of features within Web snip where Fs and Ft denote feature sets for s and t, respectively.",
                    "sid": 118,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "w(x, f ) stands for the weight (frequency in our experiment) of f in Fx.",
                    "sid": 119,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While ParLin is symmetric, it has been arguedthat it is important to determine the direction of para phrase.",
                    "sid": 120,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an asymmetric measure, we examine α- skew divergence defined by the following equation (Lee, 1999): dskew (t, s) = D (Ps αPt + (1 − α)Ps ) ,where Px denotes a probability distribution esti 6 pets as weight.",
                    "sid": 121,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normalization will be done when the matedfrom a feature set Fx . How well Pt approx paraphrasability is computed (Section 3.3).",
                    "sid": 122,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Source-focused feature extraction Independent collection of Web snippets for each phrase of a given pair might yield no intersection of feature sets even if they have the same meaning.",
                    "sid": 123,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To obtain more reliable feature sets, we retrieve Web imates Ps is calculated based on the KL divergence, D. The parameter α is set to 0.99, following tradition, because the optimization of α is difficult.",
                    "sid": 124,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To take consistent measurements, we define the paraphrasability score Parskew as follows: Parskew (s⇒t) = exp (−dskew (t, s)) . 6 We estimate them simply using maximum likelihood esti-.",
                    "sid": 125,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "snippets by querying the phrase AND the anchor of mation, i.e., Px (f ) = w(x, f )/ P ∈ x w(x, f ∗ ).",
                    "sid": 126,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1: # of sampled source phrases and automatically generated syntactic variants.",
                    "sid": 127,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Phras e type # of token s # of types th ty pe s C ov .( % ) Out put Ave. N : C : V N1 : N2 : C : V N : C : V1 : V2 N : C : Adv : V Adj : N : C : V N : C : Adj 20,20 0,041 4,323, 756 3,79 6,35 1 2,01 3,68 2 32 5,9 64 21 3,9 23 1,20 9,26 5 923, 475 37 8,6 17 23 3,9 52 78 8,0 38 20 3,8 45 1,000 1,014 10.7 107 1,00 5 6.3 15 1,0 22 12.9 21 1,0 97 3.9 20 1,0 49 14.1 86 1,0 03 31.4 1,5 36 (48 9) 3.1 88,0 40 (966 ) 91.1 75,3 44 (982 ) 76.7 8,2 81 (52 3) 15.",
                    "sid": 128,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 1 2 8 (50) 2.6 3,2 12 (99 2) 3.2 Total 26,69 8,276 7,912 ,633 6 , 1 9 0 176,5 41 (4,00 2) 44.1 Table 2: # of syntactic variants whose paraphrasability scores are computed.",
                    "sid": 129,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nor.HITS ⊃ Nor.BOW.∗⊃ Nor.MOD.∗.",
                    "sid": 130,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Anc.HITS ⊃ Anc.BOW.∗⊃ Anc.MOD.∗.",
                    "sid": 131,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nor.HITS ⊃ Anc.HITS.",
                    "sid": 132,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nor.BOW.∗⊃ Anc.BOW.∗.",
                    "sid": 133,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nor.MOD.∗⊃ Anc.MOD.∗.",
                    "sid": 134,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "X denotes the set of syntactic variants whose scores are computed based on X. Phras e type N o r . H I T S Outpu t Ave. N o r . B O W . ∗ Outpu t Ave. N o r . M O D . ∗ Outpu t Ave. A n c . H I T S Outpu t Ave. A n c . B O W . ∗ Outpu t Ave. A n c . M O D . ∗ Outpu t Ave. M a i n i c h i Outpu t Ave. N : C : V N1 : N2 : C : V N : C : V1 : V2 N : C : Adv : V Adj : N : C : V N : C : Adj 1,40 5 (489 ) 2.9 9,54 4 (964 ) 9.9 3,76 9 (876 ) 4.3 69 0 (35 9) 1.9 4 5 (20) 2.3 1,45 9 (885 ) 1.6 1,40 2 (488 ) 2.9 9,24 9 (922) 10.0 3,40 6 (774 ) 4.4 50 6 (24 7) 2.0 4 5 (20) 2.3 1,45 9 (885 ) 1.6 1,39 6 (488 ) 2.9 8,65 2 (921 ) 9.4 3,10 9 (762 ) 4.1 47 5 (23 3) 2.0 4 2 (17) 2.5 1,39 9 (864 ) 1.6 1,36 8 (488 ) 2.8 7,43 7 (897 ) 8.3 2,51 7 (697 ) 3.6 34 2 (17 4) 2.0 4 1 (18) 2.3 1,23 5 (809 ) 1.5 1,36 6 (487 ) 2.8 7,42 4 (894 ) 8.3 2,49 7 (690 ) 3.6 33 9 (17 3) 2.0 4 1 (18) 2.3 1,23 5 (809 ) 1.5 1,36 0 (487 ) 2.8 6,79 5 (891 ) 7.6 2,25 8 (679 ) 3.3 32 2 (16 8) 1.9 3 9 (16) 2.4 1,16 1 (779 ) 1.5 1,10 3 (457 ) 2.4 3,04 1 (948 ) 3.2 1,15 6 (548 ) 2.1 21 5 (16 7) 1.3 1 4 (7) 2.0 55 9 (45 9) 1.2 Total 16,91 2 (3,59 3) 4.7 16,06 7 (3,33 6) 4.8 15,07 3 (3,28 5) 4.6 12,94 0 (3,08 3) 4.2 12,90 2 (3,07 1) 4.2 11,93 5 (3,02 0) 4.0 6,08 8 (2,5 86) 2.4 Now Parx falls within [0, 1], and a larger Parx indicates a more paraphrasable pair of phrases.",
                    "sid": 135,
                    "ssid": 71,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental setting. ",
            "number": "4",
            "sents": [
                {
                    "text": "We conduct empirical experiments to evaluate the proposed methods.",
                    "sid": 136,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Settings are described below.",
                    "sid": 137,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Test collection.",
                    "sid": 138,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, source phrases were sampled from a 15 years of newspaper articles (Mainichi 19912005, approximately 1.5GB).",
                    "sid": 139,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Referring to the dependency structure given by CaboCha, we extracted most frequent 1,000+ phrases for each of 6 phrase types.",
                    "sid": 140,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These phrases were then fed to a system proposed in (Fujita et al., 2007) to generate syntactic variants.",
                    "sid": 141,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The numbers of the source phrases and their syntactic variants are summarized in Table 1, where the numbers in the parentheses indicate that of source phrases paraphrased.",
                    "sid": 142,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At least one candidate was generated for 4,002 (64.7%) phrases.",
                    "sid": 143,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the system generates numerous syntactic variants from a given phrase, most of them are erroneous.",
                    "sid": 144,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, among 159 syntactic variants that are automatically generated for the phrase “songai:baishou:o:motomeru” (demand compensation for damages), only 8 phrases are grammatical, and only 5 out of 8 are correct paraphrases.",
                    "sid": 145,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paraphrasability of each pair of source phrase and candidate is then computed by the methods proposed in Section 3.",
                    "sid": 146,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 summarizes the numbers of pairs whose features can be extracted from the Web snippets.",
                    "sid": 147,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While more than 90% of candidates were discarded due to ’No hits’ in the Web, at least one candidate survived for 3,020 (48.8%) phrases.",
                    "sid": 148,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mainichi is a baseline which counts HITS in the corpus used for sampling source phrases.",
                    "sid": 149,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Samples for evaluation.",
                    "sid": 150,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We sampled three sets of pairs for evaluation, where Mainichi, ∗.HITS, ∗.BOW, ∗.MOD, the harmonic mean of the scores derived from ∗.BOW and ∗.MOD (referred to as ∗.HAR), and two distributional similarity measures for ∗.BOW, ∗.MOD, and ∗.HAR, in total 15 models, are compared.",
                    "sid": 151,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ev.Gen: This investigates how well a correct candidate is ranked first among candidates for a given phrase using the top-ranked pairs for randomly sampled 200 source phrases for each of 15 models.",
                    "sid": 152,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ev.Rec: This assesses how well a method gives higher scores to correct candidates using the 200-best pairs for each of 15 models.",
                    "sid": 153,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ev.Ling: This compares paraphrasability of each phrase type using the 20-best pairs for each of 6 phrase type and 14 Web-based models.",
                    "sid": 154,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Criteria of paraphrasability.",
                    "sid": 155,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To assess by human the paraphrasability discussed in Section 3, we designed the following four questions based on (Szpektor et al., 2007): Qsc: Is s a correct phrase in Japanese?",
                    "sid": 156,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qtc: Is t a correct phrase in Japanese?",
                    "sid": 157,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qs2t: Does t hold if s holds and can t substituted for s in some context?",
                    "sid": 158,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qt2s: Does s hold if t holds and can s substituted for t in some context?",
                    "sid": 159,
                    "ssid": 24,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental results. ",
            "number": "5",
            "sents": [
                {
                    "text": "5.1 Agreement of human judge.",
                    "sid": 160,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two human assessors separately judged all of the 1,152 syntactic variant pairs (for 962 source phrases) within the union of the three sample sets.",
                    "sid": 161,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They agreed on all four questions for 795 (68.4%) pairs.",
                    "sid": 162,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the 963 (83.6%) pairs that passed Qsc and Qtc in both two judges, we obtained reasonable agreement ratios 86.9% and 85.0% and substantial Kappa values 0.697 and 0.655 for assessing Qs2t and Qt2s.",
                    "sid": 163,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Ev.Gen. Table 3 shows the results for Ev.Gen, where the strict precision is calculated based on the number of two positive judges for Qs2t , while the lenient precision is for at least one positive judge for the same question.",
                    "sid": 164,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "∗.MOD and ∗.HAR outperformed the other models, although there was no statistically significant difference7 . Significant differences between Mainichi and the other models in lenient precisions indicate that the Web enables us to compute paraphrasability more accurately than a limited size of corpus.",
                    "sid": 165,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From a closer look at the distributions of paraphrasability scores of ∗.BOW and ∗.MOD shown in Table 4, we find that if a top-ranked candidate for a given phrase is assigned enough high score, it is very likely to be correct.",
                    "sid": 166,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The scores of Anc.∗ aredistributed in a wider range than those of Nor.∗, pre serving precision.",
                    "sid": 167,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This allows us to easily skim the most reliable portion by setting a threshold.",
                    "sid": 168,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.3 Ev.Rec.",
                    "sid": 169,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results for Ev.Rec, as summarized in Table 5, show the significant differences of performances be tween Mainichi or ∗.HITS and the other models.",
                    "sid": 170,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of ∗.HITS supported the importance of comparing features of phrases.",
                    "sid": 171,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, ∗.BOW performed as well as ∗.MOD and ∗.HAR.This sounds nice because BOW features can be ex tracted extremely quickly and accurately.",
                    "sid": 172,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, Anc.∗ led only a small impact on strict precisions.",
                    "sid": 173,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We speculate that the selection of the anchor is inadequate.",
                    "sid": 174,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another possible interpretation is that source phrases are rarely ambiguous, because they contain at least two content words.",
                    "sid": 175,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In 7 p < 0.05 in 2-sample test for equality of proportions.",
                    "sid": 176,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3: Precision for 200 candidates (Ev.Gen).",
                    "sid": 177,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mode l S t r i c t Leni ent Nor .∗ Anc .∗ No r.∗ An c.∗ Maini chi HITS BOW .Lin BOW .skew MOD .Lin MOD .skew HAR.",
                    "sid": 178,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lin HAR.",
                    "sid": 179,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "skew 77 (39% ) 84 (42% ) 82 (41% ) 86 (43% ) 91 (46% ) 92 (46% ) 90 (45% ) 93 (47% )- 83 (42% ) 85 (43% ) 87 (44% ) 91 (46% ) 90 (45% ) 90 (45% ) 90 (45% ) 101 (51% ) 120 (60% ) 123 (62% ) 125 (63% ) 130 (65% ) 132 (66% ) 129 (65% ) 134 (67% )- 119 (60%) 124 (62%) 124 (62%) 131 (66%) 130 (65%) 130 (65%) 131 (66%) Table 4: Distribution of paraphrasability scores and lenient precision (Ev.Gen).",
                    "sid": 180,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Par (s⇒ t) N o r . B O W A n c . B O W L i n s k e w L i n s k e w0.9 1.00.8 1.00.7 1.00.6 1.00.5 1.00.4 1.00.3 1.00.2 1.00.1 1.00.0 1.0 11/ 12 (92 %) 45/ 49 (92 %) 72/ 88 (82 %) 94/1 27 (74 %) 102/1 45 (70% ) 107/1 58 (68% ) 113/1 73 (65% ) 119/1 84 (65% ) 123/1 98 (62% ) 123/2 00 (62% ) 0/ 0 1/ 1 (10 0% ) 7/ 7 (10 0% ) 11/ 11 (100 %) 13/ 13 (100 %) 13/ 14 (93 %) 25/ 26 (96 %) 40/ 41 (98 %) 74/ 86 (86 %) 125/2 00 (63%) 17/ 18 (94 %) 45/ 50 (90 %) 73/ 92 (79 %) 83/1 13 (74 %) 96/1 28 (75 %) 103/1 45 (71% ) 114/1 66 (69% ) 121/1 86 (65% ) 124/2 00 (62% ) 124/2 00 (62% ) 2/ 2 (10 0% ) 6/ 6 (10 0% ) 10/ 11 (91 %) 12/ 13 (92 %) 14/ 15 (93 %) 21/ 22 (96 %) 31/ 32 (97 %) 49/ 50 (98 %) 82/ 99 (83 %) 124/2 00 (62%) Varia nce 0 . 0 5 2 0 . 0 3 1 0 . 0 6 1 0 . 0 4 4 Par (s⇒ t) N o r . M O D A n c . M O D L i n s k e w L i n s k e w0.9 1.00.8 1.00.7 1.00.6 1.00.5 1.00.4 1.00.3 1.00.2 1.00.1 1.00.0 1.0 2/ 2 (10 0% ) 10/ 10 (100 %) 13/ 14 (93 %) 20/ 21 (95 %) 31/ 32 (97 %) 42/ 44 (96 %) 61/ 68 (90 %) 81/ 92 (88 %) 105/1 33 (79%) 130/2 00 (65%) 0/ 0 0/ 0 0/ 0 1/ 1 (10 0% ) 6/ 6 (10 0% ) 11/ 11 (100 %) 12/ 12 (100 %) 13/ 13 (100 %) 17/ 18 (94 %) 132/2 00 (66%) 7/ 7 (10 0% ) 12/ 13 (92 %) 17/ 18 (94 %) 27/ 28 (96 %) 36/ 37 (97 %) 51/ 53 (96 %) 61/ 68 (90 %) 82/ 94 (87 %) 104/1 26 (83%) 131/2 00 (66%) 1/ 1 (10 0% ) 2/ 2 (10 0% ) 6/ 6 (10 0% ) 9/ 9 (10 0% ) 10/ 10 (100 %) 12/ 12 (100 %) 13/ 14 (93 %) 18/ 19 (95 %) 24/ 25 (96 %) 130/2 00 (65%) Varia nce 0 . 0 5 7 0 . 0 1 4 0 . 0 7 2 0 . 0 3 0 paraphrase generation, capturing the correct boundary of phrases is rather vital, because the source phrase is usually assumed to be grammatical.",
                    "sid": 181,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qsc for 55 syntactic variants (for 44 source phrases) were actually judged incorrect.",
                    "sid": 182,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lenient precisions, which were reaching a ceiling, implied the limitation of the proposed methods.",
                    "sid": 183,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most common errors among the proposed methods were generated by a transformation pattern N1 : N2 : C : V ⇒ N2 : C : V . Typically, dropping a nominal element N1 of the given nominal compound N1 : N2 generalizes the meaning that the compound conveys, and thus results correct paraphrases.",
                    "sid": 184,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it caused errors in some cases; for example, since N1 was the semantic head in (7), dropping it was incorrect.(7) s. “shukketsu:taryou:de:shibou suru” (die due to heavy blood loss) t.∗“taryou:de:shibousuru” (die due to plenty) Table 5: Precision for 200 candidates (Ev.Rec).",
                    "sid": 185,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6: Precision for each phrase type (Ev.Ling).",
                    "sid": 186,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Phras e type S t r i c t L e ni e nt N : C : V N1 : N2 : C : V N : C : V1 : V2 N : C : Adv : V Adj : N : C : V N : C : Adj 52/ 98 (53 %) 51/ 72 (71 %) 42/ 86 (49 %) 33/ 61 (54 %) 0/ 25 (0 %) 18/ 73 (25 %) 69/ 98 (70 %) 64/ 72 (89 %) 60/ 86 (70 %) 44/ 61 (72 %) 4/ 25 (16 %) 38/ 73 (52 %) Total 196/4 15 (47% ) 279/4 15 (67% ) 5.4 Ev.Ling.",
                    "sid": 187,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally the results for Ev.Ling is shown in Table 6.",
                    "sid": 188,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paraphrasability of syntactic variants for phrases containing an adjective was poorly computed.",
                    "sid": 189,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The primal source of errors for Adj : N : C : V type phrases was the subtle change of nuance by switching syntactic heads as illustrated in (8), where underlines indicate heads.",
                    "sid": 190,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(8) s. “yoi:shigoto:o:suru” (do a good job) t1./=“yoku:shigotosuru” (work hard) t2./=“shigoto:o:yoku:suru” (improve the work) Most errors in paraphrasing N : C : Adj type phrases, on the other hand, were caused due to the difference of aspectual property and agentivity between adjectives and verbs.",
                    "sid": 191,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, (9s) can describe not only things those qualities have been improved as inferred by (9t), but also those originally having a high quality.",
                    "sid": 192,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qs2t for (9) was thus judged incorrect.",
                    "sid": 193,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(9) s. “shitsu:ga:takai” (having high quality) t./=“shitsu:ga:takamaru” (quality rises) Precisions of syntactic variants for the other types of phrases were higher, but they tended to include trivial paraphrases such as shown in (10) and (11).",
                    "sid": 194,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yet, collecting paraphrase instances statically will contribute to paraphrase recognition tasks.",
                    "sid": 195,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(10) s. “shounin:o:eru” (clear) t. “shouninsa-re-ru” (be approved) (11) s. “eiga:o:mi:owaru” (finish seeing the movie) t. “eiga:ga:owaru” (the movie ends)",
                    "sid": 196,
                    "ssid": 37,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discussion. ",
            "number": "6",
            "sents": [
                {
                    "text": "As described in the previous sections, our quite naive methods have shown fairly good performances in this first trial.",
                    "sid": 197,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This section describes some remaining issues to be discussed further.",
                    "sid": 198,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 7: # of features.",
                    "sid": 199,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nor.BOW Nor.MOD Anc.BOW Anc.MOD # of featur es (type) 73 ,8 48 471, 720 72,1 09 409, 379 avera ge featur es (type) 1 , 3 2 2 2 1 1 1,2 77 2 0 2 avera ge featur es (toke n) 4 , 8 8 3 3 9 1 4,7 28 3 8 3 are semantically equivalent and syntactically substitutable, following the spirit described in (Fujita et al., 2007).",
                    "sid": 200,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Through the comparisons of Nor.∗ andAnc.∗, we have shown a little evidence that the am biguity of phrases was not problematic at least for handling syntactic variants, arguing the necessity of detecting the appropriate phrase boundaries.",
                    "sid": 201,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To overcome the data sparseness problem, Web snippets are harnessed.",
                    "sid": 202,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Features extracted from the snippets outperformed newspaper corpus; however, the small numbers of features for phrases shown in Table 7 and the lack of sophisticated weighting function suggest that the problem might persist.",
                    "sid": 203,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To examine the proposed features and measures further, we plan to use TSUBAKI8, an indexed Web corpus developed for NLP research, because it allow us to obtain snippets as much as it archives.",
                    "sid": 204,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of larger number of snippets increases the computation time for assessing paraphrasability.",
                    "sid": 205,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For reducing it as well as gaining a higher coverage, the enhancement of the paraphrase generation system is necessary.",
                    "sid": 206,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A look at the syntactic variants automatically generated by a system, which we proposed, showed that the system could generate syntactic variants for only a half portion of the input, producing many erroneous ones (Section 4.1).",
                    "sid": 207,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To prune a multitude of incorrect candidates, statistical language models such as proposed in (Habash, 2004) will be incorporated.",
                    "sid": 208,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In parallel, we plan to develop a paraphrase generation system which lets us to quit from the labor of maintaining patterns such as shown in (4).",
                    "sid": 209,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We think a more unrestricted generation algorithm will gain a higher coverage, preserving the meaning as far as handling syntactic variants of predicate phrases.",
                    "sid": 210,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The aim of this study is to create a thesaurus of phrases to recognize and generate phrases that 8 http://tsubaki.ixnlp.nii.ac.jp/se/index.cgi",
                    "sid": 211,
                    "ssid": 15,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "7",
            "sents": [
                {
                    "text": "In this paper, we proposed a method of assessing paraphrasability between automatically generated syntactic variants of predicate phrases.",
                    "sid": 212,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Web snippets were utilized to overcome the data sparseness problem, and the conventional distributional similarity measures were employed to quantify the similarity of feature sets for the given pair of phrases.",
                    "sid": 213,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Empirical experiments revealed that features extracted from the Web snippets contribute to the task, showing promising results, while no significant difference was observed between two measures.",
                    "sid": 214,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In future, we plan to address several issues such as those described in Section 6.",
                    "sid": 215,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Particularly, at present, the coverage and portability are of our interests.",
                    "sid": 216,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "We are deeply grateful to all anonymous reviewers for their valuable comments.",
                    "sid": 217,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work was supported in part by MEXT Grant-in-Aid for Young Scientists (B) 18700143, and for Scientific Research (A) 16200009, Japan.",
                    "sid": 218,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}