{
    "ID": "I08-4015",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper describes the Chinese Word Segmenter for the fourth International Chinese Language Processing Bakeoff.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Base on Conditional Random Field (CRF) model, a basic segmenter is designed as a problem of character-based tagging.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To further improve the performance of our segmenter, we employ a word-based approach to increase the in-vocabulary (IV) word recall and a post-processing to increase the out-of-vocabulary (OOV) word recall.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We participate in the word segmentation closed test on all five corpora and our system achieved four second best and one the fifth in all the five corpora.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Since Chinese Word Segmentation was firstly treated as a character-based tagging task in (Xue and Converse, 2002), this method has been widely accepted and further developed by researchers (Peng et al., 2004), (Tseng et al., 2005), (Low et al., 2005), (Zhao et al., 2006).",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, as a powerful sequence tagging model, CRF became the dominant method in the Bakeoff 2006 (Levow, 2006).In this paper, we improve basic segmenter un der the CRF work frame in two aspects, namely IV and OOV identification respectively.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the result from word-based segmentation to revise the CRF output so that we gain a higher IV word recall.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the OOV part a post-processing rule is proposed to find those OOV words which are wrongly segmented into several fractions.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our system performs well in the Fourth Bakeoff, achieving four second best and on the fifth in all the five corpora.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following of this paper, we describe our method in more detail.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of this paper is organized as follows.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 2, we first give a brief review to the basic CRF tagging approach and then we propose our methods to improve IV and OOV performance respectively.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 3 we give the experiment results on the fourth Bakeoff corpora to show that our method is effective to improve the performance of the segmenter.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 4, we conclude our work.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "our word segmentation system. ",
            "number": "2",
            "sents": [
                {
                    "text": "In this section, we describe our system in more detail.",
                    "sid": 15,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our system includes three modules: a basic CRF tagger, a word-base segmenter to improve the IV recall and a post-processing rule to improve the OOV recall.",
                    "sid": 16,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following of this section, we introduce these three modules respectively.",
                    "sid": 17,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Basic CRF tagger.",
                    "sid": 18,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sequence tagging approach treat Word Segmentation task as a labeling problem.",
                    "sid": 19,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Every character in input sentences will be given a label which indicates whether this character is a word boundary.",
                    "sid": 20,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our basic CRF1 tagger is almost the same as the system described in (Zhao et al., 2006) except we add a feature to incorporate word information, which is learned from training corpus.",
                    "sid": 21,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 CRF tagger in this paper is implemented by CRF++.",
                    "sid": 22,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "which is downloaded from http://crfpp.sourceforge.net/ Type Feature Function Unigram C-1, C0, C1 Previous, current and next character Bigram C-1 C0, C0 C1 Two adjacent character Jump C-1 C1 Previous character and next character Word Flag F0 F1 Whether adjacent characters form an IV word Table 1 Feature templates used for CRF in our system Under the CRF tagging scheme, each character in one sentence will be given a label by CRF model to indicate which position this character occupies in a word.",
                    "sid": 23,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our system, CRF tag set is proposed to distinguish different positions in the multi-character words when the word length is less than 6, namely 6-tag set {B, B2, B3, M, E, O}.",
                    "sid": 24,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, Tag B and E stand for the first and the last position in a multi-character word, respectively.",
                    "sid": 25,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "S stands up a single-character word.",
                    "sid": 26,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "B2 and B3 stand for the second and the third position in a multi-character word, whose length is larger than two-character or three-character.",
                    "sid": 27,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "M stands for the fourth or more rear position in a multi-character word, whose length is larger than four-character.",
                    "sid": 28,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We add a new feature, which also used in maximum entropy model for word segmentation task by (Low et al., 2005), to the feature templates for CRF model while keep the other features same as (Zhao et al., 2006).",
                    "sid": 29,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The feature templates are defined in table 1.",
                    "sid": 30,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the feature template, only the Word Flag feature needs an explanation.",
                    "sid": 31,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bi nary function F0 = 1 if and only if C-1 C0 form a IV mentations for any input sentence.",
                    "sid": 32,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the exponential time and space of the length of the input sentence are needed for such a search and it is always intractable in practice.",
                    "sid": 33,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we use the trigram language model to select top B (B is a constant predefined before search and in our experiment 3 is used) best candidates with highest probability at each stage so that the search algorithm can work in practice.",
                    "sid": 34,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, when the whole sentence has been read, the best candidate with the highest probability will be selected as the segmentation result.",
                    "sid": 35,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After we get word-based segmentation result, we use it to revise the CRF tagging result similar to (Zhang et al., 2006).",
                    "sid": 36,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since word-based segmentation result also corresponds to a tag sequence according to the 6-tag set, we now have two tags for each character, word-based tag (WT) and CRF tag (CT).",
                    "sid": 37,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Which tag will be kept as the final result depends on Marginal Probability (MP) of the CT. Here, we give a short explanation about what is the MP of the CT. Suppose there is a sentence C  c0c1...cM , where ciis the character this sen word, else F0 = 0 and F1 = 1 if and only if C0 C1 tence containing.",
                    "sid": 38,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CRF model gives this sentence a form a IV word, else F1 = 0.",
                    "sid": 39,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "optimal tag sequence T  t0t1...tM , where ti is the 2.2 Word based segmenter and revise rules.",
                    "sid": 40,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tag for c . If t  t and t  {B, B , B , M , E, S} , i i 2 3 For the word-based word segmentation, we collect dictionary from training corpus first.",
                    "sid": 41,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of the MP of ti is defined as: Maximum Match, trigram language model 2 MP(t  t)  T ,t t P(T | C)trained on training corpus is employed for disam biguation.",
                    "sid": 42,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During the disambiguation procedure, a i P(T | C) T beam search decoder is used to seek the most Here,P(T | C) is the conditional probability giv possible segmentation.",
                    "sid": 43,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For detail, the decoder reads characters from the input sentence one at a time, and generates candidate segmentations in- crementally.",
                    "sid": 44,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At each stage, the next incoming character is combined with an existing candidate in two different ways to generate new candidates: it is either appended to the last word in the candidate, or taken as the start of a new word.",
                    "sid": 45,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method guarantees exhaustive generation of possible seg 2 Language model used in this paper is SLRIM down-.",
                    "sid": 46,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "loaded from http://www.speech.sri.com/projects/srilm/ en by CRF model.",
                    "sid": 47,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For more detail about how to calculate this conditional probability, please refer to (Lafferty et al., 2001).",
                    "sid": 48,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Assume that the tag assigned to the current character is CT by CRF and WT by word-based segmenter respectively.",
                    "sid": 49,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rules under which we revise CRF result with word-based result is that if MP(CT) of a character is less than a predefined threshold and WT is not “S”, the WT of this character will be kept as the final result, else the CT of the character will be kept as the final result.",
                    "sid": 50,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The restriction that WT should not be “S” is reasonable because word-based segmentation is incapable to recognize the OOV word and always segments OOV word into single characters.",
                    "sid": 51,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides CRF model is better at dealing with OOV word than our word-based segmentation.",
                    "sid": 52,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When WT is “S” it is possible that current word is an OOV word and segmented into single character wrongly by the word-based segmenter, so the CT of the character should be kept under such situation.",
                    "sid": 53,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For more detail about this analysis please refer to (Wang et al., 2008).",
                    "sid": 54,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Post-processing rule.",
                    "sid": 55,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rules we described in last subsection is helpful to improve the IV word recall and now we introduce our post-processing rule to improve the OOV recall.",
                    "sid": 56,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our post-processing rule is designed to deal with one typical type of OOV errors, namely an OOV word wrongly segmented into several parts.",
                    "sid": 57,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In practice many OOV errors belong to such type.",
                    "sid": 58,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rule is quite simple.",
                    "sid": 59,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When we read a sentence from the result we get by the last step, we also kept the last N sentences in memory, in our system we set N equals to 20.",
                    "sid": 60,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do this because adjacent sentences are always relevant and some named entity likely occurs repeatedly in these sentences.",
                    "sid": 61,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we scan these sentences to find all n-grams (n from 2 to 7) and count their occurrence.",
                    "sid": 62,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If certain n-gram appears more than a threshold and this n-gram never appears in training corpus, the n-gram will be selected as a word candidate.",
                    "sid": 63,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we filter these word candidates according to the context entropy (Luo and Song, 2004).",
                    "sid": 64,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Assume w is a word candidate appearsn times in the current sentence and last N sen threshold will be bind as a whole word in test corpus no matter what tag sequence the segmenter giving it.",
                    "sid": 65,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a shorter n-gram is contained in a longer n-gram and both of them satisfy the above condition, the shorter n-gram will be overlooked and the longer n-gram is bind as a whole word.",
                    "sid": 66,
                    "ssid": 52,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "evaluation of our system. ",
            "number": "3",
            "sents": [
                {
                    "text": "On the corpora of the Fourth Bakeoff, we evaluate our system.",
                    "sid": 67,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We carry out our evaluation on the closed tracks.",
                    "sid": 68,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It means that we do not use any additional knowledge beyond the training corpus.",
                    "sid": 69,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The thresholds set for MP and CE on each corpus are tuned on left-out data of training corpus by cross validation.",
                    "sid": 70,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To analyze our methods on IV and OOV words, we use a detailed evaluation metric than Bakeoff 2006 (Levow, 2006) which includes Foov and Fiv.",
                    "sid": 71,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our results are shown in Table 2.",
                    "sid": 72,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Table 2, the row “Basic Model” means the results produced by our basic CRF tagger, the row “+IV” means the results produced by the combination of CRF tagger and word-based segmenter and the row “+IV+OOV” means the result we get by executing post-processing rule on the combination results.",
                    "sid": 73,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The F measure of the basic CRF tagger alone in the Table 2 is within the top three in the closed tests except Cityu.",
                    "sid": 74,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance on Cityu corpus is not so good because the inconsistencies existing in Cityu training and test corpora.",
                    "sid": 75,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the training corpus the quotation marks are 「」while in test corpus quotation marks are“”, which never apper in the training corpus.",
                    "sid": 76,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a reult, a lot of errors were caused by quotation marks.",
                    "sid": 77,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the following four character “事業”were combined as a one word in our result and fragment“越位”was tagged as two “越 and 位”.",
                    "sid": 78,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because CRF tagger never tences and   {a0 , a1 ,..., al } is the set of left side characters of w . Left Context Entropy (LCE) can be defined as: words met “ and ” in training corpus so the tagger gave the most common tags, namely B and E to the quotation marks, which cause segmentation LCE (w)  1  n a  C (ai , w) log n C (ai , w) errors not only on quotation marks themselv es but also on the character s adjacent to them.",
                    "sid": 79,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We remove these inconsiste ncies munually and got Here, C (ai , w) is the count of concur rence of the F measu re 0.5 percen tage higer than the rusultai and w . For the Right Context Entropy, the de finition is the same except change left into right.",
                    "sid": 80,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now, we define Context Entropy (CE) of a word in table 2.",
                    "sid": 81,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result is within the top three in the closed tests.",
                    "sid": 82,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On all the five corpora, our “+IV” module can increase the Fiv and our “+OOV” candidate w as min(LCE(w), RCE(w)) . The.",
                    "sid": 83,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "module can increase Foov respectively.",
                    "sid": 84,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, word candidates with CE larger than a predefined these improvements are not significant.",
                    "sid": 85,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Co rp us Me tho d R P F RO OV PO OV FO OV RIV PIV FIV C K IP Ba sic M od el 0.9 46 0.9 23 0.9 40 0.6 51 0.7 19 0.6 83 0.9 69 0.9 48 0.9 58 + IV 0.9 49 0.9 35 0.9 42 0.6 47 0.7 41 0.6 91 0.9 73 0.9 48 0.9 60 + IV + O O V 0.9 50 0.9 36 0.9 43 0.6 56 0.7 48 0.6 99 0.9 73 0.9 49 0.9 61 Ci ty U Ba sic M od el 0.9 44 0.9 34 0.9 39 0.6 54 0.7 21 0.6 86 0.9 70 0.9 51 0.9 60 + IV 0.9 46 0.9 36 0.9 41 0.6 55 0.7 38 0.6 94 0.9 72 0.9 51 0.9 62 + IV + O O V 0.9 49 0.9 37 0.9 43 0.6 78 0.7 59 0.7 16 0.9 73 0.9 51 0.9 62 C T B Ba sic M od el 0.9 53 0.9 51 0.9 52 0.7 03 0.7 27 0.7 15 0.9 67 0.9 64 0.9 65 + IV 0.9 54 0.9 52 0.9 53 0.6 97 0.7 47 0.7 21 0.9 69 0.9 63 0.9 66 + IV + O O V 0.9 54 0.9 53 0.9 53 0.7 03 0.7 49 0.7 25 0.9 69 0.9 64 0.9 66 N C C Ba sic M od el 0.9 40 0.9 28 0.9 34 0.4 38 0.5 80 0.4 99 0.9 65 0.9 40 0.9 52 + IV 0.9 44 0.9 30 0.9 36 0.4 34 0.6 03 0.5 04 0.9 69 0.9 41 0.9 55 + IV + O O V 0.9 45 0.9 32 0.9 39 0.4 50 0.6 20 0.5 22 0.9 70 0.9 43 0.9 56 S X U Ba sic M od el 0.9 60 0.9 53 0.9 56 0.6 36 0.6 74 0.6 54 0.9 77 0.9 67 0.9 72 + IV 0.9 62 0.9 55 0.9 58 0.6 37 0.6 96 0.6 65 0.9 80 0.9 67 0.9 73 + IV + O O V 0.9 62 0.9 55 0.9 59 0.6 45 0.7 02 0.6 73 0.9 79 0.9 68 0.9 74 Table 2 performance each step of our system achieves",
                    "sid": 86,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions and future work. ",
            "number": "4",
            "sents": [
                {
                    "text": "In this paper, we propose a three-stage strategy in Chinese Word Segmentation.",
                    "sid": 87,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on the results produced by basic CRF, our word-based segmentation module and post-processing module are designed to improve IV and OOV performance respectively.",
                    "sid": 88,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results above show that our system achieves the state-of-the-art performance.",
                    "sid": 89,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since only the CRF tagger is good enough as we shown in our experiment, in the future work we will pay effort on the semi-supervised learning for CRF model in order to mining more useful information from training and test corpus for CRF tag- ger.",
                    "sid": 90,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}