{
    "ID": "J01-4003",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "In this paper we compare pronoun resolution algorithms and introduce a centering algorithm (Left­ Right Centering) that adheres to the constraints and rules of centering theory and is an alternative to Brennan, Friedman, and Pollard's (1987) algorithm.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then use the Left-Right Centering algorithm to see if two psycholinguistic claims on Cf-list ranking will actually improve pronoun resolution accuracy.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our results from this investigation lead to the development of a new syntax­ based ranking of the Cf-list and corpus-based evidence that contradicts the psycholinguistic claims.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The aims of this paper are to compare implementations of pronoun resolution algo­ rithms automatically on a common corpus and to see if results from psycholinguistic experiments can be used to improve pronoun resolution.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many hand-tested corpus evaluations have been done in the past (e.g., Walker 1989; Strube 1998; Mitkov 1998; Strube and Hahn 1999), but these have the drawback of being carried out on small corpora.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While manual evaluations have the advantage of allowing the researcher to examine the data closely, they are problematic because they can be time consuming, generally making it difficult to process corpora that are large enough to provide reli­ able, broadly based statistics.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With a system that can run various pronoun resolution algorithms, one can easily and quickly analyze large amounts of data and generate more reliable results.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this study, this ability to alter an algorithm slightly and test its performance is central.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first show the attractiveness of the Left-Right Centering algorithm (henceforth LRC) (Tetreault 1999) given its incremental processing of utterances, psycholinguistic plausibility, and good performance in finding the antecedents of pronouns.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The al­ gorithm is tested against three other leading pronoun resolution algorithms: Hobbs's naive algorithm (1978), S-list (Strube 1998), and BFP (Brennan, Friedman, and Pollard 1987).",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next we use the conclusions from two psycholinguistic experiments on ranking the Cf-list, the salience of discourse entities in prepended phrases (Gordon, Grosz, and Gilliam 1993) and the ordering of possessor and possessed in complex NPs (Gordon et al. 1999), to try to improve the performance of LRC.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We begin with a brief review of the four algorithms to be compared (Section 2).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then discuss the results of the corpus evaluation (Sections 3 and 4).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we show that the results from two psycholinguistic experiments, thought to provide a better ordering of the Cf-list, do not improve LRC's performance when they are incorporated (Section 5).",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "* Department of Computer Science, Rochester, NY 14627.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email: tetreaul@cs.rochester.edu © 2001 Association for Computational Linguistics",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "algorithms. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Hobbs's Algorithm.",
                    "sid": 17,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hobbs (1978) presents two algorithms: a naive one based solely on syntax, and a more complex one that includes semantics in the resolution method.",
                    "sid": 18,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The naive one (hence­ forth, the Hobbs algorithm) is the one analyzed here.",
                    "sid": 19,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike the other three algorithms analyzed in this project, the Hobbs algorithm does not appeal to any discourse models for resolution; rather, the parse tree and grammatical rules are the only information used in pronoun resolution.",
                    "sid": 20,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Hobbs algorithm assumes a parse tree in which each NP node has an N type node below it as the parent of the lexical object.",
                    "sid": 21,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm is as follows: 1.",
                    "sid": 22,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Begin at the NP node immediately dominating the pronoun..",
                    "sid": 23,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 24,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Walk up the tree to the first NP or S encountered.",
                    "sid": 25,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Call this node X, and.",
                    "sid": 26,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "call the path used to reach it p. 3.",
                    "sid": 27,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Traverse all branches below node X to the left of path p in a left-to­.",
                    "sid": 28,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "right, breadth-first manner.",
                    "sid": 29,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Propose as the antecedent any NP node that is encountered which has an NP or S node between it and X. If no antecedent is found, proceed to Step 4.",
                    "sid": 30,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4. If node X is the highest S node in the sentence, traverse the surface parse.",
                    "sid": 31,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "trees of previous sentences in order of recency, the most recent first; each tree is traversed in a left-to-right, breadth-first manner, and when an NP node is encountered, propose it as the antecedent.",
                    "sid": 32,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If X is not the highest S node in the sentence, continue to Step 5.",
                    "sid": 33,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5. From node X, go up the tree to the first NP or S node encountered.",
                    "sid": 34,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Call.",
                    "sid": 35,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "this new node X, and call the path traversed to reach it p. 6.",
                    "sid": 36,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If X is an NP node and if the path p to X did not pass through the N. node that X immediately dominates, propose X as the antecedent.",
                    "sid": 37,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.",
                    "sid": 38,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Traverse all branches below node X to the left of path p in a left-to­.",
                    "sid": 39,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "right, breadth-first manner.",
                    "sid": 40,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Propose any NP node encountered as the antecedent.",
                    "sid": 41,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8.",
                    "sid": 42,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If X is an S node, traverse all branches of node X to the right of path p. in a left-to-right, breadth-first manner, but do not go below any NP or S node encountered.",
                    "sid": 43,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Propose any NP node encountered as the antecedent.",
                    "sid": 44,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9.",
                    "sid": 45,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Go to Step 4..",
                    "sid": 46,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A match is \"found\" when the NP in question matches the pronoun in number, gender, and person.",
                    "sid": 47,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm amounts to walking the parse tree from the pronoun in question by stepping through each NP and S on the path to the top S and running a breadth-first search on NP's children left of the path.",
                    "sid": 48,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a referent cannot be found in the current utterance, then the breadth-first strategy is repeated on preceding utterances.",
                    "sid": 49,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hobbs did a hand-based evaluation of his algorithm on three different texts: a history chapter, a novel, and a news article.",
                    "sid": 50,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Four pronouns were considered: he, she, it, and they.",
                    "sid": 51,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cases where it refers to a nomecoverable entity (such as the time or weather) were not counted.",
                    "sid": 52,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm performed successfully on 88.3% of the 300 pronouns in the corpus.",
                    "sid": 53,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accuracy increased to 91.7% with the inclusion of selectional constraints.",
                    "sid": 54,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Centering Theory and BFP's Algorithm.",
                    "sid": 55,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Centering theory is part of a larger theory of discourse structure developed by Grosz and Sidner (1986).",
                    "sid": 56,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These researchers assert that discourse structure has three compo nents: (1) a linguistic structure, which is the structure of the sequence of utterances; (2) the intentional structure, which is a structure of discourse-relevant purposes; and (3) the attentional state, which is the state of focus.",
                    "sid": 57,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The attentional state models the discourse participants' focus of attention determined by the other two structures at any one time.",
                    "sid": 58,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, it has global and local components that correspond to the two levels of discourse coherence.",
                    "sid": 59,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Centering models the local component of attentional state-namely, how the speaker's choice of linguistic entities affects the inference load placed upon the hearer in discourse processing.",
                    "sid": 60,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, referring to an entity with a pronoun signals that the entity is more prominently in focus.",
                    "sid": 61,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As described by Brennan, Friedman, and Pollard (1987) (henceforth, BFP) and Walker, Iida, and Cote (1994), entities called centers link an utterance with other utter­ ances in the discourse segment.",
                    "sid": 62,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each utterance within a discourse has one backward­ looking center (Cb) and a set of forward-looking centers (Cf).",
                    "sid": 63,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Cf set for an utterance Uo is the set of discourse entities evoked by that utterance.",
                    "sid": 64,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Cf set is ranked according to discourse salience; the most accepted ranking is by grammatical role (by subject, direct object, indirect object).",
                    "sid": 65,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The highest-ranked element of this list is called the preferred center (Cp).",
                    "sid": 66,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Cb represents the most highly ranked element of the previous utterance that is found in the current utterance.",
                    "sid": 67,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Essentially, it serves as a link between utterances.",
                    "sid": 68,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Abrupt changes in discourse topic are reflected by a change of Cb between utterances.",
                    "sid": 69,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In discourses where the change of Cb is minimal, the Cp of the utterance represents a prediction of what the Cb will be in the next utterance.",
                    "sid": 70,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Grosz, Joshi, and Weinstein (1986, 1995) proposed the following constraints of centering theory: Constraints For each utterance U;, in a discourse segment D, consisting of utterances of U 1 ...",
                    "sid": 71,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Urn: 1.",
                    "sid": 72,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is precisely one Cb..",
                    "sid": 73,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 74,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Every element of the Cf-list for U; must be realized in U;..",
                    "sid": 75,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 76,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The center, Cb(U;, D), is the highest-ranked element of Cf(U;_ 1,D) that is. realized in U;.",
                    "sid": 77,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, they proposed the following rules: Rules For each utterance U;, in a discourse segment D, consisting of utterances of U1 ...",
                    "sid": 78,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Urn: 1.",
                    "sid": 79,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If some element of Cf(U;_1, D) is realized as a pronoun in U;, then so is. Cb(U;,D).",
                    "sid": 80,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 81,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Transition states (defined below) are ordered such that a sequence of.",
                    "sid": 82,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Continues is preferred over a sequence of Retains, which are preferred over sequences of Shifts.",
                    "sid": 83,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relationship between the Cb and Cp of two utterances determines the co­ herence between the utterances.",
                    "sid": 84,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Centering theory ranks the coherence of adjacent utterances with transitions that are determined by the following criteria: 1.",
                    "sid": 85,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "whether or not the Cb is the same from Un-l to Un; 2.",
                    "sid": 86,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "whether or not this entity coincides with the Cp of Un.",
                    "sid": 87,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "509 Table 1 Centering transition table.",
                    "sid": 88,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cb(Un) = Cp(U,) Cb(Un) = Cp(Un1) Continue Retain Smooth Shift Rough Shift BFP and Walker, Iida, and Cote (1994) identified a finer gradation in the Shift tran­ sition, stating that Retains were preferred over Smooth Shifts, which were preferred over Rough Shifts.",
                    "sid": 89,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 shows the criteria for each transition.",
                    "sid": 90,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given these constraints and rules, BFP proposed the following pronoun-binding algorithm based on centering: 1.",
                    "sid": 91,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generate all possible CbCf combinations..",
                    "sid": 92,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 93,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Filter combinations by contraindices and centering rules..",
                    "sid": 94,
                    "ssid": 78,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "rank remaining combinations by transitions.. ",
            "number": "3",
            "sents": [
                {
                    "text": "Walker (1989) compared Hobbs and BFP on three small data sets using hand evaluation.",
                    "sid": 95,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results indicated that the two algorithms performed equivalently over a fictional domain of 100 utterances; and Hobbs outperformed BFP over domains consisting of newspaper articles (89% to 79%) and a task domain (Tasks) (51% to 49%).",
                    "sid": 96,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 The S-List Approach.",
                    "sid": 97,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third approach (Strube 1998) discards the notions of backward- and forward­ looking centers but maintains the notion of modeling the attentional state.",
                    "sid": 98,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method, the S-list (salience list), was motivated by the BFP algorithm's problems with mere­ mentality and computational overhead (it was also difficult to coordinate the algorithm with intrasentential resolution).",
                    "sid": 99,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3.1 The S-List.",
                    "sid": 100,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The model has one structure, the S-list, which \"describes the atten­ tional state of the hearer at any given point in processing a discourse\" (Strube 1998, page 1252).",
                    "sid": 101,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At first glance, this definition is quite similar to that of a Cf-list; however, the two differ in ranking and composition.",
                    "sid": 102,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the S-list can contain elements from both the current and previous utterance while the Cf-list contains elements from the previous utterance alone.",
                    "sid": 103,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, the S-list's elements are ranked not by grammatical role but by information status and then by surface order.",
                    "sid": 104,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The elements of the S-list are separated into three information sets-hearer-old discourse entities (OLD), mediated discourse entities (MED), and hearer-new dis­ course entities (NEW)-all of which are based on Prince's (1981) familiarity scale.",
                    "sid": 105,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The three sets are further subdivided: OLD consists of evoked and unused entities; MED consists of inferrables, containing inferrables, and anchored brand-new discourse intrasentential entities; NEW consists solely of brand-new entities.",
                    "sid": 106,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What sorts of NPs fall into these categories?",
                    "sid": 107,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pronouns and other referring expres­ sions, as well as previously mentioned proper names, are evoked.",
                    "sid": 108,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unused entities are proper names.",
                    "sid": 109,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inferrables are entities that are linked to some other entity in the hearer's knowledge, but indirectly.",
                    "sid": 110,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Anchored brand-new discourse entities have as their anchor an entity that is OLD.",
                    "sid": 111,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The three sets are ordered by their information status.",
                    "sid": 112,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "OLD entities are preferred over MED entities, which are preferred over NEW entities.",
                    "sid": 113,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Within each set, the or­ dering is by utterance and position in utterance.",
                    "sid": 114,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basically, an entity of utterance x is preferred over an entity of utterance y if utterance x follows utterance y. If the entities are in the same utterance, they are ranked by position in the sentence: an entity close to the beginning of the sentence is preferred over one that is farther away.",
                    "sid": 115,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3.2 Algorithm.",
                    "sid": 116,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resolution algorithm presented here comes from Strube (1998) and personal communication with Michael Strube.",
                    "sid": 117,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each utterance (U1 ...",
                    "sid": 118,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "UN): for each entity within U;: 1.",
                    "sid": 119,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If U; is a pronoun, then find a referent by looking through the S-list left.",
                    "sid": 120,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "to right for one that matches in gender, number, person, and binding constraints.",
                    "sid": 121,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mark entity as EVOKED.1 2.",
                    "sid": 122,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If U; is preceded by an indefinite article, then mark U; as BRAND-NEW..",
                    "sid": 123,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 124,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If U; is not preceded by a determiner, then mark U; as UNUSED..",
                    "sid": 125,
                    "ssid": 31,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "else mark u; as anchored brand-new.. ",
            "number": "4",
            "sents": [
                {
                    "text": "6.",
                    "sid": 126,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Upon completion of U; remove all entities from the 5-list that were not.",
                    "sid": 127,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "realized in U;.",
                    "sid": 128,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In short, the S-list method continually inserts new entities into the S-list in their proper positions and \"cleanses\" the list after each utterance to purge entities that are unlikely to be used again in the discourse.",
                    "sid": 129,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pronoun resolution is a simple lookup in the S-list.",
                    "sid": 130,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Strube did perform a hand test of the S-list algorithm and the BFP algorithm on three short stories by Hemingway and three articles from the New York Times.",
                    "sid": 131,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BFP, with intrasentential centering added, successfully resolved 438 pronouns out of 576 (76%).",
                    "sid": 132,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The S-list approach performed much better (85%).",
                    "sid": 133,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4 Left-Right Centering Algorithm.",
                    "sid": 134,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Left-Right Centering (Tetreault 1999) is an algorithm built upon centering theory's constraints and rules as detailed in Grosz, Joshi, and Weinstein (1995).",
                    "sid": 135,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The creation of the LRC algorithm is motivated by BFP's limitation as a cognitive model in that it makes no provision for incremental resolution of pronouns (Kehler 1997).",
                    "sid": 136,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Psycholin­ guistic research supports the claim that listeners process utterances one word at a time.",
                    "sid": 137,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, when a listener hears a pronoun, he or she will try to resolve it immediately; if new information appears that makes the original choice incorrect (such as a violation of binding constraints), the listener will go back and find a correct antecedent.",
                    "sid": 138,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Responding to the lack of incremental processing in the BFP model, we have constructed an incremental resolution algorithm that adheres to centering constraints.",
                    "sid": 139,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It works by first searching for an antecedent in the current utterance;2 if one is not found, then the previous Cf-lists (starting with the previous utterance) are searched 1 In the original S-list formulation, pronouns are not the only entities that can be marked as EVOKED;.",
                    "sid": 140,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "nominal anaphora and previously mentioned proper names (to name just two) can also be EVOKED (Strube and Hahn 1999).",
                    "sid": 141,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our implementation, pronouns are the only entities that can fall in this category.",
                    "sid": 142,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 In this project, a sentence is considered an utterance..",
                    "sid": 143,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "left to right for an antecedent: 1.",
                    "sid": 144,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preprocessing-from previous utterance: Cb(Un1) and Cf(Un1) are.",
                    "sid": 145,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "available.",
                    "sid": 146,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 147,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Process utterance-parse and extract incrementally from U 11 all refer­.",
                    "sid": 148,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ences to discourse entities.",
                    "sid": 149,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each pronoun do: (a) Search for an antecedent intrasententially in Cfpartiai(Un)3 that meet feature and binding constraints.",
                    "sid": 150,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If one is found, proceed to the next pronoun within utterance.",
                    "sid": 151,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Else go to (b).",
                    "sid": 152,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(b) Search for an antecedent intersententially in Cf(Un1) that meets feature and binding constraints.",
                    "sid": 153,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 154,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Create C£-create Cf-list of Un by ranking discourse entities of Un ac­.",
                    "sid": 155,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "cording to grammatical function.",
                    "sid": 156,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our implementation used a left-to-right breadth-first walk of the parse tree to approximate sorting by grammat­ ical function.",
                    "sid": 157,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It should be noted that while BFP makes use of Rule 2 of centering theory, LRC does not since Rule 2's role in pronoun resolution is not yet known (see Kehler [1997] for a critique of its use by BFP).",
                    "sid": 158,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The preference for searching intrasententially before intersententially is motivated by the fact that large sentences are not broken up into clauses as Kameyama (1998) proposes.",
                    "sid": 159,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By looking through the Cf-partial, clause-by-clause centering is roughly ap­ proximated.",
                    "sid": 160,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, the antecedents of reflexive pronouns are found by searching Cf-partial right to left because their referents are usually found in the minimal S. There are two important points to be made about centering and pronoun resolu­ tion.",
                    "sid": 161,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, centering is not a pronoun resolution method; the fact that pronouns can be resolved is simply a side effect of the constraints and rules.",
                    "sid": 162,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, ranking by grammatical role is very naive.",
                    "sid": 163,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a perfect world, the Cf-list would consist of entities ranked by a combination of syntax and semantics.",
                    "sid": 164,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our study, ranking is based solely on syntax.",
                    "sid": 165,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 166,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation of Algorithms.",
                    "sid": 167,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Data.",
                    "sid": 168,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All four algorithms were compared on two domains taken from the Penn Treebank annotated corpus (Marcus, Santorini, and Marcinkiewicz 1993).",
                    "sid": 169,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first domain con­ sists of 3,900 utterances (1,694 unquoted pronouns) in New York Times articles provided by Ge, Hale, and Charniak (1998), who annotated the corpus with coreference infor­ mation.",
                    "sid": 170,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus consists of 195 different newspaper articles.",
                    "sid": 171,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentences are fully bracketed and have labels that indicate part of speech and number.",
                    "sid": 172,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pronouns and their antecedent entities are all marked with the same tag to facilitate coreference verification.",
                    "sid": 173,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, the subject NP of each S subconstituent is marked.",
                    "sid": 174,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second domain consists of 553 utterances (511 unquoted pronouns) in three fictional texts taken from the Penn Treebank corpus, which we annotated in the same manner as Ge, Hale, and Charniak's corpus.",
                    "sid": 175,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second domain differs from the first in that the sentences are generally shorter and less complex, and contain more hes and shes.",
                    "sid": 176,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 Cf-partial is a list of all processed discourse entities in Un..",
                    "sid": 177,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Method.",
                    "sid": 178,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evaluation (Byron and Tetreault 1999) consisted of two steps: (1) parsing Penn Treebank utterances and (2) running the four algorithms.",
                    "sid": 179,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parsing stage involved extracting discourse entities from the Penn Treebank utterances.",
                    "sid": 180,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since we were solely concerned with pronouns having NP antecedents, we extracted only NPs.",
                    "sid": 181,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each NP we generated a \"filecard\" that stored its syntactic information.",
                    "sid": 182,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This information included agreement properties, syntactic type, parent nodes, depth in tree, position in utterance, presence or absence of a determiner, gender, coreference tag, utterance number, whether it was quoted, commanding verb, whether it was part of a title, whether it was reflexive, whether it was part of a possessive NP, whether it was in a prepended phrase, and whether it was part of a conjoined sentence.",
                    "sid": 183,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The entities were listed in each utterance in order of mention except in the case of conjoined NPs.",
                    "sid": 184,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conjoined entities such as John and Mary were realized as three entities: the singular entities John and Mary and the plural John and Mary.",
                    "sid": 185,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The plural entity was placed ahead of the singular ones in the Cf-list, on the basis of research by Gordon et al.",
                    "sid": 186,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1999).",
                    "sid": 187,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conjoined utterances were broken up into their subutterances.",
                    "sid": 188,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the utterance United Illuminating is based in New Haven,Conn.,and Northeast is based in Hartford, Conn. was replaced by the two utterances United Illuminating is based in New Haven,Conn. and Northeast is based in Hartford, Conn. This strategy was inspired by Kameyama's (1998) methods for dealing with complex sentences; it improves the accuracy of each algorithm by 1% to 2%.",
                    "sid": 189,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second stage involved running each algorithm on the parsed forms of the Penn Treebank utterances.",
                    "sid": 190,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For all algorithms, we used the same guidelines as Strube and Hahn (1999): no world knowledge was assumed, only agreement criteria (gender, number) and binding constraints were applied.",
                    "sid": 191,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike Strube and Hahn, we did not make use of sortal constraints.",
                    "sid": 192,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of each NP could be extracted from the Penn Treebank annotations, but gender had to be hand-coded.",
                    "sid": 193,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A database of all NPs was tagged with their gender (masculine, feminine, neuter).",
                    "sid": 194,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NPs such as president or banker were marked as androgynous since it is possible to refer to them with a gendered pronoun.",
                    "sid": 195,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Entities within quotes were removed from the evaluation since the S-list algorithm and BFP do not allow resolution of quoted text.",
                    "sid": 196,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We depart from Walker's (1989) and Strube and Hahn's (1999) evaluations by not defining any discourse segments.",
                    "sid": 197,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Walker defines a discourse segment as a paragraph (unless the first sentence of the paragraph has a pronoun in subject position or unless it has a pronoun with no antecedent among the preceding NPs that match syntactic features).",
                    "sid": 198,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, we divide our corpora only by discourses (newspaper article or story).",
                    "sid": 199,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once a new discourse is encountered, the history list for each algorithm (be it the Cf-list or S-list) is cleared.",
                    "sid": 200,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using discourse segments should increase the efficiency of all algorithms since it constrains the search space significantly.",
                    "sid": 201,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike Walker (1989), we do not account for false positives or error chains; instead, we use a \"location\"-based evaluation procedure.",
                    "sid": 202,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Error chains occur when a pronoun P;2 refers to a pronoun P;, that was resolved incorrectly to entity Ek (where P;2 and P;, evoke the same entity E;).",
                    "sid": 203,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So P;2 would corefer incorrectly with Ek· In our evaluation, a coreference is deemed correct if it corefers with an NP that has the same coreference tag.",
                    "sid": 204,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So in the above situation, P;2 would be deemed correct since it was matched to an expression that should realize the correct entity.",
                    "sid": 205,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Algorithm Modifications.",
                    "sid": 206,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The BFP algorithm had to be modified slightly to compensate for underspecifications in its intrasentential resolution.",
                    "sid": 207,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We follow the same method as Strube and Hahn (1999); that is, we first try to resolve pronouns intersententially using the BFP algorithm.",
                    "sid": 208,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If there are pronouns left unresolved, we search for an antecedent left to right in the same utterance.",
                    "sid": 209,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Strube and Hahn use Kameyama's (1998) specifications for complex sentences to break up utterances into smaller components.",
                    "sid": 210,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We keep the utterances whole (with the exception of splitting conjoined utterances).",
                    "sid": 211,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an aside, the BFP algorithm can be modified (Walker 1989) so that intrasen­ tential antecedents are given a higher preference.",
                    "sid": 212,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To quote Walker, the alteration (sug­ gested by Carter [1987]) involves selecting intrasentential candidates \"only in the cases where no discourse center has been established or the discourse center has been re­ jected for syntactic or selectional reasons\" (page 258).",
                    "sid": 213,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Walker applied the modification and was able to boost BFP's accuracy to 93% correct over the fiction corpus, 84% on Newsweek articles, and 64% on Tasks (up from 90%, 79%, and 49%, respectively).",
                    "sid": 214,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BFP with Carter's modification may seem quite similar to LRC except for two points.",
                    "sid": 215,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, LRC seeks antecedents intrasententially regardless of the status of the discourse center.",
                    "sid": 216,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, LRC does not use Rule 2 in constraining possible antecedents intersententially, while BFP does so.",
                    "sid": 217,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because the S-list approach incorporates both semantics and syntax in its famil­ iarity ranking scheme, a shallow version that uses only syntax is implemented in this study.",
                    "sid": 218,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that inferrables are not represented and entities rementioned as NPs may be underrepresented in the ranking.",
                    "sid": 219,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both the BFP and S-list algorithms were modified so that they have the ability to look back through all past Cf/S-lists.",
                    "sid": 220,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This puts the two algorithms on equal footing with the Hobbs and LRC algorithms, which allow one to look back as far as possible within the discourse.",
                    "sid": 221,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hobbs (1978) makes use of selectional constraints to help refine the search space for neutral pronouns such as it.",
                    "sid": 222,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do not use selectional constraints in this syntax-only study.",
                    "sid": 223,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Results.",
                    "sid": 224,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two naive algorithms were created to serve as a baseline for results.",
                    "sid": 225,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first, \"most recent,\" keeps a history list of all entities seen within the discourse unit.",
                    "sid": 226,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most recent entity that matches in gender, number, and binding constraints is selected as the antecedent for the pronoun.",
                    "sid": 227,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method correctly resolves 60% of pronouns in both domains.",
                    "sid": 228,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A slightly more complex baseline involves using the LRC algorithm but random­ izing all Cf-lists considered.",
                    "sid": 229,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, in the intrasentential component, the ranking of the entities in Cf-partial is random.",
                    "sid": 230,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous Cf-lists are also randomized after being pro­ cessed.",
                    "sid": 231,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method actually does well (69%) compared with the \"intelligent\" algo­ rithms, in part because of its preference for intrasentential entities.",
                    "sid": 232,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tables 2 and 3 include results for the different algorithms over the two domains.",
                    "sid": 233,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"Success rate\" as defined by Mitkov (2000) is the number of successfully resolved pro­ nouns divided by the total number of pronouns.",
                    "sid": 234,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two variations of LRC are included as further baselines.",
                    "sid": 235,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LRCsurf ranks its Cf-list by surface order only.",
                    "sid": 236,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LRC ranks the Cf-list by grammatical function.",
                    "sid": 237,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LRC-F is the best instantiation of LRC and involves moving entities in a prepended phrase to the back of the Cf-list (which is still ranked by grammatical function).",
                    "sid": 238,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LRC-P ranks its entities the same way as LRC-F except that it then moves all pronouns to the head of the Cf-list (maintaining original order).",
                    "sid": 239,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This algorithm was meant to be a hybrid of the S-list and LRC algorithms with the hope that performance would be increased by giving weight to pronouns since they would be more likely to continue the backward-looking center.",
                    "sid": 240,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 Pronoun resolution algorithms for New York Times articles.",
                    "sid": 241,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alg orit hm R i g h t S u c c e s s R a t e % Ri gh t In tr a % Ri gh t Int er BF P 1 0 0 4 5 9 . 4 75 .1 48.",
                    "sid": 242,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 Ran do m Cf 1 1 7 5 6 9 . 4 70 .2 66.",
                    "sid": 243,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7S list 1 2 1 1 7 1 . 7 74 .1 67.",
                    "sid": 244,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 LR Csu rf 1 2 6 6 7 4 . 7 72 .0 81.",
                    "sid": 245,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 LR C 1 2 6 8 7 4 . 9 72 .0 82.",
                    "sid": 246,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 Ho bbs 1 2 9 8 7 6 . 8 74 .2 82.",
                    "sid": 247,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 LR C-F 1 3 6 2 8 0 . 4 77 .7 87.",
                    "sid": 248,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 LR C-P 1 3 6 2 8 0 . 4 77 .7 87.",
                    "sid": 249,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 Table 3 Pronoun resolution algorithms for fictional texts.",
                    "sid": 250,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alg orit hm R i g h t S u c c e s s R a t e % Ri gh t In tr a % Ri gh t Int er BF P 2 4 1 4 6 . 4 81 .8 43.",
                    "sid": 251,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8S list 3 3 7 6 6 . 1 84 .4 56.",
                    "sid": 252,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Ran dom Cf 3 6 7 7 1 . 1 84 .3 62.",
                    "sid": 253,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 LR Csu rf 3 7 2 7 2 . 1 84 .3 64.",
                    "sid": 254,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 LR C 3 7 2 7 2 . 1 84 .3 64.",
                    "sid": 255,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 LR C-P 3 7 8 7 4 . 0 84 .3 66.",
                    "sid": 256,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Ho bbs 4 1 4 8 0 . 1 85 .8 75.",
                    "sid": 257,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 LR C-F 4 2 0 8 1 . 1 86 .0 76.",
                    "sid": 258,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 4.",
                    "sid": 259,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discussion.",
                    "sid": 260,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this study, we use McNemar's test to test whether the difference in performance of two algorithms is significant.",
                    "sid": 261,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopt the standard statistical convention of p :s:; 0.05 for determining whether the relative performance is indeed significant.",
                    "sid": 262,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we consider LRC in relation to the classical algorithms: Hobbs, BFP, and S-list.",
                    "sid": 263,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found a significant difference in the performance of all four algorithms (e.g., LRC and S-list: p :s:; 0.00479), though Hobbs and LRC performed the closest in terms of getting the same pronouns right.",
                    "sid": 264,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These two algorithms perform similarly for two reasons.",
                    "sid": 265,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, both search for referents intrasententially and then intersententially.",
                    "sid": 266,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the New York Times corpus, over 71% of all pronouns have intrasentential referents, so clearly an algorithm that favors the current utterance will perform better.",
                    "sid": 267,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, both search their respective data structures in a salience-first manner.",
                    "sid": 268,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intersententially, both examine previous utterances in the same manner: breadth-first based on syntax.",
                    "sid": 269,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intrasententially, Hobbs does slightly better since it first favors antecedents close to the pronoun before searching the rest of the tree.",
                    "sid": 270,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LRC favors entities near the head of the sentence under the assumption that they are more salient.",
                    "sid": 271,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These algorithms' similarities in intra- and intersentential evaluation are reflected in the similarities in their percentage correct for the respective categories.",
                    "sid": 272,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although S-list performed worse than LRC over the New York Times corpus, it did fare better over the fictional texts.",
                    "sid": 273,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is due to the high density of pronouns in these texts, which S-list would rank higher in its salience list since they are hearer-old.",
                    "sid": 274,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It should be restated that a shallow version (syntax only) of the S-list algorithm is implemented here.",
                    "sid": 275,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The standing of the BFP algorithm should not be surprising given past studies.",
                    "sid": 276,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Strube (1998) found that the S-list algorithm performed at 91% correct on three New York Times articles, while the best version of BFP performed at 81%.",
                    "sid": 277,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This 10% difference is reflected in the present evaluation as well.",
                    "sid": 278,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main drawback for BFP was its preference for intersentential resolution.",
                    "sid": 279,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, BFP, as formally defined, does not have an intrasentential processing mechanism.",
                    "sid": 280,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the purposes of the project, the LRC intrasentential technique was used to resolve pronouns that could not be resolved by the BFP (intersentential) algorithm.",
                    "sid": 281,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is unclear whether this is the optimal intrasentential algorithm for BFP.",
                    "sid": 282,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LRC-F is much better than LRC alone considering its improvement of over 5% in the newspaper article domain and over 7% in the fictional domain.",
                    "sid": 283,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This increase is discussed in the following section.",
                    "sid": 284,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hybrid algorithm (LRC-P) has the same accuracy rate as LRC-F, though each gets 5 instances right that the other does not.",
                    "sid": 285,
                    "ssid": 160,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "examining psycholinguistic claims of centering. ",
            "number": "5",
            "sents": [
                {
                    "text": "Having established LRC as a fair model of centering given its performance and incre­ mental processing of utterances, we can use it to test empirically whether psycholin­ guistic claims about the ordering of the Cf-list are reflected in an increase in accuracy in resolving pronouns.",
                    "sid": 286,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reasoning behind the following corpus tests is that if the predictions made by psycholinguistic experiments fail to increase performance or even lower performance, then this suggests that the claims may not be useful.",
                    "sid": 287,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As Suri, Mc­ Coy, and DeCristofaro (1999, page 180) point out: \"the corpus analysis reveals how language is actually used in practice, rather than depending on a small set of dis­ courses presented to the human subjects.\"",
                    "sid": 288,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we use our corpus evaluation to provide counterevidence to the claims made about using genitives and prepended phrases to rank the Cf-list, and we propose a new Cf-list ranking based on these results.",
                    "sid": 289,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Moving Prepended Phrases.",
                    "sid": 290,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gordon, Grosz, and Gilliam (1993) carried out five self-paced reading time experiments that provided evidence for the major tenets of centering theory: that the backward­ looking center (Cb) should be realized as a pronoun and that the grammatical subject of an utterance is most likely to be the Cb if possible.",
                    "sid": 291,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their final experiment showed that surface position also plays a role in ranking the Cf-list.",
                    "sid": 292,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They observed that entities in surface-initial nonsubject positions in the previous sentence had about the same repeated-name penalty as an entity that had been the noninitial subject of the previous sentence.",
                    "sid": 293,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results can be interpreted to mean that entities in subject position and in prepended phrases (nonsubject surface-initial positions) are equally likely to be the Cb.",
                    "sid": 294,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So the claim we wished to test was whether sentence-initial and subject position can serve equally well as the Cb.",
                    "sid": 295,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To evaluate this claim, we changed our parser to find the subject of the utterance.",
                    "sid": 296,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By tagging the subject, we know what entities constitute the prepended phrase (since they precede the subject).",
                    "sid": 297,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We developed two different methods of locating the subject.",
                    "sid": 298,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first simply takes the first NP that is the subject of the first S constituent.",
                    "sid": 299,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is possible that this S constituent is not the top-level S structure and may even be embedded in a prepended phrase.",
                    "sid": 300,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method is called LRC-F since it takes the first subject NP found.",
                    "sid": 301,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second method (LRCS) selects the NP that is the subject of the top-level S structure.",
                    "sid": 302,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If one cannot be found, then the system defaults to the first method.",
                    "sid": 303,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result of both tagging methods is that all NPs preceding the chosen subject are marked as being in a prepended phrase.",
                    "sid": 304,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 Prepended phrase movement experiments over New York Times articles.",
                    "sid": 305,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prepended Movement Standard Sort Alg orit hm Nor m P r e Nor m P r e LR C-F 76.2 1% 8 0 . 4 0 % 79.6 3% 7 5 . 5 0 % LR CS 75.9 7% 8 0 . 0 8 % 78.8 1% 7 4 . 8 5 % Eight different corpus trials were carried out involving the two different parsing algorithms (LRC-F and LRCS) and two different ordering modifications: (1) ranking the Cf-list after processing and (2) modifying the order of entities before processing the utterance.",
                    "sid": 306,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The standard Cf-list consists of ranking entities by grammatical role and surface order.",
                    "sid": 307,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, prepended phrases would still be ranked ahead of the main subject.",
                    "sid": 308,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The modified Cf-list consists of ranking the main clause by grammatical role and placing all entities in the prepended phrase after all entities from the main clause.",
                    "sid": 309,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second method involves reordering the utterance before processing.",
                    "sid": 310,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This technique was motivated mostly by the order we selected for pronoun resolution: an antecedent is first searched for in the Cf-partial, then in the past Cf-lists, and finally in the entities of the same utterance not in the Cf-partial.",
                    "sid": 311,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pronouns in prepended phrases frequently refer to the subject of the same utterance as well as to entities in the previous utterance.",
                    "sid": 312,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moving the prepended entities after the main clause entities before evaluation achieves the same result as looking in the main clause before the intersentential search.",
                    "sid": 313,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 contains the results of the trials over the New York Times domain.",
                    "sid": 314,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"Prepended movement\" refers to ranking the Cf-list with prepended entities moved to the end of the main clause; \"Standard sort\" refers to maintaining the order of the Cf-list.",
                    "sid": 315,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"Norm\" means that prepended entities were not moved before the utterance was processed.",
                    "sid": 316,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"Pre\" means that the entities were placed behind the main clause.",
                    "sid": 317,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All statistics (within the respective algorithms) were deemed significant relative to each other using McNemar's test.",
                    "sid": 318,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it should be noted that between the best performers for LRC-F and LRCS (movement of prepended phrases before and after Cf-list, column 2), the difference in performance is insignificant (p ::; 0.624).",
                    "sid": 319,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This indicates that the two algorithms fare the same.",
                    "sid": 320,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The conclusion is that if an algorithm prefers the subject and marks entities in prepended phrases as less salient, it will resolve pronouns better.",
                    "sid": 321,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Ranking Complex NPs.",
                    "sid": 322,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second claim we wished to test involved ranking possessor and possessed enti­ ties realized in complex NPs.",
                    "sid": 323,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Walker and Prince (1996) developed the complex NP assumption that \"In English, when an NP evokes multiple discourse entities, such as a subject NP with a possessive pronoun, we assume that the Cf ordering is from left to right within the higher NP\" (page 8).",
                    "sid": 324,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So the Cf-list for the utterance Her mother knows Queen Elizabeth would be {her, mother, Elizabeth}.",
                    "sid": 325,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Walker and Prince note that the theory is just a hypothesis but motivate its plausibility with a complex example.",
                    "sid": 326,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, a series of psycholinguistic experiments carried out by Gordon et al.",
                    "sid": 327,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1999) refute Walker and Prince's claim that the entities are ordered left to right.",
                    "sid": 328,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gordon et al. found that subjects had faster reading rates for small discourses in which a pronoun referred to the possessed entity rather than the possessor entity.",
                    "sid": 329,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 Results of evaluating pronoun resolution algorithms for New York Times articles.",
                    "sid": 330,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alg orit hm W P + G e n + P o s LR C-F 8 0.",
                    "sid": 331,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 4 % 7 9 . 9 9 % 7 8 . 4 1 % LR CS 8 0.",
                    "sid": 332,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 0 % 8 0 . 3 4 % 7 8 . 8 3 % LR C 7 6.",
                    "sid": 333,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 5 % 7 6 . 0 3 % 7 4 . 4 7 % Table 6 Results of evaluating pronoun resolution algorithms for Fiction texts.",
                    "sid": 334,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Algorithm WP +Gen +Pos LRC-F LRCS LRC 79.73% 81.08% 80.31% 79.58% 81.08% 80.15% 79.42% 80.88% 79.81% Hobbs (1978) also assumes Gordon et al.'s interpretation in his pronoun algorithm.",
                    "sid": 335,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He assumes that possessor entities are nested deeper in the parse tree, so when the algorithm does a breadth-first search of the tree, it considers the possessed NP to be the most prominent.",
                    "sid": 336,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To see which claim is correct, we altered the Cf-list ranking to put possessed entities before possessor entities.",
                    "sid": 337,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The original LRC ordered them left to right as Walker and Prince (WP) suggest.",
                    "sid": 338,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tables 5 and 6 include results for both domains.",
                    "sid": 339,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "II +gen\" indicates that only complex NPs containing genitive pronouns were reversed; II +pos\" indicates that all possessive NPs were reversed, matching Gordon et al.'s study.",
                    "sid": 340,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results indicate for both domains that Walker and Prince's theory works better, though marginally (for all domains and algorithms, significance levels between WP and +gen are under 0.05).",
                    "sid": 341,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the New York Times domain, the difference in the actual number correct between LRCS with WP and LRCS with +pos is 1,362 to 1,337 or 25 pronouns, which is substantial (p :::; 1.4e06) over a corpus of 1,691 pronouns.",
                    "sid": 342,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Likewise, for the fictional texts, 1 extra pronoun is resolved incorrectly when using Gordon et al.'s method.",
                    "sid": 343,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Looking at the difference in what each algorithm gets right and wrong, it seems that type of referring expression and mention count play a role in which entity should be selected from the complex NP.",
                    "sid": 344,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If an entity has been mentioned previously or is realized as a pronoun, it is more likely to be the referent of a following pronoun.",
                    "sid": 345,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This would lend support to Strube and Hahn's S-list and functional centering theories (Strube and Hahn 1996), which maintain that type of referring expression and previous mention influence the salience of each entity with the S-list or Cf-list.",
                    "sid": 346,
                    "ssid": 61,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "6",
            "sents": [
                {
                    "text": "In this paper we first presented a new pronoun resolution algorithm, Left-Right Center­ ing, which adheres to the constraints of centering theory and was inspired by the need to remedy a lack of incremental processing in Brennan, Friedman, and Pollard's (1987) method.",
                    "sid": 347,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, we compared LRC's performance with that of three other leading pronoun resolution algorithms, each one restricted to using only syntactic informa­ tion.",
                    "sid": 348,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This comparison is significant in its own right because these algorithms have not been previously compared, in computer-encoded form, on a common corpus.",
                    "sid": 349,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Coding all the algorithms allows one to quickly test them on a large corpus and eliminates human error.",
                    "sid": 350,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Third, we tried to improve LRC's performance by incorporating theories on Cf-list construction derived from psycholinguistic experiments.",
                    "sid": 351,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our corpus-based evaluation showed that prepended phrases should not be ranked prominently in the Cf-list as Gordon, Grosz, and Gilliam (1993) suggest.",
                    "sid": 352,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our results also showed that Walker and Prince's (1996) complex NP assumption performs marginally better than the opposite theory based on experimental results.",
                    "sid": 353,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe that corpus-based anal­ yses such as this one not only increase performance in resolution algorithms but also can aid in validating the results of psycholinguistic studies, which are usually based on small sequences of utterances.",
                    "sid": 354,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "future work. ",
            "number": "7",
            "sents": [
                {
                    "text": "The next step is to research ways of breaking up complex utterances and applying centering to these utterances.",
                    "sid": 355,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An overlooked area of research, the incorporation of quoted phrases into centering and pronoun resolution, should be explored.",
                    "sid": 356,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Research into how transitions and the backward-looking center can be used in a pronoun res­ olution algorithm should also be carried out.",
                    "sid": 357,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Strube and Hahn (1996) developed a heuristic of ranking transition pairs by cost to evaluate different Cf-ranking schemes.",
                    "sid": 358,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Perhaps this heuristic could be used to constrain the search for antecedents.",
                    "sid": 359,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It should be noted that all the algorithms analyzed in this paper are syntax based (or modified to be syntax based).",
                    "sid": 360,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Incorporating semantic information such as sortal constraints would be the next logical development for the system.",
                    "sid": 361,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe that purely syntax-based resolution algorithms probably have an upper bound of perfor­ mance in the mid 80s and that developing an algorithm that achieves 90% or better accuracy over several domains requires semantic knowledge.",
                    "sid": 362,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In short, the results pre­ sented here suggest that purely syntactic methods cannot be pushed much farther, and the upper limit reached can serve as a baseline for approaches that combine syntax and semantics.",
                    "sid": 363,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are several other psycholinguistic experiments that can be verified using our computational corpus-based approach.",
                    "sid": 364,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The effects of parallelism and other complex NPs such as plurals still need to be investigated computationally.",
                    "sid": 365,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "I am grateful to Barbara Grosz for aiding me in the development of the LRC algorithm and for discussing centering theory issues.",
                    "sid": 366,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I am also grateful to Donna Byron, who was responsible for much brainstorming, crosschecking of results, and coding of the Hobbs algorithm.",
                    "sid": 367,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I am thankful as well for Jenny Rogers's work in annotating the fictional texts from the Penn Treebank in the same style used by Ge, Hale, and Charniak (1998).",
                    "sid": 368,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Special thanks go to Michael Strube, James Allen, Lenhart Schubert, and Mark Core for advice and brainstorming.",
                    "sid": 369,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I would also like to thank Eugene Charniak and Niyu Ge for the annotated, parsed Penn Treebank corpus, which proved invaluable.",
                    "sid": 370,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Partial support for the research reported in this paper was provided by the National Science Foundation under Grants IRI90-09018, IRI94-04756, and CDA94-01024 to Harvard University and by DARPA Research Grant F3060298-20133 to the University of Rochester.",
                    "sid": 371,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}