{
    "ID": "J01-4006",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Pronoun resolution studies compute performance inconsistently and describe results incom­ pletely.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose a new reporting standard that improves the exposition of individual results and the possibility for readers to compare techniques across studies.We also propose an informative new performance metric, the resolution rate, for use in addition to precision and recall.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "To describe the merits of new pronoun resolution techniques, we often compare them with previous approaches using the performance metrics precision and recall.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Precision P = where: C = pronouns resolved correctly A = total pronouns attempted Recall R = ¥ where: C = pronouns resolved correctly T = total pronouns in the test data Precision computes how well a technique did what it was designed to do, and is not at issue here.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recall is intended as a more general performance measure, yet R scores are difficult to interpret due in part to varying methods of calculating T. T includes only the pronouns that were included in the study rather than all pronouns in the data set.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But since different studies consider different sorts of pronouns to be in scope, R scores from different studies are difficult to compare.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, since the pronouns in scope for a study might represent a large or small percentage of the pronouns in the corpus, R reveals little about a technique's utility for the general problem of pronoun resolution.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper proposes a new reporting format and a new performance measure to supplement R and P. Pronoun resolution studies differ in many respects, such as the method of calculating C and the underlying semantic assumptions, and this proposal does not address ways to make the studies themselves more consistent (for discussion of these issues, see Walker 1989, van Deemter and Kibble 1999, Mitkov 2000).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, we propose a reporting format that clarifies the details of a study's test data (especially those details that tend to differ between studies) and explicitly derives the numbers used to compute performance measures.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "* Department of Computer Science, P. 0.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Box 270226, Rochester, NY 14627.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email: dbyron@cs.rochester.ed u © 2001 Association for Computational Linguistics",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "reporting pronoun resolution performance. ",
            "number": "2",
            "sents": [
                {
                    "text": "This squib is necessary because past reports of pronoun resolution performance have included inconsistent amounts of detail.",
                    "sid": 13,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some provide complete details of the exper­ imental design and results, while others (e.g., Byron and Stent 1998) fail to answer even basic questions: What pronouns did this study address?",
                    "sid": 14,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Which pronouns were resolved correctly?",
                    "sid": 15,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order for a reader to assess performance scores, a report must describe its test data so that the reader knows exactly what the study includes and what it excludes from T. This section briefly discusses what details should be provided.",
                    "sid": 16,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Describing the Test Data.",
                    "sid": 17,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.1 Corpus Type.",
                    "sid": 18,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each pronoun resolution evaluation is carried out over an evalu­ ation corpus, for example a set of human conversations or a number of pages from a book.",
                    "sid": 19,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Details about the evaluation corpus's genre (written or spoken, news or fiction, etc.) and size (e.g., word count, number of discourse units) should be provided to help the reader understand how the corpus chosen for evaluation affected the results obtained.",
                    "sid": 20,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.2 Lexical Coverage.",
                    "sid": 21,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A report should clearly indicate which pronouns the study included, called the coverage, by listing each distinct pronoun type (e.g., it, itself, and its are shown separately).",
                    "sid": 22,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some past reports give no coverage details at all, while others (e.g., PopescuBelis and Robba 1997, page 97) precisely state their coverage: \"/ill, I elle/, /le/, /la/, /l'I, /lui/, /ils/ ,-/ elles/.\"",
                    "sid": 23,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A categorical description, such as \"[results are shown for] personal and possessive pronouns\" (Strube 1998, page 1256) is insufficient because the author might assume that his exclusion of certain pronouns (e.g., first person pronouns) need not be mentioned since they are excluded by most other studies.",
                    "sid": 24,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.3 Exclusions.",
                    "sid": 25,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Before pronoun resolution is executed, any evaluation corpus must be brought into line with the goals of the study by marking individual pronoun tokens as included or excluded.1 Even tokens of pronoun types covered in the study might be excluded from the evaluation.",
                    "sid": 26,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reasons for considering tokens to be out of scope for a study are called exclusion criteria, and the set of pronouns remaining after all exclusions are applied to the corpus is the evaluation set.",
                    "sid": 27,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different studies apply different exclusions, and pronoun tokens that were ex­ cluded in one study might be counted as errors in another.",
                    "sid": 28,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cataphors are a case in point.",
                    "sid": 29,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some pronoun resolution techniques address cataphora (e.g., Lappin and Leass 1994), so the cataphors are included when calculating the performance for these tech­ niques.",
                    "sid": 30,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other techniques are not designed to identify cataphors, and for some of those the authors exclude cataphors from their test data (e.g., Ge, Hale, and Charniak 1998) while others include them but count the cataphors as errors (e.g., Strube and Hahn 1999).",
                    "sid": 31,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are no standard guidelines for what exclusions are reasonable to apply, although it would be beneficial for such a standard to exist.",
                    "sid": 32,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since performance mea­ sures are based on the number of pronouns in the evaluation set, such inconsistencies make recall scores from separate studies difficult to compare.",
                    "sid": 33,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because each study defines its own idiosyncratic set of exclusion criteria, it is important that performance reports clearly list which criteria were applied.",
                    "sid": 34,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some 1 Items might be marked in the answer key or in the test corpus itself, for example, by using special.",
                    "sid": 35,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "part-of-speech tags.",
                    "sid": 36,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Space restrictions prevent us from discussing the additional issues of whether pleonastics and items to be resolved in the text are identified manually or automatically.",
                    "sid": 37,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 Pleonastic constructions in English.",
                    "sid": 38,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extraposition Clefts Idioms Prop-it Extrapositio n moves a clausal subject to the predicate.",
                    "sid": 39,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most nominal clauses can be extraposed, including participles, infinitives, relative clauses, and some prepositiona l clauses.",
                    "sid": 40,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: It's good that you cleaned up.",
                    "sid": 41,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clefts provide contrastive stress with a dummy subject it and the focal NP placed after the verb.",
                    "sid": 42,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: It was Pat who gave us directions.",
                    "sid": 43,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Idioms often include vacuous pronouns, for example, hit it off Prop -it is the ascri ptio n of prop ertie s to an entit y with no exist enti al force (Qui rk and Gre enba um 1973 ).",
                    "sid": 44,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Exa mple s: (we athe r) It is raini ng, (tim e) It is 5 o'clo ck, and (am bien t envi ron men t) It is hot in here . reports provide no exclusion details at all, and even when authors do provide them, the descriptions they use are often incomplete or confusing, as in these examples: • \"7 of the pronouns were non-anaphoric and 16 exophoric\" (Mitkov 1998, page 872).",
                    "sid": 45,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is unclear what categories of pronouns this statement refers to, since exophoric pronouns are nonanaphoric.",
                    "sid": 46,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• \"Pleonastic pronouns it (i.e. non-anaphoric it) have not been included in these results\" (Peral, Palomar, and Femindez 1999, page 71).",
                    "sid": 47,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This assertion seems to incorrectly equate the categories pleonastic and nonanaphoric.",
                    "sid": 48,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• '\"It' was not counted when referring to a syntactically recoverable 'that' clause or occurring in a time or weather construction\" (Hobbs 1986, page 344).",
                    "sid": 49,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are only some of the possible pleonastic constructions.",
                    "sid": 50,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reader is left to wonder whether all pleonastic items were excluded.",
                    "sid": 51,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Without clear and complete exclusion details, it is impossible for future researchers to begin with the same evaluation corpus and recreate results, or for readers of the report to determine whether they think that the exclusions applied were reasonable.",
                    "sid": 52,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To aid future researchers in providing clear and complete exclusion descriptions, the terminology important for describing exclusion criteria is briefly reviewed below.",
                    "sid": 53,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ex­ clusion categories for nonreferential and referential items must be kept distinct.",
                    "sid": 54,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nonreferential items include all items lexically identical to pronouns that do not refer and that should therefore be excluded from performance statistics for pronoun resolution.",
                    "sid": 55,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In English, lexical items called expletives or pleonastics look like pronouns but are semantically vacuous.",
                    "sid": 56,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Categories of pleonastic items are defined in Table 1.",
                    "sid": 57,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Postal and Pullum (1988) describe tests to discriminate pleonastic from ordinary NPs, since the distinction is not always straightforward.",
                    "sid": 58,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other languages, forms that sometimes function as pronouns may also be used as other parts of speech, for exam­ ple, !' in French.",
                    "sid": 59,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides pleonastic items, other tokens might be considered nonreferential by a particular study.",
                    "sid": 60,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, spontaneous discourse may contain pronouns in aban­ doned fragments that are uninterpretable to humans.",
                    "sid": 61,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In So that'll have ok so you want all three boxcars from Dansville?",
                    "sid": 62,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Beeman and Allen 1995, d9310.1,utt29), the initial false start is discarded, so the abandoned token of that would probably be excluded.",
                    "sid": 63,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Referential pronoun tokens can be anaphoric, cataphoric, exophoric, or modified to form complete independent references (e.g., He that plants thorns must not expect to gather roses (Mitkov 2001).",
                    "sid": 64,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Anaphors \"... point back to some previous item\" (Halliday and Hassan 1976, page 14) for their meaning.",
                    "sid": 65,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many constituents besides pronouns can be anaphoric.",
                    "sid": 66,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Anaphors point to preceding discourse, while cataphors point to sub­ sequent discourse.",
                    "sid": 67,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The stretch of discourse pointed to is a sponsor, and the pronoun and sponsor are said to corefer when they refer to the same, rather than to a related or inferred, entity.",
                    "sid": 68,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We reserve the term antecedent for coreferential base-NP sponsors.",
                    "sid": 69,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Exophors refer outside the discourse to entities in the discourse setting.",
                    "sid": 70,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cornish (1986) and Mitkov (2000) note that the terms nonreferential and nonanaphoric are often con­ flated, as are anaphoric and coreferential, but the above definitions explain why this is incorrect.",
                    "sid": 71,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Current research tends to focus only on anaphors, so nonanaphoric tokens are com­ monly excluded.",
                    "sid": 72,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Anaphoric: pronouns with certain properties may also be excluded.",
                    "sid": 73,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some common reasons are: 1.",
                    "sid": 74,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Split antecedence: The pronoun is a plural pronoun whose referent must.",
                    "sid": 75,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "be constructed.",
                    "sid": 76,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: Pati went to Kim/s house and theyi+j went dancing.",
                    "sid": 77,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 78,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Quoted speech: Either the pronoun or its sponsor occurs in reported.",
                    "sid": 79,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "speech.",
                    "sid": 80,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: Mr. Vinkeni exclaimed, \"The guy ran right in front of mei.\"",
                    "sid": 81,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 82,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "High-order entities: Pronouns referring to entities such as propositions.",
                    "sid": 83,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and events often have sponsors that are not base NPs.",
                    "sid": 84,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: [He practiced the tuba all night]i and iti almost drove me crazy.",
                    "sid": 85,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 86,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noncoreference: The pronoun and its sponsor do not corefer.",
                    "sid": 87,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example:.",
                    "sid": 88,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Bakersi+j arrived next.",
                    "sid": 89,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "She/san astronaut and he/sa teacher.",
                    "sid": 90,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.",
                    "sid": 91,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Long-distance reference: The sponsor appears outside a preset window.",
                    "sid": 92,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "utilized by the algorithm.",
                    "sid": 93,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Measuring Performance.",
                    "sid": 94,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In previous studies, recall has been computed over the pronouns in scope for a study (e.g., only coreferential pronouns, only third person pronouns) rather than all refer­ ential pronouns.",
                    "sid": 95,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This makes recall rates difficult to compare because the number of pronouns in scope for different studies varies.",
                    "sid": 96,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, because results are stated in terms of the items that were attempted, most studies report similarly high success rates.",
                    "sid": 97,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This author has been asked, \"Why is work on pronoun resolution still needed when tech­ nique X gets 93% of pronouns correct?\"",
                    "sid": 98,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, technique X correctly resolves 93% of singular personal pronouns that have coreferential noun phrase antecedents, which is only a fraction of the pronouns needing to be resolved.",
                    "sid": 99,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This hardly makes pronoun res­ olution a solved problem.",
                    "sid": 100,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But one must read the report carefully to find these details, and the fact that the question was asked demonstrates the interpretation problems that result from the performance metric:s currently in use.",
                    "sid": 101,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the long-term goal of pronoun resolution research is to describe a process for interpreting all referential pronouns, there should be a performance number that in­ dicates how a technique measures up against this goal.",
                    "sid": 102,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The metric we propose, res­ olution rate, does that by computing the percentage of referential pronouns in the evaluation corpus that were resolved correctly.",
                    "sid": 103,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resolution rate RR = T Ewhere: • C = number of pronouns resolved correctly • T =all pronouns in the evaluation set • E = all excluded referential pronouns The denominator of RR includes all the pronouns that remain in the evaluation corpus after removing nonreferential items and before excluding referential tokens.",
                    "sid": 104,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Computing RR for a technique's performance on a variety of corpora demonstrates the technique's sensitivity to its input data.",
                    "sid": 105,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "RR also provides a way to reward techniques that attempt to resolve more sorts of pronouns, such as cataphora or event anaphora.",
                    "sid": 106,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obviously, RR applies to techniques that claim general utility but not to those designed for specific circumstances, such as the one reported in Suri, McCoy, and DeCristofaro (1999) or a technique to handle a particular phenomenon such as cataphora.",
                    "sid": 107,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rand P are still useful to show a technique's performance on the in-scope items, and they are more informative because the reader knows what percentage of the total pronouns were in scope.",
                    "sid": 108,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "R uses the above definition of T as its denominator, and P remains unchanged.",
                    "sid": 109,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All performance measures should be reported separately for each pronoun type covered rather than just for the test corpus as a whole.",
                    "sid": 110,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This facilitates comparing results from studies with different coverage or with test data from different genres where the mix of pronoun types might be different.",
                    "sid": 111,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also elucidates the effect that the composition of the evaluation corpus had on the results.",
                    "sid": 112,
                    "ssid": 100,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "proposed reporting format: the standard disclosure. ",
            "number": "3",
            "sents": [
                {
                    "text": "The standard disclosure includes important details, such as the coverage, performance metrics, the size and composition of the evaluation corpus, and the number of pro­ nouns in each exclusion type, all in a user-friendly format.",
                    "sid": 113,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It includes these details in less space than would otherwise be required and spares the author from providing textual descriptions of exclusions, such as \"We have only two examples of sentential or VP anaphora altogether....",
                    "sid": 114,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Neither Hobbs algorithm nor BFP attempt to cover these examples\" (Walker 1989, page 257).",
                    "sid": 115,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This leaves more space for commentary on the technique(s) being described.",
                    "sid": 116,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describe the format as it applies to pronoun resolu­ tion studies, but it can be adapted for other categories of referring expression (e.g., descriptive NPs).",
                    "sid": 117,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Explanation of the Format.",
                    "sid": 118,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 is a sample disclosure for a fictional study comparing a new technique, Tech­ nique Beta, with an existing baseline Technique Alpha, on the same English evaluation corpus.",
                    "sid": 119,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Footnotes in this example are provided to assist in explaining the format and would not be included in an actual disclosure.",
                    "sid": 120,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Italicized row and column headings indicate parts of the disclosure that will vary depending on the study being reported (they need not be italicized in an actual disclosure), while items not in italics are invariant portions of the format.",
                    "sid": 121,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The header to the disclosure lists the evaluation corpus used as well as its genre and size.",
                    "sid": 122,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the table proper, a data column is provided for each lexical type covered by the study; all types that are not addressed in this study are summarized in the \"Out of Scope\" column.",
                    "sid": 123,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because pronouns are a closed word class in English, pronoun types are best described by showing the different lexical forms.",
                    "sid": 124,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some flexibility is allowed; for example, one might wish to collapse the categories for \"He/She\" or \"Him-/Herself\" In other languages, or for other forms of referring expressions such as descriptive noun phrases, column headings would instead be category labels.",
                    "sid": 125,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first data row, \"A: Raw Word Count,\" contains the count of all tokens of that lexical form in the evaluation corpus.",
                    "sid": 126,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The next section details nonreferential ex­ clusions, resulting in subtotal row \"B: Sum Nonreferential.\"",
                    "sid": 127,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More details could be provided in this section at the researcher's discretion; for example, different categories Table 2 Sample standard disclosure for a fictional study.",
                    "sid": 128,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation corpus name: Peanut dialogues (Babar et a!.",
                    "sid": 129,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1994) Genre: Two-party problem-solving dialogues Size: 15 dialogues, 937 turns, 31 minutes total speaking time Out of Pronoun Lexical Types:\" Her She Herself He Him His Himself It Its Itself Scopeb Total A: Raw Word Cou nt 2 2 25 3 89 44 7 1 4 94 12 186 4 9 7 N o n r e f e r e n t i a l E x c l u s i o n s ' Pleo nasti c 0 0 0 0 0 0 0 6 0 0 2 8 Aban doned Utter ance 0 0 0 1 0 1 0 0 0 0 2 4 B: Sum Nonr efere ntial 0 0 0 1 0 1 0 6 0 0 4 12 C: Total Refer ential (A B) 2 2 2 5 3 88 44 6 1 4 88 12 1 182 4 8 5 R e f e r e n t i a l E x c l u s i o n s d Plur al 0 0 0 0 0 0 0 0 0 0 120 1 2 0 Dem onstr ative 0 0 0 0 0 0 0 0 0 0 36 36 1st/2 nd Pers on 0 0 0 0 0 0 0 0 0 0 24 24 Repor ted Spee ch 0 0 0 1 0 0 0 0 0 0 2 3 Event Anap hora 0 0 0 0 0 0 0 15 0 0 0 15 D: Sum Ref Excl usion s 0 0 0 1 0 0 0 15 0 0 182 1 9 8 E: Eval uatio n Set (C D) 2 2 2 5 3 87 44 6 1 4 73 12 1 O' 2 8 7 R e s u l t s Techn ique Alph a F:#Co rrect: Ante (Inte r) 7/7 16/17 0/3 35/45 20/21 2/3 0/14 30/41 2/3 0/1 0 112 (82% ) F:#Co rrect: Ante (Intr a) 15/15 7 /8 0/0 35/42 20/23 3/3 0/0 24/32 9/9 0/0 0 113 (86% ) Error s: Cata phor a 0 0 0 7/7 0 0 0 3/3 0 0 0 10 Error s: Long Dista nce 0 2 /2 0 4/4 0 0 0 4/4 0 0 0 10 G:#C orrect : Refs 21 22 0 67 38 5 0 52 11 0 0 216 (75% ) Error s: Chai ning 1 0 0 0 1 0 0 0 0 0 0 2 Resolution Rate (G/C) 100% 88% 0% 76% 86% 83% 0% 59% 92% 0% 0% 45% New Technique Beta H:#Correct: Ante (Inter) 5/7 17/17 3/3 45/45 15/21 2/3 13/14 34/41 3/3 1/1 0 138 (90%) H:#Correct: Ante (Intra) 15/15 7/8 0/0 31/42 24/31 3/3 0/0 27/32 6/9 0/0 0 113 (85%) Error s: Cata phor a 0 0 0 7!7 0 0 0 1/3 0 0 0 8 Error s: Long Dista nce 0 2 0 4 0 0 0 4 0 0 0 10 I:# Corre ct: Refs 2 0 23 3 7 6 38 5 1 3 61 8 1 0 248 (86% ) Error s: Chai ning 0 0 0 1 2 0 0 0 0 0 0 3 Resolution Rat/ (1/C) 90% 92% 100% 86% 86% 83% 93% 69% 67% 100% 0% 51% Notes on the format: \"Pronouns shown as column headings are those included in this (fictional) study.",
                    "sid": 130,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other studies would have different column headings depending on their coverage or the language of the evaluation corpus.",
                    "sid": 131,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "bPlurals, demonstratives, 1st/2nd person, reported speech, and event anaphora in this example.",
                    "sid": 132,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "'Categories in this section differ in different languages.",
                    "sid": 133,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the French leis both a pronoun and a determiner, so a study using a French corpus would have an exclusion category for determiners.",
                    "sid": 134,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "dThese are the exclusions applied in our fictional study.",
                    "sid": 135,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For any particular study, the categories listed here may differ from these.",
                    "sid": 136,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "'All pronouns in the \"Out of Scope\" category have been explicitly listed, resulting in 0 \"Out of Scope\" pronouns remaining in the evaluation set.",
                    "sid": 137,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "fThe numerator of RR is either correct referents or correct antecedents, depending on the researcher's goals.",
                    "sid": 138,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of pleonastics could be listed separately.",
                    "sid": 139,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Identifying all the nonreferential tokens is time-consuming, but need only be performed once for each evaluation corpus.",
                    "sid": 140,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The next row, \"C: Total Referential,\" is simply A - B and is used as the denominator of RR.",
                    "sid": 141,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The next section lists referential pronouns excluded from the test set.",
                    "sid": 142,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the exclu­ sions applied in the study must be itemized.",
                    "sid": 143,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Categories of pronouns that are clumped together in the \"Out of Scope\" column, such as demonstratives and plurals in this example, are listed individually in this section.",
                    "sid": 144,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Row \"D: Sum Ref Exclusions\" shows the total tokens excluded, and the next row, \"E: Evaluation Set,\" is C-D, the resulting count of pronouns that are in scope.",
                    "sid": 145,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice that because the table starts with raw word counts and works forward to the evaluation set, the researcher must explicitly account for each excluded token.",
                    "sid": 146,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final section shows the performance of the technique(s) under study.",
                    "sid": 147,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For sys­ tems that compute referents for the test pronouns, it is recommended that the correct antecedents (Ante) and correct referents (Ref) be shown separately to clarify the effect of chaining errors.",
                    "sid": 148,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also recommend calculating performance separately for inter­ sentential (Inter) and intrasentential (Intra) sponsors, since techniques tend to vary across this dimension.",
                    "sid": 149,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Separating the resolution details in this manner is informa­ tive; however, it is optional.",
                    "sid": 150,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The table could instead show only one number for the total correct resolutions per type of pronoun, although that would be less useful to the reader.",
                    "sid": 151,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recall would be included for techniques that do not resolve every item attempted.",
                    "sid": 152,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Error analysis is optional, but in light of the fact that pronouns that are excluded in one study often cause errors in another, it is highly recommended that error details be shown for classes of pronouns that are commonly excluded.",
                    "sid": 153,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other categories of errors could be detailed as well if particular error categories are of interest in the study.",
                    "sid": 154,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resolution rate is shown last, calculated as the number of correct resolutions divided by the number of referential pronouns in row C. If a technique reports high RR with this format, it is easy to tell whether its performance results from doing a few things well or from doing a mediocre job at everything.",
                    "sid": 155,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To summarize, the important features of this format are: 1.",
                    "sid": 156,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pronoun types included in the study are readily apparent..",
                    "sid": 157,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 158,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Categories and itemized counts of excluded tokens are clearly shown..",
                    "sid": 159,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 160,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "RR can be calculated because the referential exclusions are enumerated..",
                    "sid": 161,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 The Benefits of the Standard Disclosure.",
                    "sid": 162,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By combining details of the evaluation corpus's construction with performance statis­ tics, the standard disclosure displays many important details in one place, making them easy for readers to find.",
                    "sid": 163,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some authors in the past have stated their performance statistics separately for each pronoun type, while others stated only one overall per­ formance number per technique.",
                    "sid": 164,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because a particular technique's performance can vary widely across pronoun types (for example, Hobbs's algorithm resolved 93% of instances of he but only 77% of instances of it; Hobbs 1986), reporting performance per pronoun type should become standard practice.",
                    "sid": 165,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, different studies choose different combinations of pronouns to investigate, and without detailed performance numbers one cannot know how the two techniques compare on the pronouns they have in common.",
                    "sid": 166,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the only sure way to compare two techniques is in a head-to-head test on the same corpus, results stated in the standard disclosure format leave the reader better able to judge, for example, if a technique might be appropriate to his corpus.",
                    "sid": 167,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Providing details on the exclusion criteria applied to the evaluation corpus pro­ vides a sanity check so that the reader understands how the initial corpus was pared down to become the evaluation data set.",
                    "sid": 168,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the table shows that an unexpectedly high percentage of pronouns were excluded from testing, the reader might wonder whether the results obtained are reliable or if, on the other hand, the researcher might have overzealously tailored the evaluation set to the capabilities of the algorithm being tested.",
                    "sid": 169,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because many past studies either did not discuss their exclusion categories at all, described their exclusions with confusing descriptions of the sort listed in Sec­ tion 2.1.3, or did not state the number of pronouns excluded, the reader must be guarded in interpreting the stated results.",
                    "sid": 170,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tabular format suggested here does not guarantee consistent application of the exclusion categories across studies, but it does represent an improvement over current practices.",
                    "sid": 171,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preparing exclusion data might at first seem like an extra burden.",
                    "sid": 172,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it must only be collected once per eval­ uation corpus, and much of this information is already collected during the corpus annotation process.",
                    "sid": 173,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we demonstrated above, many authors already discuss exclu­ sions in the body of a paper.",
                    "sid": 174,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe that the increased clarity that the standard disclosure format offers to the reader outweighs any small outlay of time required to prepare it.",
                    "sid": 175,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, this format allows the researcher to compute RR for general-purpose al­ gorithms, giving the community a more realistic view of how an algorithm performs.",
                    "sid": 176,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While in the past the reader knew that a particular technique correctly resolved 93% of some subset of pronouns, he had no clear idea what that 93% represented because the process used to derive its denominator was so unclear.",
                    "sid": 177,
                    "ssid": 65,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "summary. ",
            "number": "4",
            "sents": [
                {
                    "text": "The reporting format we propose has numerous benefits.",
                    "sid": 178,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Important details of a pro­ noun resolution study are in one place and easy for readers to find.",
                    "sid": 179,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The information is organized to clearly state details that may differ from one study to another so that future researchers do not need to reimplement a technique simply to remove these dif­ ferences.",
                    "sid": 180,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its tabular format consumes less space for this additional information, freeing up room in the body of a paper for analysis and discussion of the techniques under investigation.",
                    "sid": 181,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By tabulating the number of referential pronouns that are excluded, the format clarifies the composition of the test data set and enables the calculation of the resolution rate (RR), which is a more accurate general measure of performance.",
                    "sid": 182,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "RR makes a nice addition to the performance metrics currently in use that state per­ formance in terms of the in-scope pronouns.",
                    "sid": 183,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While it does not solve many of the difficulties involved in comparing techniques from different studies, this format does offer an incremental improvement over current practices.",
                    "sid": 184,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This material is based on work supported by ONR Grant N0001495-11088 and DARPA Grant F3060298-20133.",
                    "sid": 185,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The author thanks James Allen, Nate Blaylock, Jason Eisner, Lucian Galescu, Brandon Sanders, Amanda Stent, and the anonymous reviewers for helpful comments on ideas developed here.",
                    "sid": 186,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}