{
    "ID": "J02-2003",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This article concerns the estimation of a particular kind of probability, namely, the probability of a noun sense appearing as a particular argument of a predicate.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to overcome the accompanying sparse-data problem, the proposal here is to define the probabilities in terms of senses from a semantic hierarchy and exploit the fact that the senses can be grouped into classes consisting of semantically similar senses.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is a particular focus on the problem of how to determine a suitable class for a given sense, or, alternatively, how to determine a suitable level of generalization in the hierarchy.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A procedure is developed that uses a chi-square test to determine a suitable level of generalization.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to test the performance of the estimation method, a pseudo-disambiguation task is used, together with two alternative estimation methods.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each method uses a different generalization procedure; the first alternative uses the minimum description length principle, and the second uses Resnik’s measure of selectional preference.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, the performance of our method is investigated using both the standard Pearson chi- square statistic and the log-likelihood chi-square statistic.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "This article concerns the problem of how to estimate the probabilities of noun senses appearing as particular arguments of predicates.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such probabilities can be useful for a variety of natural language processing (NLP) tasks, such as structural disambiguation and statistical parsing, word sense disambiguation, anaphora resolution, and language modeling.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To see how such knowledge can be used to resolve structural ambiguities, consider the following prepositional phrase attachment ambiguity: Example 1 Fred ate strawberries with a spoon.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ambiguity arises because the prepositional phrase with a spoon can attach to either strawberries or ate.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ambiguity can be resolved by noting that the correct sense of spoon is more likely to be an argument of “ate-with” than “strawberries-with” (Li and Abe 1998; Clark and Weir 2000).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The problem with estimating a probability model defined over a large vocabulary of predicates and noun senses is that this involves a huge number of parameters, which results in a sparse-data problem.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to reduce the number of parameters, we propose to define a probability model over senses in a semantic hierarchy and ∗ Division of Informatics, University of Edinburgh, 2 Buccleuch Place, Edinburgh, EH8 9LW, UK.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email: stephenc@cogsci.ed.ac.uk.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "† School of Cognitive and Computing Sciences, University of Sussex, Brighton, BN1 9QH, UK.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email: david.weir@cogs.susx.ac.uk.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2002 Association for Computational Linguistics to exploit the fact that senses can be grouped into classes consisting of semantically similar senses.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The assumption underlying this approach is that the probability of a particular noun sense can be approximated by a probability based on a suitably chosen class.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, it seems reasonable to suppose that the probability of (the food sense of) chicken appearing as an object of the verb eat can be approximated in some way by a probability based on a class such as FOOD.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are two elements involved in the problem of using a class to estimate the probability of a noun sense.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, given a suitably chosen class, how can that class be used to estimate the probability of the sense?",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And second, given a particular noun sense, how can a suitable class be determined?",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This article offers novel solutions to both problems, and there is a particular focus on the second question, which can be thought of as how to find a suitable level of generalization in the hierarchy.1 The semantic hierarchy used here is the noun hierarchy of WordNet (Fellbaum 1998), version 1.6.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous work has considered how to estimate probabilities using classes from WordNet in the context of acquiring selectional preferences (Resnik 1998; Ribas 1995; Li and Abe 1998; McCarthy 2000), and this previous work has also addressed the question of how to determine a suitable level of generalization in the hierarchy.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Li and Abe use the minimum description length principle to obtain a level of generalization, and Resnik uses a simple technique based on a statistical measure of selectional preference.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(The work by Ribas builds on that by Resnik, and the work by McCarthy builds on that by Li and Abe.)",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compare our estimation method with those of Resnik and Li and Abe, using a pseudo-disambiguation task.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our method outperforms these alternatives on the pseudo-disambiguation task, and an analysis of the results shows that the generalization methods of Resnik and Li and Abe appear to be overgeneralizing, at least for this task.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the problem being addressed here is the engineering problem of estimating predicate argument probabilities, with the aim of producing estimates that will be useful for NLP applications.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, we are not addressing the problem of acquiring selectional restrictions in the way this is usually construed (Resnik 1993; Ribas 1995; McCarthy 1997; Li and Abe 1998; Wagner 2000).",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The purpose of using a semantic hierarchy for generalization is to overcome the sparse data problem, rather than find a level of abstraction that best represents the selectional restrictions of some predicate.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This point is considered further in Section 5.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The next section describes the noun hierarchy from WordNet and gives a more precise description of the probabilities to be estimated.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 shows how a class from WordNet can be used to estimate the probability of a noun sense.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 shows how a chi-square test is used as part of the generalization procedure, and Section 5 describes the generalization procedure.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 6 describes the alternative class-based estimation methods used in the pseudo-disambiguation experiments, and Section 7 presents those experiments.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the semantic hierarchy. ",
            "number": "2",
            "sents": [
                {
                    "text": "The noun hierarchy of WordNet consists of senses, or what Miller (1998) calls lexicalized concepts, organized according to the “is-a-kind-of” relation.",
                    "sid": 38,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that we are using concept to refer to a lexicalized concept or sense and not to a set of senses; we use class to refer to a set of senses.",
                    "sid": 39,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are around 66,000 different concepts in the noun hierarchy 1 A third element of the problem, namely, how to obtain arguments of predicates as training data, is not considered here.",
                    "sid": 40,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We assume the existence of such data, obtained from a treebank or shallow parser.",
                    "sid": 41,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "188 of WordNet version 1.6.",
                    "sid": 42,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A concept in WordNet is represented by a “synset,” which is the set of synonymous words that can be used to denote that concept.",
                    "sid": 43,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, 2 the synset for the concept (cocaine) is { cocaine, cocain, coke, snow, C }.",
                    "sid": 44,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let syn(c) be the synset for concept c, and let cn(n)= { c | n ∈ syn(c) } be the set of concepts that can be denoted by noun n. The hierarchy has the structure of a directed acyclic graph (although only around 1% of the nodes have more than one parent), where the edges of the graph constitute what we call the “direct–isa” relation.",
                    "sid": 45,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let isa be the transitive, reflexive closure of direct–isa; then cl isa c implies cl is a kind of c. If cl isa c, then c is a hypernym of cl and cl is a hyponym of c. In fact, the hierarchy is not a single hierarchy but instead consists of nine separate subhierarchies, each headed by the most general kind of concept, such as (entity), (abstraction), (event), and (psychological feature).",
                    "sid": 46,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the purposes of this work we add a common root dominating the nine subhierarchies, which we denote (root).",
                    "sid": 47,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are some important points that need to be clarified regarding the hierarchy.",
                    "sid": 48,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, every concept in the hierarchy has a nonempty synset (except the notional con cept (root)).",
                    "sid": 49,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even the most general concepts, such as (entity), can be denoted by some noun; the synset for (entity) is { entity, something }.",
                    "sid": 50,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, there is an important distinc tion between an individual concept and a set of concepts.",
                    "sid": 51,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the individual concept (entity) should not be confused with the set or class consisting of concepts denoting kinds of entities.",
                    "sid": 52,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To make this distinction clear, we use c = { cl | cl isa c } to denote the set of concepts dominated by concept c, including c itself.",
                    "sid": 53,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, (animal) is the set consisting of those concepts corresponding to kinds of animals (including (animal) itself).",
                    "sid": 54,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability of a concept appearing as an argument of a predicate is written p(c | v, r), where c is a concept in WordNet, v is a predicate, and r is an argument position.3 The focus in this article is on the arguments of verbs, but the techniques discussed can be applied to any predicate that takes nominal arguments, such as adjectives.",
                    "sid": 55,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability p(c | v, r) is to be interpreted as follows: This is the probability that some noun n in syn(c), when denoting concept c, appears in position r of verb v (given v and r).",
                    "sid": 56,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The example used throughout the article is p((dog) | run, subj), which is the conditional probability that some noun in the synset of (dog), when denoting the concept (dog), appears in the subject position of the verb run.",
                    "sid": 57,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that, in practice, no distinction is made between the different senses of a verb (although the techniques do allow such a distinction) and that each use of a noun is assumed to correspond to exactly one concept.4",
                    "sid": 58,
                    "ssid": 21,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "class-based probability estimation. ",
            "number": "3",
            "sents": [
                {
                    "text": "This section explains how a set of concepts, or class, from WordNet can be used to estimate the probability of an individual concept.",
                    "sid": 59,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More specifically, we explain how a set of concepts cl, where cl is some hypernym of concept c, can be used to estimate p(c | v, r).",
                    "sid": 60,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Recall that cl denotes the set of concepts dominated by cl, including cl itself.)",
                    "sid": 61,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possible approach would be simply to substitute cl for the individual concept c. This is a poor solution, however, since p(cl | v, r) is the conditional probability that 2 Angled brackets are used to denote concepts in the hierarchy..",
                    "sid": 62,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 The term predicate is used loosely here, in that the predicate does not have to be a semantic object but.",
                    "sid": 63,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "can simply be a word form.",
                    "sid": 64,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 A recent paper that extends the acquisition of selectional preferences to sense-sense relationships is Agirre and Martinez (2001).",
                    "sid": 65,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "189 some noun denoting a concept in cl appears in position r of verb v. For example, p((animal) | run, subj) is the probability that some noun denoting a kind of animal appears in the subject position of the verb run.",
                    "sid": 66,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Probabilities of sets of concepts are obtained by summing over the concepts in the set: p(cl | v, r)= , p(cll | v, r) (1) cII∈cI This means that p((animal) | run, subj) is likely to be much greater than p((dog) | run, subj) and thus is not a good approximation of p((dog)| run, subj).",
                    "sid": 67,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What can be done, though, is to condition on sets of concepts.",
                    "sid": 68,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If it can be shown that p(v | cl, r), for some hypernym cl of c, is a reasonable approximation of p(v | c, r), then we have a way of estimating p(c | v, r).",
                    "sid": 69,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability p(v | c, r) can be obtained from p(c | v, r) using Bayes’ theorem: p(c | r) p(c | v, r)= p(v | c, r) p(v (2) | r) Since p(c | r) and p(v | r) are conditioned on the argument slot only, we assume these can be estimated satisfactorily using relative frequency estimates.",
                    "sid": 70,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alternatively, a standard smoothing technique such as Good-Turing could be used.5 This leaves p(v | c, r).",
                    "sid": 71,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Continuing with the (dog) example, the proposal is to estimate p(run | (dog), subj) using a relative-frequency estimate of p(run | (animal), subj) or an estimate based on a similar, suitably chosen class.",
                    "sid": 72,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, assuming this choice of class, p((dog) | run, subj) would be approximated as follows: p((dog)| subj) p((dog)| run, subj) ≈ p(run | (animal), subj) p(run (3) | subj) The following derivation shows that if p(v | cl, r) = k for each child cl of cl, and i i p(v | cl, r)= k, then p(v | cl, r) is also equal to k: p(v | r) p(v | cl, r) = p(cl | v, r) p(c (4) r) p(v | r) ( \\ = , p(cl | v, r)+ p(cl | v, r) (5) p(cl | r) i p(v | r) ( p(cl | r) p(cl | r)\\ = p(cl | r) 1 , p(v | cl, r) i ( i p(v | r) + p(v | cl, r) \\ p(v | r) (6) = , k p(cl | r)+ k p(cl | r) (7) p(cl | r) i k ( \\ = , p(cl | r)+ p(cl | r) (8) p(cl | r) i = k (9) 5 Unsmoothed estimates were used in this work..",
                    "sid": 73,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "190 Note that the proof applies only to a tree, since the proof assumes that cl is partitioned by cl and the sets of concepts dominated by each of the daughters of cl, which is not necessarily true for a directed acyclic graph (DAG).",
                    "sid": 74,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WordNet is a DAG but is a close approximation to a tree, and so we assume this will not be a problem in practice.6 The derivation in (4)–(9) shows how probabilities conditioned on sets of concepts can remain constant when moving up the hierarchy, and this suggests a way of finding a suitable set, cl, as a generalization for concept c: Initially set cl equal to c and move up the hierarchy, changing the value of cl, until there is a significant change in p(v | cl, r).",
                    "sid": 75,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Estimates of p(v | cl, r), for each child cl of cl, can be compared to see whether i i p(v | cl, r) has significantly changed.",
                    "sid": 76,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(We ignore the probability p(v | cl, r) and consider the probabilities p(v | cl, r) only.)",
                    "sid": 77,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that this procedure rests on the assumption that p(v | c, r) is close to p(v | c, r).",
                    "sid": 78,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(In fact, p(v | c, r) is equal to p(v | c, r) when c is a leaf node.)",
                    "sid": 79,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So when finding a suitable level for the estimation of p((sandwich) | eat, obj), for example, we first assume that p(eat | (sandwich), obj) is a good approximation of p(eat | (sandwich), obj) and then apply the procedure to p(eat | (sandwich), obj).",
                    "sid": 80,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A feature of the proposed generalization procedure is that comparing probabilities of the form p(v | C, r), where C is a class, is closely related to comparing ratios of probabilities of the form p(C | v, r)/p(C | r) (for a given verb and argument position): p(C | v, r) p(v | C, r)= p(C p(v r) (10) | r) Note that, for a given verb and argument position, p(v | r) is constant across classes.",
                    "sid": 81,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Equation (10) is of interest because the ratio p(C | v, r)/p(C | r) can be interpreted as a measure of association between the verb v and class C. This ratio is similar to point- wise mutual information (Church and Hanks 1990) and also forms part of Resnik’s association score, which will be introduced in Section 6.",
                    "sid": 82,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the generalization procedure can be thought of as one that finds “homogeneous” areas of the hierarchy, that is, areas consisting of classes that are associated to a similar degree with the verb (Clark and Weir 1999).",
                    "sid": 83,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we note that the proposed estimation method does not guarantee that the estimates form a probability distribution over the concepts in the hierarchy, and so a normalization factor is required: psc(c | v, r)= ˆp(v [c, v, r], r) ˆp(c|r) ˆp(v|r) cI∈C ˆp(v | [cl, v, r], r) ˆp(v|r) (11) We use psc to denote an estimate obtained using our method (since the technique finds sets of semantically similar senses, or “similarity classes”) and [c, v, r] to denote the class chosen for concept c in position r of verb v; ˆp denotes a relative frequency estimate, and C denotes the set of concepts in the hierarchy.",
                    "sid": 84,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Before providing the details of the generalization procedure, we give the relative- frequency estimates of the relevant probabilities and deal with the problem of am 6 Li and Abe (1998) also develop a theoretical framework that applies only to a tree and turn WordNet.",
                    "sid": 85,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "into a tree by copying each subgraph with multiple parents.",
                    "sid": 86,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One way to extend the experiments in Section 7 would be to investigate whether this transformation has an impact on the results of those experiments.",
                    "sid": 87,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "191 biguous data.",
                    "sid": 88,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relative-frequency estimates are as follows: ˆp(c | r) = f (c,r) = ),vI∈V f (c, vl, r) (12) f (r) ),v c l l ˆp(v | r) = f (v,r) I∈V ), I∈C f (c , v , r) = ),cI∈C f (cl, v, r) (13) f (r) ),v c l l I∈V ), I∈C f (c , v , r) ),cII∈cI f (cll, v, r) ˆp(v | cl, r) = f (cI ,v,r) = (14) f (cI ,r) ),vI∈V ),cII∈cI f (cll, vl, r) where f (c, v, r) is the number of (n, v, r) triples in the data in which n is being used to denote c, and V is the set of verbs in the data.",
                    "sid": 89,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The problem is that the estimates are defined in terms of frequencies of senses, whereas the data are assumed to be in the form of (n, v, r) triples: a noun, verb, and argument position.",
                    "sid": 90,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the data used in this work have been obtained from the British National Corpus (BNC), using the system of Briscoe and Carroll (1997), which consists of a shallow-parsing component that is able to identify verbal arguments.",
                    "sid": 91,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We take a simple approach to the problem of estimating the frequencies of senses, by distributing the count for each noun in the data evenly among all senses of the noun: ˆf (c, v, r)= , n∈syn(c) f (n, v, r) |cn(n)| (15) where ˆf (c, v, r) is an estimate of the number of times that concept c appears in position r of verb v, and |cn(n)| is the cardinality of cn(n).",
                    "sid": 92,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is the approach taken by Li and Abe (1998), Ribas (1995), and McCarthy (2000).7 Resnik (1998) explains how this apparently crude technique works surprisingly well.",
                    "sid": 93,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alternative approaches are described in Clark and Weir (1999) (see also Clark [2001]), Abney and Light (1999), and Ciaramita and Johnson (2000).",
                    "sid": 94,
                    "ssid": 36,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "using a chi-square test to compare probabilities. ",
            "number": "4",
            "sents": [
                {
                    "text": "In this section we show how to test whether p(v | cl, r) changes significantly when considering a node higher in the hierarchy.",
                    "sid": 95,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the problem of deciding whether p(run | (canine), subj) is a good approximation of p(run | (dog), subj).",
                    "sid": 96,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "((canine) is the parent of (dog) in WordNet.)",
                    "sid": 97,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To do this, the probabilities p(run | cl, subj) are compared using a chi-square test, where the cl are the children of ( ).",
                    "sid": 98,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, the null i hypothesis of the test is that the probabilities canine p(run | ci, subj) are the same for each child ci.",
                    "sid": 99,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By judging the strength of the evidence against the null hypothesis, how similar the true probabilities are likely to be can be determined.",
                    "sid": 100,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the test indicates that the probabilities are sufficiently unlikely to be the same, then the null hypothesis is rejected, and the conclusion is that p(run | (canine), subj) is not a good approximation of p(run | (dog), subj).",
                    "sid": 101,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example contingency table, based on counts obtained from a subset of the BNC using the system of Briscoe and Carroll, is given in Table 1.",
                    "sid": 102,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Recall that the frequencies are estimated by distributing the count for a noun equally among the noun’s senses; this explains the fractional counts.)",
                    "sid": 103,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One column contains estimates of counts arising 7 Resnik takes a similar approach but divides the count evenly among the noun’s senses and all the.",
                    "sid": 104,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "hypernyms of those senses.",
                    "sid": 105,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "192 Contingency table for the children of (canine) in the subject position of run.",
                    "sid": 106,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ci ˆf(ci, run, subj) ˆf(ci, subj) ˆf(ci, run, subj) ˆf(ci, subj)= ), ∈V ˆf(ci, v, subj) (bitch) 0.3 (0.5) 26.7 (26.6) 27.0 (dog) 12.8 (10.5) 620.4 (622.7) 633.2 (wolf) 0.3 (0.6) 38.7 (38.4) 39.0 (jackal) 0.0 (0.3) 20.0 (19.7) 20.0 (wild dog) 0.0 (0.0) 3.0 (3.0) 3.0 (hyena) 0.0 (0.2) 10.0 (9.8) 10.0 (fox) 0.0 (1.2) 72.3 (71.1) 72.3 13.4 791.1 804.5 from concepts in ci appearing in the subject position of the verb run: ˆf (ci, run, subj).",
                    "sid": 107,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A second column presents estimates of counts arising from concepts in ci appearing in the subject position of a verb other than run.",
                    "sid": 108,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The figures in brackets are the expected values if the null hypothesis is true.",
                    "sid": 109,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is a choice of which statistic to use in conjunction with the chi-square test.",
                    "sid": 110,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The usual statistic encountered in textbooks is the Pearson chi-square statistic, denoted X2: (oij − eij)2 eij (16) i,j where oij is the observed value for the cell in row i and column j, and eij is the corresponding expected value.",
                    "sid": 111,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An alternative statistic is the log-likelihood chi-square statistic, denoted G2:8 G2 = 2 , oij log oij (17) i,j e eij The two statistics have similar values when the counts in the contingency table are large (Agresti 1996).",
                    "sid": 112,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The statistics behave differently, however, when the table contains low counts, and, since corpus data are likely to lead to some low counts, the question of which statistic to use is an important one.",
                    "sid": 113,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dunning (1993) argues for the use of G2 rather than X2, based on an analysis of the sampling distributions of G2 and X2, and results obtained when using the statistics to acquire highly associated bigrams.",
                    "sid": 114,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We consider Dunning’s analysis at the end of this section, and the question of whether to use G2 or X2 will be discussed further there.",
                    "sid": 115,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For now, we continue with the discussion of how the chi-square test is used in the generalization procedure.",
                    "sid": 116,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Table 1, the value of G2 is 3.8, and the value of X2 is 2.5.",
                    "sid": 117,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Assuming a level of significance of α = 0.05, the critical value is 12.6 (for six degrees of freedom).",
                    "sid": 118,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, for this α value, the null hypothesis would not be rejected for either statistic, and the conclusion would be that there is no reason to suppose that p(run | (canine), subj) is not a reasonable approximation of p(run | (dog), subj).",
                    "sid": 119,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 An alternative formula for G2 is given in Dunning (1993), but the two are equivalent..",
                    "sid": 120,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "193 Contingency table for the children of (liquid) in the object position of drink.",
                    "sid": 121,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ci ˆf(ci, drink, obj) ˆf(ci, obj) ˆf (ci, drink, obj) ˆf(ci, obj)= ), ∈V ˆf(ci, v, obj) (beverage) 261.0 (238.7) 2,367.7 (2,390.0) 2,628.7 (supernatant) 0.0 (0.1) 1.0 (0.9) 1.0 (alcohol) 11.5 (9.4) 92.0 (94.1) 103.5 (ammonia) 0.0 (0.8) 8.5 (7.7) 8.5 (antifreeze) 0.0 (0.1) 1.0 (0.9) 1.0 (distillate) 0.0 (0.5) 6.0 (5.5) 6.0 (water) 12.0 (31.6) 335.7 (316.1) 347.7 (ink) 0.0 (2.9) 32.0 (29.1) 32.0 (liquor) 0.7 (1.1) 11.6 (11.2) 12.3 285.2 2,855.5 3,140.7 As a further example, Table 2 gives counts for the children of (liquid) in the object position of drink.",
                    "sid": 122,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Again, the counts have been obtained from a subset of the BNC using the system of Briscoe and Carroll.",
                    "sid": 123,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Not all the sets dominated by the children of (liquid) are shown, as some, such as (sheep dip), never appear in the object position of a verb in the data.",
                    "sid": 124,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This example is designed to show a case in which the null hypothesis is rejected.",
                    "sid": 125,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The value of G2 for this table is 29.0, and the value of X2 is 21.2.",
                    "sid": 126,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So for G2, even if an α value as low as 0.0005 were being used (for which the critical value is 27.9 for eight degrees of freedom), the null hypothesis would still be rejected.",
                    "sid": 127,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For X2, the null hypothesis is rejected for α values greater than 0.005.",
                    "sid": 128,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This seems reasonable, since the probabilities associated with the children of (liquid) and the object position of drink would be expected to show a lot of variation across the children.",
                    "sid": 129,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A key question is how to select the appropriate value for α.",
                    "sid": 130,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One solution is to treat α as a parameter and set it empirically by taking a held-out test set and choosing the value of α that maximizes performance on the relevant task.",
                    "sid": 131,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Clark and Weir (2000) describes a prepositional phrase attachment algorithm that employs probability estimates obtained using the WordNet method described here.",
                    "sid": 132,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To set the value of α, the performance of the algorithm on a development set could be compared across different values of α, and the value that leads to the best performance could be chosen.",
                    "sid": 133,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that this approach sets no constraints on the value of α: The value could be as high as 0.995 or as low as 0.0005, depending on the particular application.",
                    "sid": 134,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There may be cases in which the conditions for the appropriate application of a chi- square test are not met.",
                    "sid": 135,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One condition that is likely to be violated is the requirement that expected values in the contingency table not be too small.",
                    "sid": 136,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(A rule of thumb often found in textbooks is that the expected values should be greater than five.)",
                    "sid": 137,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One response to this problem is to apply some kind of thresholding and either ignore counts below the threshold, or apply the test only to tables that do not contain low counts.",
                    "sid": 138,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ribas (1995), Li and Abe (1998), McCarthy (2000), and Wagner (2000) all use some kind of thresholding when dealing with counts in the hierarchy (although not in the context of a chi-square test).",
                    "sid": 139,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another approach would be to use Fisher’s exact test (Agresti 1996; Pedersen 1996), which can be applied to tables regardless of the size of 194 the counts they contain.",
                    "sid": 140,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main problem with this test is that it is computationally expensive, especially for large contingency tables.",
                    "sid": 141,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What we have found in practice is that applying the chi-square test to tables dominated by low counts tends to produce an insignificant result, and the null hypothesis is not rejected.",
                    "sid": 142,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The consequences of this for the generalization procedure are that low count tables tend to result in the procedure moving up to the next node in the hierarchy.",
                    "sid": 143,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But given that the purpose of the generalization is to overcome the sparse- data problem, moving up a node is desirable, and therefore we do not modify the test for tables with low counts.",
                    "sid": 144,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final issue to consider is which chi-square statistic to use.",
                    "sid": 145,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dunning (1993) argues for the use of G2 rather than X2, based on the claim that the sampling distribution of G2 approaches the true chi-square distribution quicker than the sampling distribution of X2.",
                    "sid": 146,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, Agresti (1996, page 34) makes the opposite claim: “The sampling distributions of X2 and G2 get closer to chi-squared as the sample size n increases....",
                    "sid": 147,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The convergence is quicker for X2 than G2.” In addition, Pedersen (2001) questions whether one statistic should be preferred over the other for the bigram acquisition task and cites Cressie and Read (1984), who argue that there are some cases where the Pearson statistic is more reliable than the log-likelihood statistic.",
                    "sid": 148,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the results of the pseudo-disambiguation experiments presented in Section 7 are at least as good, if not better, when using X2 rather than G2, and so we conclude that the question of which statistic to use should be answered on a per application basis.",
                    "sid": 149,
                    "ssid": 55,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the generalization procedure. ",
            "number": "5",
            "sents": [
                {
                    "text": "The procedure for finding a suitable class, cl, to generalize concept c in position r of verb v works as follows.",
                    "sid": 150,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(We refer to cl as the “similarity class” of c with respect to v and r and the hypernym cl as top(c, v, r), since the chosen hypernym sits at the “top” of the similarity class.)",
                    "sid": 151,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initially, concept c is assigned to a variable top.",
                    "sid": 152,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, by working up the hierarchy, successive hypernyms of c are assigned to top, and this process continues until the probabilities associated with the sets of concepts dominated by top and the siblings of top are significantly different.",
                    "sid": 153,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once a node is reached that results in a significant result for the chi-square test, the procedure stops, and top is returned as top(c, v, r).",
                    "sid": 154,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In cases where a concept has more than one parent, the parent is chosen that results in the lowest value of the chi-square statistic, as this indicates the probabilities are the most similar.",
                    "sid": 155,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The set top(c, v, r) is the similarity class of c for verb v and position r. Figure 1 gives an algorithm for determining top(c, v, r).",
                    "sid": 156,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 gives an example of the procedure at work.",
                    "sid": 157,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, top((soup), stir, obj) is being determined.",
                    "sid": 158,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The example is based on data from a subset of the BNC, with 303 cases of an argument in the object position of stir.",
                    "sid": 159,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The G2 statistic is used, together with an α value of 0.05.",
                    "sid": 160,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initially, top is set to (soup), and the probabilities corresponding to the children of (dish) are compared: p(stir | (soup), obj), p(stir | (lasagne), obj), p(stir | (haggis), obj), and so on for the rest of the children.",
                    "sid": 161,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The chi-square test results in a G2 value of 14.5, compared to a critical value of 55.8.",
                    "sid": 162,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since G2 is less than the critical value, the procedure moves up to the next node.",
                    "sid": 163,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This process continues until a significant result is obtained, which first occurs at (substance) when comparing the children of (object).",
                    "sid": 164,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus (substance) is the chosen level of generalization.",
                    "sid": 165,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now we show how the chosen level of generalization varies with α and how it varies with the size of the data set.",
                    "sid": 166,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A note of clarification is required before presenting the results.",
                    "sid": 167,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In related work on acquiring selectional preferences (Ribas 1995; McCarthy 195 Algorithm top(c, v, r): top ← c sig result ← false comment parentmin gives lowest G2 value, G2 while not sig result & top /= (root) do 2 min ←∞ for all parents of top do calculate G2 for sets dominated by children of parent if G2 < G2 then G2 ← G2 parent end pare ntmi n ← end if chi squar e test for paren tmin is signif icant the n sig res ult ← tru e else move up to next node: top ← paren tmin return top Figure 1 An algorithm for determining top(c, v, r).",
                    "sid": 168,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "u+ +A + u + + 31 1 u u w u+ w J J u Figure 2 An example generalization: Determining top((soup), stir, obj).",
                    "sid": 169,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "196 1997; Li and Abe 1998; Wagner 2000), the level of generalization is often determined for a small number of handpicked verbs and the result compared with the researcher’s intuition about the most appropriate level for representing a selectional preference.",
                    "sid": 170,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to this approach, if (sandwich) were chosen to represent (hotdog) in the object position of eat, this might be considered an undergeneralization, since (food) might be considered more appropriate.",
                    "sid": 171,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this work we argue that such an evaluation is not appropriate; since the purpose of this work is probability estimation, the most appropriate level is the one that leads to the most accurate estimate, and this may or may not agree with intuition.",
                    "sid": 172,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we show in Section 7 that to generalize unnecessarily can be harmful for some tasks: If we already have lots of data regarding (sandwich), why generalize any higher?",
                    "sid": 173,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the purpose of this section is not to show that the acquired levels are “correct,” but simply to show how the levels vary with α and the sample size.",
                    "sid": 174,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To show how the level of generalization varies with changes in α, top(c, v, obj) was determined for a number of handpicked (c, v, obj) triples over a range of values for α.",
                    "sid": 175,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The triples were chosen to give a range of strongly and weakly selecting verbs and a range of verb frequencies.",
                    "sid": 176,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The data were again extracted from a subset of the BNC using the system of Briscoe and Carroll (1997), and the G2 statistic was used in the chi-square test.",
                    "sid": 177,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are shown in Table 3.",
                    "sid": 178,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of times the verb occurred with some object is also given in the table.",
                    "sid": 179,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results suggest that the generalization level becomes more specific as α increases.",
                    "sid": 180,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is to be expected, since, given a contingency table chosen at random, a higher value of α is more likely to lead to a significant result than a lower value of α.",
                    "sid": 181,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also see that, for some cases, the value of α has little effect on the level.",
                    "sid": 182,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would expect there to be less change in the level of generalization for strongly selecting verbs, such as drink and eat, and a greater range of levels for weakly selecting verbs such as see.",
                    "sid": 183,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because any significant difference in probabilities is likely to be more marked for a strongly selecting verb, and likely to be significant over a wider range of α values.",
                    "sid": 184,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The table only provides anecdotal evidence, but provides some support to this argument.",
                    "sid": 185,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To investigate more generally how the level of generalization varies with changes in α, and also with changes in sample size, we took 6, 000 (c, v, obj) triples and calculated the difference in depth between c and top(c, v, r) for each triple.",
                    "sid": 186,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 6, 000 triples were taken from the first experimental test set described in Section 7, and the training data from this experiment were used to provide the counts.",
                    "sid": 187,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(The test set contains nouns, rather than noun senses, and so the sense of the noun that is most probable given the verb and object slot was used.)",
                    "sid": 188,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An average difference in depth was then calculated.",
                    "sid": 189,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To give an example of how the difference in depth was calculated, suppose (dog) generalized to (placental mammal) via (canine) and (carnivore); in this case the difference would be three.",
                    "sid": 190,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results for various levels of α and different sample sizes are shown in Table 4.",
                    "sid": 191,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The figures in each column arise from using the contingency tables based on the complete training data, but with each count in the table multiplied by the percentage at the head of the column.",
                    "sid": 192,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the 50% column is based on contingency tables in which each original count is multiplied by 50%, which is equivalent to using a sample one-half the size of the original training set.",
                    "sid": 193,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reading across a row shows how the generalization varies with sample size, and reading down a column shows how it varies with α.",
                    "sid": 194,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results show clearly that the extent of generalization decreases with an increase in the value of α, supporting the trend observed in Table 3.",
                    "sid": 195,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results also show that the extent of generalization increases with a decrease in sample 197 Table 3 Example levels of generalization for different values of α.",
                    "sid": 196,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(c, v, r), f(v, r) α ((coffee), drink, obj) 0.0005 (coffee)(BEVERAGE)(food) ...",
                    "sid": 197,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(object)(entity) 0.05 (coffee)(BEVERAGE)(food) ...",
                    "sid": 198,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(object)(entity) f (drink, obj)= 849 0.5 (coffee)(BEVERAGE)(food) ...",
                    "sid": 199,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(object)(entity) 0.995 (coffee)(BEVERAGE)(food) ...",
                    "sid": 200,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(object)(entity) ((hotdog), eat, obj) 0.0005 (hotdog)(sandwich)(snack food)(DISH) ...",
                    "sid": 201,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(food) ...",
                    "sid": 202,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(entity) 0.05 (hotdog)(sandwich)(snack food)(DISH) ...",
                    "sid": 203,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(food) ...",
                    "sid": 204,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(entity) f (eat, obj)= 1,703 0.5 (hotdog)(sandwich)(snack food)(DISH) ...",
                    "sid": 205,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(food) ...",
                    "sid": 206,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(entity) 0.995 (hotdog)(SANDWICH)(snack food)(dish) ...",
                    "sid": 207,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(food) ...",
                    "sid": 208,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(entity) ((Socrates), kiss, obj) 0.0005 (Socrates) ...",
                    "sid": 209,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(person)(life form)(CAUSAL AGENT)(entity) 0.05 (Socrates) ...",
                    "sid": 210,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(person)(life form)(CAUSAL AGENT)(entity) f (kiss, obj)= 345 0.5 (Socrates) ...",
                    "sid": 211,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(person)(life form)(CAUSAL AGENT)(entity) 0.995 (Socrates) ...",
                    "sid": 212,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(PERSON)(life form)(causal agent)(entity) ((dream), remember, obj) 0.0005 (dream) ...",
                    "sid": 213,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(preoccupation)(cognitive state)(STATE) 0.05 (dream) ...",
                    "sid": 214,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(preoccupation)(cognitive state)(STATE) f (remember, obj)= 1,982 0.5 (dream) ...",
                    "sid": 215,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(preoccupation)(COGNITIVE STATE)(state) 0.995 (dream) ...",
                    "sid": 216,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(PREOCCUPATION)(cognitive state)(state) ((man), see, obj) 0.0005 (man) ...",
                    "sid": 217,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(mammal) ...",
                    "sid": 218,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(ANIMAL)(life form)(entity) 0.05 (man) ...",
                    "sid": 219,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(MAMMAL) ...",
                    "sid": 220,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(animal)(life form)(entity) f (see, obj)= 16,757 0.5 (man) ...",
                    "sid": 221,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(MAMMAL) ...",
                    "sid": 222,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(animal)(life form)(entity) 0.995 (MAN) ...",
                    "sid": 223,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(mammal) ...",
                    "sid": 224,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(animal)(life form)(entity) ((belief), abandon, obj) 0.0005 (belief)(mental object)(cognition)(PSYCHOLOGICAL FEATURE) 0.05 (belief)(MENTAL OBJECT)(cognition)(psychological feature) f (abandon, obj)= 673 0.5 (BELIEF)(mental object)(cognition)(psychological feature) 0.995 (BELIEF)(mental object)(cognition)(psychological feature) ((nightmare), have, obj) 0.0005 (nightmare)(dreaming)(IMAGINATION) ...",
                    "sid": 225,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(psychological feature) 0.05 (nightmare)(dreaming)(IMAGINATION) ...",
                    "sid": 226,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(psychological feature) f (have, obj)= 93,683 0.5 (nightmare)(DREAMING)(imagination) ...",
                    "sid": 227,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(psychological feature) 0.995 (nightmare)(DREAMING)(imagination) ...",
                    "sid": 228,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(psychological feature) Note: The selected level is shown in upper case.",
                    "sid": 229,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 Extent of generalization for different values of α and sample sizes.",
                    "sid": 230,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "α 100% 50% 10% 1% 0.0005 3.3 3.9 5.0 5.6 0.05 2.8 3.5 4.6 5.6 0.5 2.1 2.9 4.1 5.4 0.995 1.2 1.5 2.6 3.9 size.",
                    "sid": 231,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Again, this is to be expected, since any difference in probability estimates is less likely to be significant for tables with low counts.",
                    "sid": 232,
                    "ssid": 83,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "alternative class-based estimation methods. ",
            "number": "6",
            "sents": [
                {
                    "text": "The approaches used for comparison are that of Resnik (1993, 1998), subsequently developed by Ribas (1995), and that of Li and Abe (1998), which has been adopted by McCarthy (2000).",
                    "sid": 233,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These have been chosen because they directly address the question of how to find a suitable level of generalization in WordNet.",
                    "sid": 234,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "198 The first alternative uses the “association score,” which is a measure of how well a set of concepts, C, satisfies the selectional preferences of a verb, v, for an argument position, r:9 p(C | v, r) A(C, v, r)= p(C | v, r) log2 p(C (18) | r) An estimate of the association score, Aˆ (C, v, r), can be obtained using relative frequency estimates of the probabilities.",
                    "sid": 235,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The key question is how to determine a suitable level of generalization for concept c, or, alternatively, how to find a suitable class to represent concept c (assuming the choice is from those classes that contain all concepts dominated by some hypernym of c).",
                    "sid": 236,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Resnik’s solution to this problem (which he neatly refers to as the “vertical-ambiguity” problem) is to choose the class that maximizes the association score.",
                    "sid": 237,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not clear that the class with the highest association score is always the most appropriate level of generalization.",
                    "sid": 238,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, this approach does not always generalize appropriately for arguments that are negatively associated with some verb.",
                    "sid": 239,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To see why, consider the problem of deciding how well the concept (location) satisfies the preferences of the verb eat for its object.",
                    "sid": 240,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since locations are not the kinds of things that are typically eaten, a suitable level of generalization would correspond to a class that has a low association score with respect to eat.",
                    "sid": 241,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, (location) is a kind of (entity) in WordNet,10 and choosing the class with the highest association score is likely to produce (entity) as the chosen class.",
                    "sid": 242,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a problem, because the association score of (entity) with respect to eat may be too high to reflect the fact that (location) is a very unlikely object of the verb.",
                    "sid": 243,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the solution to the vertical-ambiguity problem presented in the previous sections is able to generalize appropriately in such cases.",
                    "sid": 244,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Continuing with the eat (location) example, our generalization procedure is unlikely to get as high as (entity) (assuming a reasonable number of examples of eat in the training data), since the probabilities corresponding to the daughters of (entity) are likely to be very different with respect to the object position of eat.",
                    "sid": 245,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second alternative uses the minimum description length (MDL) principle.",
                    "sid": 246,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Li and Abe use MDL to select a set of classes from a hierarchy, together with their associated probabilities, to represent the selectional preferences of a particular verb.",
                    "sid": 247,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The preferences and class-based probabilities are then used to estimate probabilities of the form p(n | v, r), where n is a noun, v is a verb, and r is an argument slot.",
                    "sid": 248,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Li and Abe’s application of MDL requires the hierarchy to be in the form of a thesaurus, in which each leaf node represents a noun and internal nodes represent the class of nouns that the node dominates.",
                    "sid": 249,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hierarchy is also assumed to be in the form of a tree.",
                    "sid": 250,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The class-based models consist of a partition of the set of nouns (leaf nodes) and a probability associated with each class in the partition.",
                    "sid": 251,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probabilities are the conditional probabilities of each class, given the relevant verb and argument position.",
                    "sid": 252,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Li and Abe refer to such a partition as a “cut” and the cut together with the probabilities as a “tree cut model.” The probabilities of the classes in a cut, Γ, satisfy the following constraint: , p(C | v, r)= 1 (19) C∈Γ 9 The definition used here is that given by Ribas (1995)..",
                    "sid": 253,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10 For example, the hypernyms of the concept (Dallas) are as follows: (city), (municipality),.",
                    "sid": 254,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(urban area), (geographical area), (region), (location), (object), (entity).",
                    "sid": 255,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "199 <root> <entity> <abstraction> <mushroom> Figure 3 <lobster> <lobster> <pizza> <rope> Possible cut returned by MDL.",
                    "sid": 256,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to determine the probability of a noun, the probability of a class is assumed to be distributed uniformly among the members of that class: p(n | v, r)= 1 |C| p(C | v, r) for all n ∈ C (20) Since WordNet is a hierarchy with noun senses, rather than nouns, at the nodes, Li and Abe deal with the issue of word sense ambiguity using the method described in Section 3, by dividing the count for a noun equally among the concepts whose synsets contain the noun.",
                    "sid": 257,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, since WordNet is a DAG, Li and Abe turn WordNet into a tree by copying each subgraph with multiple parents.",
                    "sid": 258,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And so that each noun in the data appears (in a synset) at a leaf node, Li and Abe remove those parts of the hierarchy dominated by a noun in the data (but only for that instance of WordNet corresponding to the relevant verb).",
                    "sid": 259,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example cut showing part of the WordNet hierarchy is shown in Figure 3 (based on an example from Li and Abe [1998]; the dashed lines indicate parts of the hierarchy that are not shown in the diagram).",
                    "sid": 260,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a possible cut for the object position of the verb eat, and the cut consists of the following classes: (life form), (solid), (fluid), (food), (artifact), (space), (time), (set).",
                    "sid": 261,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(The particular choice of classes for the cut in this example is not too important; the example is designed to show how probabilities of senses are estimated from class probabilities.)",
                    "sid": 262,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the class in the cut containing (pizza) is (food), the probability p((pizza) | eat, obj) would be estimated as p((food) | eat, obj)/|(food)|.",
                    "sid": 263,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, since the class in the cut containing (mushroom) is (life form), the probability p((mushroom)| eat, obj) would be estimated as p((life form)| eat, obj)/|(life form)|.",
                    "sid": 264,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The uniform-distribution assumption (20) means that cuts close to the root of the hierarchy result in a greater smoothing of the probability estimates than cuts near the leaves.",
                    "sid": 265,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus there is a trade-off between choosing a model that has a cut near the leaves, which is likely to overfit the data, and a more general (simple) model near the root, which is likely to underfit the data.",
                    "sid": 266,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MDL looks ideally suited to the task of model selection, since it is designed to deal with precisely this trade-off.",
                    "sid": 267,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The simplicity of a model is measured using the model description length, which is an information-theoretic 200 term and denotes the number of bits required to encode the model.",
                    "sid": 268,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fit to the data is measured using the data description length, which is the number of bits required to encode the data (relative to the model).",
                    "sid": 269,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall description length is the sum of the model description length and the data description length, and the MDL principle is to select the model with the shortest description length.",
                    "sid": 270,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used McCarthy’s (2000) implementation of MDL.",
                    "sid": 271,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So that every noun is represented at a leaf node, McCarthy does not remove parts of the hierarchy, as Li and Abe do, but instead creates new leaf nodes for each synset at an internal node.",
                    "sid": 272,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "McCarthy also does not transform WordNet into a tree, which is strictly required for Li and Abe’s application of MDL.",
                    "sid": 273,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This did create a problem with overgeneralization: Many of the cuts returned by MDL were overgeneralizing at the (entity) node.",
                    "sid": 274,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason is that (person), which is close to (entity) and dominated by (entity), has two parents: (life form) and (causal agent).",
                    "sid": 275,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This DAG-like property was responsible for the over- generalization, and so we removed the link between (person) and (causal agent).",
                    "sid": 276,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This appeared to solve the problem, and the results presented later for the average degree of generalization do not show an overgeneralization compared with those given in Li and Abe (1998).",
                    "sid": 277,
                    "ssid": 45,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "pseudo-disambiguation experiments. ",
            "number": "7",
            "sents": [
                {
                    "text": "The task we used to compare the class-based estimation techniques is a decision task previously used by Pereira, Tishby, and Lee (1993) and Rooth et al.",
                    "sid": 278,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1999).",
                    "sid": 279,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The task is to decide which of two verbs, v and vl, is more likely to take a given noun, n, as an object.",
                    "sid": 280,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The test and training data were obtained as follows.",
                    "sid": 281,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A number of verb–direct object pairs were extracted from a subset of the BNC, using the system of Briscoe and Carroll.",
                    "sid": 282,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All those pairs containing a noun not in WordNet were removed, and each verb and argument was lemmatized.",
                    "sid": 283,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This resulted in a data set of around 1.3 million (v, n) pairs.",
                    "sid": 284,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To form a test set, 3,000 of these pairs were randomly selected such that each selected pair contained a fairly frequent verb.",
                    "sid": 285,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Following Pereira, Tishby, and Lee, only those verbs that occurred between 500 and 5,000 times in the data were considered.)",
                    "sid": 286,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each instance of a selected pair was then deleted from the data to ensure that the test data were unseen.",
                    "sid": 287,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining pairs formed the training data.",
                    "sid": 288,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To complete the test set, a further fairly frequent verb, vl, was randomly chosen for each (v, n) pair.",
                    "sid": 289,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The random choice was made according to the verb’s frequency in the original data set, subject to the condition that the pair (vl, n) did not occur in the training data.",
                    "sid": 290,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the set of (v, n, vl) triples, the task is to decide whether (v, n) or (vl, n) is the correct pair.11 We acknowledge that the task is somewhat artificial, but pseudo-disambiguation tasks of this kind are becoming popular in statistical NLP because of the ease with which training and test data can be created.",
                    "sid": 291,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also feel that the pseudo-disambig- uation task is useful for evaluating the different estimation methods, since it directly addresses the question of how likely a particular predicate is to take a given noun as an argument.",
                    "sid": 292,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An evaluation using a PP attachment task was attempted in Clark and Weir (2000), but the evaluation was limited by the relatively small size of the Penn Treebank.",
                    "sid": 293,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "11 We note that this procedure does not guarantee that the correct pair is more likely than the incorrect.",
                    "sid": 294,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "pair, because of noise in the data from the parser and also because a highly plausible incorrect pair could be generated by chance.",
                    "sid": 295,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "201 Results for the pseudo-disambiguation task.",
                    "sid": 296,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generalization technique % correct av.gen. sd.gen. Similarity class α = 0.0005 73.8 3.3 2.0 α = 0.05 73.4 2.8 1.9 α = 0.3 73.0 2.4 1.8 α = 0.75 73.9 1.9 1.6 α = 0.995 73.8 1.2 1.2 Low class 73.6 0.9 1.0 MDL 68.3 4.1 1.9 Assoc 63.9 4.2 2.1 Note: av.gen. is the average number of generalized levels; sd.gen. is the standard deviation.",
                    "sid": 297,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using our approach, the disambiguation decision for each (v, n, vl) triple was made according to the following procedure: if max c∈cn(n) p (c v, obj) > max c∈cn(n) psc(c | vl, obj) then choose (v, n) else if max c∈cn(n) p (c vl, obj) > max c∈cn(n) psc(c | v, obj) then choose (vl, n) else choose at random If n has more than one sense, the sense is chosen that maximizes the relevant probability estimate; this explains the maximization over cn(n).",
                    "sid": 298,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability estimates were obtained using our class-based method, and the G2 statistic was used for the chi square test.",
                    "sid": 299,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This procedure was also used for the MDL alternative, but using the MDL method to estimate the probabilities.",
                    "sid": 300,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using the association score for each test triple, the decision was made according to the following procedure: if max max Aˆ (cl, v, obj) > max max Aˆ (cl, vl, obj) c∈cn(n) cI∈h(c) then choose (v, n) c∈cn(n) cI∈h(c) else if max max Aˆ (cl, vl, obj) > max max Aˆ (cl, v, obj) c∈cn(n) cI∈h(c) then choose (vl, n) else choose at random c∈cn(n) cI∈h(c) We use h(c) to denote the set consisting of the hypernyms of c. The inner maximization is over h(c), assuming c is the chosen sense of n, which corresponds to Resnik’s method of choosing a set to represent c. The outer maximization is over the senses of n, cn(n), which determines the sense of n by choosing the sense that maximizes the association score.",
                    "sid": 301,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first set of results is given in Table 5.",
                    "sid": 302,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our technique is referred to as the “similarity class” technique, and the approach using the association score is referred 202 Results for the pseudo-disambiguation task with one-fifth training data.",
                    "sid": 303,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generalization technique % correct av.gen. sd.gen. Similarity class α = 0.0005 66.7 4.5 1.9 α = 0.05 68.4 4.1 1.9 α = 0.3 70.2 3.7 1.9 α = 0.75 72.3 3.0 1.9 α = 0.995 72.4 1.9 1.6 Low class 71.9 1.1 1.1 MDL 62.9 4.7 1.9 Assoc 62.6 4.1 2.0 Note: av.gen. is the average number of generalized levels; sd.gen. is the standard deviation.",
                    "sid": 304,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "to as “Assoc.” The results are given for a range of α values and demonstrate clearly that the performance of similarity class varies little with changes in α and that similarity class outperforms both MDL and Assoc.12 We also give a score for our approach using a simple generalization procedure, which we call “low class.” The procedure is to select the first class that has a count greater than zero (relative to the verb and argument position), which is likely to return a low level of generalization, on the whole.",
                    "sid": 305,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results show that our generalization technique only narrowly outperforms the simple alternative.",
                    "sid": 306,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that, although low class is based on a very simple generalization method, the estimation method is still using our class-based technique, by applying Bayes’ theorem and conditioning on a class, as described in Section 3; the difference is in how the class is chosen.",
                    "sid": 307,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To investigate the results, we calculated the average number of generalized levels for each approach.",
                    "sid": 308,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of generalized levels for a concept c (relative to a verb v and argument position r) is the difference in depth between c and top(c, v, r), as explained in Section 5.",
                    "sid": 309,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each test case, the number of generalized levels for both verbs, v and vl, was calculated, but only for the chosen sense of n. The results are given in the third column of Table 5 and demonstrate clearly that both MDL and Assoc are generalizing to a greater extent than similarity class.",
                    "sid": 310,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(The fourth column gives a standard deviation figure.)",
                    "sid": 311,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results suggest that MDL and Assoc are overgeneralizing, at least for the purposes of this task.",
                    "sid": 312,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To investigate why the value for α had no impact on the results, we repeated the experiment, but with one fifth of the data.",
                    "sid": 313,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A new data set was created by taking every fifth pair of the original 1.3 million pairs.",
                    "sid": 314,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A test set of 3,000 triples was created from this new data set, as before, but this time only verbs that occurred between 100 and 1,000 times were considered.",
                    "sid": 315,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results using these test and training data are given in Table 6.",
                    "sid": 316,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results show a variation in performance across values for α, with an optimal performance when α is around 0.75.",
                    "sid": 317,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Of course, in practice, the value for α would need to be optimized on a held-out set.)",
                    "sid": 318,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But even with this variation, similarity class is still outperforming MDL and Assoc across the whole range of α values.",
                    "sid": 319,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the 12 The results given for similarity class are different from those given in Clark and Weir (2001) because.",
                    "sid": 320,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the probability estimates used in Clark and Weir (2001) were not normalized.",
                    "sid": 321,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "203 Disambiguation results for G2 and X2.",
                    "sid": 322,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "α value % correct (G2) % correct (X2) 0.0005 73.8 (3.3) 74.1 (3.0) 0.05 73.4 (2.8) 73.8 (2.5) 0.3 73.0 (2.4) 74.1 (2.2) 0.75 73.9 (1.9) 74.3 (1.8) 0.995 73.8 (1.2) 73.3 (1.2) α values corresponding to the lowest scores lead to a significant amount of generalization, which provides additional evidence that MDL and Assoc are overgeneralizing for this task.",
                    "sid": 323,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The low-class method scores highly for this data set also, but given that the task is one that apparently favors a low level of generalization, the high score is not too surprising.",
                    "sid": 324,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a final experiment, we compared the task performance using the X2, rather than G2, statistic in the chi-square test.",
                    "sid": 325,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are given in Table 7 for the complete data set.13 The figures in brackets give the average number of generalized levels.",
                    "sid": 326,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The X2 statistic is performing at least as well as G2, and the results show that the average level of generalization is slightly higher for G2 than X2.",
                    "sid": 327,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests a possible explanation for the results presented here and those in Dunning (1993): that the X2 statistic provides a less conservative test when counts in the contingency table are low.",
                    "sid": 328,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(By a conservative test we mean one in which the null hypothesis is not easily rejected.)",
                    "sid": 329,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A less conservative test is better suited to the pseudo-disambiguation task, since it results in a lower level of generalization, on the whole, which is good for this task.",
                    "sid": 330,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, the task that Dunning considers, the discovery of bigrams, is better served by a more conservative test.",
                    "sid": 331,
                    "ssid": 54,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "8",
            "sents": [
                {
                    "text": "We have presented a class-based estimation method that incorporates a procedure for finding a suitable level of generalization in WordNet.",
                    "sid": 332,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method has been shown to provide superior performance on a pseudo-disambiguation task, compared with two alternative approaches.",
                    "sid": 333,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An analysis of the results has shown that the other approaches appear to be overgeneralizing, at least for this task.",
                    "sid": 334,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the features of the generalization procedure is the way that α, the level of significance in the chi-square test, is treated as a parameter.",
                    "sid": 335,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This allows some control over the extent of generalization, which can be tailored to particular tasks.",
                    "sid": 336,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have also shown that the task performance is at least as good when using the Pearson chi-square statistic as when using the log-likelihood chi-square statistic.",
                    "sid": 337,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are a number of ways in which this work could be extended.",
                    "sid": 338,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possibility would be to use all the classes dominated by the hypernyms of a concept, rather than just one, to estimate the probability of the concept.",
                    "sid": 339,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An estimate would be obtained for each hypernym, and the estimates combined in a linear interpolation.",
                    "sid": 340,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An approach similar to this is taken by Bikel (2000), in the context of statistical parsing.",
                    "sid": 341,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is still room for investigation of the hidden-data problem when data are used that have not been sense disambiguated.",
                    "sid": 342,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this article, a very simple approach is taken, 13 χ2 performed slightly better than G2 using the smaller data set also.",
                    "sid": 343,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "204 which is to split the count for a noun evenly among the noun’s senses.",
                    "sid": 344,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Abney and Light (1999) have tried a more motivated approach, using the expectation maximization algorithm, but with little success.",
                    "sid": 345,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach described in Clark and Weir (1999) is shown in Clark (2001) to have some impact on the pseudo-disambiguation task, but only with certain values of the α parameter, and ultimately does not improve on the best performance.",
                    "sid": 346,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, an issue that has not been much addressed in the literature (except by Li and Abe [1996]) is how the accuracy of class-based estimation techniques compare when automatically acquired classes, as opposed to the manually created classes from WordNet, are used.",
                    "sid": 347,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pseudo-disambiguation task described here has also been used to evaluate clustering algorithms (Pereira, Tishby, and Lee, 1993; Rooth et al., 1999), but with different data, and so it is difficult to compare the results.",
                    "sid": 348,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A related issue is how the structure of WordNet affects the accuracy of the probability estimates.",
                    "sid": 349,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have taken the structure of the hierarchy for granted, without any analysis, but it may be that an alternative design could be more conducive to probability estimation.",
                    "sid": 350,
                    "ssid": 19,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This article is an extended and updated version of a paper that appeared in the proceedings of NAACL 2001.",
                    "sid": 351,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The work on which it is based was carried out while the first author was a D.Phil.",
                    "sid": 352,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "student at the University of Sussex and was supported by an EPSRC studentship.",
                    "sid": 353,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would like to thank Diana McCarthy for suggesting the pseudo-disambiguation task and providing the MDL software, John Carroll for supplying the data, and Ted Briscoe, Geoff Sampson, Gerald Gazdar, Bill Keller, Ted Pedersen, and the anonymous reviewers for their helpful comments.",
                    "sid": 354,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would also like to thank Ted Briscoe for presenting an earlier version of this article on our behalf at NAACL 2001.",
                    "sid": 355,
                    "ssid": 24,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}