{
    "ID": "J04-2003",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "In statistical machine translation, correspondences between the words in the source and the target language are learned from parallel corpora, and often little or no linguistic knowledge is used to structure the underlying models.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, existing statistical systems for machine translation often treat different inflected forms of the same lemma as if they were independent of one another.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bilingual training data can be better exploited by explicitly taking into account the interdependencies of related inflected forms.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose the construction of hierarchical lexicon models on the basis of equivalence classes of words.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we introduce sentence-level restructuring transformations which aim at the assimilation of word order in related sentences.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have systematically investigated the amount of bilingual training data required to maintain an acceptable quality of machine translation.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The combination of the suggested methods for improving translation quality in frameworks with scarce resources has been successfully tested: We were able to reduce the amount of bilingual training data to less than 10% of the original corpus, while losing only 1.6% in translation quality.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The improvement of the translation results is demonstrated on two GermanEnglish corpora taken from the Verbmobil task and the Nespole!",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "task.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The statistical approach to machine translation has proved successful in various comparative evaluations since its revival by the work of the IBM research group more than a decade ago.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The IBM group dispensed with linguistic analysis, at least in its earliest publications.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the IBM group finally made use of morphological and syntactic information to enhance translation quality (Brown et al. 1992; Berger et al. 1996), most of today’s statistical machine translation systems still consider only surface forms and use no linguistic knowledge about the structure of the languages involved.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In many applications only small amounts of bilingual training data are available for the desired domain and language pair, and it is highly desirable to avoid at least parts of the costly data collection process.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main objective of the work reported in this article is to introduce morphological knowledge in order to reduce the amount of bilingual data necessary to sufficiently cover the vocabulary expected in testing.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is achieved by explicitly taking into account the interdependencies of related inflected forms.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, a hierarchy of equivalence classes at different levels of abstraction is proposed.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Features from those hierarchy levels are combined to form hierarchical lexicon models, which can replace the standard probabilistic lexicon used ∗ Lehrstuhl fu¨ r Informatik VI, Computer Science Department, RWTH Aachen—University of Technology, D-52056 Aachen, Germany.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email: sonja.niessen@gmx.de; ney@cs.rwthaachen.de.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Oc 2004 Association for Computational Linguistics in most statistical machine translation systems.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Apart from the improved coverage, the proposed lexicon models enable the disambiguation of ambiguous word forms by means of annotation with morpho-syntactic tags.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.1 Overview.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The article is organized as follows.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After briefly reviewing the basic concepts of the statistical approach to machine translation, we discuss the state of the art and related work as regards the incorporation of morphological and syntactic information into systems for natural language processing.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2 describes the information provided by morpho-syntactic analysis and introduces a suitable representation of the analyzed corpus.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 suggests solutions for two specific aspects of structural difference,namely, question inversion and separated verb prefixes.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 is dedicated to hi erarchical lexicon models.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These models are able to infer translations of word forms from the translations of other word forms of the same lemma.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, they use morpho-syntactic information to resolve categorial ambiguity.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 5, we describe how disambiguation between different readings and their corresponding translationscan be performed when no context is available, as is typically the case for conven tional electronic dictionaries.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 6 provides an overview of our procedure for training model parameters for statistical machine translation with scarce resources.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experimental results are reported in Section 7.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 8 concludes the presentation with a discussion of the achievements of this work.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.2 Statistical Machine Translation.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In statistical machine translation, every target language string eI = e1 ··· eI is assigned a probability Pr(eI ) of being a valid word sequence in the target language and a probability Pr(eI |f J ) of being a translation for the given source language string f J = 1 1 1 f1 ··· fJ . According to Bayes’ decision rule, the optimal translation for f J is the target string that maximizes the product of the target language model Pr(eI ) and the string translation model Pr(f J |eI ).",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many existing systems for statistical machine translation 1 1 (Garc´ıa-Varea and Casacuberta 2001; Germann et al. 2001; Nießen et al. 1998; Och, Tillmann, and Ney 1999) implement models presented by Brown, Della Pietra, Della Pietra, and Mercer (1993): The correspondence between the words in the source and the target strings is described by alignments that assign target word positions to each source word position.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability that a certain target language word will occur in the target string is assumed to depend basically only on the source words aligned with it.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.3 Related Work.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.3.1 Morphology.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some publications have already dealt with the treatment of mor phology in the framework of language modeling and speech recognition: Kanevsky, Roukos, and Sedivy (1997) propose a statistical language model for inflected languages.They decompose word forms into stems and affixes.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Maltese and Mancini (1992) re port that a linear interpolation of word n-grams, part of speech n-grams, and lemma n-grams yields lower perplexity than pure word-based models.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Larson et al.",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2000) apply a data-driven algorithm for decomposing compound words in compounding languages as well as for recombining phrases to enhance the pronunciation lexicon and the language model for large-vocabulary speech recognition systems.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As regards machine translation, the treatment of morphology is part of the analysis and generation step in virtually every symbolic machine translation system.",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this purpose, the lexicon should contain base forms of words and the grammatical category, 182 subcategorization features, and semantic information in order to enable the size of the lexicon to be reduced and in order to account for unknown word forms, that is, word forms not present explicitly in the dictionary.",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Today’s statistical machine translation systems build upon the work of P. F. Brown and his colleagues at IBM.",
                    "sid": 45,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation models they presented in various papers between 1988 and 1993 (Brown et al. 1988; Brown et al. 1990; Brown, Della Pietra, Della Pietra, and Mercer 1993) are commonly referred to as IBM models 1–5, based on the numbering in Brown, Della Pietra, Della Pietra, and Mercer (1993).",
                    "sid": 46,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The underlying (probabilistic) lexicon contains only pairs of full forms.",
                    "sid": 47,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, Brown et al.",
                    "sid": 48,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1992) had already suggested word forms be annotated with morpho-syntactic information, but they did not perform any investigation on the effects.",
                    "sid": 49,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.3.2 Translation with Scarce Resources.",
                    "sid": 50,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some recent publications, like AlOnaizan et al.",
                    "sid": 51,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2000), have dealt with the problem of translation with scarce resources.",
                    "sid": 52,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "AlOnaizan et al. report on an experiment involving Tetun-to-English translation by different groups, including one using statistical machine translation.",
                    "sid": 53,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "AlOnaizan et al. assume the absence of linguistic knowledge sources such as morphological analyzers and dictionaries.",
                    "sid": 54,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, they found that the human mind is very well capable of deriving dependencies such as morphology, cognates, proper names, and spelling variations and that this capability was finally at the basis of the better results produced by humans compared to corpus-based machine translation.",
                    "sid": 55,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The additional information results from complex reasoning, and it is not directly accessible from the full-word- form representation in the data.",
                    "sid": 56,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This article takes a different point of view: Even if full bilingual training data are scarce, monolingual knowledge sources like morphological analyzers and data for training the target language model as well as conventional dictionaries (one word and its translation[s] per entry) may be available and of substantial usefulness for improving the performance of statistical translation systems.",
                    "sid": 57,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is especially the case for more-inflecting major languages like German.",
                    "sid": 58,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of dictionaries to augment or replace parallel corpora has already been examined by Brown, Della Pietra, Della Pietra, and Goldsmith (1993) and Koehn and Knight (2001), for instance.",
                    "sid": 59,
                    "ssid": 59,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "morpho-syntactic information. ",
            "number": "2",
            "sents": [
                {
                    "text": "A prerequisite for the methods for improving the quality of statistical machine translation described in this article is the availability of various kinds of morphological and syntactic information.",
                    "sid": 60,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This section describes the output resulting from morpho- syntactic analysis and explains which parts of the analysis are used and how the output is represented for further processing.",
                    "sid": 61,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Description of the Analysis Results.",
                    "sid": 62,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For obtaining the required morpho-syntactic information, the following analyzers for German and English were applied: gertwol and engtwol for lexical analysis and gercg and engcg for morphological and syntactic disambiguation.",
                    "sid": 63,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a description of the underlying approach, the reader is referred to Karlsson (1990).",
                    "sid": 64,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tables 1 and 2 give examples of the information provided by these tools.",
                    "sid": 65,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Treatment of Ambiguity.",
                    "sid": 66,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The examples in Tables 1 and 2 demonstrate the capability of the tools to disambiguate among different readings: For instance, they infer that the word wollen is a verb in the indicative present first-person plural form.",
                    "sid": 67,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Without any context taken into account, 183 Table 1 Sample analysis of a German sentence.",
                    "sid": 68,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Input: Wir wollen nach dem Abendessen nach Essen aufbrechen.",
                    "sid": 69,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(In English: We want to start for Essen after dinner.)",
                    "sid": 70,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ori gin al Ba se for m Ta gs Wir wi r pe rso nal pr on ou n pl ur al fir st no mi na tiv e wol len wo lle n ve rb in dic ati ve pr ese nt pl ur al fir st nac h na ch pr ep osi tio n da tiv e de m da s de fin ite art icl e sin gu lar da tiv e ne ut er Abe nde sse n Ab en d# ess en no un ne ut er sin gu lar da tiv e nac h na ch pr ep osi tio n da tiv e Ess en Es se n no un na me ne ut er sin gu lar da tiv e Es se no un fe mi ni ne pl ur al da tiv e Es se n no un ne ut er pl ur al da tiv e Es se n no un ne ut er sin gu lar da tiv e auf brec hen auf |br ec he n ve rb se pa ra ble inf ini tiv e Table 2 Sample analysis of an English sentence.",
                    "sid": 71,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Input: Do we have to reserve rooms?.",
                    "sid": 72,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ori gin al Ba se for m Ta gs Do do ver b pr ese nt not sin gu lar thi rd fin ite au xili ar y we we pe rso nal pr on ou n no mi nat ive pl ur al firs t su bje ct hav e ha ve ver b inf ini tiv e not fin ite ma in to to inf ini tive ma rke r rese rve res erv e ver b inf ini tiv e not fin ite ma in roo ms ro om no un no mi nat ive pl ur al obj ect wollen has other readings.",
                    "sid": 73,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can even be interpreted as derived from an adjective with the meaning “made of wool.” The inflected word forms on the German part of the Verbmobil (cf.",
                    "sid": 74,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 7.1.1) corpus have on average 2.85 readings (1.86 for the English corpus), 58% of which can be eliminated by the syntactic analyzers on the basis of sentence context.",
                    "sid": 75,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Common bilingual corpora normally contain full sentences, which provide enough context information for ruling out all but one reading for an inflected word form.",
                    "sid": 76,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To reduce the remaining uncertainty, preference rules have been implemented.",
                    "sid": 77,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, it is assumed that the corpus is correctly true-case-converted beforehand, and as a consequence, non-noun readings of uppercase words are dropped.",
                    "sid": 78,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, indicative verb readings are preferred to subjunctive or imperative.",
                    "sid": 79,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, some simple domain-specific heuristics are applied.",
                    "sid": 80,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reading “plural of Esse” for the German word form Essen, for instance, is much less likely in the domain of appointment scheduling and travel arrangements than the readings “proper name of the town Essen” or the German equivalent of the English word meal.",
                    "sid": 81,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As can be seen in Table 3, the reduction in the number of readings resulting from these preference rules is fairly small in the case of the Verbmobil corpus.",
                    "sid": 82,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining ambiguity often lies in those parts of the information which are not used or which are not relevant to the translation task.",
                    "sid": 83,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the analyzers cannot tell accusative from dative case in German, but the case information is not essential for the translation task (see also Table 4).",
                    "sid": 84,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2.4 describes a method 184 Table 3 Resolution of ambiguity on the Verbmobil corpus.",
                    "sid": 85,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Number of readings per word form Dis am big uati on Ge rm an E n g l i s h No ne 2 . 8 5 1 . 8 6 By con text 1 . 2 0 1 . 0 2 By pref ere nce 1 . 1 9 1 . 0 2 By sele ctin g rele van t tags 1 . 0 6 1 . 0 1 By reso rtin g to una mbi guo us part 1 . 0 0 1 . 0 0 for selecting morpho-syntactic tags considered relevant for the translation task, which results in a further reduction in the number of readings per word form to 1.06 for German and 1.01 for English.",
                    "sid": 86,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In these rare cases of ambiguity it is admissible to resort to the unambiguous parts of the readings, that is, to drop all tags causing mixed interpretations.",
                    "sid": 87,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 summarizes the gradual resolution of ambiguity.",
                    "sid": 88,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The analysis of conventional dictionaries poses some special problems, because they do not provide enough context to enable effective disambiguation.",
                    "sid": 89,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For handling this special situation, dedicated methods have been implemented; these are presented in Section 5.1.",
                    "sid": 90,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 The Lemma-Tag Representation.",
                    "sid": 91,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A full word form is represented by the information provided by the morpho-syntactic analysis: from the interpretation gehen verb indicative present first singular, that is, the base form plus part of speech plus the other tags, the word form gehe can be restored.",
                    "sid": 92,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has already been mentioned that the analyzers can disambiguate among different readings on the basis of context information.",
                    "sid": 93,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this sense, the information inherent in the original word forms is augmented by the disambiguating analyzer.",
                    "sid": 94,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be useful for choosing the correct translation of ambiguous words.",
                    "sid": 95,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of course, these disambiguation clues result in an enlarged vocabulary.",
                    "sid": 96,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The vocabulary of the new representation of the German part of the Verbmobil corpus, for example, in which fullword forms are replaced by base form plus morphological and syntactic tags (lemma tag representation), is one and a half times as large as the vocabulary of the original corpus.",
                    "sid": 97,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, the information in the lemma-tag representation can be accessed gradually and ultimately reduced: For example, certain instances of words can be considered equivalent.",
                    "sid": 98,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This fact is used to better exploit the bilingual training data along two directions: detecting and omitting unimportant information (see Section 2.4) and constructing hierarchical translation models (see Section 4).",
                    "sid": 99,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To summarize, the lemma-tag representation of a corpus has the following main advantages: It makes context information locally available, and it allows information to be explicitly accessed at different levels of abstraction.",
                    "sid": 100,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4 Equivalence Classes of Words with Similar Translation.",
                    "sid": 101,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inflected word forms in the input language often contain information that is not rel evant for translation.",
                    "sid": 102,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is especially true for the task of translating from a more inflecting language like German into English, for instance: In parallel German/English corpora, the German part contains many more distinct word forms than the Englishpart (see, for example, Table 5).",
                    "sid": 103,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is useful for the process of statistical machine trans lation to define equivalence classes of word forms which tend to be translated by the same target language word: The resulting statistical translation lexicon becomes 185 Table 4 Candidates for equivalence classes.",
                    "sid": 104,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Part of speech Candidates Noun Gender (masculine, feminine, neuter) and case (nominative, dative, accusative) Verb Number (singular, plural) and person (first, second, third) Adjective Gender, case, and number Number Case smoother, and the coverage is considerably improved.",
                    "sid": 105,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such equivalence classes are constructed by omitting those items of information from morpho-syntactic analysis which are not relevant for translation.",
                    "sid": 106,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lemma-tag representation of the corpus helps to identify the unimportant information.",
                    "sid": 107,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The definition of relevant and unimportant information, respectively, depends on many factors like the languages involved, the translation direction, and the choice of the models.",
                    "sid": 108,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We detect candidates for equivalence classes of words automatically from the probabilistic lexicon trained for translation from German to English.",
                    "sid": 109,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this purpose, those inflected forms of the same base form which result in the same translation are inspected.",
                    "sid": 110,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each set of tags T, the algorithm counts how often an additional tag t1 can be replaced with a certain other tag t2 without effect on the translation.",
                    "sid": 111,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an example, let T = ‘blau-adjective’, t1 =‘masculine’ and t2 =‘feminine’.",
                    "sid": 112,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two entries (‘blau-adjective-masculine’|‘blue’) and (‘blau-adjective-feminine’|‘blue’) are hints for detecting gender as nonrelevant when translating adjectives into English.",
                    "sid": 113,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 lists some of the most frequently identified candidates to be ignored whiletranslating: The gender of nouns is irrelevant for their translation (which is straight forward, as the gender of a noun is unambiguous), as are the cases nominative, dative, accusative.",
                    "sid": 114,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(For the genitive forms, the translation in English differs.)",
                    "sid": 115,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For verbs the candidates number and person were found: The translation of the first-person singular form of a verb, for example, is often the same as the translation of the third-person plural form.",
                    "sid": 116,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ignoring (dropping) those tags most often identified as irrelevant for translation results in the building of equivalence classes of words.",
                    "sid": 117,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Doing so results ina smaller vocabulary, one about 65.5% the size of the vocabulary of the full lemma tag representation of the Verbmobil corpus, for example—it is even smaller than the vocabulary of the original full-form corpus.The information described in this section is used to improve the quality of statis tical machine translation and to better exploit the available bilingual resources.",
                    "sid": 118,
                    "ssid": 59,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "treatment of structural differences. ",
            "number": "3",
            "sents": [
                {
                    "text": "Difference in sentence structure is one of the main sources of errors in machine translation.",
                    "sid": 119,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is thus promising to “harmonize” the word order in corresponding sentences.",
                    "sid": 120,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The presentation in this section focuses on the following aspects: question inversion and separated verb prefixes.",
                    "sid": 121,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a more detailed discussion of restructuring for statistical machine translation the reader is referred to Nießen and Ney (2000, 2001).",
                    "sid": 122,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Question Inversion.",
                    "sid": 123,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In many languages, the sentence structure of questions differs from the structure in declarative sentences in that the order of the subject and the corresponding finite verbis inverted.",
                    "sid": 124,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the perspective of statistical translation, this behavior has some dis 186 advantages: The algorithm for training the parameters of the target language model Pr(eI ), which is typically a standard n-gram model, cannot deduce the probability of a word sequence in an interrogative sentence from the corresponding declarative form.",
                    "sid": 125,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same reasoning is valid for the lexical translation probabilities of multiword- phrase pairs.",
                    "sid": 126,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To harmonize the word order of questions with the word order in declarative sentences, the order of the subject (including the appendant articles, adjectives etc.) and the corresponding finite verb is inverted.",
                    "sid": 127,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In English questions supporting dos are removed.",
                    "sid": 128,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The application of the described preprocessing step in the bilingual training corpus implies the necessity of restoring the correct forms of the translations produced by the machine translation algorithm.",
                    "sid": 129,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This procedure was suggested by Brown et al.",
                    "sid": 130,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1992) for the language pair English and French, but they did not report on experimental results revealing the effect of the restructuring on the translation quality.",
                    "sid": 131,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Separated Verb Prefixes.",
                    "sid": 132,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "German prefix verbs consist of a main part and a detachable prefix, which can beshifted to the end of the clause.",
                    "sid": 133,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the automatic alignment process, it is often dif ficult to associate one English word with more than one word in the corresponding German sentence, namely, the main part of the verb and the separated prefix.",
                    "sid": 134,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To solve the problem of separated prefixes, all separable word forms of verbs are extracted from the training corpus.",
                    "sid": 135,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting list contains entries of the form prefix|main.",
                    "sid": 136,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all clauses containing a word matching a main part and a word matching the corresponding prefix part occurring at the end of the clause, the prefix is prepended to the beginning of the main part.",
                    "sid": 137,
                    "ssid": 19,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "hierarchical lexicon models. ",
            "number": "4",
            "sents": [
                {
                    "text": "In general, the probabilistic lexicon resulting from training the translation model contains all word forms occurring in the training corpus as separate entries, not taking into account whether or not they are inflected forms of the same lemma.",
                    "sid": 138,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bearing in mind that typically more than 40% of the word forms are seen only once in training (see, for example, Table 5), it is obvious that for many words, learning the correct translations is difficult.",
                    "sid": 139,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, new input sentences are expected to contain unknown word forms, for which no translation can be retrieved from the lexicon.",
                    "sid": 140,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This problem is especially relevant for more-inflecting languages like German: Texts in German contain many more distinct word forms than their English translations.",
                    "sid": 141,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 also reveals that these words are often generated via inflection from a smaller set of base forms.",
                    "sid": 142,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 A Hierarchy of Equivalence Classes of Inflected Word Forms As mentioned in Section 2.3, the lemma-tag representation of the information frommorpho-syntactic analysis makes it possible to gradually access information with dif ferent grades of abstraction.",
                    "sid": 143,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider, for example, the German verb form ankomme, which is the indicative present first-person singular form of the lemma ankommen and can be translated into English by arrive.",
                    "sid": 144,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lemma-tag representation provides an “observation tuple” consisting of • the original full word form (e.g., ankomme), • morphological and syntactic tags (part of speech, tense, person, case, ...",
                    "sid": 145,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": ") (e.g., verb, indicative, present tense, 1st person singular), and 187 • the base form (e.g., ankommen).",
                    "sid": 146,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following, ti = t0 , ...",
                    "sid": 147,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", ti denotes the representation of a word where the base form t0 and i additional tags are taken into account.",
                    "sid": 148,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the example above, t0 = ankommen, t1 = verb, and so on.",
                    "sid": 149,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hierarchy of equivalence classes F0 , ...",
                    "sid": 150,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", Fn is as follows: Fn = F (tn ) = ankommen verb indicative present singular 1 Fn 1 = F (tn−1 ) = ankommen verb indicative present singular Fn 2 = F (tn−2 ) = ankommen verb indicative present . F0 = F (t0 ) = ankommen where n is the maximum number of morpho-syntactic tags.",
                    "sid": 151,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The mapping from the full lemma-tag representation back to inflected word forms is generally unambigu ous; thus Fn contains only one element, namely, ankomme.",
                    "sid": 152,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fn−1 contains the formsankomme, ankommst, and ankommt; in Fn−2 the number (singular or plural) is ig nored, and so on.",
                    "sid": 153,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The largest equivalence class contains all inflected forms of the base form ankommen.1 Section 4.2 introduces the concept of combining information at different levels of abstraction.",
                    "sid": 154,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Log-Linear Combination.",
                    "sid": 155,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In modeling for statistical machine translation, a hidden variable aJ , denoting the hidden alignment between the words in the source and target languages, is usually introduced into the string translation probability: Pr(f J |eI ) = Pr(f J , aJ |eI ) = Pr(aJ |eI ) · Pr(f J |aJ , eI ) (1) 1 1 1 1 1 1 1 J J 1 1 1 1 1 In the following, Tj = tn denotes the lemma-tag representation of the jth word in the input sentence.",
                    "sid": 156,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sequence TJ stands for the sequence of readings for the word sequence f J and can be introduced as a new hidden variable: Pr(f J |aJ , eI ) = Pr(f J , TJ |aJ , eI ) (2) 1 1 1 1 1 1 1 J 1 which can be decomposed into J Pr(f J |aJ , eI ) = TI Pr(fj , Tj |f j−1 , Tj−1 , aJ , eI ) (3) 1 1 1 J j=1 1 1 1 1 1 1 The order of omitting tags can be defined in a natural way depending on the part of speech.",
                    "sid": 157,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In.",
                    "sid": 158,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "principle this decision can also be left to the maximum-entropy training, when features for all possible sets of tags are defined, but this would cause the number of parameters to explode.",
                    "sid": 159,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the experiments in this work have been carried out only with up to three levels of abstraction as defined in Section 4.2, the set of tags of the intermediate level is fixed, and thus the priority of the tags needs not be specified.",
                    "sid": 160,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relation between this equivalence class hierarchy and the suggestions in Section 2.4 is clear: Choosing candidates for morpho-syntactic tags not relevant for translation amounts to fixing a level in the hierarchy.",
                    "sid": 161,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is exactly what has been done to define the intermediate level in Section 4.2.",
                    "sid": 162,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "188 Let T (fj ) be the set of interpretations which are regarded valid readings of fj by the morpho-syntactic analyzers on the basis of the whole-sentence context f J . We assume that the probability functions defined above yield zero for all other readings, that is, when Tj /∈ T (fj ).",
                    "sid": 163,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Under the usual independence assumption, which states that the probability of the translation of words depends only on the identity of the words associated with each other by the word alignment, we get Pr(f J |aJ , eI ) = J TI p(fj , Tj |ea ) (4) 1 1 1 J 1 Tj ∈T (fj ) j j=1 As has been argued in Section 2.2, the number of readings |T (fj )| per word form can be reduced to one for the tasks for which experimental results are reported here.The elements in equation (4) are the joint probabilities p(f , T|e) of f and the readings T of f given the target language word e. The maximum-entropy principle rec ommends choosing for p the distribution which preserves as much uncertainty as possible in terms of maximizing the entropy, while requiring p to satisfy constraints which represent facts known from the data.",
                    "sid": 164,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These constraints are encoded on the basis of feature functions hm (x), and the expectation of each feature hm over the model p is required to be equal to the observed expectation.",
                    "sid": 165,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The maximum-entropy model can be shown to be unique and to have an exponential form involving a weighted sum over the feature functions hm (Ratnaparkhi 1997).",
                    "sid": 166,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In equation (5), the notation tn is used again for the lemma-tag representation of an input word (this was denoted by T in equations (2)–(4) for notational simplicity): p(f , T|e) = pΛ (f , tn |e) = exp \\ m λm hm 1 (e, f , tn ) 1 (5) 2: exp \\ λm hm (e, ˜f , ˜tn ) ˜f ,˜tn m where Λ = {λm } is the set of model parameters with one weight λm for each feature function hm . These model parameters can be trained using converging iterative training procedures like the ones described by Darroch and Ratcliff (1972) or Della Pietra, Della Pietra, and Lafferty (1995).",
                    "sid": 167,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the experiments presented in this article, the sum over the word forms ˜f and the readings ˜tn in the denominator of equation (5) is restricted to the readings of word forms having the same base form and partial reading as a word form f 11 aligned at least once to e. The new lexicon model pΛ (f , tn |e) can now replace the usual lexicon model p(f |e), over which it has the following main advantages: • The decomposition of the modeled events into feature functions allows meaningful probabilities to be provided for word forms that have not occurred during training as long as the feature functions involved are well-defined.",
                    "sid": 168,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(See also the argument later in the article and the definition of first-level and second-level feature functions presented in Section 4.2.1.) • Introducing the hidden variable T = tn and constraining the lexicon probability to be zero for interpretations considered nonvalid readings of 189 f (that is, for tn /∈T (f )) amounts to making context information from the complete sentence f J locally available: The sentence context was taken into account by the morpho-syntactic analyzer, which chose the valid readings T (f ).",
                    "sid": 169,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2.1 Definition of Feature Functions.",
                    "sid": 170,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are numerous possibilities for defining feature functions.",
                    "sid": 171,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do not need to require that they all have the same parametric form or that the components be disjoint and statistically independent.",
                    "sid": 172,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Still, it is necessary to restrict the number of parameters so that optimizing them is practical.",
                    "sid": 173,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the following types of feature functions, which have been defined on the basis of the lemma-tag representation (see Section 2.3): First level: m = {L, ˜e}, where L is the base form: h1 n 1 if e = ˜e and t0 = L and f ∈ F (tn ) (∗) L,˜e (e, f , t0 ) = 0 otherwise Second level: m = {T, L, ˜e}, with subsets T of cardinality ≤ n of morpho-syntactic tags considered relevant (see Section 2.4 for a description of the detection of relevant tags): h2 n 1 if (∗) and T ⊆ tn (∗∗) T,L,˜e (e, f , t0 ) = 0 otherwise Third level: m = {F, T, L, ˜e}, with the fully inflected original word form F: h3 n 1 if (∗∗) and F = f F,T,L,˜e (e, f , t0 ) = 0 otherwise In terms of the hierarchy introduced in Section 4.1, this means that information at three different levels in the hierarchy is combined.",
                    "sid": 174,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The subsets T of relevant tags mentioned previously fix the intermediate level.2 This choice of the types of features as well as the choice of the subsets T is reasonable but somewhat arbitrary.",
                    "sid": 175,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alternatively one can think of defining a much more general set of features and applying some method of feature selection, as has been done, for example, by Foster (2000), who compared different methods for feature selection within the task of translation modeling for statistical machine translation.",
                    "sid": 176,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the log-linear model introduced here uses one parameter per feature.",
                    "sid": 177,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the Verbmobil task, for example, there are approximately 162, 000 parameters: 47,800 for the first-order features, 55,700 for the second-order features, and 58,500 for the third-order features.",
                    "sid": 178,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No feature selection or threshold was applied: All features seen in training were used.",
                    "sid": 179,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2.2 Training Procedure.",
                    "sid": 180,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall process of training and testing with hierarchical lexicon models is depicted in Figure 1.",
                    "sid": 181,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This figure includes the possibility of using restructuring operations as suggested in Section 3 in order to deal with structural differences between the languages involved.",
                    "sid": 182,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be especially advantageous in the case of multiword phrases which jointly fulfill a syntactic function: Not merging them 2 Of course, there is not only one set of relevant tags, but at least one per part of speech.",
                    "sid": 183,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to.",
                    "sid": 184,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "keep the notation as simple as possible, this fact is not accounted for in the formulas and the textual descriptions.",
                    "sid": 185,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "190 training corpus vocabulary supported in test source part restructuring t a r g e t p a r t restructuring analyze annotation all readings of vocabulary extract event counts alignment training of alignment t r a i n i n g o f l a n g u a g e m o d e l annotation ME training lexicon model alignment model lang ua ge mo del source sentence restructuring annotation search for optimal translation inverse restructuring o u t p u t s e n t e n c e Figure 1 Training and test with hierarchical lexicon.",
                    "sid": 186,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“(Inverse) restructuring,” “analyze,” and “annotation” all require morpho-syntactic analysis of the transformed sentences.",
                    "sid": 187,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "would raise the question of how to distribute the syntactic tags which have been associated with the whole phrase.",
                    "sid": 188,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 5.2 we describe a method of learning multi- word phrases using conventional dictionaries.",
                    "sid": 189,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The alignment on the training corpus is trained using the original source language corpus containing inflected word forms.",
                    "sid": 190,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This alignment is then used to count the co-occurrences of the annotated “words” in the lemma-tag representation of the source language corpus with the words in the target language corpus.",
                    "sid": 191,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These event counts are used for the maximum-entropy training of the model parameters Λ.",
                    "sid": 192,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability mass is distributed over (all readings of) the source language word forms to be supported for test (not necessarily restricted to those occurring during training).",
                    "sid": 193,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The only precondition is that the firing features for these unseen events are known.",
                    "sid": 194,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This “vocabulary supported in test,” as it is called in Figure 1, can be a predefined closed vocabulary, as is the case in Verbmobil, in which the output of a speech recognizer with limited output vocabulary is to be translated.",
                    "sid": 195,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the easiest case it is identical to the vocabulary found in the source language part of the training corpus.",
                    "sid": 196,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other extreme would be an extended vocabulary containing all automatically generated inflected forms of all base forms occurring in the training corpus.",
                    "sid": 197,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This vocabulary is annotated with morpho-syntactic tags, ideally under consideration of all possible readings of all word forms.",
                    "sid": 198,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "191 To enable the application of the hierarchical lexicon model, the source language input sentences in test have to be analyzed and annotated with their lemma-tag representation before the actual translation process.",
                    "sid": 199,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So far, the sum over the readings in equation (4) has been ignored, because when the techniques for reducing the amount of ambiguity described in Section 2.2 and the disambiguated conventional dictionaries resulting from the approach presented in Section 5.1 are applied, there remains almost always only one reading per word form.",
                    "sid": 200,
                    "ssid": 63,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conventional dictionaries. ",
            "number": "5",
            "sents": [
                {
                    "text": "Conventional dictionaries are often used as additional evidence to better train the model parameters in statistical machine translation.",
                    "sid": 201,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The expression conventional dictionary here denotes bilingual collections of word or phrase pairs predominantly collected “by hand,” usually by lexicographers, as opposed to the probabilistic lexica, which are learned automatically.",
                    "sid": 202,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Apart from the theoretical problem of how to incorporate external dictionaries in a mathematically sound way into a statistical framework for machine translation (Brown, Della Pietra, Della Pietra, and Goldsmith 1993) there are also some pragmatic difficulties: As discussed in Section 2.2, one of the disadvantages of these conventional dictionaries as compared to full bilingual corpora is that their entries typically contain single words or short phrases on each language side.",
                    "sid": 203,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, it is not possible to distinguish among the translations for different readings of a word.",
                    "sid": 204,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In normal bilingual corpora, the words can often be disambiguated by taking into account the sentence context in which they occur.",
                    "sid": 205,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, from the context in the sentence Ich werde die Zimmer buchen, it is possible to infer that Zimmer in this sentence is plural and has to be translated by rooms in English, whereas the correct translation of Zimmer in the sentence Ich ha¨tte gerne ein Zimmer is the singular form room.",
                    "sid": 206,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The dictionary used by our research group for augmenting the bilingual data contains two entries for Zimmer: (‘Zimmer ’|‘room’) and (‘Zimmer ’|‘rooms’).",
                    "sid": 207,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Disambiguation without Context.",
                    "sid": 208,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach described in this section is based on the observation that in many of the cases of ambiguous entries in dictionaries, the second part of the entry—that is, theother-language side—contains the information necessary to decide upon the interpre tation.",
                    "sid": 209,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In some other cases, the same kind of ambiguity is present in both languages, and it would be possible and desirable to associate the (semantically) corresponding readings with one another.",
                    "sid": 210,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The method proposed here takes advantage of these facts in order to disambiguate dictionary entries.Figure 2 sketches the procedure for the disambiguation of a conventional dictio nary D. In addition to D, a bilingual corpus C1 of the same language pair is required to train the probability model for tag sequence translations.",
                    "sid": 211,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word forms in C1 need not match those in D. C1 is not necessarily the training corpus for the translation task in which the disambiguated version of D will be used.",
                    "sid": 212,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It does not even have to be taken from the same domain.",
                    "sid": 213,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A word alignment between the sentences in C1 is trained with some automatic alignment algorithm.",
                    "sid": 214,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then the words in the bilingual corpus are replaced by a reduced form of their lemma-tag representation, in which only a subset of their morpho-syntactic tags is retained—even the base form is dropped.",
                    "sid": 215,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining subset of tags, in the following denoted by Tf for the source language and Te for the target language, consists of tags considered relevant for the task of aligning corresponding readings.",
                    "sid": 216,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not necessarily the same set of tags considered relevant for the task of translation which was used, for example, to fix the intermediate level for the log-linear lexicon 192 conventional dictionary merge phrases learn phrases annotation bilingual corpus analyze all readings of entries count tag cooccurences alignment t r a i n i n g o f a l i g n m e n t annotation t a g t r a n s l a t i o n p r o b a b i l i t i e s align corresponding readings d i s a m b i g u a t e d d i c t i o n a r y Figure 2 Disambiguation of conventional dictionaries.",
                    "sid": 217,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“Learn phrases,” “analyze,” and “annotation” require morpho-syntactic analysis of the transformed sentences.",
                    "sid": 218,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "combination in Section 4.2.1.",
                    "sid": 219,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of the Verbmobil corpus, the maximum length of a tag sequence is five.",
                    "sid": 220,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The alignment is used to count the frequency of a certain tag sequence tf in the source language to be associated with another tag sequence te in the target languageand to compute the tag sequence translation probabilities p(tf |te ) as relative frequen cies.",
                    "sid": 221,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the time being, these tag sequence translation probabilities associate readings of words in one language with readings of words in the other language: Multiword sequences are not accounted for.",
                    "sid": 222,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To alleviate this shortcoming it is possible and advisable to automatically detect and merge multiword phrases.",
                    "sid": 223,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As will be described in Section 5.2, the conventional bilingual dictionary itself can be used to learn and validate these phrases.",
                    "sid": 224,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting multiword phrases Pe for the target language and Pf for the source language are afterwards concatenated within D to form entries consisting of pairs of “units.” The next step is to analyze the word forms in D and generate all possible readings of all entries.",
                    "sid": 225,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also possible to ignore those readings that are considered unlikely for the task under consideration by applying the domain-specific preference rules proposed in Section 2.2.",
                    "sid": 226,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The process of generating all readings includes replacing word forms with their lemma-tag representation, which is thereafter reduced by dropping all morpho-syntactic tags not contained in the tag sets Tf and Te .Using the tag sequence translation probabilities p(tf |te ), the readings in one lan guage are aligned with readings in the other language.",
                    "sid": 227,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These alignments are applied to the full lemma-tag representation (not only tags in Tf and Te ) of the expanded dictionary containing one entry per reading of the original word forms.",
                    "sid": 228,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The highest-ranking aligned readings according to p(tf |te ) for each lemma are preserved.",
                    "sid": 229,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "193 The resulting disambiguated dictionary contains two entries for the German word Zimmer: (‘Zimmer-noun-sg.’|‘room-noun-sg.’) and (‘Zimmer-noun-pl.’|‘room-noun- pl.’).",
                    "sid": 230,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The target language part is then reduced to the surface forms: (‘Zimmer-noun-sg.’| ‘room’) and (‘Zimmer-noun-pl.’|‘rooms’).",
                    "sid": 231,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that this augmented dictionary, in the following denoted by D1, has more entries than D as a result of the step of generating all readings.",
                    "sid": 232,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two entries (‘beabsichtigt’|‘intends’) and (‘beabsichtigt’|‘intended’),for example, produce three new entries: (‘beabsichtigt-verb-ind.-pres.-sg.3rd’|‘intends’), (‘beabsichtigt-verb-past-part.’|‘intended’), and (‘beabsichtigt adjective-pos.’|‘intended’).",
                    "sid": 233,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Multiword Phrases.",
                    "sid": 234,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some recent publications deal with the automatic detection of multiword phrases (Och and Weber 1998; Tillmann and Ney 2000).",
                    "sid": 235,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These methods are very useful, but they have one drawback: They rely on sufficiently large training corpora, because they detect the phrases from automatically learned word alignments.",
                    "sid": 236,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section a method for detecting multiword phrases is suggested which merely requires monolingual syntactic analyzers and a conventional dictionary.",
                    "sid": 237,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some multiword phrases which jointly fulfill a syntactic function are provided by the analyzers.",
                    "sid": 238,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The phrase irgend etwas (‘anything’), for example, may form either an indefinite determiner or an indefinite pronoun.",
                    "sid": 239,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "irgend=etwas is merged by theanalyzer in order to form one single vocabulary entry.",
                    "sid": 240,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the German part of the Verb mobil training corpus 26 different, nonidiomatic multiword phrases are merged, whilethere are 318 phrases suggested for the English part.",
                    "sid": 241,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, syntactic informa tion like the identification of infinitive markers, determiners, modifying adjectives (for example, single room), premodifying adverbials (more comfortable), and premodifying nouns (account number) are used for detecting multiword phrases.",
                    "sid": 242,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When applied to the English part of the Verbmobil training corpus, these hints suggest 7,225 different phrases.",
                    "sid": 243,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Altogether, 26 phrases for German and about 7,500 phrases for English are detected in this way.",
                    "sid": 244,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is quite natural that there are more multiword phrases found for English, as German, unlike English, uses compounding.",
                    "sid": 245,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But the experiments show that it is not advantageous to use all these phrases for English.",
                    "sid": 246,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Electronic dictionaries can be useful for detecting those phrases which are important in a statistical machine translation context: A multiword phrase is considered useful if it is translated into a single word or a distinct multiword phrase (suggested in a similar way by syntactic analysis) in another language.",
                    "sid": 247,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are 290 phrases chosen in this way for the English language.",
                    "sid": 248,
                    "ssid": 48,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "overall procedure for training with scarce resources. ",
            "number": "6",
            "sents": [
                {
                    "text": "Taking into account the interdependencies of inflected forms of the same base form is especially relevant when inflected languages like German are involved and when training data are sparse.",
                    "sid": 249,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this situation many of the inflected word forms to account for in test do not occur during training.",
                    "sid": 250,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sparse bilingual training data also make additional conventional dictionaries especially important.",
                    "sid": 251,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Enriching the dictionaries by aligning corresponding readings is particularly useful when the dictionaries are used in conjunction with a hierarchical lexicon, which can access the information necessary to distinguish readings via morpho-syntactic tags.",
                    "sid": 252,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The restructuring operations described in Section 3 also help in coping with the data sparseness problem, because they make corresponding sentences more similar.",
                    "sid": 253,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This section proposes a procedure for combining all these methods in order to improve the translation quality despite sparseness of data.",
                    "sid": 254,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 sketches the proposed procedure.",
                    "sid": 255,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "194 bil.",
                    "sid": 256,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "corpus C2 bil.",
                    "sid": 257,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "corpus C1 conventional dictionary D monolingual corpus disambiguate dictionary learn phrases disambiguated dictionary D’ restructuring restructuring restructuring annotation c o m b i n e d c o r p u s train hierarch.",
                    "sid": 258,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "lexicon alignment on combined corpus lexicon model Figure 3 train alignment alignment model LM training language model Training with scarce resources.",
                    "sid": 259,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“Restructuring,” “learn phrases,” and “annotation” all require morpho-syntactic analysis of the transformed sentences.",
                    "sid": 260,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two different bilingual corpora C1 and C2 , one monolingual target language corpus, and a conventional bilingual dictionary D can contribute in various ways to the overall result.",
                    "sid": 261,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is important to note here that C1 and C2 can, but need not, be distinct, and that the monolingual corpus can be identical to the target language part of C2 . Furthermore these corpora can be taken from different domains, and C1 can be (very) small.",
                    "sid": 262,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only C2 has to represent the domain and the vocabulary for which the translation system is built, and only the size of C2 and the monolingual corpus have a substantial effect on the translation quality.",
                    "sid": 263,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is interesting to note, though, that a basic statistical machine translation system with an accuracy near 50% can be built without any domain-specific bilingual corpus C2 , solely on the basis of a disambiguated dictionary and the hierarchical lexicon models, as Table 9 shows.",
                    "sid": 264,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• In the first step, multiword phrases are learned and validated on the dictionary D in the way described in Section 5.2.",
                    "sid": 265,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These multiword phrases are concatenated in D. Then an alignment is trained on the first bilingual corpus C1 . On the basis of this alignment, the tag sequence translation probabilities which are needed to align corresponding readings in the dictionary are extracted, as proposed in Section 5.1.",
                    "sid": 266,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result of this step is an expanded and disambiguated dictionary D1.",
                    "sid": 267,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this purpose, C1 does not have to cover the vocabulary of D. Besides C1 195 can be comparatively small, given the limited number of tag sequence pairs (tf |te ) for which translation probabilities must be provided: In the Verbmobil training corpus, for example, there are only 261 different German and 110 different English tag sequences.",
                    "sid": 268,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• In the next step, the second bilingual corpus C2 and D1 are combined, and a word alignment A for both is trained.",
                    "sid": 269,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "C2 , D1, and A are presented as input to the maximum-entropy training of a hierarchical lexicon model as described in Section 4.2.",
                    "sid": 270,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• The language model can be trained on a separate monolingual corpus.",
                    "sid": 271,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As monolingual data are much easier and cheaper to compile, this corpus might be (substantially) larger than the target language part of C2 .",
                    "sid": 272,
                    "ssid": 24,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental results. ",
            "number": "7",
            "sents": [
                {
                    "text": "7.1 The Tasks and the Corpora.",
                    "sid": 273,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tests were carried out on Verbmobil data and on Nespole!",
                    "sid": 274,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "data.",
                    "sid": 275,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As usual, the sentences from the test sets were not used for training.",
                    "sid": 276,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training corpora were used for training the parameters of IBM model 4.",
                    "sid": 277,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.1.1 Verbmobil.",
                    "sid": 278,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verbmobil was a project for automatic translation of spontaneously spoken dialogues.",
                    "sid": 279,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A detailed description of the statistical translation system within Verbmobil is given by Ney et al.",
                    "sid": 280,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2000) and by Och (2002).",
                    "sid": 281,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 summarizes the characteristics of the English and German parallel corpus used for training the parameters of IBM model 4.",
                    "sid": 282,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A conventional dictionary complements the training corpus (see Table 6 for the statistics).",
                    "sid": 283,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The vocabulary in Verbmobil was considered closed: There are official lists of word forms which can be produced by the speech recognizers.",
                    "sid": 284,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such lists exist for German and English (see Table 7).",
                    "sid": 285,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 8 lists the characteristics of the two test sets Test and Develop taken from the end-to-end evaluation in Verbmobil, the development part being meant to tune system parameters on a held-out corpus different from the training as well as the test corpus.",
                    "sid": 286,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As no parameters are optimized on the development set for the methods described in this article, most of the experiments were carried out on a joint set containing both test sets.",
                    "sid": 287,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 Statistics of corpora for training: Verbmobil and Nespole!",
                    "sid": 288,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Singletons are types occurring only once in training.",
                    "sid": 289,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verbmobil Nespole!",
                    "sid": 290,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "En glis h Ger ma n En glis h Ger ma n Nu mb er of sent enc es 58 ,0 73 5 8, 0 7 3 3 , 1 8 2 3 , 1 8 2 Nu mb er of disti nct sent enc es 57 ,7 31 5 7, 7 7 1 1 , 7 5 8 1 , 7 6 7 Nu mb er of run nin g wor d for ms 549 ,92 1 51 9,5 23 15 ,5 68 1 4 , 9 9 2 Nu mb er of run nin g wor d for ms wit hou t pun ctua tion 453 ,61 2 41 8,9 74 12 ,4 61 1 1 , 6 7 2 Nu mb er of wor d for ms 4 , 6 7 3 7 , 9 4 0 1 , 0 3 4 1 , 3 6 3 Nu mb er of sing leto n wor d for ms 1 , 6 9 8 3 , 4 5 3 4 0 3 6 4 1 Nu mb er of bas e for ms 3 , 6 3 9 6 , 0 6 3 1 , 0 7 2 8 7 0 Nu mb er of sing leto n bas e for ms 1 , 2 3 6 2 , 5 4 6 4 6 1 3 2 6 196 Table 6 Conventional dictionary used to complement the training corpus.",
                    "sid": 291,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "En gli sh Ge rm an Nu mb er of entr ies 1 0, 4 9 8 1 0, 4 9 8 Nu mb er of run nin g wor d for ms 1 5, 3 0 5 1 2, 7 8 4 Nu mb er of wor d for ms 5 , 1 6 1 7 , 0 2 1 Nu mb er of bas e for ms 3 , 6 6 6 5 , 4 7 9 Table 7 The official vocabularies in Verbmobil.",
                    "sid": 292,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "En gli sh Ge rm an Nu mb er of wor d for ms 6 , 8 7 1 1 0 , 1 5 7 Nu mb er of bas e for ms 3 , 2 6 8 6 , 6 6 7 Table 8 Statistics for the test sets for German to English translation: Verbmobil Eval2000 (Test and Develop) and Nespole!",
                    "sid": 293,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verbmobil Nespole!",
                    "sid": 294,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Te st De vel op Nu mb er of sent enc es 2 5 1 2 7 6 7 0 Nu mb er of run nin g wor d for ms in Ger ma n part 2,6 28 3 , 1 5 9 4 5 6 Nu mb er of wor d for ms in Ger ma n part 4 2 9 4 3 4 1 8 0 Trig ram LM per plex ity of refe renc e tran slati on 3 0.",
                    "sid": 295,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 2 8 . 1 7 6 . 9 7.1.2 Nespole!.",
                    "sid": 296,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nespole!",
                    "sid": 297,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is a research project that ran from January 2000 to June 2002.",
                    "sid": 298,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It aimed to provide multimodel support for negotiation (Nespole!",
                    "sid": 299,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2000; Lavie et al. 2001).",
                    "sid": 300,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 summarizes the corpus statistics of the Nespole!",
                    "sid": 301,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "training set.",
                    "sid": 302,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 8 provides the corresponding figures for the test set used in this work.",
                    "sid": 303,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.2 The Translation System.",
                    "sid": 304,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For testing we used the alignment template translation system, described in Och, Tillmann, and Ney (1999).",
                    "sid": 305,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training the parameters for this system entails training of IBM model 4 parameters in both translation directions and combining the resulting alignments into one symmetrized alignment.",
                    "sid": 306,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From this symmetrized alignment, the lexicon probabilities as well as the so-called alignment templates are extracted.",
                    "sid": 307,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The latter are translation patterns which capture phrase-level translation pairs.",
                    "sid": 308,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.3 Performance Measures.",
                    "sid": 309,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following evaluation criteria were used in the experiments: BLEU (Bilingual Evaluation Understudy): This score, proposed by Papineni et al.",
                    "sid": 310,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2001), is based on the notion of modified n-gram precision, with n ∈ {1, ...",
                    "sid": 311,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", 4}: All candidate unigram, bigram, trigram, and four-gram counts are collected and clipped against their corresponding maximum reference counts.",
                    "sid": 312,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reference n-gram counts are calculated on a corpus 197 of reference translations for each input sentence.",
                    "sid": 313,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The clipped candidate counts are summed and normalized by the total number of candidate n- grams.",
                    "sid": 314,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The geometric mean of the modified precision scores for a test corpus is calculated and multiplied by an exponential brevity penalty factor to penalize too-short translations.",
                    "sid": 315,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BLEU is an accuracy measure, while the others are error measures.",
                    "sid": 316,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "m-WER (multireference word error rate): For each test sentence there is a set of reference translations.",
                    "sid": 317,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each translation hypothesis, the edit distance (number of substitutions, deletions, and insertions) to the most similar reference is calculated.",
                    "sid": 318,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SSER (subjective sentence error rate): Each translated sentence is judged by a human examiner according to an error scale from 0.0 (semantically and syntactically correct) to 1.0 (completely wrong).",
                    "sid": 319,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ISER (information item semantic error rate): The test sentences are segmented into information items; for each of these items, the translation candidates are assigned either “OK” or an error class.",
                    "sid": 320,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the intended information is conveyed, the translation of an information item is considered correct, even if there are slight syntactic errors which do not seriously deteriorate the intelligibility.",
                    "sid": 321,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For evaluating the SSER and the ISER, we have used the evaluation tool EvalTrans (Nießen and Leusch 2000), which is designed to facilitate the work of manually judging evaluation quality and to ensure consistency over time and across evaluators.",
                    "sid": 322,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.4 Impact of the Corpus Size.",
                    "sid": 323,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is a costly and time-consuming task to compile large texts and have them translated to form bilingual corpora suitable for training the model parameters for statistical machine translation.",
                    "sid": 324,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a consequence, it is important to investigate the amount of data necessary to sufficiently cover the vocabulary expected in testing.",
                    "sid": 325,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we want to examine to what extent the incorporation of morphological knowledge sources can reduce this amount of necessary data.",
                    "sid": 326,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 4 shows the relation between the size of a typical German corpus and the corresponding number of different full forms.",
                    "sid": 327,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the size of 520,000 words, the size of the Verbmobil corpus used for training, this curve still has a high growth rate.To investigate the impact of the size of the bilingual corpus available for train ing, on translation quality three different setups for training the statistical lexicon on Verbmobil data have been defined: • using the full training corpus as described in Table 5, comprising 58,000 sentences • restricting the corpus to 5,000 sentences (approximately every 11th sentence) • using no bilingual training corpus at all (only a bilingual dictionary; see subsequent discussion) The language model is always trained on the full English corpus.",
                    "sid": 328,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The argument for this is that monolingual corpora are always easier and less expensive to obtain than bilingual corpora.",
                    "sid": 329,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A conventional dictionary is used in all three setups to complement 198 8 7 6 5 4 3 2 1 0 0 100 200 300 400 500 corpus size [1000 words] Figure 4 Impact of corpus size (measured in number of running words in the corpus) on vocabulary size (measured in number of different full-form words found in the corpus) for the German part of the Verbmobil corpus.",
                    "sid": 330,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the bilingual corpus.",
                    "sid": 331,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the last setup, the lexicon probabilities are trained exclusively on this dictionary As Table 9 shows, the quality of translation drops significantly when the amount of bilingual data available during training is reduced: When the training corpus is restricted to 5,000 sentences, the SSER increases by about 7% and the ISER by about 3%.",
                    "sid": 332,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As could be expected, the translations produced by the system trained exclusively on a conventional dictionary are very poor: The SSER jumps over 60%.",
                    "sid": 333,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.5 Results for Log-Linear Lexicon Combination.",
                    "sid": 334,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.5.1 Results on the Verbmobil Task.",
                    "sid": 335,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As was pointed out in Section 4, the hierarchi cal lexicon is expected to be especially useful in cases in which many of the inflected word forms to be accounted for in test do not occur during training.",
                    "sid": 336,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To systematicallyinvestigate the model’s generalization capability, it has been applied on the three dif ferent setups described in Section 7.4.",
                    "sid": 337,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training procedure was the one proposed in Section 6, which includes restructuring transformations in training and test.",
                    "sid": 338,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 9 summarizes the improvement achieved for all three setups.",
                    "sid": 339,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training on 58,000 sentences plus conventional dictionary: Compared to the effect of restructuring, the additional improvement achieved with the hierarchical lexicon is relatively small in this setup.",
                    "sid": 340,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The combination of all methods results in a relative improvement in terms of SSER of almost 13% and in terms of information ISER of more than 16% as compared to the baseline.",
                    "sid": 341,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training on 5,000 sentences plus conventional dictionary: Restructuring alone can improve the translation quality from 37.3% to 33.6%.",
                    "sid": 342,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The benefit from the hierarchical lexicon is larger in this setup, and the resulting in SSER is 31.8%.",
                    "sid": 343,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a relative improvement of almost 15%.",
                    "sid": 344,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relative improvement in terms of ISER is almost 22%.",
                    "sid": 345,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that by applying the methods 199 Table 9 Results for hierarchical lexicon models and translation with scarce resources.",
                    "sid": 346,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“Restructuring” entails treatment of question inversion and separated verb prefixes as well as merging of phrases in both languages.",
                    "sid": 347,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A conventional dictionary is available in all three setups.",
                    "sid": 348,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The language model is always trained on the full monolingual English corpus.",
                    "sid": 349,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Task: Verbmobil.",
                    "sid": 350,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Testing on 527 sentences (Test and Develop).",
                    "sid": 351,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Number of sentences for training BLEU m-WER SSER ISER 58,0 00 B a s e l i n e 53.",
                    "sid": 352,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7% 34.",
                    "sid": 353,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 % 30.",
                    "sid": 354,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 % 14.",
                    "sid": 355,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1% R e s t r u c t u r i n g 56 .3 3 2.",
                    "sid": 356,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 2 6.",
                    "sid": 357,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 12 .8 + d i c t i o n a r y d i s a m b i g u a t e d + h i e r a r c h i c a l l e x i c o n 57 .1 3 1.",
                    "sid": 358,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 2 6.",
                    "sid": 359,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 11 .8 5,00 0 B a s e l i n e 47 .4 3 8.",
                    "sid": 360,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 3 7.",
                    "sid": 361,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 17 .4 R e s t r u c t u r i n g 52 .1 3 4.",
                    "sid": 362,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 3 3.",
                    "sid": 363,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 15 .2 + d i c t i o n a r y d i s a m b i g u a t e d + h i e r a r c h i c a l l e x i c o n 52 .9 3 3.",
                    "sid": 364,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 3 1.",
                    "sid": 365,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 13 .7 0 B a s e l i n e 23 .3 5 3.",
                    "sid": 366,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 6 0.",
                    "sid": 367,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 29 .8 R e s t r u c t u r i n g 29 .1 5 0.",
                    "sid": 368,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 5 7.",
                    "sid": 369,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 30 .0 + d i c t i o n a r y d i s a m b i g u a t e d + h i e r a r c h i c a l l e x i c o n 32 .6 4 8.",
                    "sid": 370,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 5 2.",
                    "sid": 371,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 24 .1 proposed here, the corpus for training can be reduced to less than 10% of the original size while increasing the SSER only from 30.2% to 31.8% compared to the baseline when using the full corpus.",
                    "sid": 372,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training only on conventional dictionary: In this setup the impact of the hierarchical lexicon is clearly larger than the effect of the restructuring methods, because here the data sparseness problem is much more important than the word order problem.",
                    "sid": 373,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall relative reduction in terms of SSER is 13.7% and in terms of ISER 19.1%.",
                    "sid": 374,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An error rate of about 52% is still very poor, but it is close to what might be acceptable when only the gist of the translated document is needed, as is the case in the framework of document classification or multilingual information retrieval.",
                    "sid": 375,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples taken from the Verbmobil Eval2000 test set are given in Table 10.",
                    "sid": 376,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Smoothing the lexicon probabilities over the inflected forms of the same lemma enables the translation of sind as would instead of are.",
                    "sid": 377,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The smoothed lexicon contains the translation convenient for any inflected form of bequem.",
                    "sid": 378,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The comparative more convenient would be the completely correct translation.",
                    "sid": 379,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last two examples in the table demonstrate the effect of the disambiguating analyzer, which on the basis of the sentence context identifies Zimmer as plural (it has been translated into the singular form room by the baseline system) and das as an article to be translated by the instead of a pronoun which would be translated as that.",
                    "sid": 380,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last example demonstrates that over- fitting on domain-specific training can be problematic in some cases: Generally, because is a good translation for the coordinating conjunction denn, but in the appointment- scheduling domain, denn is often an adverb, and it often occurs in the same sentence as dann, as in Wie wa¨re es denn dann?.",
                    "sid": 381,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation for this sentence is something like How about then?.",
                    "sid": 382,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of the frequency of this domain-specific language use, the word form denn is often aligned to then in the training corpus.",
                    "sid": 383,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hierarchical 200 Table 10 Examples of the effect of the hierarchical lexicon.",
                    "sid": 384,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Input sind Sie mit einem Doppelzimmer einverstanden?",
                    "sid": 385,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Baseline are you agree with a double room?",
                    "sid": 386,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hierarchical lexicon would you agree with a double room?",
                    "sid": 387,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Input mit dem Zug ist es bequemer.",
                    "sid": 388,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Baseline by train it is UNKNOWN-bequemer.",
                    "sid": 389,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hierarchical lexicon by train it is convenient.",
                    "sid": 390,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Input wir haben zwei Zimmer.",
                    "sid": 391,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Baseline we have two room.",
                    "sid": 392,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hierarchical lexicon we have two rooms.",
                    "sid": 393,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Input ich wu¨ rde das Hilton vorschlagen denn es ist das beste.",
                    "sid": 394,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Baseline I would suggest that Hilton then it is the best.",
                    "sid": 395,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hierarchical lexicon I would suggest the Hilton because it is the best.",
                    "sid": 396,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "lexicon distinguishes the adverb reading and the conjunction reading, and the correct translation because is the highest-ranking one for the conjunction.",
                    "sid": 397,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.5.2 Results on the Nespole!",
                    "sid": 398,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Task.",
                    "sid": 399,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We were provided with a small GermanEnglish corpus from the Nespole!",
                    "sid": 400,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "project (see Section 7.1 for a description).",
                    "sid": 401,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From Table 5 it is obvious that this task is an example of very scarce training data, and it is thus interesting to test the performance of the methods proposed in this article on this task.",
                    "sid": 402,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same conventional dictionary as was used for the experiments on Verbmobil data (cf.",
                    "sid": 403,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6) complemented the small bilingual training corpus.",
                    "sid": 404,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the (monolingual) English part of the Verbmobil corpus was used in addition to the English part of the Nespole!",
                    "sid": 405,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "corpus for training the language model.",
                    "sid": 406,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 11 summarizes the results.",
                    "sid": 407,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Information items have not been defined for this test set.",
                    "sid": 408,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An overall relative improvement of 16.5% in the SSER can be achieved.",
                    "sid": 409,
                    "ssid": 137,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "8",
            "sents": [
                {
                    "text": "In this article we have proposed methods of incorporating morphological and syntactic information into systems for statistical machine translation.",
                    "sid": 410,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall goal was to improve translation quality and to reduce the amount of parallel text necessary to Table 11 Results for hierarchical lexicon model Nespole!",
                    "sid": 411,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“Restructuring” entails treatment of question inversion and separated verb prefixes as well as merging of phrases in both languages.",
                    "sid": 412,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same conventional dictionary was used as in the experiments the Verbmobil.",
                    "sid": 413,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The language model was trained on a combination of the English parts of the Nespole!",
                    "sid": 414,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "corpus and the Verbmobil corpus.",
                    "sid": 415,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BL EUm W ER SS ER Bas elin e 31.",
                    "sid": 416,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6% 50.",
                    "sid": 417,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2% 41.",
                    "sid": 418,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1% Res truc turi ng 33.",
                    "sid": 419,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 45.",
                    "sid": 420,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 38.",
                    "sid": 421,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 + h i e r a r c h i c a l l e x i c o n 36.",
                    "sid": 422,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 44.",
                    "sid": 423,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 34.",
                    "sid": 424,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 201 train the model parameters.",
                    "sid": 425,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Substantial improvements on the Verbmobil task and the Nespole!",
                    "sid": 426,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "task were achieved.",
                    "sid": 427,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some sentence-level restructuring transformations have been introduced which are motivated by knowledge about the sentence structure in the languages involved.",
                    "sid": 428,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These transformations aim at the assimilation of word orders in related sentences.A hierarchy of equivalence classes has been defined on the basis of morpholog ical and syntactic information beyond the surface forms.",
                    "sid": 429,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The study of the effect ofusing information from either degree of abstraction led to the construction of hier archical lexicon models, which combine different items of information in a log-linear way.",
                    "sid": 430,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The benefit from these combined models is twofold: First, the lexical coverage isimproved, because the translation of unseen word forms can be derived by consider ing information from lower levels in the hierarchy.",
                    "sid": 431,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, category ambiguity can be resolved, because syntactical context information is made locally accessible by means of annotation with morpho-syntactic tags.",
                    "sid": 432,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a side effect of the preparative work for setting up the underlying hierarchy of morpho-syntactic information, those pieces of information inherent in fully inflected word forms that are not relevant for translation are detected.A method for aligning corresponding readings in conventional dictionaries con taining pairs of fully inflected word forms has been proposed.",
                    "sid": 433,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach uses information deduced from one language side to resolve category ambiguity in thecorresponding entry in the other language.",
                    "sid": 434,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting disambiguated dictionar ies have proven to be better suited for improving the quality of machine translation, especially if they are used in combination with the hierarchical lexicon models.",
                    "sid": 435,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The amount of bilingual training data required to achieve an acceptable quality of machine translation has been systematically investigated.",
                    "sid": 436,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the methods mentioned previously contribute to a better exploitation of the available bilingual data and thus to improving translation quality in frameworks with scarce resources.",
                    "sid": 437,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Three setups fortraining the parameters of the statistical lexicon on Verbmobil data have been exam ined: (1) Using the full 58,000 sentences comprising the bilingual training corpus, (2) restricting the corpus to 5,000 sentences, and (3) using only a conventional dictionary.",
                    "sid": 438,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each of these setups, a relative improvement in terms of subjective sentence errorrate between 13% and 15% as compared to the baseline could be obtained using combi nations of the methods described in this article.",
                    "sid": 439,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The amount of bilingual training data could be reduced to less than 10% of the original corpus, while losing only 1.6% in accuracy as measured by the subjective sentence error rate.",
                    "sid": 440,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A relative improvement of 16.5% in terms of subjective sentence error rate could also be achieved on the Nespole!",
                    "sid": 441,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "task.",
                    "sid": 442,
                    "ssid": 33,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This work has been partially supported as part of the Verbmobil project (contract number 01 IV 701 T4) by the German Federal Ministry of Education, Science, Research and Technology and as part of the EuTrans project (project number 30268) by the European Union.",
                    "sid": 443,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the provision of the Nespole!",
                    "sid": 444,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "data we thank the Nespole!",
                    "sid": 445,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "consortium, listed on the project’s home page (Nespole!",
                    "sid": 446,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2000).",
                    "sid": 447,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Special thanks to Alon Lavie, Lori Levin, Stephan Vogel, and Alex Waibel (in alphabetical order).",
                    "sid": 448,
                    "ssid": 39,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}