{
    "ID": "J06-2001",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This article presents clustering experiments on German verbs: A statistical grammar model for German serves as the source for a distributional verb description at the lexical syntax–semantics interface, and the unsupervised clustering algorithm k-means uses the empirical verb properties to perform an automatic induction of verb classes.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Various evaluation measures are applied to compare the clustering results to gold standard German semantic verb classes under different criteria.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The primary goals of the experiments are (1) to empirically utilize and investigate the well-established relationship between verb meaning and verb behavior within a cluster analysis and (2) to investigate the required technical parameters of a cluster analysis with respect to this specific linguistic task.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The clustering methodology is developed on a small-scale verb set and then applied to a larger-scale verb set including 883 German verbs.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "motivation",
            "number": "1",
            "sents": [
                {
                    "text": "Semantic verb classes generalize over verbs according to their semantic properties, that is, they capture large amounts of verb meaning without defining the idiosyncratic details for each verb.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classes refer to a general semantic level, and idiosyncratic lexical semantic properties of the verbs are either added to the class description or left underspecified.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples for semantic verb classes are Position verbs such as liegen ‘lie’, sitzen ‘sit’, stehen ‘stand’, and Manner of Motion with a Vehicle verbs such as fahren ‘drive’, fliegen ‘fly’, rudern ‘row’.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Manual definitions of semantic verb classes exist for several languages, the most dominant examples concerning English (Levin 1993; Baker, Fillmore, and Lowe 1998) and Spanish (Va´ zquez et al. 2000).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the one hand, verb classes reduce redundancy in verb descriptions since they encode the common properties of verbs.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, verb classes can predict and refine properties of a verb that received insufficient empirical evidence, with reference to verbs in the same class: Under this criterion, a verb classification is especially useful for the pervasive problem of data sparseness in NLP, where little or no knowledge is provided for rare events.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the English verb classification by Levin (1993) has been used in NLP applications such as word sense disambiguation (Dorr and Jones 1996), machine translation (Dorr 1997), document classification (Klavans and Kan 1998), and subcategorization acquisition (Korhonen 2002).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To my knowledge, no comparable German verb classification is available so far; therefore, such a classification would provide a principled basis for filling a gap in available lexical knowledge.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "∗ Department of Computational Linguistics, Saarbru¨ cken, Germany.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email: schulte@coli.unisb.de.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Submission received: 1 September 2003; revised submission received: 5 September 2005; accepted for publication: 10 November 2005.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "© 2006 Association for Computational Linguistics How can we obtain a semantic classification of verbs while avoiding tedious manual definitions of the verbs and the classes?",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Few resources are semantically annotated and provide semantic information off-the-shelf such as FrameNet (Baker, Fillmore, and Lowe 1998; Fontenelle 2003) and PropBank (Palmer, Gildea, and Kingsbury 2005).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, the automatic construction of semantic classes typically benefits from a long- standing linguistic hypothesis that asserts a tight connection between the lexical meaning of a verb and its behavior: To a certain extent, the lexical meaning of a verb determines its behavior, particularly with respect to the choice of its arguments (Pinker 1989; Levin 1993; Dorr and Jones 1996; Siegel and McKeown 2000; Merlo and Stevenson 2001; Schulte im Walde and Brew 2002; Lapata and Brew 2004).",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even though the meaning–behavior relationship is not perfect, we can make this prediction: If we induce a verb classification on the basis of verb features describing verb behavior, then the resulting behavior classification should agree with a semantic classification to a certain extent (yet to be determined).",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The aim of this work is to utilize this prediction for the automatic acquisition of German semantic verb classes.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verb behavior itself is commonly captured by the diathesis alternation of verbs: alternative constructions at the syntax–semantics interface that express the same or a similar conceptual idea of a verb (Lapata 1999; Schulte im Walde 2000; McCarthy 2001; Merlo and Stevenson 2001; Joanis 2002).",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider example (1), where the most common alternations of the Manner of Motion with a Vehicle verb fahren ‘drive’ are illustrated.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The conceptual participants are a vehicle, a driver, a passenger, and a direction.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (a), the vehicle is expressed as the subject in a transitive verb construction, with a prepositional phrase indicating the direction.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (b), the driver is expressed as the subject in a transitive verb construction, with a prepositional phrase indicating the direction.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (c), the driver is expressed as the subject in a transitive verb construction, with an accusative noun phrase indicating the vehicle.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (d), the driver is expressed as the subject in a ditransitive verb construction, with an accusative noun phrase indicating the passenger, and a prepositional phrase indicating the direction.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even if a certain participant is not realized within an alternation, its contribution might be implicitly defined by the verb.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the German sentence in (a) the driver is not expressed overtly, but we know that there is a driver, and in (b) and (d) the vehicle is not expressed overtly, but we know that there is a vehicle.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verbs in the same semantic class are expected to overlap in their alternation behavior to a certain extent.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the Manner of Motion with a Vehicle verb fliegen ‘fly’ alternates between (a) such as in Der Airbus A380 fliegt nach New York ‘The Airbus A380 flies to New York’, (b) in marked cases as in Der a¨ltere Pilot fliegt nach London ‘The older pilot flies to London’, (c) as in Pilot Schulze fliegt eine Boing 747 ‘Pilot Schulze flies a Boing 747’, and (d) as in Der Pilot fliegt seine Passagiere nach Thailand ‘The pilot flies his passengers to Thailand’; the Manner of Motion with a Vehicle verb rudern ‘row’ alternates between (b) such as in Anna rudert u¨ ber den See ‘Anna rows over the lake’, (c) such as in Anna rudert das blaue Boot ‘Anna rows the blue boat’, and (d) such as in Anna rudert ihren kleinen Bruder u¨ ber den See ‘Anna rows her little brother over the lake’.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example 1 (a) Der Wagen fa¨hrt in die Innenstadt.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘The car drives to the city centre.’ (b) Die Frau fa¨hrt nach Hause.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘The woman drives home.’ 160 (c) Der Filius fa¨hrt einen blauen Ferrari.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘The son drives a blue Ferrari.’ (d) Der Junge fa¨hrt seinen Vater zum Zug.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘The boy drives his father to the train.’ We decided to use diathesis alternations as an approach to characterizing verb behavior, and to use the following verb features to stepwise describe diathesis alternations: (1) syntactic structures, which are relevant for capturing argument functions; (2) prepositions, which are relevant to distinguish, for example, directions from locations; and (3) selectional preferences, which concern participant roles.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A statistical grammar model serves as the source for an empirical verb description for the three levels at the syntax– semantics interface.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on the empirical feature description, we then perform a cluster analysis of the German verbs using k-means, a standard unsupervised hard clustering technique as proposed by Forgy (1965).",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The clustering outcome cannot be a perfect semantic verb classification, since the meaning–behavior relationship on which the clustering relies is not perfect, and the clustering method is not perfect for the ambiguous verb data.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, our primary goal is not necessarily to obtain the optimal clustering result, but rather to assess the linguistic and technical conditions that are crucial for a semantic cluster analysis.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More specifically, (1) we perform an empirical investigation of the relationship between verb meaning and verb behavior (that is, Can we use the meaning–behavior relationship of verbs to induce verb classes, and to what extent does the meaning–behavior relationship hold in the experiments?), and (2) we investigate which technical parameters are suitable for the natural language task.",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting clustering methodology can then be applied to a larger-scale verb set.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The plan of the article is as follows.",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2 describes the experimental setup with respect to (1) gold standard verb classes for 168 German verbs, (2) the statistical grammar model that provides empirical lexical information for German verbs at the syntax–semantics interface, and (3) the clustering algorithm and evaluation methods.",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 performs preliminary clustering experiments on the German gold standard verbs, and Section 4 presents an application of the clustering technique in a large-scale experiment.",
                    "sid": 45,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 5 discusses related work, and Section 6 presents the conclusions and outlook for further work.",
                    "sid": 46,
                    "ssid": 46,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental setup. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 German Semantic Verb Classes.",
                    "sid": 47,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A set of 168 German verbs was manually classified into 43 concise semantic verb classes.",
                    "sid": 48,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verb class labels refer to the common semantic properties of the verbs in a class at a general conceptual level, and the idiosyncratic lexical semantic properties of the verbs are left underspecified.",
                    "sid": 49,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The German verbs are provided with a coarse translation into English, given here in brackets; we do not attempt to define subtle differences in meaning or usage.",
                    "sid": 50,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translated verb senses only refer to the respective semantic class; if the verb translations in one class are too similar to distinguish among them, a common translation is given.",
                    "sid": 51,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even though the classification is primarily based on semantic intuition and not on facts about syntactic behavior, the verbs grouped in one class share certain aspects of their behavior.",
                    "sid": 52,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Please note that this overlap does not necessarily transfer to the English translations.)",
                    "sid": 53,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This agreement corresponds to the 161 long-standing linguistic hypothesis that asserts a tight connection between the meaning components of a verb and its behavior (Pinker 1989; Levin 1993).",
                    "sid": 54,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The purpose of the manual classification is to evaluate the reliability and performance of the clustering experiments.",
                    "sid": 55,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following facts refer to empirically relevant properties of the classification: The class size is between 2 and 7, with an average of 3.9 verbs per class.",
                    "sid": 56,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Eight verbs are ambiguous with respect to class membership and marked by subscripts.",
                    "sid": 57,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classes include both high- and low-frequency verbs in order to exercise the clustering technology in both data-rich and data-poor situations: The corpus frequencies of the verbs range from 8 to 71,604 (within 35 million words of a German newspaper corpus, cf.",
                    "sid": 58,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2.2).",
                    "sid": 59,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The class labels are given on two semantic levels: coarse labels such as Manner of Motion are subdivided into finer labels, such as Locomotion, Rotation, Rush, Vehicle, Flotation.",
                    "sid": 60,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fine-grained labels are relevant for the clustering experiments, as the numbering indicates.",
                    "sid": 61,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As mentioned before, the classification is primarily based on semantic intuition, not on facts about syntactic behavior.",
                    "sid": 62,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an extreme example, the Support class (23) contains the verb unterstu¨ tzen, which syntactically requires a direct object, together with the verbs dienen, folgen, and helfen, which dominantly subcategorize for an indirect object.",
                    "sid": 63,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classification was checked to ensure lack of bias, so class membership is not disproportionately made up of high- frequency verbs, low-frequency verbs, strongly ambiguous verbs, verbs from specific semantic areas, and so forth.",
                    "sid": 64,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classification deliberately sets high standards for the automatic induction process: It would be easier (1) to define the verb classes on a purely syntactic basis, since syntactic properties are easier to obtain automatically than semantic features, or (2) to define larger classes of verbs, so that the distinction between the classes is not based on fine-grained verb properties, or (3) to disregard clustering complications such as verb ambiguity and low-frequency verbs.",
                    "sid": 65,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But the overall goal is not to achieve a perfect clustering on the given 168 verbs but to investigate both the potential and the limits of our clustering methodology that combines easily available data with a simple algorithm.",
                    "sid": 66,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The task cannot be solved completely, but we can investigate the bounds.",
                    "sid": 67,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classification is defined as follows: 1.",
                    "sid": 68,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Aspect: anfangen, aufho¨ ren, beenden, beginnen, enden (start, stop,.",
                    "sid": 69,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "finish, begin, end) 2.",
                    "sid": 70,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Propositional Attitude: ahnen, denken, glauben, vermuten, wissen.",
                    "sid": 71,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(guess, think, believe, assume, know) • Desire",
                    "sid": 72,
                    "ssid": 26,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "wish: erhoffen, wollen, wu¨ nschen (hope, want, wish). ",
            "number": "3",
            "sents": [
                {
                    "text": "5.",
                    "sid": 73,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Transfer of Possession (Obtaining): bekommen, erhalten, erlangen,.",
                    "sid": 74,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "kriegen (all: receive/obtain) • Transfer of Possession (Giving) 6.",
                    "sid": 75,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gift: geben, leihen, schenken, spenden, stiften, vermachen,.",
                    "sid": 76,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "u¨ berschreiben (give, borrow, present, donate, donate, bequeath, sign over) 7.",
                    "sid": 77,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Supply: bringen, liefern, schicken, vermitteln1 , zustellen.",
                    "sid": 78,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(bring, deliver, send, convey, deliver) 162 • Manner of Motion 8.",
                    "sid": 79,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Locomotion: gehen, klettern, kriechen, laufen, rennen,.",
                    "sid": 80,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "schleichen, wandern (go, climb, creep, walk, run, sneak, wander) 9.",
                    "sid": 81,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rotation: drehen, rotieren (turn around, rotate).",
                    "sid": 82,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10.",
                    "sid": 83,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rush: eilen, hasten (both: hurry).",
                    "sid": 84,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "11.",
                    "sid": 85,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Vehicle: fahren, fliegen, rudern, segeln (drive, fly, row, sail).",
                    "sid": 86,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "12.",
                    "sid": 87,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Flotation: fließen, gleiten, treiben (float, glide, float).",
                    "sid": 88,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Emotion 13.",
                    "sid": 89,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Origin: a¨ rgern, freuen (be annoyed, be happy).",
                    "sid": 90,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "14.",
                    "sid": 91,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Expression: heulen1 , lachen1 , weinen (cry, laugh, cry).",
                    "sid": 92,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "15.",
                    "sid": 93,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Objection: a¨ ngstigen, ekeln, fu¨ rchten, scheuen (frighten,.",
                    "sid": 94,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "disgust, fear, be afraid) 16.",
                    "sid": 95,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Facial Expression: ga¨ hnen, grinsen, lachen2 , la¨ cheln, starren.",
                    "sid": 96,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(yawn, grin, laugh, smile, stare) 17.",
                    "sid": 97,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Perception: empfinden, erfahren1 , fu¨ hlen, ho¨ ren, riechen, sehen,.",
                    "sid": 98,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "wahrnehmen (feel, experience, feel, hear, smell, see, perceive) 18.",
                    "sid": 99,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Manner of Articulation: flu¨ stern, rufen, schreien (whisper, shout, scream).",
                    "sid": 100,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "19.",
                    "sid": 101,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moaning: heulen2 , jammern, klagen, lamentieren (all: wail/moan/.",
                    "sid": 102,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "complain) 20.",
                    "sid": 103,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Communication: kommunizieren, korrespondieren, reden, sprechen,.",
                    "sid": 104,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "verhandeln (communicate, correspond, talk, talk, negotiate) • Statement 21.",
                    "sid": 105,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Announcement: anku¨ ndigen, bekanntgeben, ero¨ ffnen,.",
                    "sid": 106,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "verku¨ nden (all: announce) 22.",
                    "sid": 107,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Constitution: anordnen, bestimmen, festlegen (arrange,.",
                    "sid": 108,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "determine, constitute) 23.",
                    "sid": 109,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Promise: versichern, versprechen, zusagen (ensure,.",
                    "sid": 110,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "promise, promise) 24.",
                    "sid": 111,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Observation: bemerken, erkennen, erfahren2 , feststellen, realisieren,.",
                    "sid": 112,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "registrieren (notice, realize, get to know, observe, realize, realize) 25.",
                    "sid": 113,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Description: beschreiben, charakterisieren, darstellen1 , interpretieren.",
                    "sid": 114,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(describe, characterize, describe, interpret) 26.",
                    "sid": 115,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Presentation: darstellen2 , demonstrieren, pra¨ sentieren, veranschaulichen,.",
                    "sid": 116,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "vorfu¨ hren (present, demonstrate, present, illustrate, demonstrate) 27.",
                    "sid": 117,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Speculation: gru¨ beln, nachdenken, phantasieren, spekulieren (muse,.",
                    "sid": 118,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "think about, fantasize, speculate) 28.",
                    "sid": 119,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Insistence: beharren, bestehen1 , insistieren, pochen (all: insist).",
                    "sid": 120,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "29.",
                    "sid": 121,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Teaching: beibringen, lehren, unterrichten, vermitteln2 (all: teach).",
                    "sid": 122,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Position 30.",
                    "sid": 123,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bring into Position: legen, setzen, stellen (lay, set, put upright).",
                    "sid": 124,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "31.",
                    "sid": 125,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Be in Position: liegen, sitzen, stehen (lie, sit, stand).",
                    "sid": 126,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "163 32.",
                    "sid": 127,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Production: bilden, erzeugen, herstellen, hervorbringen, produzieren.",
                    "sid": 128,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(all: generate/produce) 33.",
                    "sid": 129,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Renovation: dekorieren, erneuern, renovieren, reparieren (decorate,.",
                    "sid": 130,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "renew, renovate, repair) 34.",
                    "sid": 131,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Support: dienen, folgen1 , helfen, unterstu¨ tzen (serve, follow, help,.",
                    "sid": 132,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "support) 35.",
                    "sid": 133,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Quantum Change: erho¨ hen, erniedrigen, senken, steigern, vergro¨ ßern,.",
                    "sid": 134,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "verklenern (increase, decrease, decrease, increase, enlarge, diminish) 36.",
                    "sid": 135,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Opening: o¨ ffnen, schließen1 (open, close).",
                    "sid": 136,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "37.",
                    "sid": 137,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Existence: bestehen2 , existieren, leben (exist, exist, live).",
                    "sid": 138,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "38.",
                    "sid": 139,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consumption: essen, konsumieren, lesen, saufen, trinken (eat, consume,.",
                    "sid": 140,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "read, booze, drink) 39.",
                    "sid": 141,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Elimination: eliminieren, entfernen, exekutieren, to¨ ten, vernichten.",
                    "sid": 142,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(eliminate, delete, execute, kill, destroy) 40.",
                    "sid": 143,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basis: basieren, beruhen, gru¨ nden, stu¨ tzen (all: be based on).",
                    "sid": 144,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "41.",
                    "sid": 145,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inference: folgern, schließen2 (conclude, infer).",
                    "sid": 146,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "42.",
                    "sid": 147,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Result: ergeben, erwachsen, folgen2 , resultieren (all: follow/result).",
                    "sid": 148,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "43.",
                    "sid": 149,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Weather: blitzen, donnern, da¨ mmern, nieseln, regnen, schneien.",
                    "sid": 150,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(lightning, thunder, dawn, drizzle, rain, snow) The evidence used in the class creation process—including the choice of the verbs—was provided by subjective conceptual knowledge, monolingual and bilingual dictionary entries and corpus searches.",
                    "sid": 151,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Interannotator agreement has therefore not been addressed, but the classes were created in close relation to the English classification by Levin (1993) (as far as the English classes have German counterparts) and agree with the German verb classification by Schumacher (1986), as far as the relevant verbs are covered by his semantic ‘fields’.",
                    "sid": 152,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To overcome the drawback of a subjective class definition, the classification was accompanied by a detailed class description.",
                    "sid": 153,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This characterization is closely related to Fillmore’s scenes-and-frames semantics (Fillmore 1977, 1982), as computationally utilized in FrameNet (Baker, Fillmore, and Lowe 1998; Fontenelle 2003); there is no reference to the German FrameNet version (Erk, Kowalski, and Pinkal 2003)—as one might expect—just because the German version itself had just started to be developed.",
                    "sid": 154,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The frame-semantic class definition contains a prose scene description, predominant frame participant and modification roles, and frame variants describing the scene.",
                    "sid": 155,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The frame roles have been developed on the basis of a large German newspaper corpus from the 1990s (cf.",
                    "sid": 156,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2.2).",
                    "sid": 157,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They capture the scene description with idiosyncratic participant names and demarcate major and minor roles.",
                    "sid": 158,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since a scene might be activated by a number of frame embeddings, the predominant frame variants from the corpus are listed, marked with participating roles, and at least one example sentence for each verb utilizing the respective frame is given.",
                    "sid": 159,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus examples are annotated and illustrate the idiosyncratic combinations of lexical verb meaning and conceptual constructions to capture variations in verb sense.",
                    "sid": 160,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example 2 presents a verb class description for the class of Aspect verbs.",
                    "sid": 161,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For further class descrip 164 tions, the reader is referred to Schulte im Walde (2003a, pages 27–103).",
                    "sid": 162,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verbs allowing a frame variant are marked by “+,” verbs allowing the frame variant only in company of an additional adverbial modifier are marked by “+adv ,” and verbs not allowing a frame variant are marked by “.” In the case of ambiguity, frame variants are only given for the senses of the verbs with respect to the class label.",
                    "sid": 163,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The frame variants with their roles marked represent the alternation potential of the verbs.",
                    "sid": 164,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the causative– inchoative alternation assumes the syntactic embeddings nX aY and nY , indicating that the alternating verbs are realized by a transitive frame type (containing a nominative NP ‘n’ with role X and an accusative NP ‘a’ with role Y) and the corresponding intransitive frame type (with a nominative NP ‘n’ only, indicating the same role Y as for the transitive accusative).",
                    "sid": 165,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Passivization of a verb–frame combination is indicated by [P].",
                    "sid": 166,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Appendix 6 lists all possible frame variants with illustrative examples.",
                    "sid": 167,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the corpus examples are given in the old German spelling version, before the spelling reform in 1998.",
                    "sid": 168,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantic verb classes have been defined for several languages, for example, as the earlier mentioned lexicographic resource FrameNet for English (Baker, Fillmore, and Lowe 1998; Fontenelle 2003) and German (Erk, Kowalski, and Pinkal 2003); the lexical semantic ontology WordNet for English (Miller et al. 1990; Fellbaum 1998); EuroWordNet (Vossen 2004) for Dutch, Italian, Spanish, French, German, Czech, and Estonian, and further languages as listed in WordNets in the World (Global WordNet Association, www.globalwordnet.org); syntax–semantics based verb classes for English (Levin 1993), Spanish (Va´ zquez et al. 2000), and French (Saint-Dizier 1998).",
                    "sid": 169,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example 2 Aspect Verbs: anfangen, aufho¨ren, beenden, beginnen, enden Scene: [E An event] begins or ends, either internally caused or externally caused by [I an initiator].",
                    "sid": 170,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The event may be specified with respect to [T tense], [L location], [X an experiencer], or [R a result].",
                    "sid": 171,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Frame Roles: I(nitiator), E(vent) Modification Roles: T(emporal), L(ocal), (e)X(periencer), R(esult) Frame Participating Verbs and Corpus Examples nE + anfangen, aufho¨ ren, beginnen / +adv enden / beenden Nun aber muß [E der Dialog] anfangen.",
                    "sid": 172,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now though must the dialog begin Erst muß [E das Morden] aufho¨ ren.",
                    "sid": 173,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First must the killing stop [E Der Gottesdienst] beginnt.",
                    "sid": 174,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The service begins [E Das Schuljahr] beginnt [T im Februar].",
                    "sid": 175,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The school year begins in February [X Fu¨ r die Flu¨ chtlinge] beginnt nun [E ein Wettlauf gegen die Zeit].",
                    "sid": 176,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the fugitives begins now a race against time [E Die Ferien] enden [R mit einem großen Fest].",
                    "sid": 177,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The vacations end [E Druckkunst] with a big party ... endet [R beim guten Buch].",
                    "sid": 178,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The art of typesetting ... ends with a good book [E Der Informationstag] ... endet [T um 14 Uhr].",
                    "sid": 179,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The information day ... finishes at 2pm 165 nI + anfangen, aufho¨ ren / beenden, beginnen, enden ... daß [I er] [T pu¨ nktlich] anfing.",
                    "sid": 180,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "... that he in time begins Jetzt ko¨ nnen [I wir] nicht einfach aufho¨ ren.",
                    "sid": 181,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now can we not just stop Vielleicht sollte [I ich] aufho¨ ren und noch studieren.",
                    "sid": 182,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Maybe should I stop and yet study nI + anfangen, beenden, beginnen / aufho¨ ren, enden aE Nachdem [I wir] [E die Sache] angefangen haben, After we the thing have started [I Die Polizei] beendete [E die Gewaltta¨ tigkeiten].",
                    "sid": 183,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The police stopped the violence [T Nach dem Abi] beginnt [I Jens] [L in Frankfurt] [E seine Lehre] ...",
                    "sid": 184,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After the Abitur begins Jens in Frankfurt his apprenticeship ... nI + anfangen, beenden, beginnen / aufho¨ ren, enden aE Wenn [E die Arbeiten] [T vor dem Bescheid] angefangen werden ...",
                    "sid": 185,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the work before the notification is started ...",
                    "sid": 186,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[P] Wa¨ hrend [X fu¨ r Senna] [E das Rennen] beendet war ...",
                    "sid": 187,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While for Senna the race was finished ...",
                    "sid": 188,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "... ehe [E eine milita¨ rische Aktion] begonnen wird ...",
                    "sid": 189,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "... before a military action is begun nI + anfangen, aufho¨ ren, beginnen / beenden, enden iE [I Ich] habe angefangen, [E Hemden zu schneidern].",
                    "sid": 190,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I have started shirts to make ... daß [I der Alkoholiker] aufho¨ rt [E zu trinken].",
                    "sid": 191,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "... that the alcoholic stops to drink In dieser Stimmung begannen [I Ma¨ nner] [E Tango zu tanzen] ...",
                    "sid": 192,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this mood began men tango to dance nI + anfangen, aufho¨ ren, beginnen / beenden, enden pE : mit Erst als [I der versammelte Hofstaat] [E mit Klatschen] anfing, Only when the gathered royal household with applause [I Der Athlet] ... kann ...",
                    "sid": 193,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[E mit seinem Sport] aufho¨ ren.",
                    "sid": 194,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "began The athlete ... can ... with his sports stop [I Man] beginne [E mit eher katharsischen Werken].",
                    "sid": 195,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One starts with rather catharsic works nI +anfangen, aufho¨ ren, beginnen / beenden, enden pE : mit Und [E mit den Umbauarbeiten] ko¨ nnte angefangen werden.",
                    "sid": 196,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And with the reconstruction work could be begun [P] [E Mit diesem ungerechten Krieg] muß sofort aufgeho¨ rt werden.",
                    "sid": 197,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With this unjust war must immediately be stopped [T Vorher] du¨ rfe [E mit der Auflo¨ sung] nicht begonnen werden.",
                    "sid": 198,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Before must with the closing not be started 2.2 Empirical Distributions for German Verbs.",
                    "sid": 199,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We developed, implemented, and trained a statistical grammar model for German that is based on the framework of head-lexicalized, probabilistic, context-free grammars.",
                    "sid": 200,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idea originates from Charniak (1997), with this work using an implementation by Schmid (2000) for a training corpus of 35 million words from a collection of large German newspaper corpora from the 1990s, including Frankfurter Rundschau, Stuttgarter Zeitung, VDINachrichten, die tageszeitung, German Law Corpus, Donaukurier, and Computerzeitung.",
                    "sid": 201,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The statistical grammar model provides empirical lexical information, specializing in but not restricted to the subcategorization behavior of verbs.",
                    "sid": 202,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Details of 166 the implementation, training, and exploitation of the grammar model can be found in Schulte im Walde (2003a, chapter 3).",
                    "sid": 203,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The German verbs are represented by distributional vectors, with features and feature values in the distribution being acquired from the statistical grammar.",
                    "sid": 204,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The dis- tributional description is based on the hypothesis that “each language can be described in terms of a distributional structure, that is, in terms of the occurrence of parts relative to other parts” (cf.",
                    "sid": 205,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Harris 1968).",
                    "sid": 206,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs are described distributionally on three levels at the syntax–semantics interface, each level refining the previous level.",
                    "sid": 207,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first level D1 encodes a purely syntactic definition of verb subcategorization, the second level D2 encodes a syntactico-semantic definition of subcategorization with prepositional preferences, and the third level D3 encodes a syntactico-semantic definition of sub- categorization with prepositional and selectional preferences.",
                    "sid": 208,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the refinement of verb features starts with a purely syntactic definition and incrementally adds semantic information.",
                    "sid": 209,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most elaborated description comes close to a definition of verb alternation behavior.",
                    "sid": 210,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We decided on this three-step procedure of verb descriptions because the resulting clusters and particularly the changes in clusters that result from a change of features should provide insight into the meaning–behavior relationship at the syntax– semantics interface.For D1, the statistical grammar model provides frequency distributions for Ger man verbs over 38 purely syntactic subcategorization frames (cf.",
                    "sid": 211,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Appendix 6).",
                    "sid": 212,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on these frequencies, we can also calculate the probabilities.",
                    "sid": 213,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For D2, the grammar provides frequencies for the different kinds of prepositional phrases within a frame type; probabilities are computed by distributing the joint probability of a verb and a PP frame over the prepositional phrases according to their frequencies in the corpus.",
                    "sid": 214,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prepositional phrases are referred to by case and preposition, such as mitDat, fu¨ rAcc . The statistical grammar model does not learn the distinction between PP arguments and PP adjuncts perfectly.",
                    "sid": 215,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we did not restrict the PP features to PP arguments, but to 30 PPs according to ‘reasonable’ appearance in the corpus, as defined by the 30 most frequent PPs that appear with at least 10 different verbs.",
                    "sid": 216,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The subcategorization frame information for D1 and D2 has been evaluated: Schulte im Walde (2002b) describes the induction of a subcategorization lexicon from the grammar model for a total of 14,229 verbs with a frequency between 1 and 255,676 in the training corpus, and Schulte im Walde (2002a) performs an evaluation of the subcategorization data against manually created dictionary entries and shows that the lexical entries have potential for adding to and improving manual verb definitions.",
                    "sid": 217,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the refinement of D3, the grammar provides selectional preference information at a fine-grained level: It specifies the possible argument realizations in the form of lexical heads, with reference to a specific verb–frame–slot combination.",
                    "sid": 218,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obviously, we would run into a sparse data problem if we tried to incorporate selectional preferences into the verb descriptions at such a specific level.",
                    "sid": 219,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are provided with detailed information at the nominal level, but we need a generalization of the selectional preference definition.",
                    "sid": 220,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A widely used resource for selectional preference information is the semantic ontology WordNet (Miller et al. 1990; Fellbaum 1998); the University of Tu¨ bingen has developed the German version of WordNet, GermaNet (Hamp and Feldweg 1997; Kunze 2000).",
                    "sid": 221,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hierarchy is realized by means of synsets, sets of synonymous nouns, which are organized by multiple inheritance hyponym/hypernym relationships.",
                    "sid": 222,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A noun can appear in several synsets, according to its number of senses.",
                    "sid": 223,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The German noun hierarchy in GermaNet is utilized for the generalization of selectional preferences: For each noun in a verb–frame–slot combination, the joint frequency is divided over the different senses of the noun and propagated up the hierarchy.",
                    "sid": 224,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In case of multiple hypernym 167 synsets, the frequency is divided again.",
                    "sid": 225,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sum of frequencies over all top synsets equals the total joint frequency.",
                    "sid": 226,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Repeating the frequency assignment and propagation for all nouns appearing in a verb–frame–slot combination, the result defines a frequency distribution of the verb–frame–slot combination over all GermaNet synsets.",
                    "sid": 227,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To restrict the variety of noun concepts to a general level, only the frequency distributions over the top GermaNet nodes1 are considered: Lebewesen ‘creature’, Sache ‘thing’, Besitz ‘property’, Substanz ‘substance’, Nahrung ‘food’, Mittel ‘means’, Situation ‘situation’, Zustand ‘state’, Struktur ‘structure’, Physis ‘body’, Zeit ‘time’, Ort ‘space’, Attribut ‘attribute’, Kognitives Objekt ‘cognitive object’, Kognitiver Prozess ‘cognitive process’.",
                    "sid": 228,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the 15 nodes are mutually exclusive and the node frequencies sum to the total joint verb-frame frequency, we can use their frequencies to define a probability distribution.",
                    "sid": 229,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Are selectional preferences equally necessary and informative for all frame types?",
                    "sid": 230,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, selectional preferences for the direct object are expected to vary strongly with respect to the subcategorizing verb (because the direct object is a highly frequent argument type across all verbs and verb classes), but selectional preferences for a subject in a transitive construction with a nonfinite clause are certainly less interesting for refinement (because this frame type is more restricted with respect to the verbs it is subcategorized for).",
                    "sid": 231,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We empirically investigated which of the overall frame roles may be realized by different selectional preferences and are therefore relevant and informative for a selectional preference distinction.",
                    "sid": 232,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, in parts of the clustering experiments we will concentrate on a specific choice of frame-slot combinations to be refined by selectional preferences (with the relevant slots underlined): ‘n’, ‘na’, ‘nd’, ‘nad’, ‘nsdass.’ Table 1 presents three verbs from different classes and their 10 most frequent frame types at the three levels of verb definition and their probabilities.",
                    "sid": 233,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "D1 for beginnen ‘begin’ defines ‘np’ and ‘n’ as the most probable frame types.",
                    "sid": 234,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After splitting the ‘np’ probability over the different PP types in D2, a number of prominent PPs are left, the time indicating umAcc and nachDat , mitDat referring to the begun event, anDat as date, and inDat as place indicator.",
                    "sid": 235,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is obvious that not all PPs are argument PPs, but adjunct PPs also represent a part of the verb behavior.",
                    "sid": 236,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "D3 illustrates that typical selectional preferences for beginner roles are Situation ‘situation’, Zustand ‘state’, Zeit ‘time’, Sache ‘thing’.",
                    "sid": 237,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "D3 has the potential to indicate verb alternation behavior, for example, ‘na(Situation)’ refers to the same role for the direct object in a transitive frame as “n(Situation)” in an intransitive frame.",
                    "sid": 238,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": "essen ‘eat’ as an object-drop verb shows strong preferences for both intransitive and transitive usage.",
                    "sid": 239,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As desired, the argument roles are dominated by Lebewesen ‘creature’ for ‘n’ and ‘na’ and Nahrung ‘food’ for ‘na’.",
                    "sid": 240,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "fahren ‘drive’ chooses typical manner of motion frames (‘n,’ ‘np,’ ‘na’) with the refining PPs being directional (inAcc , zuDat , nachDat ) or referring to a means of motion (mitDat, inDat , aufDat ).",
                    "sid": 241,
                    "ssid": 169,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The selectional preferences show correct alternation behavior: Lebewesen ‘creature’ in the object drop case for ‘n’ and ‘na,’ Sache ‘thing’ in the inchoative/causative case for ‘n’ and ‘na’.",
                    "sid": 242,
                    "ssid": 170,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the absolute verb descriptions above, a simple smoothing technique is applied to the feature values.",
                    "sid": 243,
                    "ssid": 171,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The goal of smoothing is to create more uniform distributions, especially with regard to adjusting zero values, but also for assimilating high and low frequencies and probabilities.",
                    "sid": 244,
                    "ssid": 172,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The smoothed distributions are particularly interesting for distributions with a large number of features, since they typically contain 1 Since GermaNet had not been completed when we used the hierarchy, we manually added a few.",
                    "sid": 245,
                    "ssid": 173,
                    "kind_of_tag": "s"
                },
                {
                    "text": "hypernym definitions.",
                    "sid": 246,
                    "ssid": 174,
                    "kind_of_tag": "s"
                },
                {
                    "text": "168 Table 1 Example distributions of German verbs.",
                    "sid": 247,
                    "ssid": 175,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Distribution Verb D1 D2 D3 beg inn en np 0.4 3 n 0.2 8 n( Sit uat ion ) 0.1 2 ‘beg in’ n 0.2 8 np: um Acc 0.1 6 np :u mA cc (Si tua tio n) 0.0 9 ni 0.0 9 ni 0.0 9 np: mi tDat (Si tua tio n) 0.0 4 na 0.0 7 np: mi tDat 0.0 8 ni( Le be we sen ) 0.0 3 nd 0.0 4 na 0.0 7 n( Zu sta nd ) 0.0 3 na p 0.0 3 np: an Dat 0.0 6 np: an Dat (Si tua tio n) 0.0 3 na d 0.0 3 np: inD at 0.0 6 np: inD at (Si tua tio n) 0.0 3 nir 0.0 1 nd 0.0 4 n( Zei t) 0.0 3ns 2 0.0 1 na d 0.0 3 n( Sa che ) 0.0 2 xp 0.0 1 np: na ch Dat 0.0 1 na( Sit uat ion ) 0.0 2 esse n na 0.4 2 na 0.4 2 na( Le be we sen ) 0.3 3 ‘eat’ n 0.2 6 n 0.2 6 na( Na hr un g) 0.1 7 na d 0.1 0 na d 0.1 0 na( Sa che ) 0.0 9 np 0.0 6 nd 0.0 5 n( Le be we sen ) 0.0 8 nd 0.0 5ns 2 0.0 2 na( Le be we sen ) 0.0 7 na p 0.0 4 np: auf Dat 0.0 2 n( Na hr un g) 0.0 6ns 2 0.0 2ns w 0.0 1 n( Sa che ) 0.0 4ns w 0.0 1 ni 0.0 1 nd (L eb ew ese n) 0.0 4 ni 0.0 1 np: mi tDat 0.0 1 nd (N ahr un g) 0.0 2 nas2 0.0 1 np: inD at 0.0 1 na( Att rib ut) 0.0 2 fahr en n 0.3 4 n 0.3 4 n( Sa che ) 0.1 2 ‘dri ve’ np 0.2 9 na 0.1 9 n( Le be we sen ) 0.1 0 na 0.1 9 np: inA cc 0.0 5 na( Le be we sen ) 0.0 8 na p 0.0 6 na d 0.0 4 na( Sa che ) 0.0 6 na d 0.0 4 np: zu Dat 0.0 4 n( Ort ) 0.0 6 nd 0.0 4 nd 0.0 4 na( Sa ch e) 0.0 5 ni 0.0 1 np: na ch Dat 0.0 4 np: inA cc (Sa che ) 0.0 2ns 2 0.0 1 np: mi tDat 0.0 3 np :zu Dat (Sa che ) 0.0 2 nd p 0.0 1 np: inD at 0.0 3 np: inA cc (L eb ew ese n) 0.0 2ns w 0.0 1 np: auf Dat 0.0 2 np: na ch Dat (Sa che ) 0.0 2 persuasive zero values and severe outliers.",
                    "sid": 248,
                    "ssid": 176,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chen and Goodman (1998) present a concise overview of smoothing techniques, with specific emphasis on language modeling.",
                    "sid": 249,
                    "ssid": 177,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We decided to apply the smoothing algorithm referred to as additive smoothing: The smoothing is performed simply by adding 0.5 to all verb features, that is, the joint frequency of each verb v and feature xi is changed by freqt (v, xi ) = freq(v, xi ) + 0.5.",
                    "sid": 250,
                    "ssid": 178,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The total verb frequency is adapted to the changed feature values, representing the sum of all verb feature values: vfreql = L;i freqt (v, xi ).",
                    "sid": 251,
                    "ssid": 179,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Smoothed probability values are based on the smoothed frequency distributions.",
                    "sid": 252,
                    "ssid": 180,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Clustering Algorithm and Evaluation Techniques.",
                    "sid": 253,
                    "ssid": 181,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clustering is a standard procedure in multivariate data analysis.",
                    "sid": 254,
                    "ssid": 182,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is designed to allow exploration of the inherent natural structure of the data objects, where objects in the same cluster are as similar as possible and objects in different clusters are as dissimilar as possible.",
                    "sid": 255,
                    "ssid": 183,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Equivalence classes induced by the clusters provide a means for 169 generalizing over the data objects and their features.",
                    "sid": 256,
                    "ssid": 184,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The clustering of the German verbs is performed by the k-means algorithm, a standard unsupervised clustering technique as proposed by Forgy (1965).",
                    "sid": 257,
                    "ssid": 185,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With k-means, initial verb clusters are iteratively reorganized by assigning each verb to its closest cluster and recalculating cluster centroids until no further changes take place.",
                    "sid": 258,
                    "ssid": 186,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Applying the k-means algorithm assumes (1) that verbs are represented by distributional vectors and (2) that verbs that are closer to each other in a mathematically defined way are also more similar to each other in a linguistic way.",
                    "sid": 259,
                    "ssid": 187,
                    "kind_of_tag": "s"
                },
                {
                    "text": "k-Means depends on the following parameters: (1) The number of clusters is not known beforehand, so the clustering experiments investigate this parameter.",
                    "sid": 260,
                    "ssid": 188,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Related to this parameter is the level of semantic concept: The more verb clusters are found, the more specific the semantic concept, and vice versa.",
                    "sid": 261,
                    "ssid": 189,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) k-means is sensitive to the initial clusters, so the initialization is varied according to how much preprocessing we invest: Both random clusters and hierarchically preprocessed clusters are used as initial clusters for k-means.",
                    "sid": 262,
                    "ssid": 190,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of preprocessed clusters, the hierarchical clustering is performed as bottom-up agglomerative clustering with the following criteria for merging the clusters: single linkage (minimal distance between nearest neighbor verbs), complete linkage (minimal distance between furthest neighbor verbs), average distance between verbs, distance between cluster centroids, and Ward’s method (minimizing the sum of squares when merging clusters).",
                    "sid": 263,
                    "ssid": 191,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The merging method influences the shape of the clusters; for example, single linkage causes a chaining effect in the shape of the clusters, and complete linkage creates compact clusters.",
                    "sid": 264,
                    "ssid": 192,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) In addition, there are several possibilities for defining the similarity between distributional vectors.",
                    "sid": 265,
                    "ssid": 193,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But which best fits the idea of verb similarity?",
                    "sid": 266,
                    "ssid": 194,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 presents an overview of relevant similarity measures that are applied in the experiments.",
                    "sid": 267,
                    "ssid": 195,
                    "kind_of_tag": "s"
                },
                {
                    "text": "x and y refer to the verb object vectors, their subscripts to the verb feature values.",
                    "sid": 268,
                    "ssid": 196,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Minkowski metric can be applied to frequencies and probabilities.",
                    "sid": 269,
                    "ssid": 197,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is a generalization of the two well-known instances q = 1 (Manhattan distance) and q = 2 (Euclidean distance).",
                    "sid": 270,
                    "ssid": 198,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Kullback–Leibler divergence (KL) is a measure from information theory that determines the inefficiency of assuming a model probability distribution given the true distribution (Cover and Thomas 1991).",
                    "sid": 271,
                    "ssid": 199,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The KL divergence is not defined in case yi = 0, so the probability distributions need to be smoothed.",
                    "sid": 272,
                    "ssid": 200,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two variants of KL, information radius and skew divergence, perform a default smoothing.",
                    "sid": 273,
                    "ssid": 201,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both variants can tolerate zero values in the distribution because they work with a weighted average of the two distributions compared.",
                    "sid": 274,
                    "ssid": 202,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lee (2001) has shown that the skew divergence is an effective measure for distributional similarity in NLP.",
                    "sid": 275,
                    "ssid": 203,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly to Lee’s method, we set the weight w for the skew divergence to 0.9.",
                    "sid": 276,
                    "ssid": 204,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cosine measures the similarity of the two object vectors x and y by calculating the cosine of the angle between the feature vectors.",
                    "sid": 277,
                    "ssid": 205,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cosine measure can be applied to frequency and probability values.",
                    "sid": 278,
                    "ssid": 206,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a detailed description of hierarchical clustering techniques and an intuitive interpretation of the similarity measures, the reader is referred to, for example, Kaufman and Rousseeuw (1990).",
                    "sid": 279,
                    "ssid": 207,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is no agreed standard method for evaluating clustering experiments and results, but a variety of evaluation measures from diverse areas such as theoretical statistics, machine vision, and Web-page clustering are generally applicable.",
                    "sid": 280,
                    "ssid": 208,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the following two measures for the evaluation: (1) Hatzivassiloglou and McKeown (1993) define and evaluate a cluster analysis of adjectives, based on common cluster membership of object pairs in the clustering C and the manual classification M. Recall and precision numbers are calculated in the standard way, with true positives the number of common pairs in M and C, false positives the number of pairs in C, but not M, and false negatives the number of pairs in M, but not C. We use the f -score pairF (as harmonic mean between recall and precision), which provides an easy to understand 170 Table 2 Data similarity measures.",
                    "sid": 281,
                    "ssid": 209,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Measure Definition Minkowski metric / Lq norm Lq (x, y) = q L;n |xi − yi | Manhattan distance / L1 norm L1 (x, y) = L;n |xi − yi | Euclidean distance / L2 norm L2 (x, y) = L;n (xi − yi )2 xi KL divergence / relative entropy D(x||y) = L;n xi ∗ log yi Information radius IRad(x, y) = D(x|| x+y ) + D(y|| x+y ) 2 2 Skew divergence Skew(x, y) = D(x||w ∗ y + (1 − w) ∗ x) Cosine cos(x, y) = L;i=1 xi ∗ yi i=1 x2 . n i=1 i percentage.",
                    "sid": 282,
                    "ssid": 210,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) The adjusted Rand index is a measure of agreement versus disagreement between object pairs in clusterings that provides the most appropriate reference to a null model (Hubert and Arabie 1985); cf.",
                    "sid": 283,
                    "ssid": 211,
                    "kind_of_tag": "s"
                },
                {
                    "text": "equation (1).",
                    "sid": 284,
                    "ssid": 212,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The agreement in the two partitions is represented by a contingency table C × M: tij denotes the number of verbs common to classes Ci in the clustering partition C and Mj in the manual classification M; the marginals ti.",
                    "sid": 285,
                    "ssid": 213,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and t.j refer to the number of objects in Ci and Mj , respectively; the expected number of common object pairs attributable to a particular cell (Ci , Mj ) in the contingency table is defined by ti.",
                    "sid": 286,
                    "ssid": 214,
                    "kind_of_tag": "s"
                },
                {
                    "text": "t.j / n . The upper bound for Randadj is 1, the lower 2 2 2 bound is mostly 0, with only extreme cases below zero.",
                    "sid": 287,
                    "ssid": 215,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ti.",
                    "sid": 288,
                    "ssid": 216,
                    "kind_of_tag": "s"
                },
                {
                    "text": "t.j Randadj (C, M) = i,j 2 − L;i ( 2 ) L;j ( 2 ) 2 ) t t (1) 1 ti.",
                    "sid": 289,
                    "ssid": 217,
                    "kind_of_tag": "s"
                },
                {
                    "text": "t.j L;i ( 2 ) L;j ( 2 ) 2 (L;i 2 + L;j 2 ) − i. .j 2 ) The above two measures were chosen as a result of comparing various evaluation measures and their properties with respect to the linguistic task (Schulte im Walde 2003a, chapter 4).",
                    "sid": 290,
                    "ssid": 218,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 291,
                    "ssid": 219,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preliminary Clustering Experiments.",
                    "sid": 292,
                    "ssid": 220,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 168 German verbs are associated with distributional vectors over frame types and assigned to initial clusters.",
                    "sid": 293,
                    "ssid": 221,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then k-means is allowed to run for as many iterations as it takes to reach a fixed point, and the resulting clusters are interpreted and evaluated against the manual classes.",
                    "sid": 294,
                    "ssid": 222,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs are described by D1–D3, and each level refers to frequencies and probabilities, with original and smoothed values.",
                    "sid": 295,
                    "ssid": 223,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The initial clusters for k-means are generated either randomly or by a preprocessing cluster analysis, that is, hierarchical clustering as described in Section 2.3.",
                    "sid": 296,
                    "ssid": 224,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For random cluster initialization the verbs are randomly assigned to a cluster, with cluster numbers between 1 and the number of manual classes.",
                    "sid": 297,
                    "ssid": 225,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments are performed with the number of k clusters being fixed to the number of gold standard classes (43); optimization of the number of clusters is addressed in Section 3.4.",
                    "sid": 298,
                    "ssid": 226,
                    "kind_of_tag": "s"
                },
                {
                    "text": "171 3.1 Baseline and Upper Bound.",
                    "sid": 299,
                    "ssid": 227,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiment baseline refers to 50 random clusterings: The verbs are randomly assigned to a cluster (with a cluster number between 1 and the number of manual classes), and the resulting clustering is evaluated by the evaluation measures.",
                    "sid": 300,
                    "ssid": 228,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline value is the average value of the 50 repetitions.",
                    "sid": 301,
                    "ssid": 229,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The upper bound of the experiments (the “optimum”) refers to the evaluation values on the manual classification; the manual classification is adapted before calculating the upper bound by randomly deleting additional senses (i.e., more than one sense) of a verb, so as to leave only one sense for each verb, since k-means as a hard clustering algorithm cannot model ambiguity.",
                    "sid": 302,
                    "ssid": 230,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 lists the baseline and upper bound values for the clustering experiments.",
                    "sid": 303,
                    "ssid": 231,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Experiment Results.",
                    "sid": 304,
                    "ssid": 232,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following tables present the results of the clustering experiments.",
                    "sid": 305,
                    "ssid": 233,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tables 4 to 7 each concentrate on one technical parameter of the clustering process; Tables 8 to 10 then focus on performing clustering with a fixed parameter set, in order to vary the linguistically interesting parameters concerning the feature choice for the verbs.",
                    "sid": 306,
                    "ssid": 234,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All significance tests have been performed with χ2 , df = 1, α = 0.05.",
                    "sid": 307,
                    "ssid": 235,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 illustrates the effect of the distribution units (frequencies and probabilities) on the clustering result.",
                    "sid": 308,
                    "ssid": 236,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments use distributions on D1 and D2 with random and preprocessed initialization, and the cosine as similarity measure (since it works for both distribution units).",
                    "sid": 309,
                    "ssid": 237,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To summarize the results, neither the differences between frequencies and probabilities nor between original and smoothed values are significant.Table 5 illustrates the usage of different similarity measures.",
                    "sid": 310,
                    "ssid": 238,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As before, the exper iments are performed for D1 and D2 with random and preprocessed initialization.",
                    "sid": 311,
                    "ssid": 239,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The similarity measures are applied to the relevant probability distributions (as the distribution unit that can be used for all measures).",
                    "sid": 312,
                    "ssid": 240,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tables point out that there is no best-performing similarity measure in the clustering processes.",
                    "sid": 313,
                    "ssid": 241,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the larger feature set, the Kullback–Leibler variants information radius and skew divergence tend to outperform all other similarity measures.",
                    "sid": 314,
                    "ssid": 242,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, the skew divergence is the only measure that shows significant differences for some parameter settings, as compared to all other measures except information radius.",
                    "sid": 315,
                    "ssid": 243,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In further experiments, we will therefore concentrate on the two Kullback–Leibler variants.",
                    "sid": 316,
                    "ssid": 244,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tables 6 and 7 compare the effects of varying the initialization of the k-means algorithm.",
                    "sid": 317,
                    "ssid": 245,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments are performed for D1 and D2 with probability distributions, using the similarity measures information radius and skew divergence.",
                    "sid": 318,
                    "ssid": 246,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For random and hierarchical initialization, we cite both the evaluation scores for the k-means initial cluster analysis (i.e., the output clustering from the random assignment or the preprocessing hierarchical analysis), and for the k-means result.",
                    "sid": 319,
                    "ssid": 247,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The manual columns in the tables refer to a cluster analysis where the initial clusters provided to Table 3 k-means experiment baseline and upper bound.",
                    "sid": 320,
                    "ssid": 248,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Eva luat ion Ba sel ine Op ti m u m Pair F 2 . 0 8 9 5 . 8 1 Ran dadj − 0.",
                    "sid": 321,
                    "ssid": 249,
                    "kind_of_tag": "s"
                },
                {
                    "text": "00 4 0 . 9 0 9 172 Table 4 Comparing distributions on D1 and D2.",
                    "sid": 322,
                    "ssid": 250,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Distribution: D1 Distribution: D2 Probability Frequency Probability Frequency Eval Init ial Ori gina l Sm ooth ed Ori gina l Sm oot hed Ori gina l Sm oot hed Ori gina l Sm ooth ed Pair F Ran do m 12.",
                    "sid": 323,
                    "ssid": 251,
                    "kind_of_tag": "s"
                },
                {
                    "text": "67 12.",
                    "sid": 324,
                    "ssid": 252,
                    "kind_of_tag": "s"
                },
                {
                    "text": "72 14.",
                    "sid": 325,
                    "ssid": 253,
                    "kind_of_tag": "s"
                },
                {
                    "text": "06 14.",
                    "sid": 326,
                    "ssid": 254,
                    "kind_of_tag": "s"
                },
                {
                    "text": "14 14.",
                    "sid": 327,
                    "ssid": 255,
                    "kind_of_tag": "s"
                },
                {
                    "text": "98 15.",
                    "sid": 328,
                    "ssid": 256,
                    "kind_of_tag": "s"
                },
                {
                    "text": "37 14.",
                    "sid": 329,
                    "ssid": 257,
                    "kind_of_tag": "s"
                },
                {
                    "text": "82 1 5.",
                    "sid": 330,
                    "ssid": 258,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 7H War d 11.",
                    "sid": 331,
                    "ssid": 259,
                    "kind_of_tag": "s"
                },
                {
                    "text": "40 11.",
                    "sid": 332,
                    "ssid": 260,
                    "kind_of_tag": "s"
                },
                {
                    "text": "70 11.",
                    "sid": 333,
                    "ssid": 261,
                    "kind_of_tag": "s"
                },
                {
                    "text": "56 11.",
                    "sid": 334,
                    "ssid": 262,
                    "kind_of_tag": "s"
                },
                {
                    "text": "37 10.",
                    "sid": 335,
                    "ssid": 263,
                    "kind_of_tag": "s"
                },
                {
                    "text": "57 13.",
                    "sid": 336,
                    "ssid": 264,
                    "kind_of_tag": "s"
                },
                {
                    "text": "71 11.",
                    "sid": 337,
                    "ssid": 265,
                    "kind_of_tag": "s"
                },
                {
                    "text": "65 9 . 9 8 Ran da Ran do m 0.",
                    "sid": 338,
                    "ssid": 266,
                    "kind_of_tag": "s"
                },
                {
                    "text": "09 0 0.",
                    "sid": 339,
                    "ssid": 267,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 9 0 0.",
                    "sid": 340,
                    "ssid": 268,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10 2 0.",
                    "sid": 341,
                    "ssid": 269,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 0 2 0.",
                    "sid": 342,
                    "ssid": 270,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10 4 0.",
                    "sid": 343,
                    "ssid": 271,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 1 3 0.",
                    "sid": 344,
                    "ssid": 272,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10 7 0 . 1 0 9H War d 0.",
                    "sid": 345,
                    "ssid": 273,
                    "kind_of_tag": "s"
                },
                {
                    "text": "07 9 0.",
                    "sid": 346,
                    "ssid": 274,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 8 1 0.",
                    "sid": 347,
                    "ssid": 275,
                    "kind_of_tag": "s"
                },
                {
                    "text": "08 0 0.",
                    "sid": 348,
                    "ssid": 276,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 7 6 0.",
                    "sid": 349,
                    "ssid": 277,
                    "kind_of_tag": "s"
                },
                {
                    "text": "06 5 0.",
                    "sid": 350,
                    "ssid": 278,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 9 6 0.",
                    "sid": 351,
                    "ssid": 279,
                    "kind_of_tag": "s"
                },
                {
                    "text": "07 5 0 . 0 5 6 Table 5 Comparing similarity measures on D1 and D2.",
                    "sid": 352,
                    "ssid": 280,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarity Measure D1 D2 Eval In iti al C os L 1 Eu cl IR ad Sk ew C os L 1 Eu cl IR ad Sk ew Pair F Ra nd om 12.6 7 13.1 1 13.8 5 14.1 9 14.1 3 14.9 8 15.2 0 16.1 0 16.1 5 18.0 1H Wa rd 11.4 0 13.6 5 12.8 8 13.0 7 12.6 4 10.5 7 15.5 1 13.1 1 17.4 9 19.3 0 Ran da Ra nd om 0.0 90 0.0 94 0.1 01 0.1 01 0.1 05 0.1 04 0.1 09 0.1 23 0.1 18 0.1 42H Wa rd 0.0 79 0.0 99 0.0 93 0.0 97 0.0 94 0.0 65 0.1 16 0.0 92 0.1 42 0.1 58 k-means are the manual classification, that is, the gold standard.",
                    "sid": 353,
                    "ssid": 281,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An optimal cluster analysis should realize the “perfect” clustering and not perform any reorganization of the clusters.",
                    "sid": 354,
                    "ssid": 282,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the experiments, k-means does perform iterations, so the clustering result is suboptimal.",
                    "sid": 355,
                    "ssid": 283,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This finding is caused by the syntax–semantics mismatches, which we deliberately included in the definition of the gold standard (recall, e.g., that unterstu¨ tzen is syntactically very different compared to the other three Support verbs).",
                    "sid": 356,
                    "ssid": 284,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, the results not only show that the feature sets are suboptimal, but also that the loss in quality is less for the linguistically refined feature level D2 compared to D1, as we would have hoped.",
                    "sid": 357,
                    "ssid": 285,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For random clustering initialization to k-means, the tables present both the best and the average clustering results.",
                    "sid": 358,
                    "ssid": 286,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best results are paired with the evaluation of their initial clusters, that is, the random clusterings.",
                    "sid": 359,
                    "ssid": 287,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the tables show, the initial clusters receive low evaluation scores.",
                    "sid": 360,
                    "ssid": 288,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typically, the clusterings consist of clusters with rather homogeneous numbers of verbs, but the perturbation within the clusters is high, as expected.",
                    "sid": 361,
                    "ssid": 289,
                    "kind_of_tag": "s"
                },
                {
                    "text": "k-means is able to cope with the high degree of perturbation: The resulting clusters improve significantly and are comparable with those based on preprocessed hierarchical clustering; this competitiveness vanishes with an increasing number of features.",
                    "sid": 362,
                    "ssid": 290,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The average values of the random initialization experiments are clearly below the best ones, but not significantly different.",
                    "sid": 363,
                    "ssid": 291,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cluster analyses as based on agglomerative hierarchical clustering with single-linkage amalgamation are evaluated as poor compared to the gold standard.",
                    "sid": 364,
                    "ssid": 292,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result is probably due to the chaining effect in the clustering, which is characteristic for single linkage; the effect is observable in the analysis, which typically contains one very large cluster and many clusters with few verbs, mostly singletons.",
                    "sid": 365,
                    "ssid": 293,
                    "kind_of_tag": "s"
                },
                {
                    "text": "k-means obviously cannot compensate for this strong bias in cluster sizes (and their respective centroids); the reorganization improves the clusterings, but the result is still worse than for any other initialization.",
                    "sid": 366,
                    "ssid": 294,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With average distance and centroid distance amalgamation, both the clusterings and the evaluation results are less extreme than with single linkage since the chaining effect is smoothed.",
                    "sid": 367,
                    "ssid": 295,
                    "kind_of_tag": "s"
                },
                {
                    "text": "173 Table 6 Comparing clustering initializations on D1.",
                    "sid": 368,
                    "ssid": 296,
                    "kind_of_tag": "s"
                },
                {
                    "text": "k-means Initialization Random Eval Distance Manual Best Avg PairF IRad 18.56 2.16 → 14.19 11.78 Skew 20.00 1.90 → 14.13 12.17 Randa IRad 0.150 −0.004 → 0.101 0.078 Skew 0.165 −0.005 → 0.105 0.083 k-means Initialization Hierarchical Eval Distance Single Complete Average Centroid Ward PairF IRad 4.80 → 12.73 9.43 → 10.16 10.83 → 11.33 8.77 → 11.88 12.76 → 13.07 Skew 4.81 → 13.04 11.50 → 11.00 11.68 → 11.41 8.83 → 11.45 12.44 → 12.64 Ran da IR ad 0.0 00 → 0.0 88 0.0 55 → 0.0 65 0.067 → 0.072 0.0 39 → 0.0 79 0.094 → 0.097 Sk e w 0.0 00 → 0.0 90 0.0 77 → 0.0 72 0.075 → 0.073 0.0 41 → 0.0 72 0.092 → 0.094 The overall results are better than for single linkage, but only slightly improved by k-means.",
                    "sid": 369,
                    "ssid": 297,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hierarchical clusters as based on complete-linkage amalgamation are more compact, and result in a closer fit to the gold standard than the previous methods.",
                    "sid": 370,
                    "ssid": 298,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hierarchical initialization is only slightly improved by k-means; in some cases the k-means output is worse than its hierarchical initialization.",
                    "sid": 371,
                    "ssid": 299,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ward’s method seems to work best on hierarchical clusters and k-means initialization.",
                    "sid": 372,
                    "ssid": 300,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cluster sizes are more balanced and correspond to compact cluster shapes.",
                    "sid": 373,
                    "ssid": 301,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As for complete linkage, k-means improves the clusterings only slightly; in some cases the k-means output is worse than its hierarchical initialization.",
                    "sid": 374,
                    "ssid": 302,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A cluster analysis based on Ward’s hierarchical clusters performs best of all the applied methods, especially with an increasing number of features.",
                    "sid": 375,
                    "ssid": 303,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The similarity of Ward’s clusters (and similarly complete linkage clusters) Table 7 Comparing clustering initializations on D2.",
                    "sid": 376,
                    "ssid": 304,
                    "kind_of_tag": "s"
                },
                {
                    "text": "k-means Initialization Random Eval Distance Manual Best Avg PairF IRad 40.23 1.34 → 16.15 13.37 Skew 47.28 2.41 → 18.01 14.07 Randa IRad 0.358 0.001 → 0.118 0.093 Skew 0.429 −0.002 → 0.142 0.102 k-means Initialization Hierarchical Eval Distance Single Complete Average Centroid Ward PairF IRad 5.06 → 11.12 15.37 → 14.44 10.50 → 10.64 9.16 → 12.90 17.86 → 17.49 Skew 5.20 → 10.64 15.21 → 13.81 10.02 → 10.02 9.04 → 10.91 15.86 → 15.23 Ran da IR ad 0.0 03 → 0.0 63 0.1 14 → 0.1 05 0.059 → 0.060 0.0 45 → 0.0 82 0.145 → 0.142 Sk e w 0.0 04 → 0.0 63 0.1 15 → 0.1 02 0.054 → 0.054 0.0 42 → 0.0 64 0.158 → 0.158 174 and k-means is not by chance, since these methods aim to optimize the same criterion, the sum of distances between the verbs and their respective cluster centroids.",
                    "sid": 377,
                    "ssid": 305,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that for D2, Ward’s method actually significantly outperforms all other initialization methods, complete linkage significantly outperforms all but Ward’s. Between single linkage, average and centroid distance, there are no significant differences.",
                    "sid": 378,
                    "ssid": 306,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For D1, there are no significant differences between the initializations.",
                    "sid": 379,
                    "ssid": 307,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The low scores in the tables might be surprising to the reader, but they reflect the difficulty of the task.",
                    "sid": 380,
                    "ssid": 308,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As mentioned before, we deliberately set high demands for the gold standard, especially with reference to the fine-grained, small classes.",
                    "sid": 381,
                    "ssid": 309,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared to related work (cf.",
                    "sid": 382,
                    "ssid": 310,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 5), our results achieve lower scores because the task is more difficult; for example, Merlo and Stevenson (2001) classify 60 verbs into 3 classes, and Siegel and McKeown (2000) classify 56 verbs into 2 classes, as compared to our clustering, which assigns 168 verbs to 43 classes.",
                    "sid": 383,
                    "ssid": 311,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following illustrations should provide an intuition about the difficulty of the task: 1.",
                    "sid": 384,
                    "ssid": 312,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a set of additional experiments, a random choice of a reduced number.",
                    "sid": 385,
                    "ssid": 313,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of 5/10/15/20 classes from the gold standard is performed.",
                    "sid": 386,
                    "ssid": 314,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs from the respective gold standard classes are clustered with the optimal parameter set (see Table 8), which results in a pairwise f-score PairF of 22.19%.",
                    "sid": 387,
                    "ssid": 315,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The random choice and the cluster analysis are repeated 20 times for each reduced gold standard size of 5/10/15/20 classes, and the average PairF is calculated: The results are 45.27/35.64/30.30/26.62%, respectively.",
                    "sid": 388,
                    "ssid": 316,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This shows that the clustering results are much better (with the same kind of data and features and the same algorithm) when applied to a smaller number of verbs and classes.",
                    "sid": 389,
                    "ssid": 317,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 390,
                    "ssid": 318,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Imagine a gold standard of three classes with four members each, for.",
                    "sid": 391,
                    "ssid": 319,
                    "kind_of_tag": "s"
                },
                {
                    "text": "example, {{a, b, c, d}, {e, f, g, h}, {i, j, k, l}}.",
                    "sid": 392,
                    "ssid": 320,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a cluster analysis of these elements into three clusters resulted in an almost perfect choice of {{a, b, c, d, e}, {f, g, h}, {i, j, k, l}} where only e is assigned to a ”wrong” class, the pairwise precision is 79%, the recall is 83%, and pairF is 81%, so the decrease of pairF with only one mistake is almost 20%.",
                    "sid": 393,
                    "ssid": 321,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If another cluster analysis resulted in a choice with just one more mistake such as {{a, b, c, d, e, i}, {f, g, h}, {j, k, l}} where i is also assigned to a ”wrong” class, the result decreases by almost another 20%, to a precision of 57%, a recall of 67%, and pairF of 62%.",
                    "sid": 394,
                    "ssid": 322,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results show how much impact a few mistakes may have on the pairwise f-score of the results.",
                    "sid": 395,
                    "ssid": 323,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to defining a difficult task, we also chose strong evaluation measures: Evaluating pairs of objects results in lower numbers than evaluating the individual objects.",
                    "sid": 396,
                    "ssid": 324,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the accuracy/purity measure (Stevenson and Joanis 2003; Korhonen, Krymolowski, and Marx 2003) evaluates whether a verb is assigned to a correct cluster with respect to the gold standard class of the majority of cluster members.",
                    "sid": 397,
                    "ssid": 325,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, in a first step each induced verb cluster is assigned a gold standard class according to which class captures the majority of the cluster members.",
                    "sid": 398,
                    "ssid": 326,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a second step, each verb in a cluster is evaluated as correct or wrong with respect to its gold standard class, and accuracy/purity of the whole clustering is calculated as the proportion of correct verbs divided by the total number of verbs.",
                    "sid": 399,
                    "ssid": 327,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we applied this measure to our optimal clustering with a pairwise f-score PairF of 22.19%, we achieve an accuracy of 51.19%; if we applied the measure to the above random choices of gold standard classes with 5/10/15/20 classes, we achieve accuracies of 68.20/60.73/57.82/55.48%.",
                    "sid": 400,
                    "ssid": 328,
                    "kind_of_tag": "s"
                },
                {
                    "text": "175 The last series of experiments applies the algorithmic insights from the previous experiments to a linguistic variation of parameters (cf.",
                    "sid": 401,
                    "ssid": 329,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Schulte im Walde 2003b).",
                    "sid": 402,
                    "ssid": 330,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs are described by probability distributions on different levels of linguistic information (frames, prepositional phrases, and selectional preferences).",
                    "sid": 403,
                    "ssid": 331,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A preprocessing hierarchical cluster analysis is performed by Ward’s method, and k-means is applied to reorganize the clusters.",
                    "sid": 404,
                    "ssid": 332,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarities are measured by the skew divergence.",
                    "sid": 405,
                    "ssid": 333,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 8 presents the first results comparing D1, D2, and D3, either on specified frame slots (‘n,’ ‘na,’ ‘nd,’ ‘nad,’ ‘nsdass’), on all noun phrase slots (NP), or on all noun phrase and prepositional phrase slots (NP–PP).",
                    "sid": 406,
                    "ssid": 334,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of features in each experiment is given in square brackets.",
                    "sid": 407,
                    "ssid": 335,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The table demonstrates that a purely syntactic verb description gives rise to a verb clustering clearly above the baseline.",
                    "sid": 408,
                    "ssid": 336,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Refining the coarse subcategorization frames with prepositional phrases considerably improves the verb clustering results.",
                    "sid": 409,
                    "ssid": 337,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adding selectional preferences to the verb description further improves the clustering results, but the improvement is not as persuasive as in the first step, when refining the purely syntactic verb descriptions with prepositional information.",
                    "sid": 410,
                    "ssid": 338,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The difference between D1 and D2 is significant, but neither the difference between D2 and D3 (in any variation) nor the differences between the variants of D3 are significant.",
                    "sid": 411,
                    "ssid": 339,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of adding role information to all NP (and all PP) slots, the problem might be caused by sparse data, but for the linguistically chosen subset of argument slots we assume additional linguistic reasons are directly relevant to the clustering outcome.",
                    "sid": 412,
                    "ssid": 340,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to choose the most informative frame roles for D3, we varied the selectional preference slots by considering only single slots for refinements, or small combinations of argument slots.",
                    "sid": 413,
                    "ssid": 341,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The variations should provide insight into the contribution of slots and slot combinations to the clustering.",
                    "sid": 414,
                    "ssid": 342,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments are performed on probability distributions for D3; all other parameters were chosen as above.",
                    "sid": 415,
                    "ssid": 343,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 9 shows that refining only a single slot (the underlined slot in the respective frame type) in addition to the D2 definitions results in little or no improvement.",
                    "sid": 416,
                    "ssid": 344,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is no frame-slot type that consistently improves results, but success depends on the parameter instantiation.",
                    "sid": 417,
                    "ssid": 345,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results do not match our linguistic intuitions: For example, we would expect the arguments in the two highly frequent intransitive ‘na’ and transitive ‘na’ frames with variable semantic roles to provide valuable information with respect to their selectional preferences, but only those in ‘na’ actually improve D2.",
                    "sid": 418,
                    "ssid": 346,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, a subject in a transitive construction with a non-finite clause ‘ni’, which is less variable with respect to verbs and roles, does work better than ‘n’.",
                    "sid": 419,
                    "ssid": 347,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Table 10, selected slots are combined to define selectional preference information, for example, n/na means that the nominative slot in ‘na’, and both the nominative and accusative slot in ‘na’ are refined by selectional preferences.",
                    "sid": 420,
                    "ssid": 348,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is obvious that the clustering effect does not represent a sum of its parts, for example, both the information in ‘na’ and in ‘na’ improve Ward’s clustering based on D2 (cf.",
                    "sid": 421,
                    "ssid": 349,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 9), but it is not the case that ‘na’ improves the clustering, too.",
                    "sid": 422,
                    "ssid": 350,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 8 Comparing feature descriptions.",
                    "sid": 423,
                    "ssid": 351,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Distribution Eva l D 1 [ 3 8 ] D 2 [ 1 8 3 ] D 3 [ 2 8 8 ] D 3 N P [ 9 0 6 ] D 3 N P – P P [ 2 , 7 2 6 ] Pair F 12 .6 4 18 .8 1 22 .1 9 1 9.",
                    "sid": 424,
                    "ssid": 352,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 9 2 1 . 1 1 Ran dadj 0 . 0 9 4 0 . 1 5 1 0 . 1 8 2 0 . 1 5 8 0 . 1 7 6 176 Table 9 Comparing selectional preference slot definitions.",
                    "sid": 425,
                    "ssid": 353,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Distribution D3 Eva l D 2 n n a n a n a d n a d n a d Pair F 18 .8 1 16 .2 2 21 .1 5 20 .1 9 17 .8 2 15 .1 3 19 .4 8 Ran dadj 0 . 1 5 1 0 . 1 2 5 0 . 1 7 6 0 . 1 6 4 0 . 1 4 4 0 . 1 1 5 0 . 1 6 1 D i s t r i b u t i o n Eva l D 2 n d n d n p D 3 n i n r ns2ns da ss Pair F 18 .8 1 18 .8 8 17 .9 2 16 .7 7 18 .2 6 17 .2 2 15 .5 5 1 9.",
                    "sid": 426,
                    "ssid": 354,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 9 Ran dadj 0 . 1 5 1 0 . 1 5 2 0 . 1 4 3 0 . 1 3 3 0 . 1 4 8 0 . 1 3 6 0 . 1 2 1 0 . 1 5 6 As in Table 9, there is no combination of selectional preference frame definitions that consistently improves the results.",
                    "sid": 427,
                    "ssid": 355,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the contrary, some additional D3 information makes the result significantly worse, for example, ‘nad’.",
                    "sid": 428,
                    "ssid": 356,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The specific combination of selectional preferences as determined preexperimentally actually achieves the overall best results, better than any other slot combination, and better than refining all NP slots or refining all NP and all PP slots in the frame types (cf.",
                    "sid": 429,
                    "ssid": 357,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 8).",
                    "sid": 430,
                    "ssid": 358,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Experiment Interpretation.",
                    "sid": 431,
                    "ssid": 359,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For illustrative purposes, we present representative parts of the cluster analysis as based on the following parameters: The clustering initialization is obtained from a hierarchical analysis of the German verbs (Ward’s amalgamation method), the number of clusters being the number of manual classes (43); the similarity measure is the skew divergence.",
                    "sid": 432,
                    "ssid": 360,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cluster analysis is based on the verb description on D3, with selectional roles for Table 10 Comparing selectional preference frame definitions.",
                    "sid": 433,
                    "ssid": 361,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Distribution Eva l D 2 n n a D 3 n / n a n a d n/ na /n ad Pair F 18 .8 1 16 .2 2 17 .8 2 17 .0 0 13 .3 6 1 6 . 0 5 Ran dadj 0 . 1 5 1 0 . 1 2 5 0 . 1 3 7 0 . 1 2 8 0 . 0 8 8 0 . 1 1 8 Distribution D3 Eva l D 2 n d n/ na /n d n/ na /n ad /n d np /ni /n r/ ns 2/ns da ss Pair F 18 .8 1 18 .4 8 1 6 . 4 8 2 0 . 2 1 1 6 . 7 3 Ran dadj 0 . 1 5 1 0 . 1 5 0 0 . 1 2 4 0 . 1 6 1 0 . 1 3 1 177 ‘n,’ ‘na,’ ‘nd,’ ‘nad,’ ‘nsdass.’ We compare the clusters with the respective clusters by D1 and D2.",
                    "sid": 434,
                    "ssid": 362,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(a) nieseln regnen schneien – Weather (b) da¨ mmern – Weather (c) beginnen enden – Aspect bestehen existieren – Existence liegen sitzen stehen – Position laufen – Manner of Motion: Locomotion (d) kriechen rennen – Manner of Motion: Locomotion eilen – Manner of Motion: Rush gleiten – Manner of Motion: Flotation starren – Facial Expression (e) klettern wandern – Manner of Motion: Locomotion fahren fliegen segeln – Manner of Motion: Vehicle fließen – Manner of Motion: Flotation (f) festlegen – Constitution bilden – Production erho¨ hen senken steigern vergro¨ ßern verkleinern – Quantum Change (g) to¨ ten – Elimination unterrichten – Teaching (h) geben – Transfer of Possession (Giving): Gift The weather verbs in cluster (a) strongly agree in their syntactic expression on D1 and do not need D2 or D3 refinements for an improved class constitution.",
                    "sid": 435,
                    "ssid": 363,
                    "kind_of_tag": "s"
                },
                {
                    "text": "da¨mmern in cluster (b) is ambiguous between a weather verb and expressing a sense of understanding; this ambiguity is already idiosyncratically expressed in D1 frames, so da¨mmern is never clustered together with the other weather verbs by D1–D3.",
                    "sid": 436,
                    "ssid": 364,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Manner of Motion, Existence, Position, and Aspect verbs are similar in their syntactic frame usage and therefore merged together by D1, but adding PP information distinguishes the respective verb classes: Manner of Motion verbs primarily demand directional PPs, Aspect verbs are distinguished by patient mitDat and time and location prepositions, and Existence and Position verbs are distinguished by locative prepositions, with Position verbs showing more PP variation.",
                    "sid": 437,
                    "ssid": 365,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The PP information is essential for distinguishing these verb classes, and the coherence is partly destroyed by D3: Manner of Motion verbs (from the subclasses Locomotion, Rotation, Rush, Vehicle, Flotation) are captured well by clusters (d) and (e), since they use common alternations, but cluster (c) merges Existence, Position, and Aspect verbs because verb-idiosyncratic demands on selectional roles destroy the D2 class demarcation.",
                    "sid": 438,
                    "ssid": 366,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Still, the verbs in cluster (c) are close in their (more general conceptual) semantics, with a common sense of (bringing into versus being in) existence.",
                    "sid": 439,
                    "ssid": 367,
                    "kind_of_tag": "s"
                },
                {
                    "text": "laufen fits into the cluster with its sense of “function.” Cluster (f) contains most verbs of Quantum Change, together with one verb of Production and Constitution each.",
                    "sid": 440,
                    "ssid": 368,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The common conceptual level of this cluster therefore refers to a quantum change including the quantum change from zero to something (as for the two verbs festlegen, ‘constitute,’ and bilden, ‘found’).",
                    "sid": 441,
                    "ssid": 369,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs in this cluster typically subcategorize for a direct object, alternating with a reflexive usage, “nr ” and “npr ” with mostly aufAcc and umAcc . The 178 selectional preferences help to distinguish this cluster: The verbs agree in demanding a thing or situation as subject, and various objects such as attribute, cognitive object, state, structure, or thing as object.",
                    "sid": 442,
                    "ssid": 370,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Without selectional preferences (on D1 and D2), the change of quantum verbs are not found together with the same degree of purity.",
                    "sid": 443,
                    "ssid": 371,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are verbs as in cluster (g) whose properties are correctly stated as similar by D1–D3, so a common cluster is justified, but the verbs only have coarse common meaning components; in this case to¨ten ‘kill’ and unterrichten ‘teach’ agree in an action of one person or institution towards another.",
                    "sid": 444,
                    "ssid": 372,
                    "kind_of_tag": "s"
                },
                {
                    "text": "geben in cluster (h) represents a singleton.",
                    "sid": 445,
                    "ssid": 373,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactically, this is caused by being the only verb with a strong preference for “xa.” From the meaning point of view, this specific frame represents an idiomatic expression, only possible with geben.",
                    "sid": 446,
                    "ssid": 374,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An overall interpretation of the clustering results gives insight into the relationship between verb properties and clustering outcome.",
                    "sid": 447,
                    "ssid": 375,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) The fact that there are verbs that are clustered semantically on the basis of their corpus-based and knowledge-based empirical properties indicates (a) a relationship between the meaning components of the verbs and their behavior and (b) that the clustering algorithm is able to benefit from the linguistic descriptions and to abstract away from the noise in the distributions.",
                    "sid": 448,
                    "ssid": 376,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Low-frequency verbs were a problem in the clustering experiments.",
                    "sid": 449,
                    "ssid": 377,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their distributions are noisier than those for more frequent verbs, so they typically constitute noisy clusters.",
                    "sid": 450,
                    "ssid": 378,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) As known beforehand, verb ambiguity cannot be modeled by the hard clustering algorithm k-means.",
                    "sid": 451,
                    "ssid": 379,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ambiguous verbs were typically assigned either (a) to one of the correct clusters or (b) to a cluster whose verbs have distributions that are similar to the ambiguous distribution, or (c) to a singleton cluster.",
                    "sid": 452,
                    "ssid": 380,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4) The interpretation of the clusterings unexpectedly points to meaning components of verbs that have not been discovered by the manual classification.",
                    "sid": 453,
                    "ssid": 381,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example verb is laufen, expressing not only a Manner of Motion but also a kind of existence when used in the sense of operation.",
                    "sid": 454,
                    "ssid": 382,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The discovery effect should be more impressive with an increasing number of verbs, since manual judgement is more difficult, and also with a soft clustering technique, where multiple cluster assignment is enabled.",
                    "sid": 455,
                    "ssid": 383,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5) In a similar way, the clustering interpretation exhibits semantically related verb classes, that is, verb classes that are separated in the manual classification, but semantically merged in a common cluster.",
                    "sid": 456,
                    "ssid": 384,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Perception and Observation verbs are related in that all the verbs express an observation, with the Perception verbs additionally referring to a physical ability, such as hearing.",
                    "sid": 457,
                    "ssid": 385,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(6) Related to the preceding issue, the manual verb classes as defined are demonstrated as detailed and subtle.",
                    "sid": 458,
                    "ssid": 386,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared to a more general classification that would appropriately merge several classes, the clustering confirms that we defined a difficult task with subtle classes.",
                    "sid": 459,
                    "ssid": 387,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We were aware of this fact but preferred a fine-grained classification, since it allows insight into verb and class properties.",
                    "sid": 460,
                    "ssid": 388,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, verbs that are similar in meaning are often clustered incorrectly with respect to the gold standard.",
                    "sid": 461,
                    "ssid": 389,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To come to the main point, what exactly is the nature of the meaning–behavior relationship?",
                    "sid": 462,
                    "ssid": 390,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) Already a purely syntactic verb description allows a verb clustering clearly above the baseline.",
                    "sid": 463,
                    "ssid": 391,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result is a (semantic) classification of verbs that agree in their syntactic frame definitions, for example, most of the Support verbs.",
                    "sid": 464,
                    "ssid": 392,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The clustering fails for semantically similar verbs that differ in their syntactic behavior, for example, unterstu¨ tzen, which belongs to the Support verbs but demands an accusative rather than a dative object.",
                    "sid": 465,
                    "ssid": 393,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, it fails for syntactically similar verbs that are clustered together even though they do not exhibit semantic similarity; for example, many verbs from different semantic classes subcategorize for an accusative object, so they are falsely clustered together.",
                    "sid": 466,
                    "ssid": 394,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Refining the syntactic verb information with prepositional phrases is helpful for the semantic clustering, not only in the clustering of verbs where the PPs are obligatory, but also in the clustering of verbs with optional PP arguments.",
                    "sid": 467,
                    "ssid": 395,
                    "kind_of_tag": "s"
                },
                {
                    "text": "179 The improvement underlines the linguistic fact that verbs that are similar in their meaning agree either on a specific prepositional complement (e.g., glauben/denken anAcc ) or on a more general kind of modification, for example, directional PPs for Manner of Motion verbs.",
                    "sid": 468,
                    "ssid": 396,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) Defining selectional preferences for arguments improves the clustering results further, but the improvement is not as persuasive as when refining the purely syntactic verb descriptions with prepositional information.",
                    "sid": 469,
                    "ssid": 397,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, selectional preferences help demarcate the Quantum Change class because the respective verbs agree in their structural as well as selectional properties.",
                    "sid": 470,
                    "ssid": 398,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But in the Consumption class, essen and trinken have strong preferences for a food object, whereas konsumieren allows a wider range of object types.",
                    "sid": 471,
                    "ssid": 399,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, there are verbs that are very similar in their behavior, especially with respect to a coarse definition of selectional roles, but they do not belong to the same fine-grained semantic class, for example, to¨ten and unterrichten.",
                    "sid": 472,
                    "ssid": 400,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The effect could be due to (a) noisy or (b) sparse data, but the basic verb descriptions appear reliable with respect to their desired linguistic content, and Table 8 illustrates that even with little added information the effect exists (e.g., refining few arguments by 15 selectional roles results in 253 instead of 178 features, so the magnitude of feature numbers does not change).",
                    "sid": 473,
                    "ssid": 401,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Why do we encounter an indeterminism concerning the encoding and effect of verb features, especially with respect to selectional preferences?",
                    "sid": 474,
                    "ssid": 402,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The meaning of verbs comprises both properties that are general for the respective verb classes, and idiosyncratic properties that distinguish the verbs from each other.",
                    "sid": 475,
                    "ssid": 403,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As long as we define the verbs by those properties that represent the common parts of the verb classes, a clustering can succeed.",
                    "sid": 476,
                    "ssid": 404,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But by stepwise refining the verb description and including lexical idiosyncrasy, the emphasis on the common properties vanishes.",
                    "sid": 477,
                    "ssid": 405,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From a theoretical point of view, the distinction between common and idiosyncratic features is obvious, but from a practical point of view there is no perfect choice for the encoding of verb features.",
                    "sid": 478,
                    "ssid": 406,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The feature choice depends on the specific properties of the desired verb classes, and even if classes are perfectly defined on a common conceptual level, the relevant level of behavioral properties of the verb classes might differ.",
                    "sid": 479,
                    "ssid": 407,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Still, for a large-scale classification of verbs, we need to specify a combination of linguistic verb features as a basis for the clustering.",
                    "sid": 480,
                    "ssid": 408,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Which combination do we choose?",
                    "sid": 481,
                    "ssid": 409,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both the theoretical assumption of encoding features of verb alternation as verb behavior and the practical realization by encoding syntactic frame types, prepositional phrases, and selectional preferences seem promising.",
                    "sid": 482,
                    "ssid": 410,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we aimed at a (rather linguistically than technically based) choice of selectional preferences that represents a useful compromise for the conceptual needs of the verb classes.",
                    "sid": 483,
                    "ssid": 411,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, this choice of features best utilizes the meaning–behavior relationship and will be applied in a large- scale clustering experiment (cf.",
                    "sid": 484,
                    "ssid": 412,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4).",
                    "sid": 485,
                    "ssid": 413,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Optimizing the Number of Clusters.",
                    "sid": 486,
                    "ssid": 414,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not a goal of this article to optimize the number of clusters in the cluster analysis.",
                    "sid": 487,
                    "ssid": 415,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are not interested in the question of whether, for example, 40, 42, 43, or 45 clusters represent the best semantic classification of 168 verbs.",
                    "sid": 488,
                    "ssid": 416,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But there are two reasons why it is interesting and relevant to investigate the properties of clusterings with respect to different numbers of clusters.",
                    "sid": 489,
                    "ssid": 417,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) The clustering methodology should basically work the way we expect it to work, that is, the evaluation of the results should show deficiencies for extreme numbers of clusters, but (possibly several) optimal values for various numbers of clusters in between.",
                    "sid": 490,
                    "ssid": 418,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Even if we do not check for an exact number of clusters, we should check the magnitude of the number of clusters, since the clustering 180 methodology might be successful in capturing a rough verb classification with few verb classes but not a fine-grained classification with many subtle distinctions.",
                    "sid": 491,
                    "ssid": 419,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 illustrates the clustering results for the series of cluster analyses as performed by k-means with hierarchical clustering initialization (Ward’s method) on probability distributions, with skew divergence as the similarity measure.",
                    "sid": 492,
                    "ssid": 420,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The feature description refers to D2.",
                    "sid": 493,
                    "ssid": 421,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of clusters is varied from 1 through the number of verbs (168), and the results are evaluated by Randadj . A range of numbers of clusters is determined as optimal (71) or near-optimal (approx.",
                    "sid": 494,
                    "ssid": 422,
                    "kind_of_tag": "s"
                },
                {
                    "text": "58–78).",
                    "sid": 495,
                    "ssid": 423,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The figure demonstrates that having performed experiments on the parameters for clustering, it is worthwhile exploring additional parameters: The optimal result is 0.188 for 71 clusters as compared to 0.158 for 43 clusters reported previously.",
                    "sid": 496,
                    "ssid": 424,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "large-scale clustering experiments. ",
            "number": "4",
            "sents": [
                {
                    "text": "So far, all clustering experiments were performed on a small scale, preliminary set of 168 manually chosen German verbs.",
                    "sid": 497,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One goal of this article was to develop a clustering methodology with respect to the automatic acquisition of a large-scale German verb classification.",
                    "sid": 498,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We therefore apply the insights on the theoretical relationship between verb meaning and verb behavior and our findings regarding the clustering parameters to a considerably larger amount of verb data.",
                    "sid": 499,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We extracted all German verbs from our statistical grammar model that appeared with an empirical frequency of between 500 and 10,000 in the training corpus (cf.",
                    "sid": 500,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2.2).",
                    "sid": 501,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This selection resulted in a total of 809 verbs, including 94 verbs from the preliminary set of 168 verbs.",
                    "sid": 502,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We added the missing verbs from the preliminary set, resulting in a total of 883 German verbs.",
                    "sid": 503,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The feature description of the German verbs refers to the probability distribution over the coarse syntactic frame types, with Figure 1 Varying the number of clusters (evaluation: Randadj ).",
                    "sid": 504,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "181 prepositional phrase information on the 30 chosen PPs and selectional preferences for our empirically most successful combination ‘n,’ ‘na,’ ‘nd,’ ‘nad,’ and ‘nsdass.’ As in previous clustering experiments, the features are stepwise refined.",
                    "sid": 505,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "k-means is provided hierarchical clustering initialization (based on Ward’s method), with the similarity measure being skew divergence.",
                    "sid": 506,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of clusters is set to 100, which corresponds to an average of 8.83 verbs per cluster, that is, not too fine-grained clusters but still possible to interpret.",
                    "sid": 507,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The preliminary set of 168 verbs is a subset of the large-scale set in order to provide an “auxiliary” evaluation of the clustering results: Considering only the manually chosen verbs in the clustering result, this partial cluster analysis is evaluated against the gold standard of 43 verb classes.",
                    "sid": 508,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results were not expected to match the results of our clustering experiments using only the preliminary verb set, but to provide an indication of how different cluster analyses can be compared with each other.",
                    "sid": 509,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tables 11 to 13 present the clustering results for the large-scale verb set for D1–D3 in the rightmost columns, citing the evaluation scores of the initial (hierarchical) clusters and the resulting k-means clusters.",
                    "sid": 510,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The subset of the 168 gold standard verbs is scattered over 72 of the 100 resulting clusters.",
                    "sid": 511,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are compared to our previous results for the 168 verbs in 43 clusters, and to the case where those 168 verbs are clustered into 72 hierarchical classes.",
                    "sid": 512,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The large-scale clustering results once more confirm the general insights (1) that the stepwise refinement of features improves the clustering and (2) that Ward’s hierarchical clustering is seldom improved by the k-means application.",
                    "sid": 513,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, several of the large-scale cluster analyses were quite comparable with the clustering results using the small-scale set of verbs, especially when compared to 72 clusters.",
                    "sid": 514,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following, we present example clusters from the optimal large-scale cluster analysis (according to the above evaluation): Ward’s hierarchical cluster analysis based on subcategorization frames, PPs, and selectional preferences, without running k-means on the hierarchical clustering.",
                    "sid": 515,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some clusters are extremely good with respect to the semantic overlap of the verbs, some clusters contain a number of similar verbs mixed with semantically different verbs, and for some clusters it is difficult to recognize common elements of meaning.",
                    "sid": 516,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs that we think are semantically similar are marked in bold face.",
                    "sid": 517,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) abschneiden ‘cut off’, anziehen ‘dress’, binden ‘bind’, entfernen ‘remove’, tunen ‘tune’, wiegen ‘weigh’ (2) aufhalten ‘detain’, aussprechen ‘pronounce’, auszahlen ‘pay off’, durchsetzen ‘achieve’, entwickeln ‘develop’, verantworten ‘be responsible’, verdoppeln ‘double’, zuru¨ ckhalten ‘keep away’, zuru¨ ckziehen ‘draw back’, a¨ndern ‘change’ Table 11 Large-scale clustering on D1.",
                    "sid": 518,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "S m a l l S c a l e L ar ge S ca le Eva l 4 3 C lu st er s 72 Clusters 7 2 C lu st er s Pair F 12.",
                    "sid": 519,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "44 → 12.",
                    "sid": 520,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "64 10.83 → 11.73 12.",
                    "sid": 521,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "15 → 12.",
                    "sid": 522,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "88 Ran dadj 0.0 92 → 0.0 94 0.084 → 0.091 0.0 94 → 0.1 02 182 Table 12 Large-scale clustering on D2.",
                    "sid": 523,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Small-Scale Large-Scale Eval 43 Clusters 72 Clusters 72 Clusters PairF 18.64 → 18.81 17.56 → 18.81 18.22 → 16.96 Randadj 0.148 → 0.151 0.149 → 0.161 0.152 → 0.142 Table 13 Large-scale clustering on D3 with n/na/nd/nad/nsdass.",
                    "sid": 524,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "S m a l l S c a l e L ar ge S ca le Eva l 4 3 C lu st er s 72 Clusters 7 2 C lu st er s Pair F 22.",
                    "sid": 525,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "86 → 22.",
                    "sid": 526,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "19 19.47 → 20.48 19.",
                    "sid": 527,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "92 → 15.",
                    "sid": 528,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "06 Ran dadj 0.1 90 → 0.1 82 0.165 → 0.174 0.1 70 → 0.1 15 (3) anho¨ren ‘listen’, auswirken ‘affect’, einigen ‘agree’, lohnen ‘be worth’, verhalten ‘behave’, wandeln ‘promenade’ (4) abholen ‘pick up’, ansehen ‘watch’, bestellen ‘order ’, erwerben ‘purchase’, holen ‘fetch’, kaufen ‘buy’, konsumieren ‘consume’, verbrennen ‘burn’, verkaufen ‘sell’ (5) anschauen ‘watch’, erhoffen ‘wish’, vorstellen ‘imagine’, wu¨ nschen ‘wish’, u¨ berlegen ‘think about’ (6) danken ‘thank’, entkommen ‘escape’, gratulieren ‘congratulate’ (7) beschleunigen ‘speed up’, bilden ‘constitute’, darstellen ‘illustrate’, decken ‘cover ’, erfu¨ llen ‘fulfil’, erho¨ hen ‘raise’, erledigen ‘fulfil’, finanzieren ‘finance’, fu¨ llen ‘fill’, lo¨sen ‘solve’, rechtfertigen ‘justify’, reduzieren ‘reduce’, senken ‘lower ’, steigern ‘increase’, verbessern ‘improve’, vergro¨ ßern ‘enlarge’, verkleinern ‘make smaller ’, verringern ‘decrease’, verschieben ‘shift’, verscha¨ rfen ‘intensify’, versta¨ rken ‘intensify’, vera¨ ndern ‘change’ (8) ahnen ‘guess’, bedauern ‘regret’, befu¨ rchten ‘fear ’, bezweifeln ‘doubt’, merken ‘notice’, vermuten ‘assume’, weißen ‘whiten’, wissen ‘know’ (9) anbieten ‘offer ’, bieten ‘offer ’, erlauben ‘allow’, erleichtern ‘facilitate’, ermo¨ glichen ‘make possible’, ero¨ ffnen ‘open’, untersagen ‘forbid’, veranstalten ‘arrange’, verbieten ‘forbid’ (10) argumentieren ‘argue’, berichten ‘report’, folgern ‘conclude’, hinzufu¨ gen ‘add’, jammern ‘moan’, klagen ‘complain’, schimpfen ‘rail’, urteilen ‘judge’ (11) basieren ‘be based on’, beruhen ‘be based on’, resultieren ‘result from’, stammen ‘stem from’ (12) befragen ‘interrogate’, entlassen ‘release’, ermorden ‘assassinate’, erschießen ‘shoot’, festnehmen ‘arrest’, to¨ ten ‘kill’, verhaften ‘arrest’ 183 (13) beziffern ‘amount to’, scha¨ tzen ‘estimate’, veranschlagen ‘estimate’ (14) entschuldigen ‘apologize’, freuen ‘be glad’, wundern ‘be surprised’, a¨ rgern ‘be annoyed’ (15) nachdenken ‘think about’, profitieren ‘profit’, reden ‘talk’, spekulieren ‘speculate’, sprechen ‘talk’, tra¨ umen ‘dream’, verfu¨ gen ‘decree’, verhandeln ‘negotiate’ (16) mangeln ‘lack’, nieseln ‘drizzle’, regnen ‘rain’, schneien ‘snow’ Clusters (1) to (3) are examples where the verbs do not share elements of meaning.",
                    "sid": 529,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the overall cluster analysis, such semantically incoherent clusters tend to be rather large, that is, with more than 15–20 verb members.",
                    "sid": 530,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clusters (4) to (7) are examples of clusters where some of the verbs show overlap in meaning, but also contain considerable noise.",
                    "sid": 531,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cluster (4) mainly contains verbs of buying and selling, cluster (5) contains verbs of wishing, cluster (6) contains verbs of expressing approval, and cluster (7) contains verbs of quantum change.",
                    "sid": 532,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clusters (8) to (16) are examples of clusters where most or all verbs show a strong similarity in their semantic concept.",
                    "sid": 533,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cluster (8) contains verbs expressing a propositional attitude; the underlined verbs, in addition, indicate an emotion.",
                    "sid": 534,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The only unmarked verb weißen can be explained, since some of its inflected forms are ambiguous with respect to their base verb: either weißen or wissen, a verb that belongs to the Aspect verb class.",
                    "sid": 535,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs in cluster (9) describe a scene where somebody or some situation makes something possible (in the positive or negative sense); the only exception verb is veranstalten.",
                    "sid": 536,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs in cluster (10) are connected more loosely, all referring to a verbal discussion, with the underlined verbs denoting a negative, complaining way of utterance.",
                    "sid": 537,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In cluster (11) all verbs refer to a basis, in cluster (12) the verbs describe the process from arresting to releasing a suspect, and cluster (13) contains verbs of estimating an amount of money.",
                    "sid": 538,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In cluster (14), all verbs except for entschuldigen refer to an emotional state (with some origin for the emotion).",
                    "sid": 539,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs in cluster (15) except for profitieren all indicate thought (with or without talking) about a certain matter.",
                    "sid": 540,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally in cluster (16), we can recognize the same weather verb cluster as in the previously discussed small-scale cluster analyses.",
                    "sid": 541,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We experimented with two variations in the clustering setup: (1) For the selection of the verb data, we considered a random choice of German verbs in approximately the same magnitude of number of verbs (900 verbs plus the preliminary verb set), but without any restriction on the verb frequency.",
                    "sid": 542,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The clustering results are—both on the basis of the evaluation and on the basis of a manual inspection of the resulting clusters—much worse than in the preceding cluster analysis, since the large number of low-frequency verbs destroys the clustering.",
                    "sid": 543,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) The number of target clusters was set to 300 instead of 100, that is, the average number of verbs per cluster was 2.94 instead of 8.83.",
                    "sid": 544,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting clusters are numerically slightly worse than in the preceding cluster analysis, but easier for inspection and therefore a preferred basis for a large- scale resource.",
                    "sid": 545,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several of the large, semantically incoherent clusters are split into smaller and more coherent clusters, and the formerly coherent clusters often preserved their constitution.",
                    "sid": 546,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To present one example, the following cluster from the 100-cluster analysis anzeigen ‘announce’, aufkla¨ren ‘clarify’, beeindrucken ‘impress’, befreien ‘free’, begeistern ‘inspire’, beruhigen ‘calm down’, entta¨uschen ‘disappoint’, retten ‘save’, schu¨ tzen ‘protect’, sto¨ren ‘disturb’, u¨ berraschen ‘surprise’, u¨ berzeugen ‘persuade’ 184 is split into the following four clusters from the 300-cluster analysis: (a) anzeigen ‘announce’, aufkla¨ ren ‘clarify’ (b) beeindrucken ‘impress’, entta¨ uschen ‘disappoint’, u¨ berraschen ‘surprise’, u¨ berzeugen ‘persuade’ (c) befreien ‘free’, beruhigen ‘calm down’, retten ‘save’, schu¨ tzen ‘protect’, sto¨ ren ‘disturb’ (d) begeistern where cluster (a) shows a loose semantic coherence of declaration, the verbs in cluster (b) are semantically very similar and describe an emotional impact of somebody or a situation on a person, and the verbs in cluster (c) show a protective (and the negation: nonprotective) influence of one person towards another.",
                    "sid": 547,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Summarizing, the large-scale clustering experiment results in a mixture of semantically coherent and incoherent verb classes.",
                    "sid": 548,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantically incoherent verb classes and clustering mistakes need to be split into finer and more coherent clusters, or to be filtered from the classification.",
                    "sid": 549,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantically coherent verb classes need little manual correction as a lexical resource.",
                    "sid": 550,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Interestingly, the coherence in verb classes refers to different criteria on meaning coherence, such as synonymy (e.g., reduzieren ‘reduce’ and verringern ‘decrease’), antonymy (e.g., reduzieren ‘reduce’ and erho¨hen ‘raise’), situational overlap (e.g., emotional state containing freuen ‘be glad’ and a¨rgern ‘be annoyed’), and participation in a common process/script (e.g., bestellen ‘order ’, kaufen ‘buy’, verkaufen ‘sell’, and abholen ‘pick up’).",
                    "sid": 551,
                    "ssid": 55,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "5",
            "sents": [
                {
                    "text": "The following paragraphs describe related classification and clustering experiments on the automatic induction of verb classes.",
                    "sid": 552,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classifications refer to different class criteria, for example, aspectual properties (Siegel and McKeown 2000), syntactic categories (Merlo and Stevenson 2001; Merlo et al. 2002; Tsang, Stevenson, and Merlo 2002), and— most similar to my approach—semantic categories (Schulte im Walde 2000; Joanis 2002).",
                    "sid": 553,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The soft clustering approaches indicate how we might extend our hard clustering to verb ambiguity, now that we have determined the relevant set of verb features.",
                    "sid": 554,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Siegel and McKeown (2000) used three supervised and one unsupervised machine- learning algorithm to perform an automatic aspectual classification of English verbs.",
                    "sid": 555,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) For the supervised classification, 97,973 parsed sentences from medical discharge summaries were used to extract frequencies for verbs on 14 linguistic indicators, such as manner adverb, duration in PP, past tense, and perfect tense.",
                    "sid": 556,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Logistic regression, decision tree induction, and genetic programming were applied to the verb data to distinguish states and events.",
                    "sid": 557,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparing the ability of the learning methods to combine the linguistic indicators was claimed to be difficult, as they rank differently depending on the classification task and evaluation criteria.",
                    "sid": 558,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Decision trees achieved an accuracy of 93.9%, as compared to the uninformed baseline of 83.8%.",
                    "sid": 559,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) For the unsupervised clustering, 14,038 distinct verb–object pairs of varying frequencies were extracted from 75,289 parsed novel sentences.",
                    "sid": 560,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A random partition of the set of verbs was improved by a hill-climbing method, which improved the partition by moving a verb to the cluster that decreases the sum of distances most.",
                    "sid": 561,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a small set of 56 verbs whose frequency in the verb–object pairs was larger than 50, Siegel and McKeown (2000) claimed on the basis of an evaluation of 19 verbs that their clustering algorithm discriminated 185 event verbs from stative verbs.",
                    "sid": 562,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall, they performed a comparably simpler task than presented in this article, since the aspectual class criteria can be defined more objectively and more clearly than semantic criteria based on situational similarity.",
                    "sid": 563,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their choice of features delimited their class criteria well, and they were able to achieve excellent results.",
                    "sid": 564,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In previous work on English, Schulte im Walde (2000) clustered 153 verbs into 30 verb classes taken from Levin (1993), using unsupervised hierarchical clustering.",
                    "sid": 565,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs were described by distributions over subcategorization frames as extracted from maximum-probability parses using a robust statistical parser, and completed by assigning WordNet classes as selectional preferences to the frame arguments.",
                    "sid": 566,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using Levin’s verb classification as a basis for evaluation, 61% of the verbs were classified correctly into semantic classes.",
                    "sid": 567,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The clustering was most successful when utilizing syntactic sub- categorization frames enriched with PP information; selectional preferences decreased the performance of the clustering approach.",
                    "sid": 568,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The detailed encoding and therefore sparse data made the clustering worse with the selectional preference information.",
                    "sid": 569,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Merlo and Stevenson (2001) presented an automatic classification of three types of English intransitive verbs, based on argument structure and crucially involving thematic relations.",
                    "sid": 570,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They selected 60 verbs with 20 verbs from each verb class, comprising unergatives, unaccusatives, and object-drop verbs.",
                    "sid": 571,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs in each verb class show similarities with respect to their argument structure, in that they all can be used both as transitives and intransitives.",
                    "sid": 572,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, argument structure alone does not distinguish the classes, and subcategorization information is refined by thematic relations.",
                    "sid": 573,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Merlo and Stevenson defined verb features based on linguistic heuristics that describe the thematic relations between subject and object in transitive and intransitive verb usage.",
                    "sid": 574,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features included heuristics for transitivity, causativity, animacy, and syntactic features.",
                    "sid": 575,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the degree of animacy of the subject argument roles was estimated as the ratio of occurrences of pronouns to all subjects for each verb, based on the assumption that unaccusatives occur less frequently with an animate subject compared to unergative and object-drop verbs.",
                    "sid": 576,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each verb was described by a five-feature vector, and the vector descriptions were fed into a decision tree algorithm.",
                    "sid": 577,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared with a baseline performance of 33.9%, the decision trees classified the verbs into the three classes with an accuracy of 69.8%.",
                    "sid": 578,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further experiments demonstrated the contribution of the different features within the classification.",
                    "sid": 579,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared to the current article, Merlo and Stevenson (2001) performed a simpler task and classified a smaller number of 60 verbs into only three classes.",
                    "sid": 580,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features of the verbs were restricted to those that should capture the basic differences between the verb classes, in line with the idea that the feature choice depends on the specific properties of the desired verb classes.",
                    "sid": 581,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But using the same classification methodology for a large-scale experiment with an enlarged number of verbs and classes faces more problems.",
                    "sid": 582,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Joanis (2002) reported an extension of their work that used 802 verbs from 14 classes from Levin (1993).",
                    "sid": 583,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He defined an extensive feature space with 219 core features (such as part of speech, auxiliary frequency, syntactic categories, and animacy as above) and 1,140 selectional preference features taken from WordNet.",
                    "sid": 584,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in Schulte im Walde (2000), the selectional preferences did not improve the clustering.",
                    "sid": 585,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In recent work, Stevenson and Joanis (2003) compared their supervised method for verb classification with semisupervised and unsupervised techniques.",
                    "sid": 586,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In these experiments, they enlarged the number of gold standard English verb classes to 14 classes related to Levin classes, with a total of 841 verbs.",
                    "sid": 587,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Low- frequency and ambiguous verbs were excluded from the classes.",
                    "sid": 588,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They found that a semisupervised approach where the classifier was trained with five seed verbs from each verb class outperformed both a manual selection of features and the unsupervised 186 approach of Dash, Liu, and Yao (1997), which used an entropy measure to organize data into a multidimensional space.",
                    "sid": 589,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classification methodology from Merlo and Stevenson (2001) was applied to multilinguality by Merlo et al.",
                    "sid": 590,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2002) and Tsang, Stevenson, and Merlo (2002).",
                    "sid": 591,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Merlo et al.",
                    "sid": 592,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2002) showed that the classification paradigm is applicable in languages other than English by using the same features as defined by Merlo and Stevenson (2001) for the respective classification of 59 Italian verbs empirically based on the Parole corpus.",
                    "sid": 593,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting accuracy is 86.4%.",
                    "sid": 594,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, they used the content of Chinese verb features to refine the English verb classification, explained in more detail by Tsang, Stevenson, and Merlo (2002).",
                    "sid": 595,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The English verbs were manually translated into Chinese and given part-of-speech tag features, passive particles, causative particles, and sublexical morphemic properties.",
                    "sid": 596,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verb tags and particles in Chinese are overt expressions of semantic information that is not expressed as clearly in English, and the multilingual set of features outperformed either set of monolingual features, yielding an accuracy of 83.5%.",
                    "sid": 597,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pereira, Tishby, and Lee (1993) describe a hierarchical soft clustering method that clusters words according to their distribution in particular syntactic contexts.",
                    "sid": 598,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They used an application of their method to nouns appearing as direct objects of verbs.",
                    "sid": 599,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The clustering result was a hierarchy of noun clusters, where every noun belongs to every cluster with a membership probability.",
                    "sid": 600,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The initial data for the clustering process were frequencies of verb–noun pairs in a direct object relationship, as extracted from parsed sentences from the Associated Press news wire corpus.",
                    "sid": 601,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the basis of the conditional verb–noun probabilities, the similarity of the distributions was determined by the Kullback–Leibler divergence.",
                    "sid": 602,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The EM algorithm (Baum 1972) was used to learn the hidden cluster membership probabilities, and deterministic annealing performed the divisive hierarchical clustering.",
                    "sid": 603,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting class-based model can be utilized for estimating information for unseen events (cf.",
                    "sid": 604,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dagan, Lee, and Pereira 1999).",
                    "sid": 605,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rooth et al.",
                    "sid": 606,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1999) produced soft semantic clusters for English that represent a classification on verbs as well as on nouns.",
                    "sid": 607,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They gathered distributional data for verb–noun pairs in specific grammatical relations from the British National Corpus.",
                    "sid": 608,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extraction was based on a lexicalized probabilistic context-free grammar (Carroll and Rooth 1998) and contained the subject and object nouns for all intransitive and transitive verbs in the parses—a total of 608,850 verb–noun types.",
                    "sid": 609,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conditioning of the verbs and the nouns on each other was done through hidden classes, and the joint probabilities of classes, verbs, and nouns were trained by the EM algorithm.",
                    "sid": 610,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting model defined conditional membership probabilities for each verb and noun in each class; for example, the class of communicative action contains the most probable verbs ask, nod, think, shape, smile and the most probable nouns man, Ruth, Corbett, doctor, woman.",
                    "sid": 611,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The semantic classes were utilized for the induction of a semantically annotated verb lexicon.",
                    "sid": 612,
                    "ssid": 61,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion and outlook. ",
            "number": "6",
            "sents": [
                {
                    "text": "This article presented a clustering methodology for German verbs whose results agreed with a manual classification in many respects and should prove useful as automatic basis for a large-scale clustering.",
                    "sid": 613,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Without a doubt the cluster analysis needs manual correction and completion, but represents a plausible foundation.",
                    "sid": 614,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Key issues of the clustering methodology concern linguistic criteria on the one hand, and technical criteria on the other hand.",
                    "sid": 615,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Linguistic Criteria: The strategy of utilizing subcategorization frames, prepositional information, and selectional preferences to define the verb features seems promising, 187 since the experiments illustrated a relation between the induced verb behavior and the membership of the semantic verb classes.",
                    "sid": 616,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, each level of representation generated a positive effect on the clustering and improved upon the less informative level.",
                    "sid": 617,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments presented evidence for a linguistic limit on the usefulness of the verb features: The meaning of verbs comprises both (1) properties that are general for the respective verb classes and (2) idiosyncratic properties that distinguish the verbs from each other.",
                    "sid": 618,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As long as we define the verbs by those properties that represent the common parts of the verb classes, a clustering can succeed.",
                    "sid": 619,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But by stepwise refining the verb description and including lexical idiosyncrasy, emphasis on the common properties vanishes.",
                    "sid": 620,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the theoretical point of view, the distinction between common and idiosyncratic features is obvious.",
                    "sid": 621,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But from the practical point of view, feature choice then depends on the definition of the verb classes, and this definition might vary according to the conceptual level and also according to the kind of semantic coherence captured by the class.",
                    "sid": 622,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So far, we have concentrated on synonymy, but the large-scale experiment, in particular, discovered additional semantic relations within a verb class, such as participation in a process/script.",
                    "sid": 623,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the investigated feature combination within this article seems to be a useful starting point for verb description.Technical Criteria: We investigated the relationship between clustering idea, cluster ing parameters, and clustering result in order to develop a clustering methodology that is suitable for the demands of natural language.",
                    "sid": 624,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The clustering initialization played an important role: k-means needed compact, similarly-sized clusters in order to achieve a linguistically meaningful classification.",
                    "sid": 625,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The linguistically most successful initial clusters were therefore based on hierarchical clustering with complete linkage or Ward’s method, as the resulting clusters are comparable in size and correspond to compact cluster shapes.",
                    "sid": 626,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hierarchical clustering achieved more similar clustering outputs than k-means, which is due to the similarity of the clustering methods with respect to the common clustering criterion of optimizing the sum of distances between verbs and cluster centroids.",
                    "sid": 627,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The similarity measure used in the clustering experiments proved to be of secondary importance, since the differences in clustering due to varying the measure were negligible.",
                    "sid": 628,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For larger object and feature sets, Kullback–Leibler variants tended to outperform other measures, confirming language-based results on distributional similarity (Lee 2001).",
                    "sid": 629,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both frequencies and probabilities represented a useful basis for the verb distributions.",
                    "sid": 630,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of clusters played a role concerning the magnitude of numbers: Inducing fine-grained clusters as given in the manual classification proved to be an ambitious goal because the feature distinction for the classes was also fine- grained.",
                    "sid": 631,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inducing coarse clusters provided a coarse classification that was subject to less noise and easier to manually correct.",
                    "sid": 632,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The “optimal” number of clusters is always a compromise and depends on the purpose of the classes, for example, as a fine-grained lexical resource, or for an NLP application.",
                    "sid": 633,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the latter case, the optimal number should be determined by automatic means, that is, by trying different magnitudes of cluster numbers, because the level of generalization depends on the purpose for the abstraction.",
                    "sid": 634,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are various directions for future research.",
                    "sid": 635,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) The manual definition of the German semantic verb classes will be extended in order to include a greater number and a larger variety of verb classes.",
                    "sid": 636,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An extended classification would be useful as a gold standard for further clustering experiments, and more generally as a resource for NLP applications.",
                    "sid": 637,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Low-frequency verbs require a specific handling in the clustering procedure: Both the small-scale and the large-scale experiments showed that the low- frequency verbs have a negative impact on the cluster coherence.",
                    "sid": 638,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An alternative model for the low-frequency verbs might, for example, first take out of the cluster analysis 188 those verbs below a certain frequency cutoff, and then assign the left-out verbs to the nearest clusters.",
                    "sid": 639,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cluster assignment should also be special, for example, using verb features restricted to the reliable features, that is, above a certain frequency threshold.",
                    "sid": 640,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if we consider the D2 features of the low-frequency verb ekeln ‘disgust’ (frequency: 31) with a minimum feature frequency of 2, we get a strong overlap with the distinguishing features of the verb fu¨ rchten ‘fear ’.",
                    "sid": 641,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Future work will address these issues.",
                    "sid": 642,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) Possible features for describing German verbs will include any kind of information that helps to classify the verbs in a semantically appropriate way.",
                    "sid": 643,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Within this article, we concentrated on defining the verb features with respect to alternation behavior.",
                    "sid": 644,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other features that are relevant for describing the behavior of verbs are their auxiliary selection and adverbial combinations.",
                    "sid": 645,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, if we try to address additional types of semantic verb relations such as script-based relations, we will need to extend our features.",
                    "sid": 646,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Schulte im Walde and Melinger (2005) recently showed that nouns in co-occurrence windows of verbs contribute to verb descriptions by encoding scene information, rather than intrasentential functions.",
                    "sid": 647,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They proposed the integration of window-based approaches into function-based approaches, a combination that has not yet been applied.",
                    "sid": 648,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4) Variations in the existing feature description are especially relevant for the choice of selectional preferences.",
                    "sid": 649,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiment results demonstrated that the 15 conceptual GermaNet top levels are not sufficient for all verbs.",
                    "sid": 650,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the verbs to¨ten and unterrichten require a finer version of selectional preferences in order to be distinguished.",
                    "sid": 651,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is worthwhile either to find a more appropriate level of selectional preferences in WordNet or to apply a more sophisticated approach towards selectional preferences such as that of Li and Abe (1998), in order to determine a more flexible choice of selectional preferences.",
                    "sid": 652,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5) With respect to a large-scale classification of verbs, it will be interesting to apply classification techniques to the verb data.",
                    "sid": 653,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This would require more data manually labeled with classes in order to train a classifier.",
                    "sid": 654,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But the resulting classifier might abstract better than k-means over the different requirements of the verb classes with respect to the feature description.",
                    "sid": 655,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(6) As an extension of the existing clustering, a soft clustering algorithm will be applied to the German verbs.",
                    "sid": 656,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Soft clustering enables us to assign verbs to multiple clusters and therefore address the phenomenon of verb ambiguity.",
                    "sid": 657,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These clustering outcomes should be even more useful for discovering new verb meaning components and semantically related classes, compared with the hard clustering technique.",
                    "sid": 658,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(7) The verb clusters as resulting from the cluster analysis will be used within an NLP application in order to prove the usefulness of the clusters.",
                    "sid": 659,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, replacing verbs in a language model by the respective verb classes might improve the language model’s robustness and accuracy, as the class information provides more stable syntactic and semantic information than the individual verbs.",
                    "sid": 660,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Appendix A: Subcategorization Frame Types The syntactic part of the German verb behavior is captured by 38 subcategorization frame types.",
                    "sid": 661,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The frames comprise maximally three arguments.",
                    "sid": 662,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Possible arguments are nominative (n), dative (d) and accusative (a) noun phrases, reflexive pronouns (r), prepositional phrases (p), expletive es (x), subordinated non-finite clauses (i), subordinated finite clauses (s-2 for verb second clauses, s-dass for dass-clauses, sob for ob-clauses, s-w for indirect wh-questions), and copula constructions (k).",
                    "sid": 663,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting frame types are listed in Table A.1, accompanied by annotated verb–second example clauses.",
                    "sid": 664,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The German examples are provided with English glosses; in cases where the glosses are difficult to understand, an English translation is added.",
                    "sid": 665,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "189 Table A1 Subcategorization frame types.",
                    "sid": 666,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Frame Type Example n Natalien schwimmt.",
                    "sid": 667,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Natalie swims na Hansn sieht seine Freundina . Hans sees his girlfriend nd Ern glaubt den Leutend nicht.",
                    "sid": 668,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He believes the people np Die Autofahrern achten not besonders auf Kinderp . The drivers watch out especially for children nad Annan verspricht ihrem Vaterd ein tolles Geschenka . Anna promises her father a great present nap Die Verka¨ uferinn hindert den Dieba am Stehlenp . The saleslady keeps the thief from stealing ndp Der Moderatorn dankt dem Publikumd fu¨ r sein Versta¨ ndnisp . The moderator thanks the audience for their understanding ni Mein Freundn versucht immer, pu¨ nktlich zu kommeni . My friend tries always in time to arrive ‘My friend always tries to arrive in time.’ nai Ern ho¨ rt seine Muttera ein Lied tra¨ llerni . He hears his mother a song sing ‘He hears his mother singing a song.’ ndi Helenen verspricht ihrem Großvaterd ihnbaldzubesucheni . Helene promises her grandfather him soon to visit nr Die Kindern fu¨ rchten sichr . The children are afraid themselves nar Der Unternehmern erhofft sichr schnellen Fortschritta . The businessman hopes himself quick progress ndr Sien schließt sichr nach 10 Jahren wieder der Kirched an.",
                    "sid": 669,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "She associates herself after 10 years again the church with npr Der Pastorn hat sichr als der Kirche wu¨ rdigp erwiesen.",
                    "sid": 670,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pastor has himself to the church worthy proven nir DiealteFraun stellt sichr vor, den Preis zu gewinneni . The old women imagines herself x Esx blitzt.",
                    "sid": 671,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the price to win It lightenings xa Esx gibt viele Bu¨ chera . There exist many books xd Esx graut mird . It terrifies me 190 Table A1 (cont.)",
                    "sid": 672,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Frame Type Example xp Esx geht um einen tollen Preis fu¨ r mein Sofap . It is about a great price for my sofa xr Esx rechnet sichr . It calculates itself ‘It is worth it.’ xsdass Esx heißt, dass Thomas sehr schlau ists−dass . It says, that Thomas very intelligent is ns2 Der Professorn hat gesagt, er halte bald einen Vortrags−2 . The professor has said, he gives soon a talk nas2 Der Chefn schnauzt ihna an, er sei ein Idiots−2 . The chef bawls him out, he is an idiot nds2 Ern sagt seiner Freundind , sie sei zu krank zum Arbeitens−2 . He tells his girlfriend, she is too ill to work nrs2 Der Kleinen wu¨ nscht sichr , das Ma¨ dchen bliebe bei ihms−2 . The boy wishes himself, the girl stays with him nsdass Der Wintern hat schon angeku¨ ndigt, dass er bald kommts−dass . Winter has already announced, that it soon arrives nasdass Der Vatern fordert seine Tochtera auf, dass sie verreists−dass . The father requests his daughter that she travels ndsdass Ern sagt seiner Geliebtend , dass er verheiratet ists−dass He tells his lover, nrsdass Der Kleinen wu¨ nscht sichr , that he married is dass seine Mutter bleibts−dass . The boy wishes himself, that his mother stays nsob Der Professorn hat gefragt, ob die neue Forscherin interessant seis−ob The professor has asked, whether the new researcher interesting is nasob Antonn fragt seine Fraua , ob sie ihn liebts−ob . Anton asks his wife, whether she him loves ndsob Der Nachbarn ruft der Fraud zu, ob sie verreists−ob The neighbor shouts the woman whether she travels nrsob Der Alten wird sichr erinnern, ob das Ma¨ dchen dort wars−ob . The old man will himself remember, whether the girl there was ns-w Der Kleinen hat gefragt, wann die Tante endlich ankommts−w The boy has asked, when the aunt finally arrives nas-w Der Mannn fragt seine Freundina , warum sie ihn liebts−w . The man asks his girlfriend, why she him loves nds-w Der Vatern verra¨ t seiner Tochterd nicht, wer zu Besuch kommts−w . The father tells his daughter not, who for a visit comes nrs-w Das Ma¨ dchenn erinnert sichr , wer zu Besuch kommts−w . The girl remembers herself, who for a visit comes k Der neue Nachbark ist ein ziemlicher Idiot.",
                    "sid": 673,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The new neighbor is a complete idiot 191",
                    "sid": 674,
                    "ssid": 62,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "The work reported here was performed while the author was a member of the DFG-funded PhD program “Graduierten kolleg” Sprachliche Repra¨sentationen und ihre Interpretation at the Institute for Natural Language Processing (IMS), University of Stuttgart, Germany.",
                    "sid": 675,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many thanks to Helmut Schmid, Stefan Evert, Frank Keller, Scott McDonald, Alissa Melinger, Chris Brew, Hinrich Schu¨ tze, Jonas Kuhn, and the two anonymous reviewers for their valuable comments on previous versions of this article.",
                    "sid": 676,
                    "ssid": 64,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}