{
    "ID": "J07-4005",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "There has been a great deal of recent research into word sense disambiguation, particularly since the inception of the Senseval evaluation exercises.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because a word often has more than one meaning, resolving word sense ambiguity could benefit applications that need some level of semantic interpretation of language input.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A major problem is that the accuracy of word sense disambiguation systems is strongly dependent on the quantity of manually sense-tagged data available, and even the best systems, when tagging every word token in a document, perform little better than a simple heuristic that guesses the first, or predominant, sense of a word in all contexts.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The success of this heuristic is due to the skewed nature of word sense distributions.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Data for the heuristic can come from either dictionaries or a sample of sense- tagged data.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, there is a limited supply of the latter, and the sense distributions and predominant sense of a word can depend on the domain or source of a document.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(The first sense of “star” for example would be different in the popular press and scientific journals).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this article, we expand on a previously proposed method for determining the predominant sense of a word automatically from raw text.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We look at a number of different data sources and parameterizations of the method, using evaluation results and error analyses to identify where the method performs well and also where it does not.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, we find that the method does not work as well for verbs and adverbs as nouns and adjectives, but produces more accurate predominant sense information than the widely used SemCor corpus for nouns with low coverage in that corpus.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We further show that the method is able to adapt successfully to domains when using domain specific corpora as input and where the input can either be hand-labeled for domain or automatically classified.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "∗ Department of Informatics, Brighton BN1 9QH, UK.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email: {dianam,robk,juliewe,johnca}@sussex.ac.uk.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Submission received: 16 November 2005; revised submission received: 12 July 2006; accepted for publication 16 February 2007.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "© 2007 Association for Computational Linguistics",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "In word sense disambiguation, the “first sense” heuristic (choosing the first, or predominant sense of a word) is used by most state-of-the-art systems as a back-off method when information from the context is not sufficient to make a more informed choice.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this article, we present an in-depth study of a method for automatically acquiring predominant senses for words from raw text (McCarthy et al. 2004a).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The method uses distributionally similar words listed as “nearest neighbors” in automatically acquired thesauruses (e.g., Lin 1998a), and takes advantage of the observation that the more prevalent a sense of a word, the more neighbors will relate to that sense, and the higher their distributional similarity scores will be.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The senses of a word are defined in a sense inventory.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use WordNet (Fellbaum 1998) because this is widely used, is publicly available, and has plenty of gold-standard evaluation data available (Miller et al. 1993; Cotton et al. 2001; Preiss and Yarowsky 2001; Mihalcea and Edmonds 2004).",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distributional strength of the neighbors is associated with the senses of a word using a measure of semantic similarity which relies on the relationships between word senses, such as hyponyms (available in an inventory such as WordNet) or overlap in the definitions of word senses (available in most dictionaries), or both.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this article we provide a detailed discussion and quantitative analysis of the motivation behind the first sense heuristic, and a full description of our method.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We extend previously reported work in a number of different directions: • We evaluate the method on all parts of speech (PoS) on SemCor (Miller et al. 1993).",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous experiments (McCarthy et al. 2004c) evaluated only nouns on SemCor, or all PoS but only on the Senseval2 (Cotton et al. 2001) and Senseval3 (Mihalcea and Edmonds 2004) data.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evaluation on all PoS is much more extensive because the SemCor corpus is composed of 220,000 words in contrast to the 6 documents in the Senseval2 and -3 English all words data (10,000 words).",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• We compare two WordNet similarity measures in our evaluation on nouns, and also contrast performance using two publicly available thesauruses, both produced from the same NEWSWIRE corpus, but one derived using a proximity-based approach and the other using dependency relations from a parser.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It turns out that the results from the proximity-based thesaurus are comparable to those from the dependency based thesaurus; this is encouraging for applying the method to languages without sophisticated analysis tools.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• We manually analyze a sample of errors from the SemCor evaluation.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A small number of errors can be traced back to inherent shortcomings of our method, but the main source of error is due to noise from related senses.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a common problem for all WSD systems (Ide and Wilks 2006) but one which is only recently starting to be addressed by the WSD community (Navigli, Litkowski, and Hargraves 2007).",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• One motivation for an automatic method for acquiring predominant senses is that there will always be words for which there are insufficient data available in manually sense-tagged resources.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compare the performance of our automatic method with the first sense heuristic derived from SemCor on nouns in the Senseval2 data.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We find that the 554 automatic method outperforms the one obtained from manual annotations in SemCor for nouns with fewer than five occurrences in SemCor.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Aside from the lack of coverage of manually annotated data, there is a need for first sense heuristics to be specific to domain.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We explore the potential for applying the method with domain-specific text for all PoS in an experiment using a gold-standard domain-specific resource (Magnini and Cavaglia` 2000) which we have used previously only with nouns.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that although there is a little mileage to be had from domain-specific first sense heuristics for verbs, nouns benefit greatly from domain-specific training.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• In previous work (Koeling, McCarthy, and Carroll 2005) we produced manually sense-annotated domain-specific test corpora for a lexical sample, and demonstrated that predominant senses acquired (from hand-classified corpora) in the same domain as the test data outperformed the SemCor first sense.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We further this exploration by contrasting with results from training on automatically categorized text from the English Gigaword Corpus and show that the results are comparable to those using hand-classified domain data.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The article is organized as follows.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the next section we motivate the use of predominant sense information in WSD systems and the need for acquiring this information automatically.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 3 we give an overview of related work in WSD, focusing on the acquisition of prior sense distributions and domain-specific sense information.",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 describes our acquisition method.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 5 describes the experimental setup for the work reported in this article.",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 6 describes four experiments.",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first evaluates the first sense heuristic using predominant sense information acquired for all PoS on SemCor; for nouns we compare two semantic similarity methods and three different types of distributional thesaurus.",
                    "sid": 45,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also report an error analysis for all PoS of our method.",
                    "sid": 46,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second experiment compares the performance of the automatic method to the manually produced data in SemCor, on nouns in the Senseval2 data, looking particularly at nouns which have a low frequency in SemCor.",
                    "sid": 47,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third uses corpora in restricted domains and the subject field code gold standard of Magnini and Cavaglia` (2000) to investigate the potential for domain-specific rankings for different PoS.",
                    "sid": 48,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fourth compares results when we train and test on domain-specific corpora, where the training data is (1) manually categorized for domain and from the same corpus as the test data, and (2) where the training data is harvested automatically from another corpus which is categorized automatically.",
                    "sid": 49,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we conclude (Section 7) and discuss directions for future work (Section 8).",
                    "sid": 50,
                    "ssid": 50,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "motivation. ",
            "number": "2",
            "sents": [
                {
                    "text": "The problem of disambiguating the meanings of words in text has received much attention recently, particularly since the inception of the Senseval evaluation exercises (Kilgarriff and Palmer 2000; Preiss and Yarowsky 2001; Mihalcea and Edmonds 2004).",
                    "sid": 51,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the standard Senseval tasks (the “all words” task) is to tag each open class word with one of its senses, as listed in a dictionary or thesaurus such as WordNet (Fellbaum 1998).",
                    "sid": 52,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most accurate word sense disambiguation (WSD) systems use supervised machine learning approaches (Stevenson and Wilks 2001), trained on text which has been sense tagged by hand.",
                    "sid": 53,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the performance of these systems is strongly 555 dependent on the quantity of training data available (Yarowsky and Florian 2002), and manually sense-annotated text is extremely costly to produce (Kilgarriff 1998).",
                    "sid": 54,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The largest all words sense tagged corpus is SemCor, which is 220,000 words taken from 103 passages, each of about 2,000 words, from the Brown corpus (Francis and Kucˇera 1979) and the complete text of a 19th-century American novel, The Red Badge of Courage, which totals 45,600 words (Landes, Leacock, and Tengi 1998).",
                    "sid": 55,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Approximately half of the words in this corpus are open-class words (nouns, verbs, adjectives, and adverbs) and these have been linked to WordNet senses by human taggers using a software interface.",
                    "sid": 56,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The shortage of training data due to the high costs of tagging texts has motivated research into unsupervised methods for WSD.",
                    "sid": 57,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But in the English all-words tasks in Senseval2 and Senseval3 (Snyder and Palmer 2004), systems that did not make use of hand-tagged data (in some form or other) performed substantially worse than those that did.",
                    "sid": 58,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 summarizes the situation.",
                    "sid": 59,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It gives the precision and recall of the best1 two supervised (S) and unsupervised (U)2 systems for the English all words and English lexical sample for Senseval23 and -3, along with the first sense baseline (FS) reported by the task organizers.4 This is a simple application of the “first sense” heuristic—that is, using the most common sense of a word for every instance of it in the test corpus, regardless of context.",
                    "sid": 60,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although contextual WSD is of course preferable, the baseline is a very powerful one and unsupervised systems find it surprisingly hard to beat (indeed, some of the systems that report themselves as unsupervised actually make some use of a manually obtained first-sense heuristic).",
                    "sid": 61,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Considering both precision and recall, only 5 of 26 systems in the Senseval3 English all-words task beat the first sense heuristic as derived from SemCor (61.5%5 ), and then by only a few percentage points (the top system scoring 65% precision and recall) despite using hand-tagged training data available from SemCor and previous Senseval data sets, large sets of contextual features, and sophisticated machine learning algorithms.",
                    "sid": 62,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of WSD systems, at least for all-words tasks, seems to have plateaued at a level just above the first sense heuristic (Snyder and Palmer 2004).",
                    "sid": 63,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is due to the shortage of training data and the often fine granularity of sense distinctions.",
                    "sid": 64,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ide and Wilks (2006) argue that it is best to concentrate effort on distinctions which are useful for applications and where systems can be confident of high precision.",
                    "sid": 65,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In cases where systems are less confident, but word senses, rather than words, are needed, the first sense heuristic is a powerful back-off strategy.",
                    "sid": 66,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This strategy is dependent on information provided in dictionaries.",
                    "sid": 67,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two dictionaries that have been used by English WSD systems are the Longman Dictionary of Contemporary English (LDOCE) (Procter 1 We rank the systems by the recall scores, because this is the accuracy over the entire test set regardless of.",
                    "sid": 68,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "how many items were attempted.",
                    "sid": 69,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Note that the classification of systems as unsupervised is not straightforward.",
                    "sid": 70,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Systems reported as.",
                    "sid": 71,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "unsupervised in the Senseval proceedings sometimes make use of some manual annotations.",
                    "sid": 72,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the top scoring system that reported itself unsupervised in the Senseval3 lexical sample task used manually sense-tagged training data for constructing glosses.",
                    "sid": 73,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 The verb lexical sample was done as a separate exercise for Senseval2, and for brevity we have not.",
                    "sid": 74,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "included the results from this task.",
                    "sid": 75,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 The all-words task organizers used the first sense as listed in WordNet.",
                    "sid": 76,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is based on the SemCor first.",
                    "sid": 77,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sense because WordNet senses are ordered according to the frequency data in SemCor.",
                    "sid": 78,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, where senses are not found in WordNet, the ordering is arbitrarily determined as a function of the “grind” program (see http://wordnet.princeton.edu/man/grind.1WN.htm).",
                    "sid": 79,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lexical sample task organizers state that they use the “most frequent sense” but do not stipulate if this is taken from WordNet, or directly from SemCor.",
                    "sid": 80,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 This figure is the arithmetic mean of two published estimates (Snyder and Palmer 2004), the difference.",
                    "sid": 81,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "being due to the treatment of multiwords.",
                    "sid": 82,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "556 Table 1 The best two performing systems of each type (according to fine-grained recall) in Senseval2 and -3.",
                    "sid": 83,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All words Lexical sample Precision (%) Recall (%) Precision (%) Recall (%) Sen sev al2 S 6 9 . 0 6 9 . 0 6 4 . 2 6 4 . 2 Sen sev al2 S 6 3 . 6 6 3 . 6 6 3 . 8 6 3 . 8 Sen sev al2 U 4 5 . 1 4 5 . 1 4 0 . 2 4 0 . 1 Sen sev al2 U 3 6 . 0 3 6 . 0 5 8 . 1 3 1 . 9 FS bas elin e 5 7 . 0 5 7 . 0 4 7 . 6 4 7 . 6 Sen sev al3 S 6 5 . 1 6 5 . 1 7 2 . 9 7 2 . 9 Sen sev al3 S 6 5 . 1 6 4 . 2 7 2 . 6 7 2 . 6 Sen sev al3 U 5 8 . 3 5 8 . 2 6 6 . 1 6 5 . 7 Sen sev al3 U 5 5 . 7 5 4 . 6 5 6 . 3 5 6 . 3 FS bas elin e 6 1 . 5 6 1 . 5 5 5 . 2 5 5 . 2 1978) and WordNet (Fellbaum 1998).",
                    "sid": 84,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These both provide a ranking of senses according to their predominance.",
                    "sid": 85,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sense ordering in LDOCE is based on lexicographer intuition, whereas in WordNet the senses are ordered according to their frequency in SemCor (Miller et al. 1993).",
                    "sid": 86,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are two major problems with deriving a first sense heuristic from these types of resources.",
                    "sid": 87,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first is that the predominant sense of a word varies according to the source of the document (McCarthy and Carroll 2003) and with the domain.",
                    "sid": 88,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the first sense of star as derived from SemCor is celestial body, but if one were disambiguating popular news stories then celebrity would be more likely.",
                    "sid": 89,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Domain, topic, and genre are important in WSD (Martinez and Agirre 2000; Magnini et al. 2002) and the sense-frequency distributions of words depend on all of these factors.",
                    "sid": 90,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Any dictionary will provide only a single sense ranking, whether this is derived from sense- tagged data as in WordNet, lexicographer intuition as in LDOCE, or inspection of corpus data as in the Oxford Advanced Learner ’s Dictionary (Hornby 1989).",
                    "sid": 91,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A fixed order of senses may not reflect the data that an NLP system is dealing with.",
                    "sid": 92,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second problem with obtaining predominant sense information applies to the use of hand-tagged resources, such as SemCor.",
                    "sid": 93,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such resources are relatively small due to the cost of manual tagging (Kilgarriff 1998).",
                    "sid": 94,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many words will simply not be covered, or occur only a few times.",
                    "sid": 95,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For many words in WordNet the ordering of word senses is based on a very small number of occurrences in SemCor.",
                    "sid": 96,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the first sense of tiger is an audacious person whereas most people would assume the carnivorous animal sense is more prevalent.",
                    "sid": 97,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because the two senses each occur exactly once in SemCor, and when there is no frequency information to break the tie the WordNet sense ordering is assigned arbitrarily.",
                    "sid": 98,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are many fairly common words (such as the noun crane) which do not occur at all in SemCor.",
                    "sid": 99,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 gives the number and percentage of words6 in WordNet and the BNC which do not occur in SemCor.",
                    "sid": 100,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As one would expect from Zipf’s law, a substantial number of words do not occur in SemCor, even when we do not consider multiwords.",
                    "sid": 101,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many of these words are extremely rare, but 6 Here and elsewhere in this article we give figures only for words without embedded spaces, that is, not.",
                    "sid": 102,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "multiwords.",
                    "sid": 103,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "557 Table 2 Words (excluding multiwords) in WordNet 1.7.1 and the BNC without any data in SemCor.",
                    "sid": 104,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Po S Word Net types No . % BNC type s No.",
                    "sid": 105,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "% no un 43 ,7 81 81 .9 36 0,5 35 97.",
                    "sid": 106,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 ver b 4 , 7 4 1 56 .4 2 5, 2 9 2 87.",
                    "sid": 107,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 adj ecti ve 14 ,9 91 72 .3 9 5, 9 0 8 95.",
                    "sid": 108,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 adv erb 2 , 4 0 5 64 .4 1 0, 2 2 3 89.",
                    "sid": 109,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Table 3 Polysemous word types in the Senseval2 and -3 English all-words tasks test documents with no data in SemCor (0 columns), or with very little data (≤ 1 and ≤ 5 occurrences).",
                    "sid": 110,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that there are no annotations for adverbs in the Senseval3 documents.",
                    "sid": 111,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Senseval2 Senseval3 0 ≤ 1 ≤ 5 0 ≤ 1 ≤ 5 PoS No.",
                    "sid": 112,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "% No.",
                    "sid": 113,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "% No.",
                    "sid": 114,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "% No.",
                    "sid": 115,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "% No.",
                    "sid": 116,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "% No.",
                    "sid": 117,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "% no un 12 3.",
                    "sid": 118,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 28 7.",
                    "sid": 119,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 49 12 .9 1 3 3.",
                    "sid": 120,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 26 6.",
                    "sid": 121,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 69 16 .7 ver b 7 2.",
                    "sid": 122,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 11 3.",
                    "sid": 123,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 28 8 . 6 3 0.",
                    "sid": 124,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 10 2.",
                    "sid": 125,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 36 10 .4 adj ecti ve 9 4.",
                    "sid": 126,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 16 7.",
                    "sid": 127,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 50 23 .1 8 4.",
                    "sid": 128,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 15 8.",
                    "sid": 129,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 33 19 .5 adv erb 1 0.",
                    "sid": 130,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 1 0.",
                    "sid": 131,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 2 1 . 8 – – – – – – in any given document it is likely that there will be at least some words without SemCor data.",
                    "sid": 132,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 quantifies this, for the Senseval2 and -3 all-words tasks test data, showing the percentage of polysemous word types with no frequency information in SemCor, the percentage with zero or one occurrences, and the percentage with up to five occurrences.",
                    "sid": 133,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(For example, the table indicates that 12.9% of nouns in the Senseval2 data, and 16.7% in Senseval3, have five or fewer occurrences in SemCor.)",
                    "sid": 134,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, although SemCor may cover many frequently occurring word types in a given document, there are likely to be a substantial proportion for which there is very little or no information available.",
                    "sid": 135,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tables 4 and 5 present an analysis of the actual ambiguity of polysemous words within the six documents making up the Senseval2 and -3 all-words test data.",
                    "sid": 136,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They show the extent to which these words are used in a predominant sense, within a document, and the extent to which this is the same as that given by SemCor.",
                    "sid": 137,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two tables share a common format: columns 2–5 give percentages over all “document/word type” combinations.",
                    "sid": 138,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second column shows the percentage of the “document/word type” combinations where the word is used in the document in only one of its senses.",
                    "sid": 139,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fourth column shows the same percentage but for “document/word type” combinations where the word is used in more than one sense in the document.",
                    "sid": 140,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third and fifth columns give the percentage of the words in the preceding columns (second and fourth, respectively) where the first sense for the word in the document is the same as in SemCor (FS = SC FS).",
                    "sid": 141,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the third column, this is the only sense that this word appears in within the document.",
                    "sid": 142,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Note that for any row, columns 2 and 4 account for all possibilities so will always add up to 100.)",
                    "sid": 143,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sixth column gives the mean degree of polysemy, according to WordNet, for the set of words that these figures are calculated for.",
                    "sid": 144,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "558 Table 4 Most frequent sense analysis for Senseval2 and -3 polysemous lemmas occurring more than once in a document (adverb data is only from Senseval2).",
                    "sid": 145,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 sense > 1 sense PoS % FS = SC FS % % FS = SC FS % Mean polysemy no un 7 2 . 2 5 2 . 2 2 7 . 8 7 . 3 5 . 9 ver b 4 5 . 6 2 5 . 1 5 4 . 4 1 6 . 9 1 2 . 7 adj ecti ve 6 2 . 9 4 0 . 5 3 7 . 1 1 0 . 3 4 . 8 adv erb 6 4 . 7 5 0 . 0 3 5 . 3 1 7 . 6 4 . 7 The figures in Table 4 are for words occurring more than once in a given Senseval test document.",
                    "sid": 146,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tendency for words to be used in only one sense in any given document7 is strongest for nouns, although adverbs and adjectives also tend towards one sense.",
                    "sid": 147,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verbs are on average much more polysemous than the other parts of speech yet still 45.6% of polysemous verbs which occur more than once are used in only a single sense.",
                    "sid": 148,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, because verbs are in general more polysemous, it makes it less likely that if a verb occurs in only one sense in a document then it will be the one indicated by SemCor.",
                    "sid": 149,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The figures in Table 5 are for all words in the Senseval documents (not just those occurring more than once), showing the accuracy of a SemCor-derived first-sense heuristic for words with a frequency below a specified threshold (column 1) in SemCor.",
                    "sid": 150,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The table shows that although having a first sense from SemCor is certainly useful, when looking at figures for all the words in the Senseval documents a good proportion have first senses other than the one indicated by SemCor.",
                    "sid": 151,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the lower the frequency in SemCor the more likely that the first sense indicated by SemCor is wrong.",
                    "sid": 152,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(However, the situation is slightly different for adverbs because there are not many with low frequency in SemCor and they are on average not very polysemous, so for them a first sense derived from a resource like SemCor—where one exists—is possibly sufficient.)",
                    "sid": 153,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results show that although SemCor is a useful resource, there will always be words for which its coverage is inadequate.",
                    "sid": 154,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, few languages have extensive hand-tagged resources or sense orderings produced by lexicographers.",
                    "sid": 155,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, general resources containing word sense information are not likely to be appropriate when processing language for a wider variety of domains, topics, and genres.",
                    "sid": 156,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What is needed is a means to find predominant senses automatically.",
                    "sid": 157,
                    "ssid": 107,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "3",
            "sents": [
                {
                    "text": "Most research in WSD to date has concentrated on using contextual features, typically neighboring words, to help infer the correct sense of a target word.",
                    "sid": 158,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, our work is aimed at discovering the predominant sense of a word from raw text because 7 The tendency for words to be used in only one sense in a given discourse is weaker for fine-grained.",
                    "sid": 159,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "distinctions (Krovetz 1998) compared to coarse-grained distinctions (Gale, Church, and Yarowsky 1992).",
                    "sid": 160,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, even with a fine-grained inventory the first sense heuristic is certainly powerful, as shown in Table 1.",
                    "sid": 161,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "559 Table 5 Most frequent sense analysis for all polysemous lemmas in the Senseval2 and -3 test data, broken down by their frequencies of occurrence in SemCor (adverb data is only from Senseval2).",
                    "sid": 162,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 sense > 1 sense Frequency % FS = SC FS % % FS = SC FS % Mean polysemy ≤ 1 (54) 9 6 . 3 2 4 . 1 n o u n 3.",
                    "sid": 163,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 0 . 0 2 . 8 ≤ 5 (11 8) 9 6 . 6 4 3 . 2 3.",
                    "sid": 164,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 0 . 0 3 . 2 ≤ 10 (19 1) 9 6 . 9 4 8 . 7 3.",
                    "sid": 165,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 0 . 0 3 . 3 all (79 2) 8 8 . 8 5 1 . 6 11.",
                    "sid": 166,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 2 . 5 5 . 5 v e r b ≤ 1 (21) 1 0 0 . 0 3 3 . 3 0.",
                    "sid": 167,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0 . 0 2 . 4 ≤ 5 (64) 9 8 . 4 3 5 . 9 1.",
                    "sid": 168,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 1 . 6 3 . 2 ≤ 10 (11 0) 9 8 . 2 3 8 . 2 1.",
                    "sid": 169,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 1 . 8 3 . 5 all (67 1) 8 2 . 6 3 9 . 3 17.",
                    "sid": 170,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 5 . 1 9 . 0 ad je cti ve ≤ 1 (31) 9 3 . 5 1 9 . 4 6.",
                    "sid": 171,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 0 . 0 2 . 5 ≤ 5 (83) 9 5 . 2 3 4 . 9 4.",
                    "sid": 172,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 1 . 2 2 . 7 ≤ 10 (12 0) 9 0 . 8 4 0 . 8 9.",
                    "sid": 173,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 1 . 7 2 . 8 all (38 5) 8 2 . 6 4 6 . 2 17.",
                    "sid": 174,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 3 . 6 5 . 1 a d v e r b ≤ 1 (1) 0 . 0 0 . 0 100.",
                    "sid": 175,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0 . 0 2 . 0 ≤ 5 (2) 5 0 . 0 5 0 . 0 50.",
                    "sid": 176,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0 . 0 2 . 0 ≤ 10 (8) 8 7 . 5 6 2 . 5 12.",
                    "sid": 177,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 0 . 0 2 . 3 all (11 1) 8 2 . 9 6 2 . 2 17.",
                    "sid": 178,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 5 . 4 4 . 0 the first sense heuristic is so powerful, and because manually sense-tagged data is not always available.",
                    "sid": 179,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lapata and Brew (2004) highlighted the importance of a good prior in WSD.",
                    "sid": 180,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They used syntactic evidence to find a prior distribution for Levin (1993) verb classes, and incorporated this in a WSD system.",
                    "sid": 181,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lapata and Brew obtained their priors for verb classes directly from subcategorization evidence in a parsed corpus, whereas we use parsed data to find distributionally similar words (nearest neighbors) to the target word which reflect the different senses of the word and have associated distributional similarity scores which can be used for ranking the senses according to prevalence.",
                    "sid": 182,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would, however, agree that subcategorization evidence should be very useful for disambiguating verbs, and would hope to combine such evidence with our ranking models for context-based WSD.",
                    "sid": 183,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A major benefit of our work is that this method permits us to produce predominant senses for any desired domain and text type.",
                    "sid": 184,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Buitelaar and Sacaleanu (2001) explored ranking and selection of synsets in GermaNet for specific domains using the words in a given synset, and those related by hyponymy, and a term relevance measure taken from information retrieval.",
                    "sid": 185,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Buitelaar and Sacaleanu evaluated their method on identifying domain-specific concepts using human judgments on 100 items.",
                    "sid": 186,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluate 560 our method using publicly available resources for balanced text, and, for domain- specific investigations, resources we have developed ourselves (Koeling, McCarthy, and Carroll 2005).",
                    "sid": 187,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Magnini and Cavaglia` (2000) associated WordNet word senses with particular domains, and this has proved useful for high precision WSD (Magnini et al. 2001); indeed, we have used their domain labels (or subject field codes, SFCs) for evaluation (Section 6.3).",
                    "sid": 188,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Identification of these SFCs for word senses was semiautomatic and required a considerable amount of hand-labeling.",
                    "sid": 189,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach requires only raw text from the given domain and because of this it can easily be applied to a new domain or sense inventory, as long as there is enough appropriate text.",
                    "sid": 190,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are other approaches aimed at gleaning domain-specific information from raw data.",
                    "sid": 191,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gliozzo, Giuliano, and Strapparava (2005) induced domain models from raw data using unsupervised latent semantic models and then fed this into a supervised WSD model and evaluated on Senseval3 lexical sample data in four languages.",
                    "sid": 192,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chan and Ng (2005) obtained probability distributions to feed into their supervised WSD models.",
                    "sid": 193,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They used multilingual parallel corpus data to provide probability estimates for a subset of 22 nouns from the lexical sample task.",
                    "sid": 194,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They then fed this into a supervised WSD model and verified that the estimates for prior distributions improved performance for supervised WSD.",
                    "sid": 195,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We intend eventually to use our prevalence scores to feed into unsupervised WSD models.",
                    "sid": 196,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although unsupervised models seem to be beaten whenever there is training data to be had, we anticipate that unsupervised models with improved priors from the ranking might outperform supervised systems in situations where there is little training data available.",
                    "sid": 197,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whereas this article is about finding predominant senses for back-off in a WSD system, the method could be applied to finding a prior distribution over all word senses of each target word.",
                    "sid": 198,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is our intention that the back-off models produced by our prevalence ranking, either as predominant senses or prior distributions over word senses, could be combined with contextual information for WSD.",
                    "sid": 199,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mohammad and Hirst (2006) describe an approach to acquiring predominant senses from corpora which makes use of the category information in the Macquarie Thesaurus.",
                    "sid": 200,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation is performed on an artificially constructed test set from unambiguous words in the same category as the 27 test words (nouns, verbs, and adjectives).",
                    "sid": 201,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The senses of the words are the categories of the thesaurus and the experiment uses only two senses of each word, the two most predominant ones.",
                    "sid": 202,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The predominance of the two senses is altered systematically.",
                    "sid": 203,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are encouraging because a much smaller amount of corpus data is needed compared to our approach.",
                    "sid": 204,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, their method has only been applied to an artificially constructed test set, rather than a publicly available corpus, and has yet to be applied in a domain-specific setting, which is the chief motivation of our work.",
                    "sid": 205,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The work of Pantel and Lin (2002) is probably the most closely related study that predates ours, although their ultimate goal is different.",
                    "sid": 206,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pantel and Lin devised a method called CBC (clustering by committee) where the 10 nearest neighbors of a word in a distributional thesaurus are clustered to identify the various senses of the word.",
                    "sid": 207,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pantel and Lin use a measure of semantic similarity (Lin 1997) to evaluate the discovered classes with respect to WordNet as a gold standard.",
                    "sid": 208,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CBC method obtained a precision of 61% (the percentage of senses discovered that did exist in WordNet) and a recall of 51% (the percentage of senses discovered from the union of those discovered with different clustering algorithms that they tried).8 8 The calculation of recall was over the union of senses discovered automatically, rather than over the.",
                    "sid": 209,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "senses in WordNet, because senses in WordNet may be unattested in the data.",
                    "sid": 210,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "561 Pantel and Lin’s approach is related to ours in that, in their sense discovery procedure, predominant senses have more of a chance of being found than other senses, although their algorithm is specifically tailored to look for senses regardless of frequency.",
                    "sid": 211,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To do this the algorithm removes neighbors of the target word once they are assigned to a cluster so that less frequent senses can be discovered.",
                    "sid": 212,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our method, described in detail in Section 4, associates the nearest neighbors to the senses of the target in a predefined inventory (we use WordNet).",
                    "sid": 213,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We rank the senses using a measure which sums over the distributional similarity of neighbors weighted by the strength of the association between the neighbors and the sense.",
                    "sid": 214,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is done on the assumption that more prevalent senses will have strong associations with more nearest neighbors because they have occurred in more contexts in the corpus used for producing the thesaurus.",
                    "sid": 215,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both the number and the distributional similarity of the neighbors are used in our prevalence ranking measure.",
                    "sid": 216,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pantel and Lin process the possible clusters in order of their average distributional similarity and number of neighbors but do not take the number of neighbors into account in the scores given for the clusters.",
                    "sid": 217,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The measures that Pantel and Lin associate with their clusters are determined by the cohesiveness of the cluster with the target word because their aim is one of sense discovery.",
                    "sid": 218,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their measure is the similarity between the cluster and the target word and does not retain the distributional similarity of the neighbors within the cluster.",
                    "sid": 219,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is quite possible that there is a low frequency sense of a target word with synonyms that form a nice cohesive group.",
                    "sid": 220,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the number of neighbors assigned to a cluster may correlate with our ranking score, intuition suggests that a combination of the quantity and distributional similarity of neighbors to the target word sense is best for determining the relative predominance of senses.",
                    "sid": 221,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 6 we test this hypothesis using a simplified version of our method which only uses the number of neighbors, and assigns each to one sense.",
                    "sid": 222,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparisons with the CBC algorithm as it stands would be difficult because in order to evaluate acquisition of predominance information we have used publicly available gold-standard sense-tagged corpora, and these have WordNet senses.",
                    "sid": 223,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CBC will not always find WordNet senses.",
                    "sid": 224,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, using the online demonstration of CBC,9 several common senses from nouns from the Senseval2 lexical sample are not discovered, including the upright object sense of post, the block of something sense of bar, the daytime sense of day and the meaning of the word sense of the word sense.",
                    "sid": 225,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Automatic acquisition of sense inventories is an important endeavor, and we hope to look at ways of combining our method for detecting predominance with automatically induced inventories such as those produced by CBC.",
                    "sid": 226,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation of induced inventories should be done in the context of an application, because the senses will be keyed to the acquisition corpus and not to WordNet.",
                    "sid": 227,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Induction of senses allows coverage of senses appearing in the data that are not present in a predefined inventory.",
                    "sid": 228,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although we could adapt our method for use with an automatically induced inventory, our method which uses WordNet might also be combined with one that can automatically find new senses from text and then relate these to WordNet synsets, as Ciaramita and Johnson (2003) and Curran (2005) do with unknown nouns.",
                    "sid": 229,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 We used the demonstration at http://www.isi.edu/~pantel/Content/Demos/LexSem/cbc.htm with the.",
                    "sid": 230,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "option to include all corpora (TREC2002, TREC9, and COSMOS).",
                    "sid": 231,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "562",
                    "sid": 232,
                    "ssid": 75,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "method. ",
            "number": "4",
            "sents": [
                {
                    "text": "In our method, the predominant sense for a target word is determined from a prevalence ranking of the possible senses for that word.",
                    "sid": 233,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The senses come from a predefined inventory (which might be a dictionary or WordNet-like resource).",
                    "sid": 234,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ranking is derived using a distributional thesaurus automatically produced from a large corpus, and a semantic similarity measure defined over the sense inventory.",
                    "sid": 235,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distributional thesaurus contains a set of words that are “nearest neighbors” to the target word with respect to similarity of the way in which they are distributed.",
                    "sid": 236,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Distributional similarity is based on the hypothesis of Harris, 1968, that words which occur in similar contexts have related meanings.)",
                    "sid": 237,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The thesaurus assigns a distributional similarity score to each neighbor word, indicating its closeness to the target word.",
                    "sid": 238,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the nearest10 neighbors of sandwich might be: salad, pizza, bread, soup... and the nearest neighbors of the polysemous noun star11 might be: actor, footballer, planet, circle...",
                    "sid": 239,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These neighbors reflect the various senses of the word, which for star might be: • a celebrity • a celestial body • a shape • a sign of the zodiac12 We assume that the number and distributional similarity scores of neighbors pertaining to a given sense of a target word will reflect the prevalence of that sense in the corpus from which the thesaurus was derived.",
                    "sid": 240,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because the more prevalent senses of the word will appear more frequently and in more contexts than other, less prevalent senses.",
                    "sid": 241,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The neighbors of the target word relate to its senses, but are themselves word forms rather than senses.",
                    "sid": 242,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The senses of the target word are predefined in a sense inventory and we use a semantic similarity score defined over the sense inventory to relate the neighbors to the various senses of the target word.",
                    "sid": 243,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two semantic similarity scores that we use in this article are implemented in the WordNet similarity package.",
                    "sid": 244,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One uses the overlap in definitions of word senses, based on Lesk (1986), and the other uses a combination of corpus statistics and the WordNet hyponym hierarchy, based on Jiang and Conrath (1997).",
                    "sid": 245,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describe these fully in Section 4.2.",
                    "sid": 246,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now describe intuitively 10 In this and other examples we restrict ourselves to four neighbors for brevity..",
                    "sid": 247,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "11 In this example we assume that the sense inventory assigns four senses to star, but the inventory could.",
                    "sid": 248,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "assign fewer or more depending on its level of granularity and level of detail.",
                    "sid": 249,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "12 Note that this zodiac or horoscope sense of star usually occurs as part of the multiword star sign (e.g.,.",
                    "sid": 250,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "your star sign secrets revealed) or in plural form (your stars today—free online).",
                    "sid": 251,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "563 the measure for ranking the senses according to predominance, and then give a more formal definition.",
                    "sid": 252,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The measure uses the sum total of the distributional similarity scores of the k nearest neighbors.",
                    "sid": 253,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This total is divided between the senses of the target word by apportioning the distributional similarity of each neighbor to the senses.",
                    "sid": 254,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The contribution of each neighbor is measured in terms of its distributional similarity score so that “nearer ” neighbors count for more.",
                    "sid": 255,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distributional similarity score of each neighbor is divided between the various senses rather than attributing the neighbor to only one sense.",
                    "sid": 256,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is done because neighbors can relate to more than one sense due to relationships such as systematic polysemy.",
                    "sid": 257,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the thesaurus we describe subsequently in Section 4.1 acquired from the BNC, chicken has neighbors duck and goose which relate to both the meat and animal senses.",
                    "sid": 258,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We apportion the contribution of a neighbor to each of the word senses according to a weight which is the normalized semantic similarity score between the sense and the neighbor.",
                    "sid": 259,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We normalize the semantic similarity scores because some of the semantic similarity scores that we use, described in Section 4.2, can get disproportionately large.",
                    "sid": 260,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because we normalize the semantic similarity scores, the sum of the ranking scores for a word equals the sum of the distributional similarity scores.",
                    "sid": 261,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To summarize, we rank the senses of the target word, such as star, by apportioning the distributional similarity scores of the top k neighbors between the senses.",
                    "sid": 262,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each distributional similarity score (dss) is weighted by a normalized semantic similarity score (sss) between the sense and the neighbor.",
                    "sid": 263,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This process is illustrated in Figure 1.",
                    "sid": 264,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More formally, to find the predominant sense of a word (w) we take each sense in turn and obtain a prevalence score.",
                    "sid": 265,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let Nw = {n1 , n2 ...nk } be the ordered set of the top scoring k neighbors of w from the distributional thesaurus with associated scores {dss(w, n1 ), dss(w, n2 ), ...dss(w, nk )}.",
                    "sid": 266,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let senses(w) be the set of senses of w in the sense inventory.",
                    "sid": 267,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each sense of w (si ∈ senses(w)) we obtain a prevalence score by summing over the dss(w, nj ) of each neighbor (nj ∈ Nw ) multiplied by a weight.",
                    "sid": 268,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This weight is the sss between the target sense (si ) and nj divided by the sum of all sss scores for senses(w) Figure 1 The prevalence ranking process for the noun star.",
                    "sid": 269,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "564 and nj . sss is the maximum WordNet similarity score (ssst) between si and the senses of nj (sx ∈ senses(nj )).13 Each sense si ∈ senses(w) is therefore assigned a score as follows: sss(si, nj ) Prevalence Score(w, si ) = ) nj ∈Nw dss(w, nj ) × siit ∈senses(w) sss(s iit , n ) (1) where sss(si, nj ) = max sx ∈senses(nj ) ssst (si , sx ) (2) We describe dss and ssst in Sections 4.1 and 4.2.",
                    "sid": 270,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the dss for a given neighbor is shared between the different senses of w depending on the weight given by the normalized sss.",
                    "sid": 271,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 The Distributional Similarity Score.",
                    "sid": 272,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Measures of distributional similarity take into account the shared contexts of the two words.",
                    "sid": 273,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several measures of distributional similarity have been described in the literature.",
                    "sid": 274,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, dss is computed using Lin’s similarity measure (Lin 1998a).",
                    "sid": 275,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We set the number of nearest neighbors to equal 50.14 We use three different sources of data for our first two experiments, resulting in three distributional thesauruses.",
                    "sid": 276,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are described in the next section.",
                    "sid": 277,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use domain-specific data for our third and fourth experiments.",
                    "sid": 278,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The data sources for these are described in Sections 6.3 and 6.4.",
                    "sid": 279,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A word, w, is described by a set of features, f , each with an associated frequency, where each feature is a pair (r, x) consisting of a grammatical relation name and the other word in the relation.",
                    "sid": 280,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We computed distributional similarity scores for every pair of words of the same PoS where each word’s total feature frequency was at least 10.",
                    "sid": 281,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A thesaurus entry of size k for a target word w is then defined as the k most similar words to w. A large number of distributional similarity measures have been proposed in the literature (see Weeds 2003 for a review) and comparing them is outside the scope of this work.",
                    "sid": 282,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the study of Weeds and Weir (2005) provides interesting insights into what makes a “good” distributional similarity measure in the contexts of semantic similarity prediction and language modeling.",
                    "sid": 283,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, weighting features by pointwise mutual information (Church and Hanks 1989) appears to be beneficial.",
                    "sid": 284,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pointwise mutual information (I(w, f )) between a word and a feature is calculated as I(w, f ) = log P( f |w) P( f ) (3) Intuitively, this means that the occurrence of a less-common feature is more important in describing a word than a more-common feature.",
                    "sid": 285,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the verb eat is more selective and tells us more about the meaning of its arguments than the verb be.",
                    "sid": 286,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "13 We use sss for the semantic similarity between a WordNet sense and another word, the neighbor.",
                    "sid": 287,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use.",
                    "sid": 288,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ssst for the semantic similarity between two WordNet senses, si and a sense of the neighbor (sx ).",
                    "sid": 289,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "14 From previous work (McCarthy et al. 2004b), the value of k has a minimal effect on finding the.",
                    "sid": 290,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "predominant sense; however, we will continue experimentation with this in the future for using our ranking score for estimating probability distributions of senses, because a sufficiently large value of k will be needed to include neighbors for rarer senses.",
                    "sid": 291,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "565 We chose to use the distributional similarity score described by Lin (1998a) because it is an unparameterized measure which uses pointwise mutual information to weight features and which has been shown (Weeds 2003) to be highly competitive in making predictions of semantic similarity.",
                    "sid": 292,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This measure is based on Lin’s information-theoretic similarity theorem (Lin 1997): The similarity between A and B is measured by the ratio between the amount of information needed to state the commonality of A and B and the information needed to fully describe what A and B are.",
                    "sid": 293,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our application, if T(w) is the set of features f such that I(w, f ) is positive, then the similarity between two words, w and n, is 'Sf ∈T(w)∩T(n) I(w, f ) + I(n, f )1 dss(w, n) = f ∈T(w) I(w, f ) + 'Sf ∈T(n) I(n, f ) (4) However, due to this choice of dss and the openness of the domain, we restrict ourselves to only considering words with a total feature frequency of at least 10.",
                    "sid": 294,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Weeds et al.",
                    "sid": 295,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2005) do show that distributional similarity can be computed for lower frequency words but this is using a highly specialized corpus of 400,000 words from the biomedical domain.",
                    "sid": 296,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, it has been shown (Weeds et al. 2005; Weeds and Weir 2005) that performance of Lin’s distributional similarity score decreases more significantly than other measures for low frequency nouns.",
                    "sid": 297,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We leave the investigation of other distributional similarity scores and the application to smaller corpora as areas for further study.",
                    "sid": 298,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 The Semantic Similarity Scores.",
                    "sid": 299,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WordNet is widely used for research in WSD because it is publicly available and there are a number of associated sense-tagged corpora (Miller et al. 1993; Cotton et al. 2001; Preiss and Yarowsky 2001; Mihalcea and Edmonds 2004) available for testing purposes.",
                    "sid": 300,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several semantic similarity scores have been proposed that leverage the structure of WordNet; for ssst we experiment with two of these, as implemented in the WordNet Similarity Package (Patwardhan and Pedersen 2003).",
                    "sid": 301,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The WordNet Similarity Package implements a range of similarity scores.",
                    "sid": 302,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "McCarthy et al.",
                    "sid": 303,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004b) experimented with six of these for the ssst used in the prevalence score, Equation (2).",
                    "sid": 304,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the experiments reported here we use the two scores that performed best in that previous work.",
                    "sid": 305,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We briefly summarize them here; Patwardhan, Banerjee, and Pedersen (2003) give a more detailed discussion.",
                    "sid": 306,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The scores measure the similarity between two WordNet senses (s1 and s2).",
                    "sid": 307,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "lesk This measure (Banerjee and Pedersen 2002) maximizes the number of overlapping words in the gloss, or definition, of the senses.",
                    "sid": 308,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It uses the glosses of semantically related (according to WordNet) senses too.",
                    "sid": 309,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the default version of the measure in the package with no normalizing for gloss length, and the default set of relations: lesk(s1, s2) = |{W1 ∈ definition(s1)}| ∩ |{W2 ∈ definition(s2)}| (5) where definitions(s) is the gloss definition of sense s concatenated with the gloss definitions of the senses related to s where the relationships are defined by the de 566 fault set of relations in the relations.dat file supplied with the WordNet Similarity package.",
                    "sid": 310,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "W ∈ definition(s) is the set of words from the concatenated definitions.",
                    "sid": 311,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "jcn This measure (Jiang and Conrath 1997) uses corpus data to populate classes (synsets) in the WordNet hierarchy with frequency counts.",
                    "sid": 312,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each synset is incremented with the frequency counts (from the corpus) of all words belonging to that synset, directly or via the hyponymy relation.",
                    "sid": 313,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The frequency data is used to calculate the “information content” (IC; Resnik 1995) of a class as follows: IC(s) = −log(p(s)) (6) Jiang and Conrath specify a distance measure: Djcn (s1, s2) = IC(s1) + IC(s2) − 2 × IC(s3) (7) where the third class (s3) is the most informative, or most specific, superordinate synset of the two senses s1 and s2.",
                    "sid": 314,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is converted to a similarity measure in the WordNet Similarity package by taking the reciprocal as in Equation (8) (which follows).",
                    "sid": 315,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this reason, the jcn values can get very large indeed when the distances are negligible, for example where the neighbor has a sense which is a synonym.",
                    "sid": 316,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a motivation for our normalizing the sss in Equation (1).",
                    "sid": 317,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "jcn(s1, s2) = 1/Djcn (s1, s2) (8) The IC data required for the jcn measure can be acquired automatically from raw text.",
                    "sid": 318,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used raw data from the BNC to create the IC files.",
                    "sid": 319,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are various parameters that can be set in the WordNet Similarity Package when creating these files; we used the RESNIK method of counting frequencies in WordNet (Resnik 1995), the stop words provided with the package, and no smoothing.",
                    "sid": 320,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lesk score is applicable to all parts of speech, whereas the jcn is applicable only to nouns and verbs because it relies on IC counts which are obtained using the hyponym links and these only exist for nouns and verbs.15 However, we did not use jcn for verbs because in previous experiments (McCarthy et al. 2004c) the lesk measure outperformed jcn because the structure of the hyponym hierarchy is very shallow for verbs and the measure is therefore considerably less informative for verbs than it is for nouns.",
                    "sid": 321,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 An Example.",
                    "sid": 322,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We illustrate the application of our measure with an example.",
                    "sid": 323,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For star, if we set16 k = 4 and have the dss for the previously given neighbors as in the first row of Table 6, and 15 For verbs these pointers actually encode troponymy, which is a particular kind of entailment relation,.",
                    "sid": 324,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "rather than hyponymy.",
                    "sid": 325,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "16 In this example, as before, we set k to 4 for the sake of brevity..",
                    "sid": 326,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "567 Table 6 Example dss and sss scores for star and its neighbors.",
                    "sid": 327,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Neighbors of star (dss) Senses actor (0.22) footballer (0.12) planet (0.08) circle (0.03) cel ebr ity 0 . 4 2 0 . 5 3 0 . 0 2 0 . 0 1 cel esti al bo dy 0 . 0 1 0 . 0 1 0 . 6 8 0 . 1 0 sha pe 0 . 0 0 . 0 0 . 0 2 0 . 7 8 zod iac 0 . 0 3 0 . 0 3 0 . 2 1 0 . 0 1 Tot al 0 . 4 6 0 . 5 7 0 . 9 3 0 . 9 0 the sss between the senses and the neighbors as in the remaining rows, the prevalence score for celebrity would be: = 0.22 × 0.42 + 0.12 × 0.53 + 0.08 × 0.02 + 0.03 × 0.01 = 0.2009 + 0.1116 + 0.0017 + 0.0003 = 0.3145 The prevalence score for each of the senses would be: pre vale nce scor e(ce lebr ity) = 0.3 14 5 pre vale nce scor e(ce lesti al bod y) = 0.0 68 7 pre vale nce scor e(sh ape ) = 0.0 27 7 pre vale nce scor e(zo dia c) = 0.0 39 0 so the method would select celebrity as the predominant sense.",
                    "sid": 328,
                    "ssid": 96,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental setup. ",
            "number": "5",
            "sents": [
                {
                    "text": "5.1 The Distributional Thesauruses.",
                    "sid": 329,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The three thesauruses used in our first two experiments were all created automatically from raw corpus data, based either on grammatical relations between words computed by syntactic parsers or alternatively on word proximity relations.",
                    "sid": 330,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We created the first thesaurus, which we call BNC, from grammatical relation output produced by the RASP system (Briscoe and Carroll 2002) applied to the 90M words of the “written” portion of the British National Corpus (Leech 1992), for all polysemous nouns, verbs, adjectives, and adverbs in WordNet.",
                    "sid": 331,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each word we considered co- occurring words in the grammatical contexts listed in Table 7.",
                    "sid": 332,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first two experiments, we also use two further automatically computed distributional thesauruses, produced by Dekang Lin from 125M words of text from the Wall Street Journal, San Jose Mercury News, and AP Newswire, using the same similarity measure.",
                    "sid": 333,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The thesauruses are publicly available.17 One was constructed based on word 17 The thesauruses are available for download from http://www.cs.ualberta.ca/~lindek/.",
                    "sid": 334,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "downloads.htm.",
                    "sid": 335,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "568 Table 7 Grammatical contexts used for acquiring the BNC thesaurus.",
                    "sid": 336,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PoS Grammatical contexts noun verb in direct object or subject relation, adjective or noun modifier verb noun as direct object or subject adjective modified noun, modifying adverb adverb modified adjective or verb Table 8 Thesaurus coverage of polysemous words (excluding multiwords) in WordNet 1.6.",
                    "sid": 337,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Po S T h e s a u r u s ty pe s NI SC NI TH no un B N C 7, 09 0 2,4 36 1 1 5 no un D E P 6, 58 3 2,1 76 2 1 7 no un P R O X 6, 58 2 2,1 76 2 1 7 ver b B N C 2, 95 8 5 5 3 4 5 adj ecti ve B N C 3, 65 9 1,2 08 1 2 3 adv erb B N C 5 0 5 1 3 2 3 8 similarities computed from syntactic dependencies produced by MINIPA R (Lin 1998b), and the other was constructed based on textual proximity relationships between words.",
                    "sid": 338,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We refer below to the original corpus as NEWSWIRE, and these two thesauruses as DEP and PROX, respectively.",
                    "sid": 339,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We restricted our experiments to the nouns in these thesauruses.",
                    "sid": 340,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 8 contains details of the numbers of polysemous (according to WordNet 1.6) words contained in these thesauruses, the number of words in SemCor that were not found in these thesauruses (NITH) and the number of words in the thesauruses that were not in SemCor (NISC).",
                    "sid": 341,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the experiments described in Sections 6.3 and 6.4 we use exactly the same method as that proposed for the BNC thesaurus, however the data source is different and is described in those sections.",
                    "sid": 342,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 The Sense Inventory.",
                    "sid": 343,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use WordNet version 1.6 as the sense inventory for our first three experiments, and 1.7.1 for our last experiment.18 For ssst we use the WordNet Similarity Package version 0.05 (Patwardhan and Pedersen 2003).",
                    "sid": 344,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "18 We use 1.6 which is a rather old version of WordNet so that we can directly evaluate on the SemCor data.",
                    "sid": 345,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "released with this version; we also use it to enable comparison with the results of McCarthy et al.",
                    "sid": 346,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004a).",
                    "sid": 347,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use WordNet 1.7.1 for the fourth experiment, because this is the version that was used for annotating the test data in that experiment.",
                    "sid": 348,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We plan to move to more recent versions of WordNet and experiment with other sense inventories in the future.",
                    "sid": 349,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "569",
                    "sid": 350,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "6",
            "sents": [
                {
                    "text": "In this section we describe four experiments using our method for acquiring predominant sense information.",
                    "sid": 351,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first experiment evaluates automatically acquired predominant senses for all parts of speech, using SemCor as the test corpus.",
                    "sid": 352,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This extends previous work which had only evaluated all PoS on Senseval2 (Cotton et al. 2001) and Senseval3 (Mihalcea and Edmonds 2004) data.",
                    "sid": 353,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The SemCor corpus is composed of 220,000 words, in contrast to the 6 documents in the Senseval2 and -3 English all-words data (10,000 words).",
                    "sid": 354,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We examine the effects of using the two different semantic similarity scores that performed well in previous work: jcn is quick to compute but lesk has the advantage that it is applicable to all PoS and can be implemented for any dictionary with sense definitions.",
                    "sid": 355,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compare three thesauruses: one is derived from the BNC and two from the NEWSWIRE corpus.",
                    "sid": 356,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two from the NEWSWIRE corpus examine the requirement for a parser by contrasting results obtained when the thesaurus is built using parsed data compared to a proximity approach.",
                    "sid": 357,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We contrast the results of the BNC thesaurus with a simplified version of the prevalence score which uses the number of the k neighbors closest to a sense for ranking without using the dss and without sharing the credit for a neighbor between senses.",
                    "sid": 358,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also perform an error analysis on a random sample of words for which a predominant sense was found that differed from that given by SemCor, identifying and giving an indication of the frequencies of the main sources of error.",
                    "sid": 359,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second experiment is on nouns in the Senseval2 all-words data, again using predominant senses acquired using each of the three distributional thesauruses, but in this experiment we explore the benefits of an automatic first sense heuristic when there is inadequate data in available resources.",
                    "sid": 360,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although McCarthy et al.",
                    "sid": 361,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004c) show that on Senseval2 and Senseval3 test data a first sense heuristic derived from SemCor outperforms the automatic method, we look at whether the method’s performance is relatively stronger on words for which there is little data in SemCor.",
                    "sid": 362,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is important because, as we have shown in Table 5, low frequency words are used often in senses other than the sense that is ranked first according to SemCor.",
                    "sid": 363,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the issue of lack of coverage of manually annotated resources, sense frequency will depend on the domain of the data.",
                    "sid": 364,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the third experiment, we revisit some previous work on noun senses and domain (McCarthy et al. 2004a) using corpora of news text about sports and finance.",
                    "sid": 365,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using distributional thesauruses computed from these corpora and a gold standard domain labeling of word senses we look at the potential for computing domain-specific predominant senses for parts of speech other than nouns.",
                    "sid": 366,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Continuing the line of research on automatic acquisition of domain-specific predominant senses, the fourth experiment compares results when we train and test on domain-specific corpora, where the training data is (1) manually categorized for domain and from the same corpus as the gold-standard test data, and (2) where the training data is harvested automatically from another corpus which is categorized automatically.",
                    "sid": 367,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1 Experiment 1: All Parts of Speech.",
                    "sid": 368,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this experiment, we evaluate the accuracy of automatically acquired predominant senses for all open class parts of speech, taking SemCor as the gold standard.",
                    "sid": 369,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For nouns we use the semantic similarity measures lesk and jcn, and for other parts of speech, lesk.",
                    "sid": 370,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the three distributional thesauruses BNC, DEP, and PROX.",
                    "sid": 371,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "570 The gold standard is derived from the Brown Corpus files publicly released as part of SemCor, rather than the processed data provided in the cntlist file in the WordNet distribution.",
                    "sid": 372,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The released SemCor files contain only the tagged data from the Brown Corpus and do not include data from The Red Badge of Courage.",
                    "sid": 373,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the released data rather than that in cntlist because this includes the actual tagged examples which are marked for genre by the Brown files.",
                    "sid": 374,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We envisage the possibility of further experiments with these genre markers.",
                    "sid": 375,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We only evaluate on instances where a single, unique sense is supplied by the annotators.",
                    "sid": 376,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, for example, we ignore instances like the following with multiple wnsn values: <wf cmd=done pos=NN lemma=tooth wnsn=3;1 lexsn=1:05:02::;1:08:00::>tooth</wf> We also only evaluate on polysemous words (according to WordNet) having one sense in SemCor which is more frequent than any other, and for which both SemCor and our thesauruses have at least a minimal amount of data.",
                    "sid": 377,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, a word must occur three or more times in SemCor; it must also occur in ten or more grammatical relations in the parsed version of the BNC and have neighbors in the distributional thesaurus, or be present in Dekang Lin’s thesaurus.19 We evaluate on nouns, verbs, adjectives, and adverbs separately, computing a number of accuracy measures, both type-based and token-based.",
                    "sid": 378,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PSacc is calculated over word types in SemCor which have one sense which occurs more than any other.",
                    "sid": 379,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is the accuracy of identifying the predominant sense in SemCor.",
                    "sid": 380,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the automatic ranking has a tie for the top ranked sense then we score that word as incorrect.20 So we have PS = |correcttyp | |typesmf | × 100 (9) where typesmf are the types in SemCor such that one sense is more frequent than any other, the word has occurred at least three times in SemCor and has an entry in the thesaurus.",
                    "sid": 381,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "|correcttyp | is the number of these where the automatically acquired predominant sense matches the first sense in SemCor.",
                    "sid": 382,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PSacc BL is the predominant sense random baseline, obtained as follows: PSacc BL = 'S 1 ∈ mf |senses(w)| |typesmf | × 100 (10) WSDsc is a token-based measure.",
                    "sid": 383,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is the WSD accuracy that would be obtained by using the first sense heuristic with the automatically acquired predominant sense information, in cases where there was a unique automatic top ranked sense: correcttok | WSDsc = | |SCtokensafs | × 100 (11) 19 Although we do not evaluate words for which there were no neighbors in the thesaurus, we could extend.",
                    "sid": 384,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the thesaurus to include some of these by widening the range of grammatical relations covered and compensating for some systematic PoS tagging errors.",
                    "sid": 385,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "20 If we exclude these words with joint top ranking from the automatic method (precision rather than recall).",
                    "sid": 386,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "then we obtain marginally higher accuracy for the jcn measure but no difference for lesk.",
                    "sid": 387,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "571 where |correcttok | is the number of tokens disambiguated correctly out of the tokens in SemCor having an automatically acquired first sense (SCtokensafs ).",
                    "sid": 388,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SC FS is the WSD accuracy of the SemCor first sense heuristic on the same set of tokens (SCtokensafs ), which is the upper bound because the information it uses is derived from the test data itself.",
                    "sid": 389,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "RBL is the random baseline for the WSD task, calculated by splitting the credit for each token to be tagged in the test data evenly between all of the word’s senses.",
                    "sid": 390,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "RBL = 'S 1 ∈ afs |senses(w)| |SCtokensafs | × 100 (12) The results are shown in Table 9.",
                    "sid": 391,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We examined differences between the semantic similarity measures (lesk and jcn), the BNC and DEP thesauruses, and the DEP and PROX thesauruses using the χ2 test of significance with one degree of freedom (Siegel and Castellan 1988).",
                    "sid": 392,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "None of the differences between the different combinations of similarity measures and thesauruses for the type-based measure PSacc are significant.",
                    "sid": 393,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The differences between lesk and jcn are significant for the token-based measure WSDsc for both the BNC and PROX thesauruses (both p < .001), however not when comparing lesk and jcn for the DEP thesaurus.",
                    "sid": 394,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although lesk is more accurate than jcn, at least on the WSD task, jcn is much faster because of the precompilation of IC in the WordNet similarity package; however, lesk has the additional benefit of being applicable to other parts of speech.",
                    "sid": 395,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The method gives particularly good results for adjectives, given that they have a similar random baseline to nouns.",
                    "sid": 396,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It does not do so well for adverbs and verbs, but still performs well above the random baseline which is low for verbs due to their high degree of polysemy.",
                    "sid": 397,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given that the first sense heuristic from SemCor is particularly strong for adverbs, it is disappointing that the automatic method does not perform as well as it does on adjectives.",
                    "sid": 398,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possible reason for this might be that adverbs are often less strongly associated to the verbs that they modify than adjectives are to the nouns that they modify, so the distributional thesaurus information is less reliable.",
                    "sid": 399,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another reason may be that less data are available for adverbs, both in the thesaurus and also in WordNet.",
                    "sid": 400,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 9 Evaluation on SemCor, polysemous words only.",
                    "sid": 401,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Type Token PoS Settings No.",
                    "sid": 402,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PSacc PSacc BL No.",
                    "sid": 403,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WSDsc SC FS RBL no un lesk BN C 2, 55 5 54 .5 3 2 . 3 5 3 , 4 6 8 4 8.",
                    "sid": 404,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 6 8 . 6 2 4.",
                    "sid": 405,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 no un lesk DE P 2, 43 7 56 .3 3 2 . 1 5 2 , 1 5 8 4 9.",
                    "sid": 406,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 6 8 . 4 2 4.",
                    "sid": 407,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 no un lesk PR OX 2, 43 7 55 .9 3 2 . 1 5 2 , 1 5 8 4 9.",
                    "sid": 408,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 6 8 . 4 2 4.",
                    "sid": 409,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 no un jcn BN C 2, 55 5 54 .0 3 2 . 3 5 3 , 4 2 9 4 6.",
                    "sid": 410,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 6 8 . 6 2 4.",
                    "sid": 411,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 no un jcn DE P 2, 43 6 56 .4 3 2 . 1 5 2 , 1 2 2 4 8.",
                    "sid": 412,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 6 8 . 4 2 4.",
                    "sid": 413,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 no un jcn PR OX 2, 43 6 55 .9 3 2 . 1 5 2 , 1 1 7 4 7.",
                    "sid": 414,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 6 8 . 4 2 4.",
                    "sid": 415,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 ver b lesk BN C 1, 14 9 45 .6 2 7 . 1 3 1 , 1 8 2 3 6.",
                    "sid": 416,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 5 7 . 1 1 7.",
                    "sid": 417,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 adj ecti ve lesk BN C 1, 15 4 60 .4 3 2 . 8 1 8 , 2 1 6 5 6.",
                    "sid": 418,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 7 3 . 8 2 4.",
                    "sid": 419,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 adv erb lesk BN C 2 3 0 52 .2 3 9 . 9 8 , 8 1 0 4 3.",
                    "sid": 420,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 7 6 . 1 3 3.",
                    "sid": 421,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 572 Comparing the results for the DEP and the PROX thesauruses, we see that although there is no significant difference in PSacc (with either lesk or jcn), there is for WSDsc when using jcn (p < .001), but not when comparing the lesk values for these thesauruses.",
                    "sid": 422,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even though the differences between jcn DEP and jcn PROX are significant, the absolute differences are nevertheless relatively small; this bodes well for applying the automatic predominant sense method to languages less well resourced than English, because the PROX thesaurus was produced without using a parser.",
                    "sid": 423,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The differences in results between jcn BNC and jcn DEP for nouns are statistically significant (p < .001).21 The better accuracy with DEP may be because the NEWSWIRE corpus is larger than the BNC.",
                    "sid": 424,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We intend to investigate the effects of corpus size in the future.",
                    "sid": 425,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The differences in results between lesk BNC and lesk DEP for nouns are not significant.",
                    "sid": 426,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1.1 Results Using Simplified Prevalence Score.",
                    "sid": 427,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A simple variation of our method is just to associate each neighbor with just one sense and use the number of neighbors associated with a sense for the prevalence score.",
                    "sid": 428,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This gives a modified version of Equation (1) where each sense si ∈ senses(w) is assigned a score as follows: Simplified Prevalence Score(w, si ) = |{nj ⊂ Nw } : arg max (sss(sk , nj )) = si | (13) sk ∈senses(w) where sss(sk , nj ) = max sx ∈senses(nj ) ssst (sk , sx ) (14) For the example in Table 6, celebrity would get the top score of 2 (due to it having the highest sss for actor and footballer), celestial body would get a score of 1 (due to its sss with planet), shape would get 1 (due to circle), and zodiac would obtain a Simplified Prevalence Score of 0 because it does not have the highest sss for any of the neighbors.",
                    "sid": 429,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the results from Table 10 show, we do not get such good results with this score.",
                    "sid": 430,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This supports our intuition that a combination of both the number of neighbors and their distributional similarity scores is important for determining predominance.",
                    "sid": 431,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of the article gives results and analysis for our original prevalence score as given in Equation (1).",
                    "sid": 432,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1.2 Error Analysis.",
                    "sid": 433,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We took a random sample of 80 words that occurred more than five times in SemCor, 20 words for each PoS, from those where the automatically identified predominant sense was different from the SemCor first sense when using the lesk sss and BNC thesaurus and our ranking score as defined in Equation (1) (i.e., the data represented by the first result line and the last three result lines of Table 9).",
                    "sid": 434,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Herein, we call the automatically identified sense AUTO FS, and the SemCor sense SemCor FS.",
                    "sid": 435,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We 21 The coverage of the SemCor data by the DEP and PROX thesauruses is slightly lower than that of the.",
                    "sid": 436,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BNC-derived thesaurus due to mismatches in spelling and capitalization and also probably because the NEWSWIRE corpus is narrower in genre and domain than the BNC.",
                    "sid": 437,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "573 Table 10 Simplified prevalence score, evaluation on SemCor, polysemous words only.",
                    "sid": 438,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Type Token PoS Settings No.",
                    "sid": 439,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PSacc PSacc BL No.",
                    "sid": 440,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WSDsc SC FS RBL no un lesk BN C 2, 55 5 52 .9 3 2 . 3 5 3 , 1 7 5 4 7.",
                    "sid": 441,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 6 8 . 6 2 4.",
                    "sid": 442,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 no un jcn BN C 2, 55 5 50 .1 3 2 . 3 5 2 , 0 3 3 4 6.",
                    "sid": 443,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 6 9 . 2 2 4.",
                    "sid": 444,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 ver b lesk BN C 1, 14 9 45 .1 2 7 . 1 3 0 , 3 6 4 3 6.",
                    "sid": 445,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 5 8 . 0 1 7.",
                    "sid": 446,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 adj ecti ve lesk BN C 1, 15 4 58 .3 3 2 . 8 1 8 , 1 3 6 5 6.",
                    "sid": 447,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 7 3 . 7 2 4.",
                    "sid": 448,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 adv erb lesk BN C 2 3 0 50 .0 3 9 . 9 8 , 8 0 2 4 2.",
                    "sid": 449,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 7 6 . 1 3 3.",
                    "sid": 450,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 manually inspected the data for each of the words to find the source of the problem.",
                    "sid": 451,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We did not have the (substantial) resources that would be required to sense tag all occurrences of these words in the BNC to see what their actual first senses were.",
                    "sid": 452,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, we examined the parses, grammatical relations, and sense definitions for the words to see why the AUTO FS was ranked above the SemCor FS.",
                    "sid": 453,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found the following main types of error:22 corpora The difference appears to be due to genuine divergence between the BNC and SemCor.",
                    "sid": 454,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this error type we looked at the BNC parses to see if the acquired predominant sense was clearly due to differences in the corpus data.",
                    "sid": 455,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There may be other errors that should have been assigned this category, but without access to sense tagged BNC data we could not be sure of this, so we used this category conservatively.",
                    "sid": 456,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of this error is the adjective solid which has the good quality first sense in the Brown files in SemCor, but the firm sense according to our BNC automatic ranking.",
                    "sid": 457,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "related The automatic predominant sense is closely related to the SemCor first sense.",
                    "sid": 458,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although many word senses are related to some extent, the category was picked where a close relationship seemed to be the main cause of the error.",
                    "sid": 459,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example is the noun straw which has two senses in WordNet 1.6, fibre used for hats and fodder and plant material.",
                    "sid": 460,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The SemCor FS was the former whereas our AUTO FS was the latter.",
                    "sid": 461,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "competing Two or more related senses are ranked highly but they are overtaken by an unrelated sense.",
                    "sid": 462,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the ranking and scores for the noun transmission are: Wor dNe t sens e De scr ipt ion Pre val en ce sco re 5 ge ars 1 . 7 9 2 co m m un ica tio n 1 . 2 0 1 act of se nd in g a me ssa ge 1 . 1 9 3 fra cti on of ra dia nt en er gy 0 . 4 8 4 inf ect io n 0 . 1 5 22 There were a few other, less numerous types of error, for example systematic PoS mis-tagging of particles.",
                    "sid": 463,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(such as down) as adverbs.",
                    "sid": 464,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "574 The act of sending a message sense is overtaken by the gears sense because the credit from shared distributional neighbors is split between it and the communication sense.",
                    "sid": 465,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "neighbors There are not many neighbors related to the sense.",
                    "sid": 466,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There can be various reasons for this, such as the sense having restricted contexts of occurrence or only a small number of near synonyms existing for the sense.",
                    "sid": 467,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of this is the adjective live where the SemCor FS unrecorded sense seems to occur in the BNC corpus more than the alive sense; there are plenty of grammatical relations pertaining to this sense, but there are few distributional neighbors near in meaning to unrecorded.23 spurious similarity The WordNet similarity scores were misled by spurious relationships to neighbors; this can occur in dense areas such as the “physical object” region of the noun hyponym hierarchy.",
                    "sid": 468,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of this is the verb tap which has neighbors push and press which are related to the AUTO FS (solicit) as well as the SemCor FS (strike lightly).",
                    "sid": 469,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of the error analysis are shown in Table 11.",
                    "sid": 470,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The analysis shows that differences between the training (BNC) and testing (SemCor) corpora are not a major source of error.",
                    "sid": 471,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although SemCor itself (the released files from the Brown corpus comprising only 200,000 words) is not large enough to build a thesaurus with entries for a reasonable portion of the words, we did build a thesaurus from the entire Brown corpus (1 million words) to see the effect of corpus data.",
                    "sid": 472,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are compared to those from the BNC in Table 12 on the set of words which had thesaurus entries in the Brown data (to make the results more comparable, because the corpora are of such different sizes).",
                    "sid": 473,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also show the average results for 10 random selections of a 1 million word random sample of the BNC.",
                    "sid": 474,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To do this we randomly selected 1 th of the tuples.24 The differences in the WSDsc for the BNC 1 sample and the Brown corpus are significant ( p < .01 on the χ2 ), but the differences in PSacc are not significant.",
                    "sid": 475,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the entire BNC produced better results than the Brown data, this is undoubtedly due to the difference in size of the corpus.",
                    "sid": 476,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Taking a comparably sized sample, the results are slightly better from Brown which is the corpus from which SemCor is taken.",
                    "sid": 477,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For nouns, it was apparent that in two cases less-prevalent senses were receiving a higher ranking simply because the credit for some neighbors associated with another meaning was split between related senses (error type competing).",
                    "sid": 478,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This was not observed for other parts of speech, possibly because the AUTO FS was rarely unrelated to the SemCor FS.",
                    "sid": 479,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There were some problems arising from spurious similarity.",
                    "sid": 480,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possible source of such problems is due to the ambiguity of the neighbor; in the future we will look at reducing this source of error by removing neighbors which have a value for sx in Equation (2) which is not the same as that preferred by the other senses of the target word (w).",
                    "sid": 481,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For adverbs, all the cases that were categorized as spurious similarity were also noted to be related to the SemCor FS, though they were not categorized as related as this was not considered the primary cause of the error.",
                    "sid": 482,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The analysis was hardest for verbs.",
                    "sid": 483,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verbs are on average highly polysemous, and often have senses that are related.",
                    "sid": 484,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the structure of the WordNet verb troponym hierarchy is very shallow compared to the noun hyponymy hierarchy, so there 23 The closest neighbors to the adjective live are adult, forthcoming, lively, solo, excellent, stuffed, living, dead,.",
                    "sid": 485,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and australian weekly.",
                    "sid": 486,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "24 The variance for the 1 sample for PSacc was 0.46 and for WSDsc it was 0.49..",
                    "sid": 487,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "575 Table 11 Results of the error analysis for the sample of 80 words.",
                    "sid": 488,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PoS noun verb adjective adverb All PoS corpora 1 2 1 1 5 related 8 12 13 8 41 competing 2 0 0 0 2 neighbors 4 3 2 2 11 spurious similarity 5 3 4 9 21 Table 12 SemCor results for Nouns using jcn.",
                    "sid": 489,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thesaurus PSacc % WSDsc % full BNC 53.8 44.9 90 BNC 46.6 40.8.",
                    "sid": 490,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Brown 47.2 41.7 are more possibilities for spurious similarities from overlap of glosses.",
                    "sid": 491,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, although we tried to identify the main problem source, for verbs the problems usually arose from a combination of factors and the relatedness of the senses was usually one of these.",
                    "sid": 492,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Relatedness of senses and fine-grained distinctions are major sources of error.",
                    "sid": 493,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There have been various attempts to group WordNet senses both manually and automatically (Agirre and Lopez de Lacalle 2003; McCarthy 2006; Palmer, Dang, and Fellbaum 2007).",
                    "sid": 494,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, McCarthy demonstrated that distributional and semantic similarity can be used for relating word senses and that such methods increase accuracy of first sense heuristics, including the automatic method proposed here.",
                    "sid": 495,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WSD is improved with coarser-grained inventories but ultimately, performance depends on the application.",
                    "sid": 496,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the noun bar has 11 senses in WordNet 1.6.",
                    "sid": 497,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These include the pub sense as well as the counter sense and these are related to a certain extent.",
                    "sid": 498,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One might want to group them when acquiring predominant senses, but there may be situations where they should be distinguished.",
                    "sid": 499,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if one were to ask a robot to “go to the bar ” one would hope it could use the context to go get the drinks rather than replying that it is already there!",
                    "sid": 500,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even in cases where fine-grained distinctions are ultimately required, it may be helpful to have a coarse-grained prior and then use contextual features to tease apart subtle sense distinctions.",
                    "sid": 501,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From our error analysis, the problem of semantically isolated senses (identified as neighbors) was not a major source of error, but still causes some problems.",
                    "sid": 502,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possible remedy might be to identify these cases by looking for neighbors which relate strongly to a sense which none of the other neighbors relate to and weighting the contribution from these neighbors more.",
                    "sid": 503,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This may however give rise to further errors because of the noise introduced by focusing on individual neighbors.",
                    "sid": 504,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will explore such directions in future work.",
                    "sid": 505,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "576 In this experiment we did not assign any credit for near misses.",
                    "sid": 506,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In many cases of error the SemCor FS nonetheless received a high prevalence score.",
                    "sid": 507,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the future we hope to use the score for probability estimation, and combine this with contextual information for WSD as in related work by Lapata and Brew (2004) and Chan and Ng (2005).",
                    "sid": 508,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.2 Experiment 2: Frequency and the SemCor First Sense Heuristic.",
                    "sid": 509,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the previous section we described an evaluation of the accuracy of automatically acquired predominant sense information.",
                    "sid": 510,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We carried out the evaluation with respect to SemCor in order to have as much test data as possible.",
                    "sid": 511,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To obtain reasonably reliable gold-standard first-sense data and first-sense heuristic upper bounds, we limited the evaluation to words occurring at least three times in SemCor.",
                    "sid": 512,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clearly this scenario is unrealistic.",
                    "sid": 513,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For many words, and particularly for nouns, there is very little or no data in SemCor; Table 2 shows that 81.9% of nouns (excluding multiwords) listed in WordNet do not occur at all in SemCor.",
                    "sid": 514,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, even for English, which has substantial manually sense-tagged resources, coverage is severely limited for many words.",
                    "sid": 515,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a more realistic comparison of automatic and manual heuristics, we therefore now change to a different test corpus, the Senseval2 English all-words task data set.",
                    "sid": 516,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We focus on nouns and evaluate using all words regardless of their frequencies in SemCor.",
                    "sid": 517,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We examine the effect of frequency in SemCor on performance of a SemCor-derived heuristic in comparison to results from our automatic method on the same words.",
                    "sid": 518,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our hypothesis is that although automatically acquired predominant sense information may not outperform first-sense data obtained from a hand-tagged resource over all words in a text, the information may well be more accurate for low frequency items.",
                    "sid": 519,
                    "ssid": 169,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use a mapping between different WordNet versions25 (Daude´ , Padro´ , and Rigau 2000) to obtain the Senseval2 all words noun data (originally distributed with 1.7 sense numbers) with 1.6 sense numbers.",
                    "sid": 520,
                    "ssid": 170,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As well as examining the performance of our method in contrast to the SemCor heuristic, we calculate an upper bound for this using the first sense heuristic from the Senseval2 all-words data itself.",
                    "sid": 521,
                    "ssid": 171,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is obtained for nouns with two or more occurrences in the Senseval2 data and where one sense occurs more than any of the others.",
                    "sid": 522,
                    "ssid": 172,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We calculate type, precision, and recall, using this Senseval2 first-sense as the gold standard.",
                    "sid": 523,
                    "ssid": 173,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The recall measure is the same as PSacc described previously, except that we include items which do not have entries in the thesaurus, scoring them incorrect.",
                    "sid": 524,
                    "ssid": 174,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Precision only includes items where there is a sense ranked higher than any other for that word with the prevalence score, that is, it does not include items with a joint automatic ranking.",
                    "sid": 525,
                    "ssid": 175,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also calculate token precision and recall (WSD).",
                    "sid": 526,
                    "ssid": 176,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These measures relate to WSDsc , but again, recall includes words not in the thesaurus which are scored incorrect, and precision does not include items with a joint automatic ranking.",
                    "sid": 527,
                    "ssid": 177,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also separately compute WSD precision for words not in SemCor (NISC).",
                    "sid": 528,
                    "ssid": 178,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are shown in Table 13.26 The automatically acquired predominant sense results (the first six lines of results in the table) are approaching the SemCor-derived results (third line from the bottom of the table).",
                    "sid": 529,
                    "ssid": 179,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NISC results are particularly encouraging, but with the caveat that there are only 17 such words in the data.",
                    "sid": 530,
                    "ssid": 180,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The precision for these items is higher than the 25 This mapping is available at http://www.lsi.upc.es/~nlp/tools/mapping.html..",
                    "sid": 531,
                    "ssid": 181,
                    "kind_of_tag": "s"
                },
                {
                    "text": "26 Note that these figures are lower than those of McCarthy et al.",
                    "sid": 532,
                    "ssid": 182,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004a) in a similar experiment because.",
                    "sid": 533,
                    "ssid": 183,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the evaluation here is only on polysemous words.",
                    "sid": 534,
                    "ssid": 184,
                    "kind_of_tag": "s"
                },
                {
                    "text": "577 Table 13 Evaluating predominant sense information for polysemous nouns on the Senseval2 all-words task data.",
                    "sid": 535,
                    "ssid": 185,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Type WSD/token Sett ing s Pre cis ion (% ) Re call (% ) Pre cisi on (% ) Re call (% ) Pre cisi on NI SC (% ) lesk BN C 5 6 . 3 5 3 . 7 5 4 . 6 5 3 . 4 5 8 . 3 lesk DEP 5 2 . 0 4 7 . 2 5 2 . 6 4 8 . 7 5 8 . 3 lesk PR OX 5 2 . 0 4 7 . 2 5 2 . 3 4 8 . 5 5 8 . 3 jcn BN C 5 2 . 4 5 0 . 0 5 1 . 8 5 0 . 6 6 6 . 7 jcn DEP 5 2 . 0 4 7 . 2 5 8 . 0 5 3 . 7 8 3 . 3 jcn PR OX 5 3 . 1 4 8 . 1 5 7 . 3 5 3 . 1 8 3 . 3 Se mC or 6 4 . 8 6 3 . 0 5 8 . 5 5 7 . 3 0 . 0 Sen sev al2 – – 9 0 . 8 6 0 . 1 1 0 0 . 0 RB L 2 6 . 5 2 6 . 5 2 6 . 0 2 6 . 0 5 0 . 0 overall figure.",
                    "sid": 536,
                    "ssid": 186,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because the nouns involved are less frequent so tend to be less polysemous and consequently have a higher random baseline.",
                    "sid": 537,
                    "ssid": 187,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are a few nouns that are not in the automatic ranking, but this is due to the fact that neighbors were not collected for these nouns in the thesaurus because of tagging or parser errors or the particular set of grammatical relations used.",
                    "sid": 538,
                    "ssid": 188,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It should be possible to extend the range of grammatical relations, or use proximity-based relations, so that neighbors can be obtained in these cases.",
                    "sid": 539,
                    "ssid": 189,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It would also be possible to assign some credit in the case of joint top ranked senses to increase coverage.",
                    "sid": 540,
                    "ssid": 190,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Looking at Table 13 in more detail, it seems to be the case that although the BNC thesaurus does well in identifying the first sense of a word (the type results), the PROX and DEP thesauruses from the NEWSWIRE corpus return better WSD results when used with the jcn measure.",
                    "sid": 541,
                    "ssid": 191,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is possibly because jcn works well for more frequent items due to its incorporation of frequency information, and the NEWSWIRE corpus has more data for frequent words, although coverage is not as good as the BNC as seen by the bigger differences in precision and recall and the figures in Table 8.",
                    "sid": 542,
                    "ssid": 192,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lower coverage may be due to the narrower domain and genre of the NEWSWIRE corpus, though spelling and capitalization differences probably also account for some differences.",
                    "sid": 543,
                    "ssid": 193,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 14 shows results on the Senseval2 nouns for the best similarity measure and thesaurus combinations in Table 13 for nouns at or below various frequencies in SemCor.",
                    "sid": 544,
                    "ssid": 194,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(The differences between the DEP and PROX thesauruses are negligible at frequencies of 10 or below, so for those we report only the results for DEP.)",
                    "sid": 545,
                    "ssid": 195,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we anticipated, for low frequency words the automatic methods do give more accurate predominant sense information than SemCor.",
                    "sid": 546,
                    "ssid": 196,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The low number of test items at frequency five or less means that results for jcn with the BNC thesaurus are not significantly better when compared with SemCor ( p = .05); however the lesk WSD results are significantly better ( p < .01 for the ≤ 1 threshold and p < .05 for the ≤ 5 threshold).",
                    "sid": 547,
                    "ssid": 197,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the whole, we see that the automatic method, using either jcn or lesk and any of the three thesauruses, tend to give better results than SemCor on nouns which have low coverage in SemCor.",
                    "sid": 548,
                    "ssid": 198,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figures 2 and 3 show the precision for type and token (WSD) evaluation where the items have a frequency at or below given thresholds in SemCor.",
                    "sid": 549,
                    "ssid": 199,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the manually 578 Table 14 Senseval2 results, polysemous nouns only, broken down by their frequencies of occurrence in SemCor.",
                    "sid": 550,
                    "ssid": 200,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Type WSD/token No.",
                    "sid": 551,
                    "ssid": 201,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of occurrences in Precision Recall Precision Recall SemCor (no. of words) Settings (%) (%) (%) (%) jcn BNC 100.0 33.3 66.7 47.1 lesk BNC 100.0 33.3 58.3 41.2 0 (17) jcn DEP 100.0 33.3 83.3 58.8 lesk DEP 100.0 33.3 58.3 41.2 SemCor 0.0 0.0 0.0 0.0 Senseval2 – – 100.0 52.9 RBL 38.9 38.9 46.1 46.1 jcn BNC 66.7 44.4 54.1 45.5 lesk BNC 83.3 55.6 67.6 56.8 jcn DEP 50.0 22.2 51.7 34.1 ≤ 1 (44) lesk DEP 75.0 33.3 69.0 45.5 SemCor 50.0 33.3 33.3 20.5 Senseval2 – – 93.3 63.6 RBL 40.7 40.7 42.8 42.8 jcn BNC 80.0 61.5 63.0 57.5 lesk BNC 90.0 69.2 71.2 65.0 ≤ 5 (80) jcn DEP 71.4 38.5 56.7 42.5 lesk DEP 85.7 46.2 70.0 52.5 SemCor 60.0 46.2 54.0 42.5 Senseval2 – – 95.9 58.8 RBL 38.1 38.1 39.1 39.1 jcn BNC 75.0 63.2 59.3 55.8 lesk BNC 68.8 57.9 62.8 59.2 ≤ 10 (120) jcn DEP 66.7 42.1 56.8 45.0 lesk DEP 58.3 36.8 58.9 46.7 SemCor 68.8 57.9 57.3 49.2 Senseval2 – – 96.8 50.8 RBL 37.5 37.5 38.0 38.0 jcn BNC 76.0 67.9 66.7 64.8 lesk BNC 64.0 57.1 71.6 69.6 ≤ 15 (250) jcn DEP 60.0 42.9 68.8 55.6 lesk DEP 55.0 39.3 67.3 54.4 jcn PROX 70.0 50.0 72.3 58.4 lesk PROX 55.0 39.3 66.8 54.0 SemCor 64.0 57.1 66.5 62.0 Senseval2 – – 98.8 68.4 RBL 32.9 32.9 30.4 30.4 jcn BNC 52.4 50.0 51.8 50.6 lesk BNC 56.3 53.7 54.6 53.4 all (786) jcn DEP 52.0 47.2 58.0 53.7 lesk DEP 52.0 47.2 52.6 48.7 jcn PROX 53.1 48.1 57.3 53.1 lesk PROX 52.0 47.2 52.3 48.5 SemCor 64.8 63.0 58.5 57.3 Senseval2 – – 90.8 60.1 RBL 26.5 26.5 26.0 26.0 579 Figure 2 “TYPE” precision on finding the predominant sense for the Senseval2 English all-words test data for nouns having a frequency less than or equal to various thresholds.",
                    "sid": 552,
                    "ssid": 202,
                    "kind_of_tag": "s"
                },
                {
                    "text": "produced SemCor first-sense heuristic outperforms the automatic methods over all the test items (see the “all” results in Table 14), when items are below a frequency threshold of five the automatic methods give better results.",
                    "sid": 553,
                    "ssid": 203,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, as the threshold is moved up to 20 and even 30, more nouns are covered, and the automatic methods are still comparable and in some cases competitive with the SemCor heuristic.",
                    "sid": 554,
                    "ssid": 204,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.3 Experiment 3: The Influence of Domain.",
                    "sid": 555,
                    "ssid": 205,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this experiment, we investigate the potential of the automatic ranking method for computing predominant senses with respect to particular domains.",
                    "sid": 556,
                    "ssid": 206,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have previously demonstrated that the method produces intuitive domain-specific models for nouns (McCarthy et al. 2004a), and that these can be more accurate than first senses derived from SemCor for words salient to a domain (Koeling, McCarthy, and Carroll 2005).",
                    "sid": 557,
                    "ssid": 207,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here we investigate the behavior for other parts of speech, using a similar experimental setup to that of McCarthy et al. That work used the subject field codes (SFC) (Magnini and Cavaglia` 2000)27 as a gold standard.",
                    "sid": 558,
                    "ssid": 208,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In SFC the Princeton English WordNet is augmented with some domain labels.",
                    "sid": 559,
                    "ssid": 209,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Every synset in WordNet’s sense inventory is annotated with at least one domain label, selected from a set of about 200 labels.",
                    "sid": 560,
                    "ssid": 210,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These labels are organized in a tree structure.",
                    "sid": 561,
                    "ssid": 211,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each synset of WordNet 1.6 is labeled with one or more labels.",
                    "sid": 562,
                    "ssid": 212,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The label factotum is assigned if any other is inadequate.",
                    "sid": 563,
                    "ssid": 213,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first level consists of five main categories (e.g., doctrines and social science) and factotum.doctrines 27 More recently referred to as WordNet Domains (WN -DOMAINS)..",
                    "sid": 564,
                    "ssid": 214,
                    "kind_of_tag": "s"
                },
                {
                    "text": "580 Figure 3 WSD precision on the Senseval2 English all-words test data for nouns having a frequency less than or equal to various thresholds.",
                    "sid": 565,
                    "ssid": 215,
                    "kind_of_tag": "s"
                },
                {
                    "text": "has subcategories such as art, religion, and psychology.",
                    "sid": 566,
                    "ssid": 216,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some subcategories are further divided in subcategories (e.g., dance, music, and theatre are subcategories of art).",
                    "sid": 567,
                    "ssid": 217,
                    "kind_of_tag": "s"
                },
                {
                    "text": "McCarthy et al.",
                    "sid": 568,
                    "ssid": 218,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004a) used two domain-specific corpora for input to the method for finding predominant senses.",
                    "sid": 569,
                    "ssid": 219,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpora were obtained from the Reuters Corpus, Volume 1 (RCV1; Rose, Stevenson, and Whitehead 2002) using the Reuters topic codes.",
                    "sid": 570,
                    "ssid": 220,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two domain-specific corpora were: SPORTS (Reuters topic code GSPO), 9.1 million words FINANCE (Reuters topic codes ECAT and MCAT), 32.5 million words In that work we produced sense rankings for a set of 38 nouns which have at least one synset with an economy SFC label and one with a sport SFC label.",
                    "sid": 571,
                    "ssid": 221,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then demonstrated that there were more sport labels assigned to the predominant senses acquired from the SPORTS corpus and more economy labels assigned to those from the FINANCE corpus.",
                    "sid": 572,
                    "ssid": 222,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The predominant senses from both domains had a similarly high percentage of factotum (domain-independent) labels.",
                    "sid": 573,
                    "ssid": 223,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We reproduce the results here (in Figure 4) for ease of reference, and for comparison with other results presented in this section.",
                    "sid": 574,
                    "ssid": 224,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The y-axis in this figure shows the percentage of the predominant sense labels for these 38 nouns that have the SFC label indicated by the x-axis.",
                    "sid": 575,
                    "ssid": 225,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We envisaged running the same experiment with verbs, adjectives, and adverbs, although we suspected that these would show less domain-specific tendencies and there would be fewer candidate words to work with.",
                    "sid": 576,
                    "ssid": 226,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The SFC labels for all senses of polysemous words (excluding multiwords) in the various parts of speech are shown in Table 15.",
                    "sid": 577,
                    "ssid": 227,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see from the distribution of factotum labels across the parts of speech that nouns are certainly the PoS most likely to be influenced by domain.",
                    "sid": 578,
                    "ssid": 228,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To produce results like Figure 4 for each PoS, we needed words having at least one synset with a sport label and one with an economy label.",
                    "sid": 579,
                    "ssid": 229,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There were 20 such verbs but 581 Figure 4 Distribution of domain labels of predominant senses for 38 polysemous nouns ranked using the SPORTS and FINANCE corpora.",
                    "sid": 580,
                    "ssid": 230,
                    "kind_of_tag": "s"
                },
                {
                    "text": "only two adjectives and no adverbs meeting this condition.",
                    "sid": 581,
                    "ssid": 231,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We therefore performed the experiment only with verbs.",
                    "sid": 582,
                    "ssid": 232,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To do this we used the SPORTS and FINANCE corpora as before, computing thesauruses for verbs using the grammatical relations specified in Table 7.",
                    "sid": 583,
                    "ssid": 233,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results for the distribution of domain labels of the predominant senses Table 15 Most frequent SFC labels for all senses of polysemous words in WordNet, by part of speech.",
                    "sid": 584,
                    "ssid": 234,
                    "kind_of_tag": "s"
                },
                {
                    "text": "D o m ai n % D o m ai n % no un biol ogy 29.",
                    "sid": 585,
                    "ssid": 235,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 ve rb fact otu m 67.",
                    "sid": 586,
                    "ssid": 236,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 fact otu m 20.",
                    "sid": 587,
                    "ssid": 237,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 psy cho log y 3.",
                    "sid": 588,
                    "ssid": 238,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 art 6.",
                    "sid": 589,
                    "ssid": 239,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 spo rt 2.",
                    "sid": 590,
                    "ssid": 240,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 spo rt 3.",
                    "sid": 591,
                    "ssid": 241,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 art 2.",
                    "sid": 592,
                    "ssid": 242,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 me dici ne 3.",
                    "sid": 593,
                    "ssid": 243,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 biol ogy 2.",
                    "sid": 594,
                    "ssid": 244,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 ot he r 37.",
                    "sid": 595,
                    "ssid": 245,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 ot he r 21.",
                    "sid": 596,
                    "ssid": 246,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 adj ecti ve fact otu m 67.",
                    "sid": 597,
                    "ssid": 247,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 ad ve rb fact otu m 81.",
                    "sid": 598,
                    "ssid": 248,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 biol ogy 6.",
                    "sid": 599,
                    "ssid": 249,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 psy cho log y 7.",
                    "sid": 600,
                    "ssid": 250,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 art 3.",
                    "sid": 601,
                    "ssid": 251,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 art 1.",
                    "sid": 602,
                    "ssid": 252,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 psy cho log y 2.",
                    "sid": 603,
                    "ssid": 253,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 phy sic s 1.",
                    "sid": 604,
                    "ssid": 254,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 phy sic s 1.",
                    "sid": 605,
                    "ssid": 255,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 eco no my 1.",
                    "sid": 606,
                    "ssid": 256,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 ot he r 17.",
                    "sid": 607,
                    "ssid": 257,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 oth er 7.",
                    "sid": 608,
                    "ssid": 258,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 582 acquired from the SPORTS and FINANCE corpora are shown in Figure 5.",
                    "sid": 609,
                    "ssid": 259,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see the same tendency for sport labels for predominant senses from the SPORTS corpus and economy labels for the predominant senses from the FINANCE corpus, but the relationship is less marked compared with nouns because of the high proportions of factotum senses in both corpora for verbs.",
                    "sid": 610,
                    "ssid": 260,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe that acquisition of domain-specific predominant senses should be focused on those words which show domain-specific tendencies.",
                    "sid": 611,
                    "ssid": 261,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We hope to put more work into automatic detection of these tendencies using indicators such as domain salience and words that have different sense rankings in a given domain compared to the BNC (as discussed by Koeling, McCarthy, and Carroll 2005).",
                    "sid": 612,
                    "ssid": 262,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.4 Experiment 4: Domain-Specific Predominant Sense Acquisition.",
                    "sid": 613,
                    "ssid": 263,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the final set of experiments we evaluate the acquired predominant senses for domain- specific corpora.",
                    "sid": 614,
                    "ssid": 264,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first of the two experiments was reported by Koeling, McCarthy, and Carroll (2005), but we extend it by the second experiment reported subsequently.",
                    "sid": 615,
                    "ssid": 265,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because there are no publicly available domain-specific manually sense-tagged corpora, we created our own gold standard.",
                    "sid": 616,
                    "ssid": 266,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two chosen domains (SPORTS and FINANCE) and the domain-neutral corpus (BNC) are the same as we used in the previous experiment.",
                    "sid": 617,
                    "ssid": 267,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We selected 40 words and we sampled (randomly) sentences containing these words from the three corpora and asked annotators to choose the correct sense for the target words.",
                    "sid": 618,
                    "ssid": 268,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The set consists of 17 words which have at least one sense assigned an economy domain label and at least one sense assigned a sports label: club, manager, record, right, bill, check, competition, conversion, crew, delivery, division, fishing, reserve, return, score, receiver, running; eight words that are particular salient in the SPORTS domain: fan, star, transfer, striker, goal, title, tie, coach; eight words that are particular salient in the Figure 5 Distribution of domain labels of predominant senses for 20 polysemous verbs ranked using the SPORTS and FINANCE corpora.",
                    "sid": 619,
                    "ssid": 269,
                    "kind_of_tag": "s"
                },
                {
                    "text": "583 Table 16 WSD using predominant senses, training, and testing on all domain combinations (hand-classified corpora).",
                    "sid": 620,
                    "ssid": 270,
                    "kind_of_tag": "s"
                },
                {
                    "text": "T e s t i n g Trai nin g B N C F I N A N C E S P O R T S BN C 4 0 . 7 4 3 . 3 3 3 . 2 FIN AN CE 3 9 . 1 4 9 . 9 2 4 . 0 SPO RTS 2 5 . 7 1 9 . 7 4 3 . 7 Ra ndo m BL 1 9 . 8 1 9 . 6 1 9 . 4 Se mC or FS 3 2.",
                    "sid": 621,
                    "ssid": 271,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 (3 2.",
                    "sid": 622,
                    "ssid": 272,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9) 3 3.",
                    "sid": 623,
                    "ssid": 273,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 (3 5.",
                    "sid": 624,
                    "ssid": 274,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0) 1 6.",
                    "sid": 625,
                    "ssid": 275,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 (1 6.",
                    "sid": 626,
                    "ssid": 276,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8) FINANCE domain: package, chip, bond, market, strike, bank, share, target; and seven words that are equally salient in both domains: will, phase, half, top, performance, level, country.",
                    "sid": 627,
                    "ssid": 277,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Koeling, McCarthy, and Carroll (2005) give further details of the construction of the gold standard.",
                    "sid": 628,
                    "ssid": 278,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first experiment, we train on a corpus of documents with manually assigned domain labels (i.e., sub-corpora of the Reuters corpus, see Section 6.3), and we test on data from the same source.",
                    "sid": 629,
                    "ssid": 279,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a second experiment we build a text classifier, use the text classifier to obtain SPORTS and FINANCE corpora (using general newswire text from the English Gigaword Corpus; Graff 2003) and test on the gold-standard data from the Reuters corpus.",
                    "sid": 630,
                    "ssid": 280,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second experiment eliminates issues about dependencies between training and test data and will shed light on the question of how robust the acquired predominant sense method is with respect to noise in the input data.",
                    "sid": 631,
                    "ssid": 281,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the same time, the second experiment paves the way towards creating predominant sense inventories for any conceivable domain.",
                    "sid": 632,
                    "ssid": 282,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.4.1 Experiment Using Hand-Labeled Data.",
                    "sid": 633,
                    "ssid": 283,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section we focus on the predominant sense evaluation of the experiments described by Koeling, McCarthy, and Carroll (2005).",
                    "sid": 634,
                    "ssid": 284,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After running the predominant sense finding algorithms on the raw text of the two domain corpora (SPORTS and FINANCE) and the domain-neutral corpus (BNC), we evaluate the accuracy of performing WSD on the sample of 40 words purely with the first sense heuristic using all nine combinations of training and test corpora.",
                    "sid": 635,
                    "ssid": 285,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results (as given in Table 16) are compared with a random baseline (“Random BL”)28 and the accuracy using the first sense heuristic from SemCor (“SemCor FS”).29 The results in Table 16 show that the best results are obtained when the predominant senses are acquired using the appropriate domain (i.e., test and training data from the same domain).",
                    "sid": 636,
                    "ssid": 286,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, when trained on the domain-relevant corpora, the random baseline as well as the baseline provided by SemCor are comfortably beaten.",
                    "sid": 637,
                    "ssid": 287,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be observed from these results that apparently the BNC is more similar to the FINANCE corpus than it is to the SPORTS corpus.",
                    "sid": 638,
                    "ssid": 288,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results for the SPORTS domain lag behind the results for the FINANCE domain by almost 6 percentage points.",
                    "sid": 639,
                    "ssid": 289,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This could be because 28 The random baseline is 'S 1.",
                    "sid": 640,
                    "ssid": 290,
                    "kind_of_tag": "s"
                },
                {
                    "text": ". ∈ #senses(i) 29 The precision is given alongside in brackets because a predominant sense for the word striker is not.",
                    "sid": 641,
                    "ssid": 291,
                    "kind_of_tag": "s"
                },
                {
                    "text": "supplied by SemCor.",
                    "sid": 642,
                    "ssid": 292,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The automatic method proposes a predominant sense in every case.",
                    "sid": 643,
                    "ssid": 293,
                    "kind_of_tag": "s"
                },
                {
                    "text": "584 Table 17 WSD using predominant senses, training, and testing on all domain combinations (automatically classified corpora).",
                    "sid": 644,
                    "ssid": 294,
                    "kind_of_tag": "s"
                },
                {
                    "text": "T e s t i n g Trai nin g B N C F I N A N C E S P O R T S BN C 4 0 . 7 4 3 . 3 3 3 . 2 FIN AN CE 3 8 . 2 4 4 . 0 2 9 . 0 SPO RTS 2 7 . 0 2 3 . 4 4 5 . 0 Ra ndo m BL 1 9 . 8 1 9 . 6 1 9 . 4 Se mC or FS 3 2.",
                    "sid": 645,
                    "ssid": 295,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 (3 2.",
                    "sid": 646,
                    "ssid": 296,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9) 3 3.",
                    "sid": 647,
                    "ssid": 297,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 (3 5.",
                    "sid": 648,
                    "ssid": 298,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0) 1 6.",
                    "sid": 649,
                    "ssid": 299,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 (1 6.",
                    "sid": 650,
                    "ssid": 300,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8) of the smaller amount of training data available (32M words versus 9M words), but it could also be an artifact of this particular selection of words.",
                    "sid": 651,
                    "ssid": 301,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.4.2 Experiment Using Automatically Classified Data.",
                    "sid": 652,
                    "ssid": 302,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the previous experiment shows that it is possible to acquire domain-specific predominant senses successfully, the usefulness of doing this will be far greater if there is no need to classify corpora with respect to domain by hand.",
                    "sid": 653,
                    "ssid": 303,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is no such thing as a standard domain specification because the definition of a domain depends on user and application.",
                    "sid": 654,
                    "ssid": 304,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It would be advantageous if we could automatically obtain a user-/application-specific corpus from which to acquire predominant senses.",
                    "sid": 655,
                    "ssid": 305,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section we describe an experiment where we build a text classifier using WordNet as a sense inventory and the SFC domain extension (see Section 6.3).",
                    "sid": 656,
                    "ssid": 306,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We extracted bags of domain-specific words from WordNet for all the defined domains by collecting all the word senses (synsets) and corresponding glosses associated with each domain label.",
                    "sid": 657,
                    "ssid": 307,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These bags of words are the fingerprints for the domains and we used them to train a Support Vector Machine (SVM) text classifier using TwentyOne.30 The classifier distinguishes between 48 classes (the first and second levels of the SFC hierarchy).",
                    "sid": 658,
                    "ssid": 308,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When a document is evaluated by the classifier, it returns a list of all the classes (domains) it recognizes and an associated confidence score reflecting the certainty that the document belongs to that particular domain.",
                    "sid": 659,
                    "ssid": 309,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We classified 10 months’ worth of data from the English Gigaword Corpus using this classifier and assigned each document to the corpus belonging to the highest scoring class of the classifier ’s output.",
                    "sid": 660,
                    "ssid": 310,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The level of confidence was ignored at this stage.",
                    "sid": 661,
                    "ssid": 311,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This resulted in a SPORTS corpus comprising about 11M words and a FINANCE corpus of about 27M words.",
                    "sid": 662,
                    "ssid": 312,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The predominant sense finding algorithm was run on the raw text of these two corpora and we followed exactly the same evaluation strategy as in the previous section.",
                    "sid": 663,
                    "ssid": 313,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are summarized in Table 17 and are very similar to those based on hand-labeled corpora.",
                    "sid": 664,
                    "ssid": 314,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Again, the best results are obtained when test and training data are derived from the same domain.",
                    "sid": 665,
                    "ssid": 315,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The FINANCE–FINANCE result is slightly worse, but is still well above both Random and the SemCor baseline.",
                    "sid": 666,
                    "ssid": 316,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The SPORTS–SPORTS result has slightly improved over the result reported in the previous 30 TwentyOne Classifier is an Irion Technologies product: www.irion.ml/products/english/.",
                    "sid": 667,
                    "ssid": 317,
                    "kind_of_tag": "s"
                },
                {
                    "text": "products classify.html.",
                    "sid": 668,
                    "ssid": 318,
                    "kind_of_tag": "s"
                },
                {
                    "text": "585 section.",
                    "sid": 669,
                    "ssid": 319,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason for these differences may well be because the FINANCE corpus used for this experiment is smaller and the SPORTS corpus is slightly larger than those used in the hand-labeled experiment.",
                    "sid": 670,
                    "ssid": 320,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Automatically classifying documents inherently introduces noise in the training corpora.",
                    "sid": 671,
                    "ssid": 321,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This experiment to test the robustness of our method for finding predominant senses suggests that it deals well with the noise.",
                    "sid": 672,
                    "ssid": 322,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further experiments that take the confidence levels of the classifier into account will allow us to create corpora with less noise and will allow us to find the right balance between corpus size and corpus quality.",
                    "sid": 673,
                    "ssid": 323,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "7",
            "sents": [
                {
                    "text": "In this article we have argued that information on the predominant sense of words is important, and that it is desirable to be able to infer this automatically from unlabeled text.",
                    "sid": 674,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We presented a number of evaluations investigating various facets of a previously proposed method for automatically acquiring this information (McCarthy et al. 2004a).",
                    "sid": 675,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evaluations extend ones in previous publications in a number of ways: they use larger, balanced test data sets, and they compare alternative semantic similarity scores and distributional thesauruses derived from different corpora and based on different kinds of relations.",
                    "sid": 676,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also looked in detail at areas where the method performs well and also where it does not, and carried out a manual error analysis to identify the types of mistakes it makes.",
                    "sid": 677,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our main results are: • The predominant sense acquisition method produces promising results overall for all open class parts of speech, when evaluated on SemCor, a large balanced corpus.",
                    "sid": 678,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• The highest accuracies are for nouns and adjectives; overall accuracy for verbs is lower, but they have the lowest random baseline; adverbs have the lowest average polysemy but gains over the random baseline are lower than for other PoS.",
                    "sid": 679,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Using a thesaurus computed from proximity-based relations produces almost as good results as using an otherwise identical one computed from syntactic dependency-based relations.",
                    "sid": 680,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Lesk’s semantic similarity score (Banerjee and Pedersen 2002, lesk) produces particularly good results for nouns which have low corpus frequencies; Jiang and Conrath’s (1997, jcn) score does well on higher frequency words.31 • For low frequency nouns in SemCor, the method, using any combination of automatically acquired thesaurus and semantic similarity score that we tried, produces more accurate predominant sense information than SemCor.",
                    "sid": 681,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, for nouns with a frequency of five or less (12.9% of the polysemous nouns in the Senseval2 data) it outperforms the SemCor first sense heuristic.",
                    "sid": 682,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the threshold is increased, the SemCor first sense 31 The lesk score has wider applicability than jcn since it can be applied to all parts of speech.",
                    "sid": 683,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can also be.",
                    "sid": 684,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "used with any sense inventory which has textual definitions for its senses even if the inventory does not contain WordNet-like semantic relations.",
                    "sid": 685,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "586 heuristic becomes more competitive, but some of the automatic methods are still outperforming it for nouns occurring 20 or fewer times in SemCor.",
                    "sid": 686,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Nouns show a stronger tendency for domain-specific meanings than other parts of speech, but predominant senses for verbs acquired automatically with respect to domain-specific corpora also correlate with the appropriate domain labeling for those senses.",
                    "sid": 687,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Predominant senses acquired using domain-specific corpora outperform those from SemCor ina WSD task, for a selection of nouns, using corpora consisting of either hand-classified or automatically-classified documents.",
                    "sid": 688,
                    "ssid": 15,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "further work. ",
            "number": "8",
            "sents": [
                {
                    "text": "We are continuing to work on automatic ranking of word senses for WSD.",
                    "sid": 689,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our next step will be to use the numeric values of sense prevalence scores to compare the skews in the distributions of word senses across different corpora and see if this enables us to detect automatically words for which a domain- or genre-specific ranking is warranted.",
                    "sid": 690,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Looking at skews should also help in predicting words for which contextual WSD is likely to be particularly powerful, for example when more than one sense is scored as being highly prevalent.",
                    "sid": 691,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In such situations we will combine our method with an approach to unsupervised context-based WSD which uses the collocates of the distributional neighbors associated with each of the senses as contextual features.",
                    "sid": 692,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our error analysis shows that many errors in identifying predominant senses are caused by the sense distinctions in WordNet being particularly fine-grained.",
                    "sid": 693,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have recently (Koeling and McCarthy 2007) evaluated our method on the coarse-grained English all words task at SemEval (Navigli, Litkowski, and Hargraves 2007).",
                    "sid": 694,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will follow work on finding relationships between WordNet senses to induce coarser-grained classes (McCarthy 2006), and on automatic induction of senses (Pantel and Lin 2002) and adapt our method to acquire prevalence rankings for these.",
                    "sid": 695,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The granularity of the inventory will depend on the application and we plan to apply rankings over such inventories for WSD within the context of a task, such as lexical substitution (McCarthy and Navigli 2007).",
                    "sid": 696,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To date we have only applied our methods to English.",
                    "sid": 697,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We plan to apply our approach to other languages for which sense tagged resources of the size of SemCor are not available.",
                    "sid": 698,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the good results with Lin’s proximity based thesaurus we believe our method should work even for languages which do not have high quality parsers available.",
                    "sid": 699,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This work was supported by the UK EPSRC project EP/C537262 “Ranking Word Senses for Disambiguation: Models and Applications,” and a UK Royal Society Dorothy Hodgkin Fellowship to the first author.",
                    "sid": 700,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are grateful to Dekang Lin for making his thesaurus data publicly available and to Siddharth Patwardhan and Ted Pedersen for the WordNet Similarity Package.",
                    "sid": 701,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thank the anonymous reviewers for the many helpful comments and suggestions they made.",
                    "sid": 702,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}