{
    "ID": "J13-1007",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We present a constituency parsing system for Modern Hebrew.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system is based on the PCFG-LA parsing method of Petrov et al.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006), which is extended in various ways in order to accommodate the specificities of Hebrew as a morphologically rich language with a small treebank.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that parsing performance can be enhanced by utilizing a language resource external to the treebank, specifically, a lexicon-based morphological analyzer.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present a computational model of interfacing the external lexicon and a treebank-based parser, also in the common case where the lexicon and the treebank follow different annotation schemes.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that Hebrew word-segmentation and constituency-parsing can be performed jointly using CKY lattice parsing.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performing the tasks jointly is effective, and substantially outperforms a pipeline- based model.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We suggest modeling grammatical agreement in a constituency-based parser as a filter mechanism that is orthogonal to the grammar, and present a concrete implementation of the method.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the constituency parser does not make many agreement mistakes to begin with, the filter mechanism is effective in fixing the agreement mistakes that the parser does make.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These contributions extend outside of the scope of Hebrew processing, and are of general applicability to the NLP community.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hebrew is a specific case of a morphologically rich language, and ideas presented in this work are useful also for processing other languages, including English.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lattice-based parsing methodology is useful in any case where the input is uncertain.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extending the lexical coverage of a treebank-derived parser using an external lexicon is relevant for any language with a small treebank.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Different languages have different syntactic properties.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In English, word order is relatively fixed, whereas in other languages word order is much more flexible (in Hebrew, the subject may appear either before or after a verb).",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In languages with a flexible word order, the meaning of the sentence is realized using other structural elements, like word ∗ Computer Science Department, Ben Gurion University of the Negev, Israel.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email: yoav.goldberg@gmail.com.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "∗∗ Computer Science Department, Ben Gurion University of the Negev, Israel.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email: elhadad@cs.bgu.ac.il.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Submission received: 30 September 2011; revised submission received: 19 May 2012; accepted for publication: 3 August 2012..",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "© 2013 Association for Computational Linguistics inflections or markers, which are referred to as morphology (in Hebrew, the marker תא is used to mark definite objects, distinguishing them from subjects in the same position.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, verbs and nouns are marked for gender and number, and subject and verb must share the same gender and number).",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A limited form of morphology also exists in English: the -s and -ed suffixes are examples of English morphological markings.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other languages, morphological processes may be much more involved.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lexical units (words) in English are always separated by white space.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Chinese, such separation is not available.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Hebrew (and Arabic), most words are separated by white space, but many of the function words (determiners like the, conjunctions such as and, and prepositions like in or of ) do not stand on their own but are instead attached to the following words.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A large part of the parsing literature is devoted to automatic parsing of English, a language with a relatively simple morphology, relatively fixed word order, and a large treebank.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Data-driven English parsing is now at the state where naturally occurring text in the news domain can be automatically parsed with accuracies of around 90% (according to standard parsing evaluation measures).",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When moving from English to languages with richer morphologies and less-rigid word orders, however, the parsing algorithms developed for English exhibit a large drop in accuracy.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, whereas English has a large treebank, containing over one million annotated words, many other languages have much smaller treebanks, which also contribute to the drop in the accuracies of the data-driven parsers.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A similar drop in parsing accuracy is also exhibited in English when moving from the news domain, on which parsers have traditionally been trained, to other genres such as prose, blogs, poetry, product reviews, or biomedical texts, which use different vocabularies and, to some extent, different syntactic rules.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work focuses on constituency parsing of Modern Hebrew, a Semitic language with a rich and productive morphology, relatively free word order,1 and a small tree- bank.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several natural questions arise: Can the small size of the treebank be compensated for using other available resources or sources of information?",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How should the word segmentation issue (that function words do not appear in isolation but attach to the next word, forming ambiguous letter patterns) be handled?",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Can morphological information be used effectively in order to improve parsing accuracy?",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present a system which is based on a state-of-the-art model for constituency parsing, namely, the probabilistic context-free grammar (PCFG) with latent annotations (PCFG-LA) model of Petrov et al.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006), as implemented in the BerkeleyParser.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After evaluating the out-of-the-box performance of the BerkeleyParser on the Hebrew tree- bank, we discuss some of its limitations and then go on to extend the PCFG-LA parsing model in several directions, making it more suitable for parsing Hebrew and related languages.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our extensions are based on the following themes.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Separation of lexical and syntactic knowledge.",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are two kinds of knowledge inherent in a parsing system.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of them is syntactic knowledge governing the way in which words can be combined to form structures, which, in turn, can be combined to form ever larger structures.",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other is lexical knowledge about the identities of individual words, the word classes they belong to, and the kinds of syntactic structures they can participate in.",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We argue that the amount of syntactic knowledge needed for a parsing system is relatively limited, and that sufficiently large parts of it can be captured also 1 To be more precise, in Hebrew the order of constituents is relatively free, whereas the order of the words.",
                    "sid": 45,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "within certain constituents is relatively fixed.",
                    "sid": 46,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "122 based on a relatively small treebank.",
                    "sid": 47,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexical knowledge, on the other hand, is much more vast, and we should not rely on a treebank (small or large) to provide adequate lexical coverage.",
                    "sid": 48,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, we should aim to find ways of integrating lexical knowledge, which is external to the treebank, into the parsing process.",
                    "sid": 49,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We extend the lexical coverage of a treebank-based parser using a dictionary-based morphological analyzer.",
                    "sid": 50,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present a way of integrating the two resources also for the common case where their annotations schemes diverge.",
                    "sid": 51,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method is very effective in improving parsing accuracy.",
                    "sid": 52,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Encoding input uncertainty using a lattice-based representation.",
                    "sid": 53,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sometimes, the language signal (the input to the parser) may be uncertain.",
                    "sid": 54,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This happens in Hebrew when a space-delimited token such as לצב can represent either a single word (‘[an] onion’) or a sequence of two words or three words (‘in shadow’ and ‘in the shadow,’ respectively).",
                    "sid": 55,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When computationally feasible, it is best to let the uncertainty be resolved by the parser rather than in a separate preprocessing step.",
                    "sid": 56,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose encoding the input-uncertainty in a word lattice, and use lattice parsing (Chappelier et al. 1999; Hall 2005) to perform joint word segmentation and syntactic disambiguation (Cohen and Smith 2007; Goldberg and Tsarfaty 2008).",
                    "sid": 57,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performing the tasks jointly is effective, and substantially outperforms a pipeline-based model.",
                    "sid": 58,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using morphological information to improve parsing accuracy.",
                    "sid": 59,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Morphology provides useful hints for resolving syntactic ambiguity, and the parsing model should have a way of utilizing these hints.",
                    "sid": 60,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is a range of morphological hints than can be utilized: from functional marking elements (such as the תא marker indicating a definite direct object); to elements marking syntactic properties such as definiteness (such as the Hebrew ה marker); to agreement patterns requiring a compatibility in properties such as gender, number, and person between syntactic constituents (such as a verb and its subject or an adjective and the noun it modifies).",
                    "sid": 61,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We suggest modeling agreement as a filtering process that is orthogonal to the grammar.",
                    "sid": 62,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the constituency parser does not make many agreement mistakes to begin with, the filter mechanism is effective in fixing the agreement mistakes that the parser does make, without introducing new mistakes.",
                    "sid": 63,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Aspects of the work presented in this article are discussed in earlier publications.",
                    "sid": 64,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Goldberg and Tsarfaty (2008) suggest the lattice-parsing mechanism, Goldberg et al.",
                    "sid": 65,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009) discuss ways of interfacing a treebank-derived PCFG-parser with an external lexicon, and Goldberg and Elhadad (2011) present experiments using the PCFG-LA BerkeleyParser.",
                    "sid": 66,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here we provide a cohesive presentation of the entire system, as well as a more detailed description and an expanded evaluation.",
                    "sid": 67,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also extend the previous work in several dimensions: We introduce a new method of interfacing the parser and the external lexicon, which contributes to an improved parsing accuracy, and suggest incorporating agreement information as a filter.",
                    "sid": 68,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The methodologies we suggest extend outside the scope of Hebrew processing, and are of general applicability to the NLP community.",
                    "sid": 69,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hebrew is a specific case of a morphologically rich language, and ideas presented in this work are useful also for processing other languages, including English.",
                    "sid": 70,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lattice-based parsing methodology is useful in any case where the input is uncertain.",
                    "sid": 71,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, we have used it to solve the problem of parsing while recovering null elements in both English and Chinese (Cai, Chiang, and Goldberg 2011), and others have used it for the joint segmentation and parsing of Arabic (Green and Manning 2010).",
                    "sid": 72,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extending the lexical coverage of a treebank-derived parser using an external lexicon is relevant for any language with 123 a small treebank, and also for domain adaptation scenarios for English.",
                    "sid": 73,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the agreement-as-filter methodology is applicable to any morphologically rich language, and although its contribution to the parsing task may be limited, it is of wide applicability to syntactic generation tasks, such as target-side-syntax machine translation in a morphologically rich language.",
                    "sid": 74,
                    "ssid": 74,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "modern hebrew. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Lexical and Syntactic Properties.",
                    "sid": 75,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some relevant lexical and syntactic properties of Modern Hebrew are highlighted in this section.",
                    "sid": 76,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.1 Unvocalized Orthography.",
                    "sid": 77,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most vowels are not marked in everyday Hebrew text, which results in a very high level of lexical and morphological ambiguity.",
                    "sid": 78,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some tokens can admit as many as 15 distinct readings, and the average number of possible morphological analyses per token in Hebrew text is 2.7, compared with 1.4 in English (Adler 2007).",
                    "sid": 79,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word תויפכ can be read in at least eight different ways (‘spoons,’ ‘square cotton headkerchiefs,’ ‘coercions,’ ‘as mouths,’ ‘as spouts,’ ‘as fairies,’ ‘ungratefulness,’ ‘fun/adjectivefeminine,plural ’), the word בתכ in at least six ways (‘a journalist,’ ‘writing,’ ‘script,’ ‘wrote,’ ‘added someone as a recipient,’ ‘was added as a recipient’) and the word תא can be read as a very common case-marker (appearing before definite direct objects), a very common pronoun (‘you/feminine ’), and a noun (‘shovel’).",
                    "sid": 80,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.2 Affixation.",
                    "sid": 81,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Eight common prepositions, conjunctions, and articles may never appear in isolation and must always be attached as prefixes to the following word.2 These include the function words מ (‘from’), ש (‘which’/‘who’/‘that’), שכ (‘when’), ה (‘the’), ו (‘and’), כ (‘like’), ל (‘to’), and ב (‘in’),.",
                    "sid": 82,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several such elements may attach together, producing forms such as שמשהמשו (שמש-ה-מ-ש-ו ‘and-that-from-the-sun’).",
                    "sid": 83,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice that when it appears by itself, the last part of the token, the noun שמש (‘sun’), can also be interpreted as the sequence שמ-ש (‘who moved’).",
                    "sid": 84,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The linear order of such elements within a token is fixed (disallowing the reading שמ-ש-ה-מ-ש-ו in the previous example).",
                    "sid": 85,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The syntactic relations of these elements with respect to the rest of the sentence are rather free, however.",
                    "sid": 86,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relativizer ש (‘that’), for example, may attach to an arbitrarily long relative clause that goes beyond token boundaries.",
                    "sid": 87,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The attachment in such cases encompasses a long-distance dependency that cannot be captured by local- context (or Markovian) sequential processes that are typically used for morphological disambiguation.",
                    "sid": 88,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same argument holds for resolving PP attachment of a prefixed preposition or marking conjunction of elements of any kind.",
                    "sid": 89,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To further complicate matters, the definite article ה (‘the’) is not realized in writing when following the particles ב (‘in’), כ (‘like’), and ל (‘to’).",
                    "sid": 90,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the form תיבב can be interpreted as either תיב-ב (‘in house’) or תיב-ה-ב (‘in the house’).3 2 In what follows, we indicate the correct segmentations of the different forms.",
                    "sid": 91,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Naturally occurring.",
                    "sid": 92,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hebrew text does not have such indications.",
                    "sid": 93,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 This overt element is in fact indicated by vocalization, but is not realized in standard written text..",
                    "sid": 94,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "124 In addition, pronominal elements (clitics) may attach to nouns, verbs, adverbs, prepositions, and others as suffixes (e.g., ןאיבה [ןה-איבה, ‘brought-them’], םהילע [-ילעםה,‘on them’]).",
                    "sid": 95,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These affixations result in highly ambiguous token segmentations: ורפסמ (‘[they] assigned numbers’) vs. ו-רפסמ (‘his number ’ or ‘the one who cuts his hair ’) vs. -רפס-מו (‘from his book’ or ‘from his barber ’), תבכרה (‘putting together ’) vs. תבכר-ה (‘the train’), and לצב (‘an onion’) vs. לצ-ב (‘in the shadow’) are only a few examples of ambiguities that may arise.",
                    "sid": 96,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Quantitatively, 99,896 out of 567,483 forms (17%) in a wide-coverage lexicon of Hebrew can admit both segmented and unsegmented analyses.",
                    "sid": 97,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In many cases the correct segmentation cannot be determined from local context alone, but can be disambiguated by more global syntactic constraints (in םימש יתיאר םילוחכ, the middle token is ambiguous between םימש [‘sky’] and םימ-ש [‘that/rel water ’], and the sequence can be interpreted as either ‘I saw blue skies’ or ‘I saw that blue water.’ On the other hand, ראבה ןמ וצרפ םילוחכ םימש יתיאר is unambiguous because the past verb וצרפ requires the relativizer ש, allowing only the segmented םימ-ש reading ‘I saw that blue water broke from the well’.",
                    "sid": 98,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the other direction, יתכלהו םילוחכ םימש יתיאר ןושיל is also unambiguous, allowing only the unsegmented reading ‘I saw blue skies and went to sleep’.)",
                    "sid": 99,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.3 Rich Templatic Morphology.",
                    "sid": 100,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hebrew words follow a complex morphological structure, which is based on a root + template system, with both derivational and inflectional elements.",
                    "sid": 101,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word forms can encode gender, number, person, and tense, and in addition noun-compounding is also morphologically marked (see Section 2.1.7).",
                    "sid": 102,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the exact details of the system are irrelevant (but see Adler [2007] and Glinert [1989] for a good overview), we note that this word formation mechanism results in a very high number of possible word forms, and that it is hard to guess the part-of-speech of words based on prefixes and suffixes alone, a method frequently used in other languages.",
                    "sid": 103,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.4 The Participle Form.",
                    "sid": 104,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Hebrew participle form (ינוניב, literally the “middle form” of verbs) is a form that shares morphological and syntactic properties of nouns, verbs, and adjectives.",
                    "sid": 105,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This form causes many disagreements between human annotators, and large disagreement is found also between major Hebrew dictionaries regarding many word forms (see Adler et al. [2008b] for a discussion from tag set design and annotation guidelines, including many syntactic, semantic, and lexical considerations).",
                    "sid": 106,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the purpose of this work, this form is of interest as it highlights the inherent ambiguity between adjectival, nominal, and verbal readings of many words, which are hard to disambiguate even in context.",
                    "sid": 107,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.5 Relatively Free Constituent Order.",
                    "sid": 108,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ordering of constituents inside a phrase is relatively free.",
                    "sid": 109,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is most notably apparent in verbal phrases and sentential levels.",
                    "sid": 110,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, whereas most sentences follow a subject-verb-object order (SVO), OVS and VSO configurations are also possible (counting in the Hebrew Treebank reveals 5,720 SV cases and 2,613 VS cases, compared with 81,135 SV and 3,018 VS constructions in the English WSJ Treebank).",
                    "sid": 111,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, verbal arguments can appear before or after the verb, and in many orders.",
                    "sid": 112,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such variations in constituent order are easy to capture using ‘flat’ S structures putting the verbs and all of its arguments on the same clausal level, and this is the annotation approach adopted by the Hebrew Treebank (as well as by treebanks of other languages, such as French [Abeille´ , Cle´ ment, and Toussenel 2003]).",
                    "sid": 113,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These flat structures result in the grammar having more and longer rules and the treebank having fewer instances of each rule type, however, causing a data sparseness 125 problem for statistical estimation methods based on treebank counts, and making it more difficult to reliably estimate the grammar parameters.",
                    "sid": 114,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.6 Verbless Constructions.",
                    "sid": 115,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several constructions in which the verb is not realized are common in Hebrew.",
                    "sid": 116,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These include the possessive constructions such as םיעוצעצ ודיעל םיבר (‘to-Ido toys many’ meaning ‘ido has many toys’), which also feature a flexible constituent order ודיעל םיבר םיעוצעצ (‘toys many to-Ido’, ‘ido has many toys’), and copular constructions such as דומח דליה (‘the-boy cute’ ‘the boy is cute’) and עגושמ דליה (‘the-boy crazy’ ‘the boy is crazy’).",
                    "sid": 117,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.7 NP Structure and Construct-State.",
                    "sid": 118,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although constituent order may vary, NP internal structure is rigid.",
                    "sid": 119,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A special morphological marker (construct state, or תוכימס) is used to mark noun-compounds as well as similar phenomena (this is similar to the idafa construction in Arabic).4 Noun compounding in Modern Hebrew is productive and very frequent—about a quarter of the noun tokens in the Hebrew Treebank are in the construct state.",
                    "sid": 120,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Construct-state nouns can be highly ambiguous with non-construct- state nouns.",
                    "sid": 121,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some forms are morphologically marked but the marking is not present in unvocalized text (תונב/banot vs. תונב/bnot), and some forms are not marked at all (ךרוע).",
                    "sid": 122,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The construct-state marker, although ambiguous, is essential for analyzing NP internal structure.",
                    "sid": 123,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Where regular nouns are marked for definiteness using the definite marker ה, construct-nouns acquire the definite status of the noun-phrase they compound to.",
                    "sid": 124,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Construct constructions may be nested, as in םיחופתה תספוק הסכמ עבצ ןווג (‘shadeconst colorconst lidconst boxconst the apples,’ meaning ‘the shade of the color of the lid of the box of the apples’).",
                    "sid": 125,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.8 Definiteness.",
                    "sid": 126,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Definiteness is spread across many elements in the NP.",
                    "sid": 127,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All elements in a definite NP, except for construct-nouns and proper-names, are explicitly marked using the functional element ה that is prefixed to the token.",
                    "sid": 128,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Proper-names are inherently definite and cannot take the definite marker, and construct-nouns acquire their definiteness status from the NP they dominate (definiteness is not explicitly marked on construct-nouns).",
                    "sid": 129,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.9 Case Marking.",
                    "sid": 130,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Definite direct objects are marked.",
                    "sid": 131,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The case marker in this case is the function word תא appearing before the direct object.",
                    "sid": 132,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subjects, indirect objects, and non-definite direct objects are not marked.",
                    "sid": 133,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.10 Agreement.",
                    "sid": 134,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hebrew grammar forces morphological agreement between adjectives and nominals (adjectives appear after the noun, and agree in gender, number, and definiteness), and between subjects and verbs (including the verbless copular constructions), which agree in gender, number, and person.",
                    "sid": 135,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Agreement in the predicative case is a bit complex: When the verb is overt and the predicative-complement is a noun, as in ץורית איה העיסנה (‘the-tripfem isfem an-excusemasc ’), gender and number agreement are required between the subject and the verb (but not the predicative-complement), but in the verbless case, the subject and the predicate-complement noun must agree (ץורית העיסנה* ‘the-tripfem an-excusemasc ’).",
                    "sid": 136,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When the predicate-complement is an adjective, gender and number agreement between the subject and the predicate-complement 4 The construct state is not restricted to nouns, and can also appear on numbers (e.g., םידלי תורשע/‘tens-of.",
                    "sid": 137,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "kids’) and adjectives (םירפוסה לודג/‘biggest-of authors’).",
                    "sid": 138,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "126 is required regardless of the realization of the verb/copular element: הובג דליה, הדליה הובג*, הובג אוה דליה, הובג איה הדליה* (‘the-boy tallmasc ’, ‘*the-boy tallfem ’, ‘the-boy ismasc tallmasc ’, ‘*the-girl isfem tallmasc ’).",
                    "sid": 139,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Implications for Parsing.",
                    "sid": 140,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After surveying some lexical and syntactic properties of Modern Hebrew, we turn to highlight some aspects in which Modern Hebrew differs from English from the perspective of parsing system design.",
                    "sid": 141,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2.1 Small Amount of Annotated Data.",
                    "sid": 142,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whereas the English Treebank is relatively large (49,208 sentences, or 1,173,766 words), the Hebrew Treebank (Guthmann et al. 2009) is much smaller, containing only 6,220 sentences, or 115,661 tokens (156,316 words5 ).",
                    "sid": 143,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The small size of the Hebrew Treebank implies a smaller training set for learning- algorithms used to construct the parser.",
                    "sid": 144,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2.2 Ambiguous Word Segmentation.",
                    "sid": 145,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic parsing systems treat the input sentence as observed data—the leaves (in constituency parsing) of the tree are known in advance, and the parser is expected to build a parse tree around them.",
                    "sid": 146,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not the case in Hebrew, where many function words are not separated by white space but instead are prefixed to the next word and appear within the same token.",
                    "sid": 147,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This makes the word sequence unobserved to the parser, which has to infer both the syntactic-structure and the token segmentation.6 One possible solution to the unobserved word-sequence problem is a pipeline system in which an initial model is in charge of token-segmentation, and the output of the initial model is fed as the input to a second stage parser.",
                    "sid": 148,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a popular approach in parsing systems for Arabic and Chinese (Jiang, Huang, and Liu 2009; Green and Manning 2010).",
                    "sid": 149,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As discussed in Section 2.1.2 (as well as in Tsarfaty [2006a], Goldberg and Tsarfaty [2008], and Cohen and Smith [2007]), however, the token-segmentation and syntactic-parsing tasks are closely intertwined and are better performed jointly instead of in a pipeline fashion, which is the approach we explore in this work.",
                    "sid": 150,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2.3 Morphological Variation and High Out-of-Vocabulary Rate.",
                    "sid": 151,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The intrinsic deficiency caused by the small amount of training data is made even more severe due to Hebrew’s rich morphological inflection patterns.",
                    "sid": 152,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The high amount of morphological variation means that many word forms will not be observed in the training data, making it harder to reliably estimate lexical probabilities based on the annotated resources alone.",
                    "sid": 153,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike English, where parts-of-speech for words are relatively easy to guess based on simple orthographic features (words starting with capital letters are proper nouns, words ending in -ed are usually verbs, etc.), this is not the case for Hebrew.",
                    "sid": 154,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among the 773 words appearing in English test data but not in the training data, 269 start with a capital letter, 58 end with -ed, and 49 end with -ing.",
                    "sid": 155,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Together, these three simple heuristics cover almost half of the unobserved tokens.",
                    "sid": 156,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such heuristics are not available for Hebrew in the common case of unvocalized text: Proper names are not marked 5 Because of agglutination, a Hebrew token may consist of several words, for example the token תיבב.",
                    "sid": 157,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "comprises the two words ב(‘in’) and תיב(‘house’).",
                    "sid": 158,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 Token segmentation is sometimes (erroneously) referred to as morphological segmentation..",
                    "sid": 159,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "127 in writing, and word prefixes and suffixes are not indicative of the part-of-speech tags.7 Thus, the out-of-vocabulary (OOV) problem is much harder in Hebrew than in English and other European languages: On the one hand many words are unobserved in training, and on the other, it is more difficult to guess the analysis of such unknown words.",
                    "sid": 160,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A system for handling automatic processing of Hebrew text cannot rely solely on manually annotated corpora, as such corpora cannot provide adequate lexical coverage.",
                    "sid": 161,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Systems that attempt to perform disambiguation on the lexical level (such as sequence- based morphological disambiguators, or syntactic parsers that perform morphological disambiguation as part of the parsing process) should be designed to incorporate lexical knowledge from sources external to the annotated corpora.",
                    "sid": 162,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We discuss methods of enhancing the system’s performance based on a resource that is external to the treebank: A lexicon-based broad-coverage morphological analyzer enhanced with semi-supervised probability estimates based on expectation maximization (EM) training of a hidden Markov model (HMM) tagger on a large amount of unannotated text.",
                    "sid": 163,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2.4 Morphological Agreement.",
                    "sid": 164,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rich morphological system also means that words carry large amounts of extra information: definiteness, gender, number, tense, and person.",
                    "sid": 165,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of this information interacts with syntax through agreement constraints.",
                    "sid": 166,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, nouns and adjectives should agree in gender and number, and subjects and verbs should agree in gender, number, and person.",
                    "sid": 167,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Agreement constraints can provide useful hints for disambiguating the syntactic structure.",
                    "sid": 168,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider for example the sentence חופתה תא הלכאש םדאה תשא (‘wife of the man who ate the apple’).",
                    "sid": 169,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The English sentence is ambiguous with respect to the entity who ate the apple, but the Hebrew version is not—the verb הלכא (‘ate’) is in feminine form, indicating that it was the wife who did the eating.",
                    "sid": 170,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Can a parsing system make use of such information?",
                    "sid": 171,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This issue is investigated further in Section 8.2.",
                    "sid": 172,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Existing Resources for Hebrew Text Processing.",
                    "sid": 173,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several linguistic resources are available for Hebrew, and are used as building blocks for the parsing systems described in this work.",
                    "sid": 174,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3.1 The Hebrew Constituency-Treebank.",
                    "sid": 175,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A constituency treebank of Modern Hebrew, incrementally developed at the Technion over the course of more than eight years (Sima’an et al. 2001; Guthmann et al. 2009), is maintained by MILA, the knowledge center for processing Hebrew.8 The current version of the treebank (Version 2) contains 6,220 sentences taken from the Israeli daily newspaper ץראה (Ha’aretz).",
                    "sid": 176,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sentences are manually annotated on both the lexical and the syntactic levels.",
                    "sid": 177,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each token9 is segmented into words, and each word is assigned a part of speech tag that also captures, 7 Although the suffixes are good indicators of gender and number (םי is usually plural masculine, ה is. usually singular feminine), they are not good at indicating the core part-of-speech (ה is a suffix can appear in adjectives הפי, verbs הרמש, nouns הלחמ, and similarly for םי (םיפי, םישפחתמ, םילוענמ).",
                    "sid": 178,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, due to the root+template system, in most cases the first and last letters of the word are part of the root and not of the pattern רמוש,רומשי, making the suffixes even less indicative.",
                    "sid": 179,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 http:/ www.mila.cs.technion.ac.il/mila/eng/index.html.",
                    "sid": 180,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 As discussed in Section 2.1.2, Hebrew tokens (entities separated by white space and punctuation symbols).",
                    "sid": 181,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "do not necessarily correspond to Hebrew words.",
                    "sid": 182,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A single token may contain several words.",
                    "sid": 183,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "128 where applicable, the morphological properties of the word such as number, gender, and person.",
                    "sid": 184,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then a constituency tree is built on top of the segmented words.",
                    "sid": 185,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The annotation of NPs is relatively nested, and the sentence level structures are relatively flat (the verb and all of its arguments reside on one level under S).",
                    "sid": 186,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The treebank has 115,661 tokens and 156,764 words.",
                    "sid": 187,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The POS tagging scheme in the treebank is highly syntactic in nature: A part-of- speech is chosen to reflect the syntactic function of the given word in context.",
                    "sid": 188,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, demonstrative pronouns are tagged in the treebank as adjectives when appearing in an adjectival position (הז דלי, ‘this/JJ child/NN’), and a special MOD tag is used to mark non-adverbial clausal level modification (that is, modifications that can be treated as adverbial, but that are used to modify something other than a verb).",
                    "sid": 189,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a more detailed description of the Constituency Treebank see Sima’an et al.",
                    "sid": 190,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2001), Guthmann et al.",
                    "sid": 191,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009), and Tsarfaty (2010, pages 199–216), as well as the annotation guidelines.10 2.3.2 Train/dev/test Splits.",
                    "sid": 192,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Throughout the article, we follow the established train/ dev/test split for the treebank, namely, sentences 1–483 are used for development, sentences 484–5,740 are used for training the parser, and sentences 5,741 to 6,220 are used as the final test set.",
                    "sid": 193,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3.3 The MILA Broad-Coverage Lexicon.",
                    "sid": 194,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Aside from the Constituency Treebank, Hebrew has a wide-coverage, lexicon-based morphological analyzer which can assign morphological analyses (prefixes, suffixes, core POS, gender, number, person, etc.) to Hebrew tokens.",
                    "sid": 195,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lexicon (henceforth the KC Analyzer) is developed and maintained by the Knowledge Center for Processing Hebrew (Itai and Wintner 2008).",
                    "sid": 196,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is based on a lexicon of roughly 25,000 word lemmas and their inflection patterns.",
                    "sid": 197,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From these, 562,439 unique word forms are derived.",
                    "sid": 198,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are then prefixed (subject to constraints) by 73 prepositional prefixes.",
                    "sid": 199,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even with this seemingly large vocabulary, the KC Analyzer ’s coverage is not perfect.",
                    "sid": 200,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Adler et al.",
                    "sid": 201,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008a), we present a machine-learning method that is trained on the basis of the analyzer and that can guess possible analyses for words unknown to the analyzer with reasonable accuracies.",
                    "sid": 202,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using this extension, the analyzer has perfect coverage (even though the quality is obviously better for words that are present in the analyzer ’s database).",
                    "sid": 203,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tag set used by the lexicon/analyzer is lexicographic in nature, and is discussed in depth in BGU Computational Linguistics Group (2008).",
                    "sid": 204,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Creating a resource such as the morphological analyzer for a morphologically rich language is a worthwhile and cost-effective effort: After establishing the tag set, it is relatively straightforward to add lemmas to the lexicon, and the automatic inflection process guarantees good coverage of all the possible inflections.",
                    "sid": 205,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is much more efficient than annotating enough text to obtain a similar coverage.",
                    "sid": 206,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3.4 Hebrew Morphological Disambiguator.",
                    "sid": 207,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The morphological analyzer provides the possible set of analyses for each token, but does not disambiguate the correct analysis in context.",
                    "sid": 208,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A morphological disambiguator (henceforth “the Hebrew tagger ” or “tagger ”) was developed by Meni Adler at BenGurion University of the Negev (Adler and Elhadad 2006; Adler 2007; Goldberg, Adler, and Elhadad 2008).",
                    "sid": 209,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After the (extended) morphological analyzer assigns the possible analyses for each token in an 10 http:/ www.mila.cs.technion.ac.il/mila/files/treebank/Decisions-Corpus1-5001.v1.pdf.",
                    "sid": 210,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "129 input sentence, the tagger takes the output of the analyzer as input and chooses the single best analysis for the entire sentence (performing both token segmentation of words and part-of-speech assignment for each word).",
                    "sid": 211,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tagger is an HMM-based sequential model that is trained in a semi-supervised fashion using EM based on the output of the morphological analyzer on a large amount (about 70M words) of unannotated Hebrew text.",
                    "sid": 212,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tagger is described in Adler and Elhadad (2006) and Adler (2007).",
                    "sid": 213,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tagger is relatively accurate: It achieves 93% accuracy in predicting segmentation and tagging when measured on the POS accuracy, and 90% accuracy when measured on the complete tag set, which includes the complete set of morphological features.",
                    "sid": 214,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because the tagger is not trained on a particular annotated training set but instead on a very large corpus of text spanning multiple genres, its performance is robust across domains.",
                    "sid": 215,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tagger ’s success is due in part to a smart initialization procedure to the EM training process.",
                    "sid": 216,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This initialization procedure takes the output of the analyzer and assigns a conditional probability distribution P(tag|word) for each word.",
                    "sid": 217,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, it assigns an a priori, context-free likelihood for each analysis of a word (although the word broke can be either a verb in the past tense or an adjective, it is more likely to be the former; such preferences can be modeled as probability distributions, and the initialization procedure attempts to learn the values of these distributions automatically from raw data).",
                    "sid": 218,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This initialization procedure is described in Goldberg, Adler, and Elhadad (2008).",
                    "sid": 219,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A side effect of the EM–HMM training of the tagger is pseudo-counts for (word, tag) events, which are based on patterns observed in the unannotated training data.",
                    "sid": 220,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use these counts in order to improve the lexical-disambiguation capacity of the parser.",
                    "sid": 221,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3.5 A Resource Incompatibility Issue.",
                    "sid": 222,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, the KC Analyzer adopted a different tag set than the one used in the treebank, and analyses produced by the KC Analyzer (and hence by the morphological disambiguator) are incompatible with the Hebrew Treebank.",
                    "sid": 223,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are not mere technical differences, but derive from different perspectives on the data.",
                    "sid": 224,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Hebrew Treebank (TB) tag set is syntactic in nature (“if the word in this particular position functions as an adverb, tag it as an adverb, even though it is listed in the dictionary only as a noun”), whereas the KC tag set (Adler 2007; Netzer et al. 2007; Adler et al. 2008b) takes a lexical approach to POS tagging (“a word can assume only POS tags that would be assigned to it in a dictionary”).",
                    "sid": 225,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lexical approach does not accommodate generic modification POS tags such as MOD, nor does it allow listing of demonstrative pronouns as adjectives.",
                    "sid": 226,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These divergent perspectives are reflected in different guidelines to human taggers, different principles underlying tag definitions, and different verification procedures.",
                    "sid": 227,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This difference in perspective yields different performances for parsers induced from tagged data, and a simple mapping between the two schemes is impossible to define.",
                    "sid": 228,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some Hebrew forms, particularly the present participle and modal forms, are inherently hard to define, and the wide disagreement about their status is reflected in practically all Hebrew dictionaries.",
                    "sid": 229,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This kind of disagreement naturally appears also between the KC and TB.",
                    "sid": 230,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "See Adler et al.",
                    "sid": 231,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008b) and Netzer et al.",
                    "sid": 232,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) for further discussion on these two interesting cases.",
                    "sid": 233,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bridging the discrepancy between the two resources is an important aspect in the creation of a successful parsing system.",
                    "sid": 234,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the one hand the syntactic annotations in the treebank are needed in order to train the parser, and on the other hand the information provided by the morphological analyzer is needed in order to provide a good lexical coverage.",
                    "sid": 235,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We discuss an approach to bridging this discrepancy in Section 6.",
                    "sid": 236,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "130 2.4 Section Summary.",
                    "sid": 237,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To summarize, the Hebrew language and its analysis poses several challenges to parser design: The amount of annotated material is relatively small, precluding the possibility of learning robust lexical parameters from the annotated corpora.",
                    "sid": 238,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The productive nature of the morphology results in many word forms, adding another obstacle to estimating lexical parameters from annotated data.",
                    "sid": 239,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The nature of the word-formation mechanism in Hebrew makes it hard to guess the morphological analysis of a word based on its prefix and suffix alone as is done in other languages, requiring the use of a more complex system for handling unknown words.",
                    "sid": 240,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many function words in Hebrew are not separated by white space but are instead attached to the next token, making the observed word sequence ambiguous.",
                    "sid": 241,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word segmentation needs to be performed in addition to syntactic disambiguation.",
                    "sid": 242,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Successful word segmentation may rely on syntactic disambiguation, suggesting that it is better to perform the segmentation and syntactic-disambiguation tasks jointly.",
                    "sid": 243,
                    "ssid": 169,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, Hebrew grammar requires various forms of morphological agreement, a fact which hopefully can help disambiguate otherwise ambiguous syntactic structures.",
                    "sid": 244,
                    "ssid": 170,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The syntactic parser should be able to make use of agreement information.",
                    "sid": 245,
                    "ssid": 171,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In terms of existing resources, Hebrew has a small treebank annotated with constituency structure and a broad-coverage, manually constructed, lexicon-based morphological analyzer.",
                    "sid": 246,
                    "ssid": 172,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The morphological analyzer is capable of providing the possible morphological analyses for many lexical forms, and it is extended using a machine- learning technique to also provide possible analyses for word-forms not covered by the lexicon.",
                    "sid": 247,
                    "ssid": 173,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extended lexicon provides a good lexical coverage of Hebrew.",
                    "sid": 248,
                    "ssid": 174,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also available is a morphological disambiguator that is capable of associating probabilities to the possible analyses of the lexical forms in the lexicon, and disambiguating the analyses of a sequence of lexical items in context based on a sequential model.",
                    "sid": 249,
                    "ssid": 175,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The constituency treebank can be used to learn the parameters of a syntactic-model of Hebrew, and the morphological analyzer can be used to provide broad-coverage lexical knowledge.",
                    "sid": 250,
                    "ssid": 176,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, the treebank and the lexicon/disambiguator follow different annotation schemes, and are therefore incompatible with each other.",
                    "sid": 251,
                    "ssid": 177,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The annotation gap between the two resources must be bridged before they can be used together.",
                    "sid": 252,
                    "ssid": 178,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now turn to survey the components of our Hebrew parsing system.",
                    "sid": 253,
                    "ssid": 179,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "latent-annotation state-split grammars (pcfg-la). ",
            "number": "3",
            "sents": [
                {
                    "text": "Klein and Manning (2003) demonstrated that linguistically informed splitting of non- terminal symbols in treebank-derived grammars can result in accurate grammars.",
                    "sid": 254,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their work triggered investigations in automatic grammar refinement and state-splitting (Matsuzaki, Miyao, and Tsujii 2005; Prescher 2005), which was then perfected in work by Petrov and colleagues (Petrov et al. 2006; Petrov and Klein 2007; Petrov 2009).",
                    "sid": 255,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "State-split models assume that each non-terminal label has a latent annotation that should be recovered.",
                    "sid": 256,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of a single NP symbol, these models hypothesize that there are many different NP symbols, NP1 , . . .",
                    "sid": 257,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", NPk , and each is used in a different context.",
                    "sid": 258,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The labels are hidden, however, and we can only observe the core category label (NP).",
                    "sid": 259,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The job of the training process is to come up with the hidden set of label assignments to non-terminals, such that the resulting grammar assigns a high probability to the observed treebank data.",
                    "sid": 260,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such models are called PCFG with latent annotations (PCFG- LA) and are shown empirically to produce very accurate parsing results.",
                    "sid": 261,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "131 The model of Petrov et al.",
                    "sid": 262,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006) and its publicly available implementation, the BerkeleyParser,11 learns the latent annotations by starting with a bare-bones treebank- derived grammar and automatically refining it in split-merge-smooth cycles, setting the parameters using EM.",
                    "sid": 263,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We provide a brief description of the model and learning process (refer to Petrov et al. 2006; Petrov and Klein 2007; Petrov 2009 for the full details).",
                    "sid": 264,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The learning works by following an iterative split-merge-smooth cycle, in which the following steps are performed repetitively: Splitting each non-terminal category in two All of the grammar symbols are split.",
                    "sid": 265,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first round, NP is split into NP1 and NP2 . In the second round these are split into NP11 , NP12 , NP21 , NP22 , and so forth.",
                    "sid": 266,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each splitting round results in new grammar in which a rule of the form A → BC is replaced by eight rules, the result of splitting each A, B, and C in two.",
                    "sid": 267,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An EM procedure is then used to set the probabilities of each of the split rules.",
                    "sid": 268,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The EM training is constrained by the grammar on the one hand and by the annotated tree structures on the other.",
                    "sid": 269,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Merging back non-effective splits Not all of the splits are useful.",
                    "sid": 270,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the punctuation POS tag will always result in punctuation, and there is no reason to split it into two punctuation POS tags.",
                    "sid": 271,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Having a grammar with too many states is difficult to manage in terms of memory, storage, and parsing time, and is also prone to overfitting the data.",
                    "sid": 272,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the model aims to undo splits if they are not useful.",
                    "sid": 273,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The splits are evaluated based on an information gain criteria, and splits that are not useful are merged back into their parent symbol, resulting in a smaller grammar (if the symbols B1 and B2 are merged back into B, the rules A → B1 C and A → B2 C are merged into A → B C).",
                    "sid": 274,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The merging step is also followed by an EM procedure for setting the rule probabilities for the resulting grammar.",
                    "sid": 275,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Smoothing the split non-terminals toward their shared ancestor Finally, split symbols may still share some information (although an NP in subject position and an NP in object position behave differently, they also retain some common properties).",
                    "sid": 276,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The smoothing procedure joggles the probability mass of the grammar and moves some probability from the split symbol to its parent.",
                    "sid": 277,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This step is also followed by parameter re-estimation using EM.",
                    "sid": 278,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performing five or six such split-merge-smooth cycles results in accurate grammars, with annotations that capture many latent syntactic interactions.",
                    "sid": 279,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Six cycles mean that symbols can have as many as 64 different substates.",
                    "sid": 280,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At inference time, the latent annotations are (approximately) marginalized out, resulting in the (approximate) most probable unannotated tree according to the refined grammar (the score of the unsplit rule A → B C is taken to be L:;x L:;y L:;z Ax → By Cz ).",
                    "sid": 281,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The grammar learning process is applied to binarized parse trees, with first-order vertical and zeroth-order horizontal markovization (Klein and Manning 2003).",
                    "sid": 282,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that in the initial grammar, each of the non-terminal symbols is effectively conditioned on its parent alone, and is independent of its sisters.",
                    "sid": 283,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the rule S → NP VP NP PP is binarized as: S → NP @S @S → VP @S @S → NP @S @S → PP 11 http:/ code.google.com/p/berkeleyparser/.",
                    "sid": 284,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "132 indicating that S rules start with an NP, can be followed by a sequence of zero or more NPs and VPs, and end with a PP.",
                    "sid": 285,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such an extreme markovization suggests a very strong independence assumption, and is too permissive on its own.",
                    "sid": 286,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It allows the resulting refined grammar to encode its own set of dependencies between a node and its sisters, however, as well as ordering preferences in long, flat rules.",
                    "sid": 287,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the binarized grammar allows the production S → NP NP PP, which may be incorrect.",
                    "sid": 288,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, by annotating the symbols as follows: S → NP @S1 @S1 → VP @S2 @S2 → NP @S2 @S2 → PP the grammar now forces the VP to be produced before the NP, but still allows the NP to be dropped.",
                    "sid": 289,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, by annotating the symbols as: S → NP @S1 @S1 → VP @S2 @S2 → NP @S3 @S3 → PP the grammar effectively allows only the original rule to be produced.",
                    "sid": 290,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initial experiments on Hebrew confirm that moving to higher order horizontal markovization (encoding more context in the initial binarized rules) degrades parsing performance, while producing much larger grammars.",
                    "sid": 291,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The PCFG-LA parsing methodology is very robust, producing state-of-the-art accuracies for English, as well as many other languages including German (Petrov and Klein 2008), French (Candito, Crabbe´ , and Seddah 2009), and Chinese (Huang and Harper 2009).",
                    "sid": 292,
                    "ssid": 39,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "baseline experiments. ",
            "number": "4",
            "sents": [
                {
                    "text": "The baseline system is an “out-of-the-box” PCFG-LA parser, as described in Petrov et al.",
                    "sid": 293,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006) and Petrov and Klein (2007) and implemented in the BerkeleyParser.12 The parser is trained on the Modern Hebrew Treebank (see Section 9 for the exact experimental settings) after stripping all the functional and morphological information from the non-terminals.",
                    "sid": 294,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluate the resulting models on the development set, and consider three settings: Seg+POS Oracle: The parser has access to the gold segmentation and POS tags.",
                    "sid": 295,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Seg Oracle: The parser has access to the gold segmentation, but not the POS tags.",
                    "sid": 296,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pipeline: A POStagger is used to perform word segmentation, which is then used as parser input.",
                    "sid": 297,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A better tag set.",
                    "sid": 298,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Glossing over the parses revealed that the parser failed to learn the distinction between finite and non-finite verbs.",
                    "sid": 299,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The importance of this linguistic 12 http:/ code.google.com/p/berkeleyparser/.",
                    "sid": 300,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "133 Table 1 Baseline: Out-of-the-box BerkeleyParser performance on the dev-set.",
                    "sid": 301,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sett ing T a g s e t F1 (4 cyc les ) F1 (5 cyc les ) Seg +PO S Ora cle Co re 8 9 . 7 8 9 . 5 Seg Ora cle Co re 8 2 . 6 8 3 . 6 Pip elin e Co re 7 6 . 3 7 7 . 2 Seg +PO S Ora cle Co re +V er bs 8 9 . 9 9 0 . 9 Seg Ora cle Co re +V er bs 8 3 . 3 8 3 . 6 Pip elin e Co re +V erb s 7 7 . 1 7 7 . 3 distinction for parsing is obvious, and was also noted in Klein and Manning (2003) for English and in our previous work on parsing Hebrew (Goldberg and Tsarfaty 2008).",
                    "sid": 302,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finite and non-finite verbs are easily distinguishable from each other based on surface form alone.",
                    "sid": 303,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although finiteness is clearly annotated in the treebank, it is not on the “core” part of the POS tags and was removed prior to training the parser.",
                    "sid": 304,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a second set of experiments the core tag set of the parser was modified to distinguish finite verbs, infinitives, and modals.13 The original core–tag set already includes some important distinctions, such as construct from non-construct nouns.",
                    "sid": 305,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results and discussion.",
                    "sid": 306,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 presents the parsing results on the development set.",
                    "sid": 307,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With gold POS tags and segmentation, the results are very high.",
                    "sid": 308,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accuracy drops considerably when the parser is not given access to the gold tags (from about 90 to less than 84 F1 ), indicating that the POS tags are both informative and ambiguous.",
                    "sid": 309,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results drop even further (from 84 to 77) in the pipeline case where the gold segmentation is not available, indicating that correct segmentation also provides valuable information to the parser and that segmentation mistakes are costly.",
                    "sid": 310,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Enriching the tag set to distinguish modals and finite and infinite verbs proved useful, with an increase of about 1 F1 points (absolute) after four split-merge-smooth cycles, and a smaller increase after five cycles.",
                    "sid": 311,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This stresses the importance of the core representation: The automatic learning procedure goes a long way, but it can be aided by linguistically motivated manual interventions in some cases.",
                    "sid": 312,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Analyzing the Learned PCFG-LA Grammar.",
                    "sid": 313,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1.1 Terminal-Level (Lexical) Splits.",
                    "sid": 314,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We begin by inspecting the splits at the part-of- speech level.",
                    "sid": 315,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 displays the number of splits learned for each of the parts-of-speech symbols.",
                    "sid": 316,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prepositions are the most heavily split, followed closely by the somewhat- generic MOD tag and the nouns.",
                    "sid": 317,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nouns and adjectives.",
                    "sid": 318,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The noun and adjective splits are somewhat hard to decipher.",
                    "sid": 319,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of the groups are obvious (things appearing after numbers, last names, parts-of-dates, time related, places, etc.).",
                    "sid": 320,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Others are are much harder to interpret.",
                    "sid": 321,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "13 Unlike previous work, the distinction is retained only at the POS tag level and not propagated to the.",
                    "sid": 322,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "phrase level.",
                    "sid": 323,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tag-level information is sufficient for the parser to learn the phrase-level distinctions on its own.",
                    "sid": 324,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar observations regarding the usefulness and sufficiency of linguistically motivated manual state-splitting of preterminals (as opposed to tree-internal nodes) prior to training a latent-variable grammar were also made by Crabbe´ and Candito (2008).",
                    "sid": 325,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "134 Table 2 Number of learned splits per POS category after five split-merge cycles.",
                    "sid": 326,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tag # Splits Tag # Splits H 1 C D T 6 HA M 1 C C 7 PO S 1 D T 7 RE L 1 JJ 7 VB 1 V B I N F 7 AT 2 P R P 8 CO M 2 C D 1 0 JJT 2 R B 1 3 QW 2 N N 1 6 RB R 2 N N P 1 7 VB MD 2 N N T 2 2 WD T 2 M O D 2 4 AG R 4 I N 2 6 AU X 6 MOD.",
                    "sid": 327,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the general-modification POS tags, most categories clearly single out one or two words with very specific usage patterns, such as אל (‘no’), םג (‘also’), קר (‘only’), וליפא (‘even’), רבעשל (‘former ’), and so forth.",
                    "sid": 328,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other categories are harder to interpret.",
                    "sid": 329,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verbs.",
                    "sid": 330,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finite-verbs are not split at all, even though they form an open-class category.",
                    "sid": 331,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Modal verbs are split into two groups: One of them is dominated by nine modals (רשפא, שי, הארנ, השק, ןיא, ןתינ, המוד, בושח, ןוכנ, roughly corresponding to the English could, should, seem/appear, hard, shouldn’t, possible, appear/seem, important, fitting/required); and the second contains all the others.",
                    "sid": 332,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is an interesting distinction, as the nine singled- out modals never take a subject, whereas the modals in the other group do.14 Infinitive verbs are split into seven categories, six of which are dominated by one or two words each, and the last is a catchall category.",
                    "sid": 333,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Coordination and question-words.",
                    "sid": 334,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Coordination words are heavily split, each of the categories dominated by one or two words, indicating different usage patterns.",
                    "sid": 335,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The question words המ (‘what’) and ימ (‘who’) are singled out from the rest.",
                    "sid": 336,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gender/number agreement.",
                    "sid": 337,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbs are not split at all, indicating that the learned grammar cannot model subject–verb agreement.",
                    "sid": 338,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pronouns are split by type (personals, demonstrative, and subtypes of demonstratives), but not by gender and number.",
                    "sid": 339,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun and adjective splits are sometimes hard to decipher, but they do not exhibit any grouping based on gender or number properties, indicating that the grammar cannot model adjective–noun agreement.",
                    "sid": 340,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Category splits for the AGR tag do show a clear division that follows gender and number, but it is unclear what is captured by this division as the information cannot interact with nouns, adjectives, verbs, or pronouns.",
                    "sid": 341,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "14 In fact, the nine modals are very similar in characterization to the words identified in Netzer et al.",
                    "sid": 342,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007).",
                    "sid": 343,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "as modals, whereas many of the modals in the other group are not necessarily considered as modal outside of the treebank guidelines.",
                    "sid": 344,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "135 Table 3 Number of learned splits per NT-category after five split-merge cycles.",
                    "sid": 345,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tag # Splits Tag # Splits FR AG Q 1 A D V P 1 6 INT J 6 S 1 6 FR AG 7 P P 2 2 SQ 7 V P 2 2 PR N 8 P R E D P 2 5 ADJ P 1 4 N P 3 2 SB AR 1 4 4.1.2 Grammar-Level Splits.",
                    "sid": 346,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows the number of splits learned for each grammar non-terminal.",
                    "sid": 347,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NP category is the most heavily split, followed by predicative phrases, verb phrases, and PPs.",
                    "sid": 348,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the exception of the FRAGQ category, all symbols are split into at least six substates.",
                    "sid": 349,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What information is encapsulated in the state splits?",
                    "sid": 350,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As noted by Petrov et al.",
                    "sid": 351,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006), the latent state-splits learned for the grammar symbols are harder to analyze.",
                    "sid": 352,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One way of shedding some light on the meanings of the split-states is by using the grammar in generation mode and by sampling word sequences from each of the states.15 By looking at the resulting strings, one can sometimes infer the kind of information encoded in the grammar.",
                    "sid": 353,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NP.",
                    "sid": 354,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The split-NPs encode phrase length (some splits result in very long NPs, some in very short, some in very specific one- or two-word patterns).",
                    "sid": 355,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They also encode the definiteness rules (either an NP is definite or not), the interaction between definiteness and the AT marker, and a limited interaction between definiteness and construct nouns.",
                    "sid": 356,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other NP splits are dedicated to pronouns or to question words, or encode proper names, monetary units, and numbers.",
                    "sid": 357,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SBAR.",
                    "sid": 358,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The split-SBARs are split according to the word introducing the SBAR.",
                    "sid": 359,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, some split-SBARs encode quoted and parenthetical items.",
                    "sid": 360,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "S. The split-Ss differ by length.",
                    "sid": 361,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, some S splits seem to be modeling verb-less sentences, variations in word order, and sentence-level coordination.",
                    "sid": 362,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Limitation of PCFG-LA Parsing of Modern Hebrew.",
                    "sid": 363,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The PCFG-LA baseline is a strong one, and is substantially higher than all previous reported results for Hebrew parsing in each of the setups (Seg+POS oracle, Seg Oracle, and no Oracle).",
                    "sid": 364,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also identify some of its limitations, namely: Missed splits.",
                    "sid": 365,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The learning procedure is not perfect, and fails to capture some linguistically meaningful state-splits.",
                    "sid": 366,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When such splits are manually supplied (i.e., the trivial split of verbal types) accuracy improves.",
                    "sid": 367,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "15 Sampling a word sequence is performed by starting at a given state (a split grammar symbol), randomly.",
                    "sid": 368,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "choosing a right-hand-side based on the PCFG-induced distribution, expanding the state into the chosen right-hand side, and continuing recursively until we are left with only strings.",
                    "sid": 369,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "136 Sensitivity to non-gold POS.",
                    "sid": 370,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The substantial drop in accuracy when the POS tags are unobserved and need to be predicted is staggering, which suggests that it is difficult for the parser to assign part-of-speech tags.",
                    "sid": 371,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of the 698 part-of-speech errors, 314 are on words not seen in training.",
                    "sid": 372,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sensitivity to non-gold segmentation.",
                    "sid": 373,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The accuracy drops even further when the parser is presented with predicted segmentation.",
                    "sid": 374,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Segmentation errors are detrimental to the parser.",
                    "sid": 375,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Not encoding grammatical agreement.",
                    "sid": 376,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the learned grammar does not encode grammatical agreement.",
                    "sid": 377,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whereas the majority of the parser mistakes are due to the flexible constituent order or “standard” ambiguities such as coordination and PP attachment, a handful of them could be resolved using agreement information.",
                    "sid": 378,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In what follows, we address these four limitations, and substantially increase the parser accuracy for the realistic case where gold segmentation and POS tags are not available.",
                    "sid": 379,
                    "ssid": 87,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "manual state-splits. ",
            "number": "5",
            "sents": [
                {
                    "text": "We experimented with several linguistically motivated state-splits which were added as tree-annotations prior to running the parser.",
                    "sid": 380,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of them did not help on their own and slightly degraded parser performance when combined with other splits.",
                    "sid": 381,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These include splits which were proven useful in previous work, such as marking of definite NPs, and distinguishing possessive from other PPs.",
                    "sid": 382,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also experimented with splits based on morphological agreement features, which are discussed in Section 8.1.",
                    "sid": 383,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall, the learning procedure is capable of producing good splits on its own.",
                    "sid": 384,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We did, however, manage to improve upon it with the following annotation (the annotations were removed prior to evaluation).",
                    "sid": 385,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subject NPs.",
                    "sid": 386,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hebrew phrase order is rather flexible, and the subject can appear before or after the verb.",
                    "sid": 387,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Identifying the subject can thus help in grounding the overall structure of the sentence.",
                    "sid": 388,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The subject is also dependent on agreement constraints with the verb.",
                    "sid": 389,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following Johnson (1998), Klein and Manning (2003) implicitly annotate subject-NPs in English using parent annotation (distinguishing NPs under S from other NPs), with good results.",
                    "sid": 390,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When applied to English, the PCFG-LA also learns to model subject NPs well.",
                    "sid": 391,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hebrew’s non-configurationality, however, put both Subjects and Objects directly under S, making it much harder to learn the distinction automatically.",
                    "sid": 392,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Explicit marking of subject NPs contributes slightly to the accuracy of the parser.",
                    "sid": 393,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Perhaps more important than the small increase in accuracy is the fact that the parser can identify subjects relatively well.",
                    "sid": 394,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, marking of object NPs did not help by itself and slightly degraded the parsing accuracy when combined with other annotations.",
                    "sid": 395,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note, however, that Hebrew definite objects are already clearly marked using the תא marker, making them an easy target for the parser.",
                    "sid": 396,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "better lexical coverage with an external lexicon. ",
            "number": "6",
            "sents": [
                {
                    "text": "The drop in parsing accuracy when gold core POS tags are not available and need to be inferred by the parser is huge (from above 90 to less than 84 F1 ).",
                    "sid": 397,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "137 The large number of possible word forms make it very difficult for manually annotated corpora to provide adequate lexical coverage.",
                    "sid": 398,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The problem is even more severe with the case of the Hebrew Treebank, which is especially small.",
                    "sid": 399,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although it is big enough to learn meaningful syntactic generalizations (as demonstrated by the high performance of the baseline system) it is far too small to learn a good lexical model (as evidenced by the drop in accuracy when gold tags are not available).",
                    "sid": 400,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We suggest increasing the lexical coverage of the parser using an external resource, namely, a lexicon-based morphological analyzer.",
                    "sid": 401,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We further extend the utility of the analyzer with lexical tagging probabilities learned from an unannotated corpus.",
                    "sid": 402,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1 A Unified Lexical Probability Model We would like to use the KC Analyzer (Section 2.3.3) to increase the lexical coverage of the treebank-trained parser.",
                    "sid": 403,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, we would like to improve the lexical model P(T → W ) of the generative parser.",
                    "sid": 404,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As discussed in Section 2.3.5, however, the tag sets used by the two resources differ.",
                    "sid": 405,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How can this difference be reconciled?",
                    "sid": 406,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possibility is to re-tag the treebank with the KC tag set and then train on this unified resource.",
                    "sid": 407,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Goldberg et al.",
                    "sid": 408,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009), we show that this procedure degrades parser performance.",
                    "sid": 409,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, Goldberg et al. suggest a layered generative approach that retains the benefits of the treebank tagging for frequent words and resorts to the KC tag set only for rare and unseen words.",
                    "sid": 410,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Under this approach, frequent words are generated from treebank POS tags as usual, but rare words follow a generative process in which first the treebank tag generates a KC tag, and then the KC-tag generates the word.",
                    "sid": 411,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A sample derivation using this layered representation is presented in Figure 1.",
                    "sid": 412,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Treebank-to-KC tag generation probabilities represent a fuzzy, probabilistic mapping between the two resources.",
                    "sid": 413,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Goldberg et al.",
                    "sid": 414,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009), the estimation of these probabilities was done based on a re-tagging of the treebank to use the KC tag set.",
                    "sid": 415,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The re-tagging process was far from trivial, and many tagging cases required extensive debates between human annotators.",
                    "sid": 416,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we present a new procedure which does not require the treebank to be re- tagged with a new tag set.",
                    "sid": 417,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It still uses the layered representation, but instead of forcing one unique KC analysis for each location, it embraces the uncertainty and allows all of them.",
                    "sid": 418,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is done by treating the KC-tag assignments as hidden variables, learning the TB-KC mapping probabilities as part of the grammar training EM process, and marginalizing the KC tags out for the final tree.",
                    "sid": 419,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The procedure is based on the following assumptions: • We have access to trees in which the POS tags ttb are taken from a given tag set TTB . . JJTB PRP-M-S-3-DEMExt הז Figure 1 A layered POS tag representation.",
                    "sid": 420,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "138 . . .",
                    "sid": 421,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NNTB NN-M-SExt NNT-M-SExt VB-M-S-3-PastExt VB-M-S-3-ImpExt עקר Figure 2 A latent layered POS tag representation.",
                    "sid": 422,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• We have additional access to an external resource (lexicon) mapping words to tags text from a different tag set TExt . • Probabilities involving words which are frequent in the treebank can and should be based on treebank counts.",
                    "sid": 423,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Probabilities involving less frequent words should be smoothed in with information from the external lexicon.",
                    "sid": 424,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Smoothing should have a greater effect on less-frequent words.",
                    "sid": 425,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Probabilities for unseen words should be based solely on the external lexicon.",
                    "sid": 426,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 illustrates the representation used for words which are rare or unseen in the treebank training data.",
                    "sid": 427,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The treebank tag NNTB (upper level) generates the word-form עקר (lower level) by considering all the possible KC POS tags allowed for the word in the morphological analyzer (the middle level).",
                    "sid": 428,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probabilities related to generating the KC POS tags are summed, and all the other probabilities are multiplied.",
                    "sid": 429,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The exact equations are detailed in the following.",
                    "sid": 430,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the needed quantity is the emission probability P(TTB → W ) = P(W|TTB ), it is more convenient (for a reason which will be discussed later) to work with the tagging probability P(TTB |W ).",
                    "sid": 431,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once the tagging probabilites P(TTB |W ) are available, they can easily be converted to emission probabilities using Bayesian inversion, based on the relative-frequency estimates of P(W ) and P(TTB ) which are calculated from the treebank:16 P(ttb |w)P(w) = P(w|t P(ttb ) tb ) = P(ttb → w) (1) 16 Our notation uses capital letters to denote random variables, and lowercase letters to denote specific.",
                    "sid": 432,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "events.",
                    "sid": 433,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, P(T|W ) refers the distributions in which a tag ∈ T is condition on a word ∈ W, P(T|w) refers to the conditional distribution of tags t ∈ T given a specific word w, and P(t|w) refers to the probability mass of the specific tag t given word w. 139 Let us now focus on estimating the tagging probabilities P(TTB |W ) for the cases of frequent, rare, and OOV words.",
                    "sid": 434,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For frequent words that are seen more than K times in the treebank, we simply use treebank-based relative-frequency estimates:17 Ptb (ttb|w) = c(w, ttb ) c(w) (2) where c(·) is a counting function.",
                    "sid": 435,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For OOV words that are not seen in the treebank, the tagging probability is estimated using: Poov (ttb|w) = )' text ∈TExt P(text |w)P(ttb |text ) (3) where P(TExt |W ) is a tagging probability using the external tag set, and P(TTB |TExt ) is a transfer probability relating the tags from the two tag sets (the estimation of these two probabilities is discussed subsequently).",
                    "sid": 436,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What this does is assume a process in which the word is tagged by first choosing a tag according to the external lexicon, and then choosing a tag from the TB tag set based on the external one.",
                    "sid": 437,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The external tag assignments are then treated as latent variables, and are marginalized out.",
                    "sid": 438,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, for rare words that are seen only a few times in the treebank, we interpolate the two quantities, weighted by the word’s frequency in the treebank: c(w)Ptb (ttb|w) + Poov (ttb |w) Prare (ttb |w) = 1 + c(w) (4) We now turn to describing the estimation of the external tagging probability P(TExt |W ) and the tag transfer probability P(TTB |TExt ).",
                    "sid": 439,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Estimating P(TExt |W ).",
                    "sid": 440,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tagging probability follows the morphological analyzer.",
                    "sid": 441,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The analyzer provides the possible analyses, but does not provide probabilities for them.",
                    "sid": 442,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One simple option would be to assign each possible analysis (tag) a uniform probability, and assign 0 probability for tags not allowed by the lexicon for the given word.",
                    "sid": 443,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method is referred to as Punif (TExt |W ).",
                    "sid": 444,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We know that not all the possible analyses for a given word are equally likely, however, and in practice, the actual tagging distribution is usually biased toward one or two of the tags.",
                    "sid": 445,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These tagging preferences can be learned in an unsupervised manner given the lexicon and a large corpus of unannotated text, using EM training of an HMM tagging model.",
                    "sid": 446,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adler and Elhadad (2006) suggest such a model for accurate tagging of Hebrew, and Adler (2007) and Goldberg, Adler, and Elhadad (2008) extend it to provide state-of-the-art tagging accuracies for Hebrew using a smart initialization.",
                    "sid": 447,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we use the pseudo-counts from 17 In practice, a small amount of smoothing is added to allow tagging a word with open-class tags if it.",
                    "sid": 448,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "wasn’t seen within the treebank: Ptb (ttb |w) = (c(w, ttb ) + 0.0001 ∗ P(ttb ))/(c(w) + 0.0001).",
                    "sid": 449,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "140 the final round of EM training in this tagging model in order to compute Pem (TExt |W ).",
                    "sid": 450,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show in Section 9 that this unsupervised lexical probabilities estimation does indeed provide better parsing results.",
                    "sid": 451,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Estimating P(TTB |TExt ).",
                    "sid": 452,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tagset-transfer probabilities capture the patterns of transfer between the syntactic tagging scheme of the treebank and the other tagging scheme of the external resource.",
                    "sid": 453,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are estimated using treebank counts and the tagging distribution P(TExt |W ): c(ttb, text ) L:;w c(ttb, w)P(text |w) P(ttb|text ) = c(t = ext ) L:; w c(w)P(text|w) (5) Integration into the PCFG-LA model.",
                    "sid": 454,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The estimation procedure is incorporated into the training process of the PCFG-LA model.",
                    "sid": 455,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that in the PCFG-LA model the treebank tag set TTB is gradually split, and each tag takes the form (tag, substate), where substate is a latent variable indicating a specific split of the given tag.",
                    "sid": 456,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that the treebank tagging probability and the tag set–transfer probabilities are also defined over these split tags.",
                    "sid": 457,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whereas the external tagging probabilities P(TExt |W ) are fixed prior to PCFG-LA training, the other distributions (P(TTBsubstate |W ) and P(TTBsubstate |TExt )) are re estimated in the EM process following each of the split, merge, and smooth stages.",
                    "sid": 458,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is done by replacing the corpus counts c(·) in Equations (2) and (5) with pseudo-counts (expectations, marginal scores) of the same events in the E step of the EM procedure.",
                    "sid": 459,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main reason for using the Bayesian inversion (Equation (1)) instead of working with the emission probability P(W|T) directly is that the emission probability is highly dependent on the vocabulary size.",
                    "sid": 460,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The treebank estimates are based on a small vocabulary, the external lexicon estimates are based on a very large vocabulary, and a proper combination of the two emission probabilities is not trivial.",
                    "sid": 461,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, the tagging probabilities do not depend on the vocabulary size, allowing a very simple combination.",
                    "sid": 462,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can then base the counts for the emission probability on the treebank vocabulary alone, and estimate P(W ) for words unseen in training as if they were seen once.",
                    "sid": 463,
                    "ssid": 67,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "joint segmentation and parsing. ",
            "number": "7",
            "sents": [
                {
                    "text": "When applied to real text (for which the gold word-segmentation is not available), the baseline PCFG-LA parser is supplied with word segmentation produced by a separate tagging process.18 This seriously degrades parsing performance.",
                    "sid": 464,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A major reason for the performance drop is that the word-segmentation task and the syntactic-disambiguation task are highly related.",
                    "sid": 465,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Segmentation mistakes drive the parser toward wrong syntactic structures, and many segmentation decisions require long-distance information that is not available to a sequential process (Tsarfaty 2006a).",
                    "sid": 466,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For these reasons, we claim that parsing and segmentation should be performed jointly.",
                    "sid": 467,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "18 Although the tagger also produces POS tag assignments, we ignore them and use only the word.",
                    "sid": 468,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "segmentation.",
                    "sid": 469,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is done for two reasons: first, the tag set of the tagger is the one used by the morphological analyzer, and is not compatible with the treebank.",
                    "sid": 470,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, we believe it is better for the parser to produce its own tag assignments.",
                    "sid": 471,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "141 Figure 3 The lattice for the Hebrew sequence םיענה םלצב (see footnote 19).",
                    "sid": 472,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Joint segmentation and parsing can be achieved using lattice parsing.",
                    "sid": 473,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of parsing over a fixed input string, the parser operates on a lattice—a structure encoding all the possible segmentations.",
                    "sid": 474,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.1 Lattice Representation.",
                    "sid": 475,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Formally, a lattice is a directed acyclic graph in which all paths lead from the initial state to the end state.",
                    "sid": 476,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the Hebrew segmentation task, all word segmentations of a given sentence are represented using a lattice structure.",
                    "sid": 477,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each lattice arc corresponds to a word and its corresponding POS tag, and a path through the lattice corresponds to a specific word- segmentation and POS tagging of the sentence.",
                    "sid": 478,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is by now a fairly standard representation for multiple morphological segmentations of Hebrew utterances (Adler 2001; Bar-Haim, Sima’an, and Winter 2005; Adler 2007; Cohen and Smith 2007; Goldberg, Adler, and Elhadad 2008; Goldberg and Tsarfaty 2008; Goldberg and Elhadad 2011).",
                    "sid": 479,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also used for Arabic (Green and Manning 2010) and other languages (Smith, Smith, and Tromble 2005).",
                    "sid": 480,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 depicts the lattice for the two-words sentence םיענה םלצב.19 Double-circles indicate the space-delimited token boundaries.",
                    "sid": 481,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that in this construction arcs can never cross token boundaries.",
                    "sid": 482,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Every token is independent of the others, and the sentence lattice is in fact a concatenation of smaller lattices, one for each token.",
                    "sid": 483,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, some of the arcs represent lexemes not present in the input tokens (e.g., ה/DT, לש/POS), although these are parts of valid analyses of the token.",
                    "sid": 484,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Segments with the same surface form but different POS tags are treated as different lexemes, and are represented as separate arcs (e.g., the two arcs labeled םיענ from node 6 to 7).",
                    "sid": 485,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A similar structure is used in speech recognition.",
                    "sid": 486,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There, a lattice is used to represent the possible sentences resulting from an interpretation of an acoustic model.",
                    "sid": 487,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In speech recognition the arcs of the lattice are typically weighted in order to indicate the probability of specific transitions.",
                    "sid": 488,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given that weights on all outgoing arcs sum up to one, weights induce a probability distribution on the lattice paths.",
                    "sid": 489,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In sequential tagging models such as Smith, Smith, and Tromble (2005), Adler and Elhadad (2006), and Bar-Haim, Sima’an, and Winter (2008) weights are assigned according to a tagging model based on linear context.",
                    "sid": 490,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the case of parsing, context-free weighting of lattice arcs is used: each arc 19 Whereas Hebrew is written right-to-left, the lattice is to be read left-to-right.",
                    "sid": 491,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The words on each arc. follow the Hebrew writing directions, and are written right-to-left.",
                    "sid": 492,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "142 corresponds to a (tag, word) pair, and is weighted according to the emission distribution P(tag → word).20 7.2 Lattice Parsing.",
                    "sid": 493,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CKY parsing algorithm can be extended to accept a lattice, instead of a predefined list of tokens, as its input (Chappelier et al. 1999).",
                    "sid": 494,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CKY search then finds a tree spanning from the start-state to the end-state of the lattice, where the leaves of the tree are lattice arcs.",
                    "sid": 495,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lattice extension of the CKY algorithm is performed by indexing lexical items according to their start- and end-states in the lattice instead of by their sentence position, and changing the initialization procedure of CKY to allow terminal and preterminal symbols of spans of sizes > 1.",
                    "sid": 496,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is then relatively straightforward to modify the parsing mechanism to support this change: not giving special treatments for spans of size 1, and distinguishing lexical items from non-terminals by a specified marking instead of by their position in the chart.",
                    "sid": 497,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 4 shows the CKY chart for the lattice in Figure 3, together with an (incorrect) parse over the lattice.",
                    "sid": 498,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The chart is initialized with parts of speech corresponding to the lattice arcs.",
                    "sid": 499,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Phrase-structures are then built on top of the POS tags (in blue).",
                    "sid": 500,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed structure must span the entire chart, and correspond to a path through the lattice from the initial state (0) to the last one (7).",
                    "sid": 501,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At training time the correct segmentation is fully observed, and the generative parser is trained as usual over the treebank.",
                    "sid": 502,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At inference (test) time, the correct segmentation is unknown, and the decoding is applied to the segmentation lattice.",
                    "sid": 503,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best derivation returned by the parser forces a specific segmentation.",
                    "sid": 504,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The returned parse tree is the most probable (segmentation, tree) pair according to the grammar.21 We modified the PCFG-LA BerkeleyParser to accept lattice input at inference time.",
                    "sid": 505,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lattice parsing allows us to preserve the segmentation ambiguity and present it to the parser, instead of committing to a specific segmentation prior to parsing.",
                    "sid": 506,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This way segmentation decisions are performed in the parser as part of the global search for the most probable structure, and can be affected by global syntactic considerations.",
                    "sid": 507,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show in Section 9 that this methodology is indeed superior to the pipeline approach.",
                    "sid": 508,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Early descriptions of algorithms for parsing over word lattices can be found in Lang (1974, 1988) and Billott and Lang (1989).",
                    "sid": 509,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lattice parsing was explored in the context of parsing of speech signals by Chappelier et al.",
                    "sid": 510,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1999), Sima’an (1999), and Hall (2005), and in the context of joint word-segmentation and syntactic disambiguation in Cohen and Smith (2007), Goldberg and Tsarfaty (2008), and Green and Manning (2010).",
                    "sid": 511,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "20 Lattice parsing for Hebrew is explored also in Cohen and Smith (2007).",
                    "sid": 512,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There, lattice arc weights are.",
                    "sid": 513,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "assigned based on aggregate quantities (forward-backward tagging marginals) derived from a discriminative CRF tagging model.",
                    "sid": 514,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach is not ideal from a modeling perspective, as it makes each POS tag be accounted for twice: once by the syntactic model, and once by the sequential one.",
                    "sid": 515,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, a sequential tagging model is not used at all.",
                    "sid": 516,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the use of a sequential model is desired, an alternative method for integrating a sequence model and a syntactic model is making the models “negotiate” an agreed upon structure that maximizes the score under both models, using optimization techniques such as dual decomposition (Dantzig and Wolfe 1960), which was recently introduced into natural language processing (Rush et al. 2010).",
                    "sid": 517,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "21 Note that finding the most probable segmentation requires summing over all the trees resulting in each.",
                    "sid": 518,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "segmentation—a much harder task, proven to be NP-complete in Sima’an (1996).",
                    "sid": 519,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "143 Figure 4 Lattice initialization of the CKY chart.",
                    "sid": 520,
                    "ssid": 57,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "incorporating morphological agreement. ",
            "number": "8",
            "sents": [
                {
                    "text": "Inspecting the learned grammars reveal that they do not encode any knowledge of morphological agreement: The split categories for nouns, verbs, and adjectives do not group words according to any relevant morphological property such as gender or number, making it impossible for the grammar to model agreement patterns.",
                    "sid": 521,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the same time, inspecting some of the bad parses reveals several clear cases of agreement mistakes.",
                    "sid": 522,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Can morphological agreement be incorporated in the parsing model?",
                    "sid": 523,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8.1 Forcing Morphologically Motivated Splits.",
                    "sid": 524,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our initial attempts focused on making the PCFG-LA learning procedure pick up on agreement-relevant state-splits.",
                    "sid": 525,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When neither the core tag set nor the non-terminals encode gender and number information, it is very hard for the parser to pick up on agreement patterns.22 We attempted to train the parser on trees which mark the agreement features (either the gender, the number, or both) either on the POS tags, the relevant constituents, or 22 In the external lexicon case, the external lexicon tags do encode the morphological features, making.",
                    "sid": 526,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "it possible in principle for the parser to learn to map certain substates to certain agreement features.",
                    "sid": 527,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This did not happen in practice, arguably because other structural factors were more powerful than the agreement ones.",
                    "sid": 528,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "144 both.",
                    "sid": 529,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Annotating agreement features on the POS tag–level made the parsing much slower, but did make the parser assign certain split categories to certain gender–number combinations, and sampling utterances from the learned grammar did indicate a notion of grammatical agreement.",
                    "sid": 530,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This did not improve parsing accuracy, however—and even slightly degraded it.",
                    "sid": 531,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When propagating the agreement features and annotating them on the constituent level, parsing accuracy dropped considerably.",
                    "sid": 532,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When inspecting the learned grammar we observe that most of the agreement-annotated constituents (e.g., NPMasc,Plural ) were still fully split, indicating that the parser picked on patterns which were orthogonal to the agreement mechanism.",
                    "sid": 533,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pre-splitting according to agreement-features properties caused data sparseness, aided over-fitting, and hurt parsing performance: The smoothing procedure of the BerkeleyParser shares some probability-mass between various splits of the same symbol, but was not applied in our case (no information flowed between, for example, NPMasc,Plural and NPMasc,Singular ).",
                    "sid": 534,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We attempted to counter this effect by changing the smoothing mechanism of the BerkeleyParser to share information also between the manually split symbols.",
                    "sid": 535,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This brought parsing accuracy back to the initial level, but also caused the parser to, again, not model agreement very well.",
                    "sid": 536,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason for this is clear in hindsight: Morphological agreement is an absolute concept, not a fuzzy one (things can either agree or not).",
                    "sid": 537,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Smoothing the probabilities between the different morphology-based split-licensed grammar rules that allow morphological disagreement, and made the grammar lose its discrimination power.",
                    "sid": 538,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This was then reinforced by the training process, which picked on other syntactic factors instead, and further phased out the agreement knowledge.",
                    "sid": 539,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A note on product-grammars.",
                    "sid": 540,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In recent work, Petrov (2010) showed that a committee of latent-variable grammars encoding different grammatical preferences can be combined into a product-grammar that is better than the individual ensemble members.",
                    "sid": 541,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Petrov created the ensemble by training several PCFG-LA parsers on the same data, but using different random seeds when initializing the EM starting point.",
                    "sid": 542,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We attempted to create a similar ensemble by providing the learning process with different linguistically motivated tree annotations (with and without encoding agreement features, with and without encoding definiteness, etc.).",
                    "sid": 543,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The combined parser did increase the performance level over that of the individual parsers, but an ensemble with the same number of components that was produced using the random-seeds approach produced far superior results.",
                    "sid": 544,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This reinforces the findings of Petrov (2010) who also reports that the ensemble creation using random initialization is exceptionally strong and outperforms other methods of ensemble creation.23 8.2 Agreement as Filter.",
                    "sid": 545,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now turn to suggest an approach to modeling agreement, which rests on the following principles: • Agreement can be modeled as a set of hard (not probabilistic) constraints.",
                    "sid": 546,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Agreement is completely orthogonal to the other aspects of the grammar.",
                    "sid": 547,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "23 The product grammar approach with random seeds works well and is effective for improving the.",
                    "sid": 548,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "accuracy of Hebrew parsing.",
                    "sid": 549,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As it is completely orthogonal to the approaches presented in this article, however, we chose not to discuss it further other than commenting on its applicability.",
                    "sid": 550,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "145 Based on these principles, we suggest treating agreement as a filter, a device that can rule out illegal parses.",
                    "sid": 551,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Under the agreement-as-filter framework, we want the parser to produce the most probable parse according to its grammar and subject to hard agreement constraints.",
                    "sid": 552,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach completely decouples the grammar from the agreement verification mechanism.",
                    "sid": 553,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The agreement information is not modeled in the grammar and is not used to guide the search for the best parse.",
                    "sid": 554,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, it is a separate process that imposes hard constraints on the search space and rules out parts of it completely.",
                    "sid": 555,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, agreement is a part of the parser and not of the grammar.",
                    "sid": 556,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is similar in spirit to ideas from constraint-based grammars such as LFG (Falk 2001) and HPSG (Pollard and Sag 1994), which also model aspects of the syntax as Boolean constraints.",
                    "sid": 557,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Grammatical agreement is a relation between constituents.",
                    "sid": 558,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relevant morphological features are propagated from one of the leaves up to the constituent level.",
                    "sid": 559,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When constituents are combined to form a larger constituent, their morphological features are assigned to the newly created constituent according to language-specific rules (it is possible that different morphological features will be assigned by different constituents).",
                    "sid": 560,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An agreement violation occurs when two or more constituents assign conflicting features to their parent.",
                    "sid": 561,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Implementation.",
                    "sid": 562,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the implementation, an agreement-verification mechanism is manually constructed (not learned) based on a set of simple, language-dependent rules.",
                    "sid": 563,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we provide a set of rules to propagate the morphological agreement features from the leaves to the constituents.",
                    "sid": 564,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we specify an additional set of rules to inspect local tree configuration and identify agreement violations (the Hebrew set of rules is described later, along with a concrete example).",
                    "sid": 565,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The feature-propagation mechanism works bottom–up and the agreement verification rules are very local, making it possible to integrate the filtering mechanism into a bottom–up CKY parsing algorithm (refusing to complete a constituent if it violates an agreement constraint).",
                    "sid": 566,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We did not pursue this route for the experiments in this work, however.",
                    "sid": 567,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, we opted for an approximation in which we take the 100-best trees for each sentence, and choose the first tree that does not have an agreement violation (this is an approximation because the 100-best trees may not contain a valid tree, in which case we accept the agreement violation and choose the first-best tree).",
                    "sid": 568,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The specific details of the Hebrew agreement filter are given in the appendix.",
                    "sid": 569,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verifying the hard-constraint property.",
                    "sid": 570,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We verified that the hard constraint assumption works and that the agreement verification mechanism is valid by applying the procedure to the gold-standard trees in the training-set and checking that (1) the propagated features agree with the manually marked ones, and (2) none of the training-set trees were filtered due to agreement violation.",
                    "sid": 571,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We did find a few cases in which the propagated features disagreed with the manually marked ones, and a few gold-standard trees that the mechanism marked as containing an agreement violation.",
                    "sid": 572,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All of these cases were due to mistakes in the manual annotation.",
                    "sid": 573,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Connections to parse-reranking.",
                    "sid": 574,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our implementation is similar to parse-reranking (Charniak and Johnson 2005; Collins and Koo 2005).",
                    "sid": 575,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, if we were to model agreement as soft constraints, we could have incorporated this information as features in a reranking model.",
                    "sid": 576,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The filter approach differs in that it poses hard constraints and not soft ones, pruning away parts of the search space entirely.",
                    "sid": 577,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the use of k-best list is merely a technical detail in our implementation—the agreement information is 146 easily decomposable and the hard constraints can be efficiently incorporated into the CKY search procedure.",
                    "sid": 578,
                    "ssid": 58,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "evaluation and results. ",
            "number": "9",
            "sents": [
                {
                    "text": "Data set.",
                    "sid": 579,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For all the experiments we use Version 2 of the Hebrew Treebank (Guthmann et al. 2009), with the established test-train-dev splits: Sentences 484–5,740 are used for training, sentences 1–483 are the development set, and sentences 5,741–6,220 are used for the final test set.",
                    "sid": 580,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation Measure.",
                    "sid": 581,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the cases where the gold segmentation is given, we use the well- known evalb F1 score.",
                    "sid": 582,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Namely, each tree is treated as a set of labeled constituents.24 Each constituent is represented as a 3tuple (i, j, L), in which i and j are the indices of the first and the last words in the constituent, respectively, and L is the constituency label.",
                    "sid": 583,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, (2, 4, NP) indicates an NP spanning from word 2 to word 4.",
                    "sid": 584,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of a parser is evaluated based on the amount of constituents it recovered correctly.",
                    "sid": 585,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let G denote the set of constituents in a gold-standard constituency tree, and P denote the set of constituents in a predicted tree.",
                    "sid": 586,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Precision (P), recall (R), and F1 are defined as: precision = |G ∩ P| |P| recall = |G ∩ P| |G| F1 = 2 1 1 precision + recall F1 ranges from 0 to 1, and it is 1 iff both precision and recall are 1, indicating the trees are identical.",
                    "sid": 587,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We report numbers in precentages rather than fractions.",
                    "sid": 588,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When measuring the performance of models in which the token-segmentation is predicted and can contradict the gold-standard, a generalization of these measures isused.",
                    "sid": 589,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of representing a constituent by a triplet (i, j, L), each constituent is repre sented by a pair containing the concatenation of the words at its yield, and its label L. This measure was suggested by Tsarfaty (2006a) and used in subsequent work (Tsarfaty 2006b; Goldberg and Tsarfaty 2008; Goldberg et al. 2009; Goldberg and Elhadad 2011).",
                    "sid": 590,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is equivalent to reassigning the i and j indices to represent character positions instead of word numbers.",
                    "sid": 591,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When the yields of the gold standard and the predicted trees are the same, this is equivalent to the standard evaluation measure using the (i, j, L) triplets of word indices and a label, and it will produce the same precision, recall, and F1 as above.",
                    "sid": 592,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Effect of external lexicon.",
                    "sid": 593,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We start by evaluating the effect of extending the parser ’s lexical model with an external lexicon, as described in Section 6.1.",
                    "sid": 594,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rare-word threshold is set to 100.",
                    "sid": 595,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the morphological analyzer described in Section 2.3.3.",
                    "sid": 596,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We test two conditions: UNIFORM, in which the P(Text |w) distribution is uniform over all the 24 This assumes unary-chains do not contain cycles..",
                    "sid": 597,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "147 Table 4 Dev-set results when incorporating an external lexicon.",
                    "sid": 598,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Set ting Ext Le xic on /Pr ob s F1 (4 cy cle s) F1 (5 cyc les ) Seg Ora cle N O N E 8 3 . 1 3 8 3 . 3 9 Pip elin e N O N E 7 5 . 9 8 7 6 . 6 5 Seg Ora cle U N I F O R M 8 4 . 9 2 8 4 . 5 6 Pip elin e U N I F O R M 7 7 . 5 3 7 7 . 3 5 Seg Ora cle H M M B A S E D 8 6 . 1 7 8 5 . 7 9 Pip elin e H M M B A S E D 7 8 . 7 5 7 8 . 7 8 analyses suggested by the morphological analyzer for the word, and HMM-BASED in which the P(Text |w) distribution is based on pseudo-counts from the final round of EM– HMM training of the semi-supervised POS tagger described in Section 2.3.4.",
                    "sid": 599,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results are presented in Table 4.",
                    "sid": 600,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Incorporating the external lexicon helps both in the case where the correct segmentation is assumed to be known, as well as in the pipeline case where the segmentation is automatically induced by a sequential tagger.",
                    "sid": 601,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Incorporating the semi-supervised lexical probabilities learned over large unannotated corpora (HMM-BASED) further improves the results, up to 86.1 F1 for the gold-segmentation case and 78.7 F1 for the pipeline case.",
                    "sid": 602,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pipeline model still lags behind the gold-segmentation case, indicating that the correct segmentation is very informative for the parser.",
                    "sid": 603,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Joint segmentation and parsing.",
                    "sid": 604,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Having established that the external lexicon can be effectively incorporated into the parser, we turn to evaluate the method for joint segmentation and parsing.",
                    "sid": 605,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We follow the same conditions as before (UNIFORM and HMM-BASED lexical probabilities), but in this set of experiments the parser is allowed to choose its preferred segmentation using the lattice-parsing methodology presented in Section 7.2.",
                    "sid": 606,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lattice is constructed according to the analyses licensed by the morphological analyzer.",
                    "sid": 607,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 lists the results.",
                    "sid": 608,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lattice parsing is effective, leading to an improvement of about 2–3 F1 points over the pipeline model.",
                    "sid": 609,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Agreement filter.",
                    "sid": 610,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now turn to add the agreement filtering on top of the lexicon- enhanced models.",
                    "sid": 611,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this setting, the model outputs its 100-best trees for each sentence, agreement features are propagated, and agreement violations are checked as described Table 5 Dev-set results when using lattice parsing on top of an external lexicon/analyzer.",
                    "sid": 612,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Set ting Ext Le xic on/ Pr ob s F1 (4 cyc les ) F1 (5 cyc les ) Pip elin e U N I F O R M 7 7 . 5 3 7 7 . 3 5 Latt ice (Joi nt) U N I F O R M 8 0 . 3 5 8 0 . 3 1 Pip elin e H M M B A S E D 7 8 . 7 5 7 8 . 7 8 Latt ice (Joi nt) H M M B A S E D 8 0 . 9 1 8 0 . 4 6 148 Table 6 Dev-set results of using the agreement-filter on top of the lexicon-enhanced parser (starting from gold segmentation).",
                    "sid": 613,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Set ting Ext Le xic on/ Pr ob s F1 (4 cyc les ) F1 (5 cyc les ) No Agr eem ent U N I F O R M 8 4 . 9 2 8 4 . 5 6 Agr ee me nt as Filt er U N I F O R M 8 5 . 3 0 8 4 . 5 2 No Agr eem ent H M M B A S E D 8 6 . 1 7 8 5 . 7 9 Agr ee me nt as Filt er H M M B A S E D 8 6 . 5 5 8 6 . 2 5 in Section 12, and the first tree that does not contain any agreement violation is returned as the final parse for the sentence (or the first-best tree in case that all of the output trees contain an agreement violation).",
                    "sid": 614,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6 lists the results when agreement filtering is performed on top of parses based on gold segmentation, and Table 7 lists the results when agreement filtering is performed on top of a lattice-based parsing model that does not assume gold segmentation is available.",
                    "sid": 615,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discussion of agreement filter results.",
                    "sid": 616,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the agreement filter does not hurt the parser performance, the benefits from it are very small.",
                    "sid": 617,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To understand why that is the case, we analyzed the 1-best parses produced by the 5-cycles-trained grammar on the gold-segmented development set (these conditions corresponds to the last column of the third row in Table 6).",
                    "sid": 618,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The analysis revealed the following reasons for the low impact of the agreement filter: (1) The grammar is strong enough to produce fairly accurate structures, which have very few agreement mistakes to begin with, and (2) fixing an agreement mistake does not necessarily mean fixing the entire parse—in some cases it is very easy for the parser to fix the agreement mistake and still produce an incorrect parse for other parts of the structure.",
                    "sid": 619,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 1-best trees of the 480 sentences of the development set contain 22,500 parse- tree nodes.",
                    "sid": 620,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of these 22,500 nodes, 2,368 nodes triggered a gender-agreement check: about 10% of the parsing decisions could benefit from gender agreement.",
                    "sid": 621,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of the 2,368 relevant nodes, however, 130 nodes involved conjunctions or possessives, and were outside of the scope of our agreement verification rules.",
                    "sid": 622,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of the remaining 2,238 parse- tree nodes, 2,204 passed the agreement check, and only 34 nodes (1.5% of the relevant nodes, and 0.15% of the total number of nodes) were flagged as gender-agreement violations.",
                    "sid": 623,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly for number agreement, 2,244 nodes triggered an agreement check, of which 2,131 nodes could be handled by our system.",
                    "sid": 624,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of these relevant nodes, 2,109 nodes passed the gender-agreement check, and only 23 nodes (1.07% of relevant nodes, Table 7 Dev-set results of using the agreement-filter on top of the lexicon-enhanced lattice parser (parser does both segmentation and parsing).",
                    "sid": 625,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Set ting Ext Le xic on/ Pr ob s F1 (4 cyc les ) F1 (5 cyc les ) No Agr eem ent U N I F O R M 8 0 . 3 5 8 0 . 3 1 Agr ee me nt as Filt er U N I F O R M 8 0 . 5 5 8 0 . 7 4 No Agr eem ent H M M B A S E D 8 0 . 9 1 8 0 . 4 6 Agr ee me nt as Filt er H M M B A S E D 8 1 . 0 4 8 0 . 7 2 149 Table 8 Numbers of parse-tree nodes in the 1-best parses of the development set that triggered gender or number agreement checks, and the results of these checks.",
                    "sid": 626,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gender Agreement Number Agreement Trig gere d agr eem ent che ck 2 , 3 6 8 2 , 2 4 4 Co uld be han dle d by the syst em 2 , 2 3 8 2 , 1 3 1 No agr eem ent viol atio n 2 , 2 0 4 2 , 1 0 9 Agr ee me nt viol atio n 3 4 2 3 and 0.1% of the total nodes) were flagged as agreement violations.",
                    "sid": 627,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The numbers are summarized in Table 8.",
                    "sid": 628,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is clear that the vast majority of the parser decisions are compatible with the agreement constraints.",
                    "sid": 629,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Turning to inspect the cases in which the agreement filter caught an agreement violation, we note that the agreement filter marked 51 of the 480 development sentences as having an agreement violation in the 1-best parse—about 10% of the sentences could potentially benefit from the agreement filter.",
                    "sid": 630,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For 38 of the 51 agreement violations, the agreement violation was fixed in the tree suggested in the 100-best list.",
                    "sid": 631,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We manually inspected these 51 parse trees, and highlight some the trends we observed.",
                    "sid": 632,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the 13 cases in which the 100-best list did not contain a fix to the agreement violation, the cause was usually that the 1-best parse had many mistakes that were not related to the agreement violation, and diversity in the 100-best list reflected fixes to these mistakes without affecting the agreement violation.",
                    "sid": 633,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another cause of error was an erroneous agreement mistake due to an omission in the lexicon.",
                    "sid": 634,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of the 38 fixable agreement violations, 25 were local to a noun-phrase, 10 were cases of subject–verb agreement, and the remaining three were either corner-cases or harder to categorize.",
                    "sid": 635,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The subject– verb agreement violations were handled almost exclusively by keeping the structure mostly intact and changing the NPSUBJ label to some other closely related label that does not require verb agreement, usually NP.",
                    "sid": 636,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a good strategy for fixing subject-less sentences (about half of the cases), but it is only a partial fix in case the subject should be assigned to a different NP (which does not happen in practice) or in case a more drastic structural change to the parse-structure is needed.",
                    "sid": 637,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In one of the 10 cases, the subject–verb agreement mistake indeed resulted in a structural change that improved the overall parse quality.",
                    "sid": 638,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NP internal agreement violations include many cases of noun-compound attachments, and some cases involving coordination.",
                    "sid": 639,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corrections to the agreement violation were mostly local, and usually resulted in correct structure, but sometimes introduced new errors.",
                    "sid": 640,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 5 presents some examples of the different cases.",
                    "sid": 641,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our overall impression is that for NP internal mistakes the agreement-filtering method was mostly doing the right thing.",
                    "sid": 642,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To conclude, the agreement filter is useful in overcoming some errors and providing better parses, especially with respect to noun-compound construct-state constructions.",
                    "sid": 643,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the limited number of parsing mistakes involving agreement violations, however, and because of the local nature of the agreement-violation mistakes, the total effect of the agreement filter on the final parsing score is small.",
                    "sid": 644,
                    "ssid": 66,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the final model. ",
            "number": "10",
            "sents": [
                {
                    "text": "Finally, we evaluate the best performing model on the test set.",
                    "sid": 645,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 9 presents the results of parsing the test set while incorporating the external lexicon and using the 150 Figure 5 NP agreement violations that were caught by the agreement filter system.",
                    "sid": 646,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(a) Noun-compound case that was correctly handled.",
                    "sid": 647,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(b) Case involving conjunction that was correctly handled.",
                    "sid": 648,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(c) A case where fixing the agreement violation introduces a PP-attachment mistake.",
                    "sid": 649,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 9 Test-set results of the best-performing models.",
                    "sid": 650,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Set ting M o d e l F1 (4 cyc les ) Gol d Seg me ntat ion H MM Ba se d Ext ern al Le xic on 8 5 . 6 7 + A g r e e m e n t 8 5 . 7 0 Lattice par sing H MM Ba se d Ext ern al Le xic on 7 6 . 8 7 + A g r e e m e n t 7 6 . 9 5 151 HMM-based probabilities, for a grammar trained for four split-merge iterations.",
                    "sid": 651,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This grammar is applied both to the gold-segmentation case and to the realistic case where segmentation and parsing are performed jointly using lattice-parsing.",
                    "sid": 652,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also test the effectiveness of the agreement-filter in both situations.",
                    "sid": 653,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Agreement information does not hurt performance, but contributes very little to the final accuracy—additionally on the test sentences, the parser makes very few agreement mistakes to begin with.",
                    "sid": 654,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consistent with previous reports (Tsarfaty 2010), the test set is somewhat harder than the development set.",
                    "sid": 655,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With gold-segmentation, the models achieve accuracies of 85.70% F1 . In the realistic scenario in which the segmentation is induced by the parser, the accuracies are around 76.9% F1 . We verified that the HMM-based lexical probabilities also outperform the Uniform probabilities on the test set (the F1 scores when using uniform lexical probabilities are 84.06 and 76.30 for the gold and induced segmentations, respectively).",
                    "sid": 656,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are the best reported results for parsing the test-set of the Hebrew Treebank.",
                    "sid": 657,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work in parsing of morphologically rich languages. ",
            "number": "11",
            "sents": [
                {
                    "text": "Coping with unknown words.",
                    "sid": 658,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several papers show that the handling of unknown words is a major component to be considered when adapting a parser to a new language.",
                    "sid": 659,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the work in Attia et al.",
                    "sid": 660,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) uses language-specific unknown-word signatures for several languages based on various indicative prefixes and suffixes, and Huang and Harper (2009) suggest a Chinese-specific model based on the geometric average of the emission probabilities of the individual characters in the rare or unknown word.",
                    "sid": 661,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another method of coping with lexical sparsity is word clustering.",
                    "sid": 662,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Candito and Crabbe´ (2009), the authors demonstrate that replacing words by a combination of a morphological signature and a word-cluster (based on the linear context of a word in a large unannotated corpus) improves parsing performance for French.",
                    "sid": 663,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The technique provides more reliable estimates for in-vocabulary words (a given cluster appears more frequently than the actual word form), and it also increases the known vocabulary: Unknown words may share a cluster with known words.",
                    "sid": 664,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Arabic.",
                    "sid": 665,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Arabic is similar to Hebrew in the challenges it presents for automatic parsing.",
                    "sid": 666,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most early work on constituency parsing of Arabic focused on straightforward adaptations of Bikel’s parser to Arabic, with little empirical success.",
                    "sid": 667,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Attia et al.",
                    "sid": 668,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) show that parsing accuracies of around 81% F1 can be achieved for Arabic (assuming gold word segmentation) by using a PCFG-LA parser with Arabic-specific unknown- word signatures.",
                    "sid": 669,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently, Green and Manning (2010) report on an extensive set of experiments with several kinds of tree annotations and refinements, and report parsing accuracies of 79% F1 using the Stanford-parser and 82% F1 using the PCFG-LA BerkeleyParser, both when assuming gold word segmentation.",
                    "sid": 670,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The work of Green and Manning also explored the use of lattice-parsing as suggested in Section 7 of this article, as well as earlier in Goldberg and Tsarfaty (2008) and Cohen and Smith (2007), and report promising results for joint segmentation and parsing of Arabic (an F1 score of 76% for sentences of up to 70 words).",
                    "sid": 671,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best reported results for parsing Arabic when the gold word segmentation is not known, however, are obtained using a pipeline model in which a tagger and word-segmenter is applied prior to a manually state-split constituency parser, resulting in an F-score of 79% F1 (for sentences of up to 70 words) (Green and Manning 2010).",
                    "sid": 672,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "152 Hebrew and relational-realizational parsing.",
                    "sid": 673,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some related work deals directly with constituency parsing of Modern Hebrew.",
                    "sid": 674,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The work of Tsarfaty and Sima’an (2007) experiments with grammar refinement for Hebrew, and shows that annotating definiteness and accusativity of constituents, together with parent annotation, improves parsing accuracy when gold word segmentation is available.",
                    "sid": 675,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Relational Realizational (RR) line of work presented in Tsarfaty et al.",
                    "sid": 676,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Tsarfaty and Sima’an 2008; Tsarfaty, Sima’an, and Scha 2009; Tsarfaty and Sima’an 2010; Tsarfaty 2010) handles the constituent-order variation in Hebrew by presenting a separation between the form and function aspects of the grammar.",
                    "sid": 677,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Briefly, whereas plain treebank derived grammars have rules such as S → NP VP PP NP PP that are applied in a single step, the RR approach suggests a generative model in which the generation of flat clausal structures is decomposed into three distinct steps.",
                    "sid": 678,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, in the projection step, a non-terminal generates the kinds of its children without specifying their form or the order between them, using rules of the form S → {OBJ,SBJ,PRED,COM,Adjunct}@S. Second, in the configuration step, an order is chosen based on a separate ordering distribution, using rules of the form {OBJ,SBJ,PRED,COM,Adjunct}@S → SBJ@S PRED@S Adj@S OBJ@S COM@S. Third, in the realization step, each functional element receives a specific form, using rules of the form SBJ@S → NP or Adj@S → PP.",
                    "sid": 679,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The realization rules can encode syntactic properties that are required by the grammar for the given function—for example, a rule such as OBJ@S → NPdef,acc captures the requirement that definite objects in Hebrew must be marked for accusativity using the תא marker, and the rest if the generative process will generate the object NP according to this specified constraint.",
                    "sid": 680,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This kind of linguistically motivated separation of form and function is shown to produce models with fewer parameters and result in better parsing accuracies than plain (or head- driven) PCFGs derived from the same trees.",
                    "sid": 681,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relational-realizational model can accommodate agreement information.",
                    "sid": 682,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is shown in Tsarfaty and Sima’an (2010) that, given gold-standard POS tags that include the gender and number information for individual words, RR models enriched with gender and number agreement information can provide Modern Hebrew parsing ac- curacies of 84% F1 for sentences of up to 40 words, the highest reported number for Modern Hebrew parsing based on gold POS tags and word-segmentation by the time of its publication.",
                    "sid": 683,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the RR framework is well motivated linguistically and appealing aesthetically, in the current work we chose to rely on the extreme markovization employed by the PCFG-LA BerkeleyParser in order to cope with the constituent order variation, and to model agreement as an external filter that is orthogonal to the grammar.",
                    "sid": 684,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach taken in this article provides state-of-the-art results for Hebrew constituency parsing.",
                    "sid": 685,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We leave the question of integrating the RR approach with the approach presented here to future work.",
                    "sid": 686,
                    "ssid": 29,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "12",
            "sents": [
                {
                    "text": "We presented experiments on Hebrew Constituency Parsing based on the PCFG-LA methodology of Petrov et al.",
                    "sid": 687,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006).",
                    "sid": 688,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The PCFG-LA model performs well out-of-the-box, especially when the gold POS tags are available to the parser.",
                    "sid": 689,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is possible to improve the learned grammar, however, by specifying some manual state-splits, specifically 153 distinguishing between modal, finite, and infinitive verbs, and explicit marking of subject-NPs.",
                    "sid": 690,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parsing accuracies drop considerably when the gold POS tags are not available, and drop even further when using non-gold segmentation.",
                    "sid": 691,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A large part of the drop when the gold POS tags are not available is due to the large percentage of lexical events that are unseen or seen only a few times in the training set.",
                    "sid": 692,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This drop can be mitigated by extending the lexical coverage of the parser using an external lexical resource such as a wide-coverage morphological analyzer for mapping lexical items to their possible POS tags.",
                    "sid": 693,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The POS-tagging schemes assumed by the treebank and the morphological analyzer need not be compatible with each other: We present a method for bridging the POS tags differences between the two resources.",
                    "sid": 694,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The morphological analyzer does not provide lexical probabilities.",
                    "sid": 695,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parsing accuracies can be further improved by using lexical probabilities which are derived in a semi-supervised fashion based on the morphological analyzer and a large corpus of unannotated text.",
                    "sid": 696,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The correct token-segmentation is very important for achieving high-quality parses, and when the gold segmentation is not available, parsing results drop considerably.",
                    "sid": 697,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is better to let the parser induce its preferred segmentation in interaction with the parsing process rather than to use a segmentation based on an external sequence model in a pipeline fashion.",
                    "sid": 698,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The joint induction of both the syntactic structure and the token- segmentation can be performed by representing the possible segmentations in lattice structure, and using lattice parsing.",
                    "sid": 699,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Joint parsing and segmentation is shown to outperform the pipeline approach.",
                    "sid": 700,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parsing accuracies with non-gold segmentation are still far below the accuracies when the gold-segmentation is assumed to be known, however, and accurate parsing with non-gold segmentation remains a challenging open research problem.",
                    "sid": 701,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The learned PCFG-LA grammar is not capable of modeling agreement information.",
                    "sid": 702,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We considered methods of using morphological agreement information to improve parsing accuracy.",
                    "sid": 703,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose modeling agreement information as a filtering process that is orthogonal to the grammar used for parsing.",
                    "sid": 704,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach works in the sense that, in contrast to other methods of using agreement information, it does not degrade parsing accuracy and even improves it slightly.",
                    "sid": 705,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The benefit from the agreement filtering is small, however: With the strong grammar induced by the PCFG-LA training procedure, the parser makes very few agreement mistakes to begin with.",
                    "sid": 706,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Modeling morphological agreement is probably more useful in syntactic generation than in syntactic parsing.",
                    "sid": 707,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We expect the filtering approach we propose to be proven useful for tasks involving syntactic generation, such as target-side-syntax machine translation into a morphologically rich language.",
                    "sid": 708,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall, we presented four enhancements to the PCFG-LA mechanism in order to adapt it to parsing Hebrew: the introduction of manual, linguistically motivated state-splits; extending the lexical coverage of the parser using an external morphological analyzer; performing segmentation and parsing jointly using a lattice parser; and incorporating agreement information in a filtering framework.",
                    "sid": 709,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Together, these enhancements result in the best published results for Hebrew Constituency Parsing to date.",
                    "sid": 710,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Appendix A: The Hebrew Agreement Filter Hebrew syntax requires agreement in gender, number, and person.",
                    "sid": 711,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The implementation considers only the gender and number features, which are the most common.",
                    "sid": 712,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each of 154 the features can take one of five values Masculine, Feminine, Both, Unknown, and NA for Gender, and Singular, Plural, Both, Unknown and NA for Number.",
                    "sid": 713,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Masculine, Feminine, Singular, and Plural are self-explanatory, and are assigned when the feature value is obvious.",
                    "sid": 714,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NA means that the feature is irrelevant for the given constituent (adverbs and PPs do not carry gender or number features).",
                    "sid": 715,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both and Unknown are assigned when we are uncertain about the corresponding feature value.",
                    "sid": 716,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both and Unknown are identical in the sense that they leave the feature value unspecified, and have the same effect on the filtering process.",
                    "sid": 717,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From a practical perspective they could be collapsed into the same category.",
                    "sid": 718,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose to maintain the distinction between the two cases because they have slightly different semantics.",
                    "sid": 719,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both indicates that both options are possible (for example, the form תודלי is ambiguous between the plural girls and the singular childhood, and the titular רד, Dr. can refer both to males and females), whereas Unknown means that the feature value could not be computed due to a limitation of the model (for example, there is no clear rule as to the gender of a conjunction which coordinates masculine and feminine NPs, and we are currently unable to accurately infer the gender and number associated with certain complex quantifiers such as בור (most).",
                    "sid": 720,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compare: ראשנ התיכה בור, הלכאנ הגועה בור, הגועה בור לכאנ (‘most of the classfem stayedmasc , most of the cakefem was eatenfem , most of the cakefem was eatenmasc ’).",
                    "sid": 721,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feature values are said to agree if they are compatible with each other.",
                    "sid": 722,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feminine is compatible with NA, Both, and Unknown but not with Masculine.",
                    "sid": 723,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, Singular is compatible with NA, Both, and Unknown, but not with Plural.",
                    "sid": 724,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Agreement cases.",
                    "sid": 725,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system is designed to handle the following cases of morphological agreement: NP level agreement between nouns and adjectives.",
                    "sid": 726,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "םילודג םיקורי םיחופת זגרא (‘box-ofSg applesPl greenPl bigPl ’) , לודג םיקורי םיחופת זגרא (‘box-ofSg applesPl greenPl bigSg ’) S level agreement between subject and verbs.",
                    "sid": 727,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ךלה םידליה דחא (‘[one-of the-kids]Sg walkedSg ’) Predicative agreement between the subject, ADJP, and copular element.",
                    "sid": 728,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "םכח אוה (‘he [is] smartmasc ’), המיהדמ התיה איה (‘she was amazing/fem ’), but not with nouns למס התיה איה (‘she was a-symbolmasc ’).",
                    "sid": 729,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Agreement between the Verb in a relativized SBAR and the realization of the Null- subject in the external NP.",
                    "sid": 730,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "אשונב הנד ש הדעווה (‘the-committeefem which [*] discussedfem the-matter ’) Morphological feature propagation.",
                    "sid": 731,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first step of determining agreement is propagating the relevant features from the leaves up to the constituent level.",
                    "sid": 732,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The procedure begins by assigning each leaf gender and number features.",
                    "sid": 733,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are assigned based either on the TB tag assigned for the word if training on gold POS tags, or on the morphological analyzer entries for the given word (in most cases the number and gender features are easy to predict, even in cases where the core POS is not clear.",
                    "sid": 734,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the relatively rare cases where the analyzer contains both a feminine and masculine (alt.",
                    "sid": 735,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "singular and plural) analyses, feature value is marked as Both).",
                    "sid": 736,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "155 Table A.1 Gender and number percolation rules.",
                    "sid": 737,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "FC = first child with non-NA gender/number.",
                    "sid": 738,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rules for each constituent type are applied in order, until a condition holds.",
                    "sid": 739,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rules for gender and number are applied independently of each other.",
                    "sid": 740,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Constituent Condition Feature Values S B A R S B A R h a s R E L a n d S c h i l d r e n o t h e r w i s e S.f ea tu re s N A P R E D P P R E D P P R E D P h a s A D J P c h i l d h a s A G R c h i l d a n d n o N P c h i l d o t h e r w i s e A D J P . f e a t u r e s A G R . f e a t u r e s N A S S S h a s V P c h i l d a n d n o N P S u b j c h i l d h a s V B c h i l d a n d n o N P S u b j c h i l d o t h e r w i s e V P . f e a t u r e s V B . f e a t u r e s N A NN PG a l w a y s U N P N P N P N P N P N P N P N P h a s N N T c h i l d h a s C D T a n d N P c h i l d r e n i s a c o n j u n c t i o n h a s a “ c h i l d f i r s t c h i l d i s N P , s e c o n d i s P O S h a s I N c h i l d h a s c h i l d w i t h n o n N A g e n / n u m o t h e r w i s e N N T . f e a t u r e s C D T . n u m b e r N P . g e n d e r g e n d e r = U n u m b e r = P l u r a l U NP .fe atu res F C . g e n d e r n u m b e r = U F C . g e n d e r F C . n u m b e r N A A D J P A D J P A D J P h a s J J T c h i l d h a s c h i l d w i t h n o n N A g e n / n u m o t h e r w i s e JJT.",
                    "sid": 741,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "fea tur es FC .ge nd er FC .nu mb er N A V P V P V P V P h a s V B c h i l d h a s V B M o d a l c h i l d h a s V P c h i l d o t h e r w i s e VB .fe atu res VB M od al.f eat ur es VP .fe atu res N A oth er a l w a y s N A After each leaf is assigned feature values, the features are propagated up the tree according to a set of rules such as the following (the complete set of rules is given in Table A.1): • If the constituent is an NP and has a Construct-noun child, it is assigned the gender of the Construct-noun.",
                    "sid": 742,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• If the constituent is a coordinated NP (has a CC child), set its number feature to plural.",
                    "sid": 743,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• If the constituent is an S and it has VP child but no NP-Subject child, take the gender from the VP.",
                    "sid": 744,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Agreement rules.",
                    "sid": 745,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once the features are propagated from the leaves to a constituent, agreement is verified at the constituent level according to the following rules: NP agreement rules: • Agreement for coordinated NPs and Possessive NPs is not checked.",
                    "sid": 746,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "156 • If NP has an SBAR child, all the children up to the SBAR whose type is nominal or adjectival must agree in gender and number.",
                    "sid": 747,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• If NP has an ADJP child, all the children up to the ADJP whose type is nominal or adjectival must agree in gender and number.",
                    "sid": 748,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NP NP NP JJFem,Sg NP JJFem,Sg NNTFem,Sg NP הלודג NNTFem,Sg NP הלודג (a) תספוק NNMs,Pl םיחופת JJMs,Pl םיקורי (b) תספוק NNMs,Pl םיחופת JJMs,Pl םיקורי NPFem,Sg NPFem,Sg NPFem,Sg JJFem,Sg NPFem,Sg JJFem,Sg NNTFem,Sg NPMs,Pl הלודג NNTFem,Sg NPMs,Pl הלודג תספוק (c) Figure A.1 NNMs,Pl םיחופת JJMs,Pl םיקורי (d) תספוק NNMs,Pl םיחופת JJMs,Pl םיקורי Agreement annotation and validation example: correct tree.",
                    "sid": 749,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sentence words translate to box-of apples green big, literally, a big box of green apples.",
                    "sid": 750,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NP NP NNTFem,Sg NP NNTFem,Sg NP תספוק NP JJFem,Sg תספוק NP JJFem,S g (a) NNMs,Pl םיחופת JJMs,Pl םיקורי הלודג (b) NNMs,Pl םיחופת JJMs,Pl םיקורי הלודג NPFem,Sg NPFem,Sg NNTFem,Sg NPMs,Pl NNTFem,Sg NPMs,Pl תספוק NPMs,Pl JJFem,Sg תספוק NPMs,Pl JJFem,Sg (c) Figure A.2 NNMs,Pl םיחופת JJMs,Pl םיקורי הלודג (d) NNMs,Pl םיחופת JJMs,Pl םיקורי הלודג Agreement annotation and validation example: incorrect tree, agreement violation.",
                    "sid": 751,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "box-of apples green big, literally, a big box of green apples, though the parse tree suggests the interpretation a box of big green apples.",
                    "sid": 752,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "157 S agreement rule: • All children of S with type in {NP-Subject, VP, VB, AUX, PREDP} must agree in their gender and number features.",
                    "sid": 753,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ADJP agreement rule: • All children of ADJP with type in {NP, NP-Subject, NN, JJ, ADJP} must agree in their gender and number features.",
                    "sid": 754,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example.",
                    "sid": 755,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the tree in Figure A.1a.",
                    "sid": 756,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first stage (Figure A.1b), agreement features are propagated according to the rules in Table A.1, resulting in the annotated tree in Figure A.1c.",
                    "sid": 757,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Agreement is then validated in Figure A.1d (nodes in which an agreement rule applied and passed are marked in green).",
                    "sid": 758,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, the tree in Figure A.2a has an agreement mistake.",
                    "sid": 759,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As before, the agreement features are propagated according to the rules (Figure A.2b) resulting in Figure A.2c.",
                    "sid": 760,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Agreement validation fails at Figure A.2d (the node in which agreement validation was applied and failed is marked in red).",
                    "sid": 761,
                    "ssid": 75,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}