{
    "ID": "J98-1006",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Corpus-based approaches to word sense identification have flexibility and generality but suffer from a knowledge acquisition bottleneck.We show how knowledge-based techniques can be used to open the bottleneck by automatically locating training corpora.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describe a statistical classifier that combines topical context with local cues to identify a word sense.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classifier is used to disambiguate a noun,a verb,and an adjective.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A knowledge base in the form ofWordNet's lexical relations is used to automatically locate training examples in a general text corpus.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Test results are compared with those from manually tagged training examples.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "An impressive array of statistical methods have been developed for word sense identi­ fication.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They range from dictionary-based approaches that rely on definitions (Veronis and Ide 1990; Wilks et al. 1993) to corpus-based approaches that use only word co­ occurrence frequencies extracted from large textual corpora (Schiitze 1995; Dagan and Itai 1994).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have drawn on these two traditions, using corpus-based co-occurrence and the lexical knowledge base that is embodied in the WordNet lexicon.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two traditions complement each other.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Corpus-based approaches have the advantage of being generally applicable to new texts, domains, and corpora without needing costly and perhaps error-prone parsing or semantic analysis.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They require only training corpora in which the sense distinctions have been marked, but therein lies their weakness.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obtaining training materials for statistical methods is costly and time­ consuming-it is a \"knowledge acquisition bottleneck\" (Gale, Church, and Yarowsky 1992a).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To open this bottleneck, we use WordNet's lexical relations to locate unsuper­ vised training examples.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2 describes a statistical classifier, TLC (Topical/Local Classifier), that uses topical context (the open-class words that co-occur with a particular sense), local con­ text (the open- and closed-class items that occur within a small window around a word), or a combination of the two.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of combining the two types of context to disambiguate a noun (line), a verb (serve), and an adjective (hard) are presented.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following questions are discussed: When is topical context superior to local context (and vice versa)?",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Is their combination superior to either type alone?",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Do the answers to these questions depend on the size of the training?",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Do they depend on the syntactic category of the target?",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "* Division of Cognitive and Instructional Science, Princeton, NJ 08541; email: cleacock@ets.org.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The work reported here was done while the author was at Princeton University.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "t Department of Psychology, 695 Park Avenue, New York, NY 10021; email: mschc@cunyvm.cuny.edu :j: Cognitive Science Laboratory, 221 Nassau Street, Princeton, NJ 08542; email: geo@clarity.princeton.edu © 1998 Association for Computational Linguistics Manually tagged training materials were used in the development of TLC and the experiments in Section 2.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Cognitive Science Laboratory at Princeton Univer­ sity, with support from NSFARPA, is producing textual corpora that can be used in developing and evaluating automatic methods for disambiguation.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples of the different meanings of one thousand common, polysemous, open-class English words are being manually tagged.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of this effort will be a useful resource for train­ ing statistical classifiers, but what about the next thousand polysemous words, and the next?",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to identify senses of these words, it will be necessary to learn how to harvest training examples automatically.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 describes WordNet's lexical relations and the role that monosemous \"relatives\" of polysemous words can play in creating unsupervised training materials.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TLC is trained with automatically extracted examples, its performance is compared with that obtained from manually tagged training materials.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "corpus-based statistical sense identification. ",
            "number": "2",
            "sents": [
                {
                    "text": "Work on automatic sense identification from the 1950s onward has been well summa­ rized by Hirst (1987) and Dagan and Itai (1994).",
                    "sid": 29,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The discussion below is limited to work that is closely related to our research.",
                    "sid": 30,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Some Recent Work.",
                    "sid": 31,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hearst (1991) represents local context with a shallow syntactic parse in which the context is segmented into prepositional phrases, noun phrases, and verb groups.",
                    "sid": 32,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The target noun is coded for the word it modifies, the word that modifies it, and the prepositions that precede and follow it.",
                    "sid": 33,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Open-class items within ±3 phrase segments of the target are coded in terms of their relation to the target (modifier or head) or their role in a construct that is adjacent to the target.",
                    "sid": 34,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evidence is combined in a manner similar to that used by the local classifier component of TLC.",
                    "sid": 35,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With supervised training of up to 70 sentences per sense, performance on three homographs was quite good (88100% correct); with fewer training examples and semantically related senses, performance on two additional words was less satisfactory (7377% correct).",
                    "sid": 36,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gale, Church, and Yarowsky (1992a) developed a topical classifier based on Bayesian decision theory.",
                    "sid": 37,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The only information the classifier uses is an unordered list of words that co-occur with the target in training examples.",
                    "sid": 38,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No other cues, such as part-of-speech tags or word order, are used.",
                    "sid": 39,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Leacock, Towell, and Voorhees (1993) compared this Bayesian classifier with a content vector classifier as used in information retrieval and a neural network with backpropagation.",
                    "sid": 40,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classifiers were compared using different numbers of senses (two, three, or six manually tagged senses of line) and different amounts of training material (50, 100, and 200 examples).",
                    "sid": 41,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the six­ sense task, the classifiers averaged 74% correct answers.",
                    "sid": 42,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Leacock, Towell, and Voorhees (1993) found that the response patterns of the three classifiers converged, suggesting that each of the classifiers was extracting as much data as is available in purely top­ ical approaches that look only at word counts from training examples.",
                    "sid": 43,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If this is the case, any technique that uses only topical information will not be significantly more accurate than the three classifiers tested.",
                    "sid": 44,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Leacock, Towell, and Voorhees (1996) showed that performance of the content vector topical classifier could be improved with the addition of local templates­ specific word patterns that were recognized as being indicative of a particular sense­ in an extension of an idea initially suggested by Weiss (1973).",
                    "sid": 45,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the templates proved to be highly reliable when they occurred, all too often, none were found.Yarowsky (1993) also found that template-like structures are very powerful indi cators of sense.",
                    "sid": 46,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He located collocations by looking at adjacent words or at the first word to the left or right in a given part of speech and found that, with binary ambi­ guity, a word has only one sense in a given collocation with a probability of 9099%.1 However, he had an average of only 29% recall (i.e., the collocations were found in only 29% of the cases).",
                    "sid": 47,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When local information occurred it was highly reliable, but all too often, it did not occur.",
                    "sid": 48,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bruce and Wiebe (1994a, 1994b) have developed a classifier that represents local context by morphology (the inflection on the target word), the syntactic category of words within a window of ±2 words from the target, and collocation-specific items found in the sentence.",
                    "sid": 49,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The collocation-specific items are those determined to be the most informative, where an item is considered informative if the model for indepen­ dence between it and a sense tag provided a poor fit to the training data.",
                    "sid": 50,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relative probabilities of senses, available from the training corpus, are used in the decision process as prior probabilities.",
                    "sid": 51,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each test example, the evidence in its local context is combined in a Bayesian-type model of the probability of each sense, and the most probable sense is selected.",
                    "sid": 52,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance ranges from 7784% correct on the test words, where a lower bound for performance based on always selecting the most frequent sense for the same words (i.e., the sense with the greatest prior probability) would yield 5380% correct.",
                    "sid": 53,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yarowsky (1994), building on his earlier work, designed a classifier that looks at words within ±k positions from the target; lemma forms are obtained through mor­ phological analysis; and a coarse part-of-speech assignment is performed by dictionary lookup.",
                    "sid": 54,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Context is represented by collocations based on words or parts of speech at specific positions within the window or, less specifically, in any position.",
                    "sid": 55,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also coded are some special classes of words, such as WEEKDAY, that might serve to distinguish among word senses.",
                    "sid": 56,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each type of local-context evidence found in the corpus, a log-likelihood ratio is constructed, indicating the strength of the evidence for one form of the homograph versus the other.",
                    "sid": 57,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These ratios are then arranged in a sorted decision list with the largest values (strongest evidence) first.",
                    "sid": 58,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A decision is made for a test sentence by scanning down the decision list until a match is found.",
                    "sid": 59,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, only the single best piece of evidence is used.",
                    "sid": 60,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classifier was tested on disambiguating the homographs that result from accent removal in Spanish and French (e.g., seria, ser(a).",
                    "sid": 61,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In tests with the number of training examples ranging from a few hundred to several thousand, overall accuracy was high, above 90%.",
                    "sid": 62,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clearly, sense identification is an active area of research, and considerable ingenu­ ity is apparent.",
                    "sid": 63,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But despite the promising results reported in this literature, the reality is that there still are no large-scale, operational systems for tagging the senses of words in text.",
                    "sid": 64,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Topical/Local Classifier (TLC).",
                    "sid": 65,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The statistical classifier, TLC, uses topical context, local context, or a combination of the two, for word sense identification.",
                    "sid": 66,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TLC's flexibility in using both forms is an important asset for our investigations.",
                    "sid": 67,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A noun, a verb, and an adjective were tested in this study.",
                    "sid": 68,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 provides a synonym or brief gloss for each of the senses used.",
                    "sid": 69,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training corpora and testing corpora were collected as follows: 1.",
                    "sid": 70,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples for serve, hard, and line, in base or inflected form, were located in online corpora.",
                    "sid": 71,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples containing line and serve were taken from the 198789 LDC 1 Yarowsky does not use the idiomatic or noncompositional sense of collocation.",
                    "sid": 72,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, he means.",
                    "sid": 73,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "co-occurrence of any words.",
                    "sid": 74,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 Word senses used in the experiment and their relative frequencies.",
                    "sid": 75,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "serve (verb) hard (adj) line (noun) sup ply wit h foo d .41 not eas y (di ffi cul t) .80 pro duc t .5 4 hol d an offi ce .29 not sof t (m eta ph ori c) .12 ph one .1 0 fun ctio n as som ethi ng .20 not sof t (ph ysi cal ) .08 text .1 0 pro vide a serv ice .10 cor d .0 9 div isio n .0 9 for ma tio n .0 8 Wall Street Journal corpus and from the American Printing House for the Blind corpus.2 Examples for hard were taken from the LDC San Jose Mercury News (SJM) corpus.",
                    "sid": 76,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each consisted of the sentence containing the target and one sentence preceding it.",
                    "sid": 77,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting strings had an average length of 49 items.",
                    "sid": 78,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 79,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples where the target was the head of an unambiguous collocation were removed from the files.",
                    "sid": 80,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Being unambiguous, they do not need to be disambiguated.",
                    "sid": 81,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These collocations, for example, product line and hard candy were found using WordNet.",
                    "sid": 82,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 3, we consider how they can be used for unsupervised training.",
                    "sid": 83,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples where the target was part of a proper noun were also removed; for example, Japan Air Lines was not taken as an example of line.",
                    "sid": 84,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 85,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each occurrence of the target word was manually tagged with a WordNet sense until a large number of examples was obtained for six senses of line, four senses of serve, and three senses of hard.",
                    "sid": 86,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the process of collecting and manually tagging examples, it was possible to determine the relative frequencies of the senses of each word.",
                    "sid": 87,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The less frequent senses, which do not appear in Table 1, occurred too rarely for us to collect the minimum number of examples needed to perform the experiment described in the next section.",
                    "sid": 88,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 89,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Three sets of materials were prepared by partitioning the examples for each sense into training and test sets.3 The size of the training set was varied by taking the first 25, 50, 100, and 200 examples of the least frequent sense, and examples from the other senses in numbers that reflected their relative frequencies in the corpus.",
                    "sid": 90,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an illustration, in the smallest training set for hard, there were 25 examples of the least frequent sense, 37 examples of the second most frequent sense, and 256 examples of the most frequent sense.",
                    "sid": 91,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The test sets were of fixed size: each contained 150 of the least frequent sense and examples of the other senses in numbers that reflected their relative frequencies.",
                    "sid": 92,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The operation of TLC consists of preprocessing, training, and testing.",
                    "sid": 93,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During pre­ processing, examples are tagged with a part-of-speech tagger (Brill 1994); special tags are inserted at sentence breaks; and each open-class word found in WordNet is re­ placed with its base form.",
                    "sid": 94,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This step normalizes across morphological variants without 2 This 25-million-word corpus is archived at IBM's T. J. Watson Research Center; it consists of stories and.",
                    "sid": 95,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "articles from books and general circulation magazines.",
                    "sid": 96,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 When the examples were collected from the corpus, it was often the case that more than one was.",
                    "sid": 97,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "extracted from a given document.",
                    "sid": 98,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To prevent the classifier from being trained and then tested on sentences from the same text, care was taken to insure that the training and test materials were separate.",
                    "sid": 99,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Much of the corpus consisted of newspapers and periodicals, where it is common practice to repeat or paraphrase the same story on successive days.",
                    "sid": 100,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To minimize possible overlap due to repeated stories, the temporal order of the documents was preserved, and the test set was selected in such a way that it was not contiguous with the training materials.",
                    "sid": 101,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "resorting to the more drastic measure of stemming.",
                    "sid": 102,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Morphological information is not lost, since the part-of-speech tag remains unchanged.",
                    "sid": 103,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training consists of counting the frequencies of various contextual cues for each sense.",
                    "sid": 104,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Testing consists of taking a new example of the polysemous word and comput­ ing the most probable sense, based on the cues present in the context of the new item.",
                    "sid": 105,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A comparison is made to the sense assigned by a human judge, and the classifier's decision is scored as correct or incorrect.",
                    "sid": 106,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TLC uses a Bayesian approach to find the sense Si that is the most probable given the cues Cj contained in a context window of ±k positions around the polysemous target word.",
                    "sid": 107,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each si, the probability is computed with Bayes' rule: As Golding (1995) points out, the term p(c_kf ..",
                    "sid": 108,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": ".,Ck I si) is difficult to estimate because of the sparse data problem, but if we assume, as is often done, that the occurrence of each cue is independent of the others, then this term can be replaced with: p(c-b·· .,ck I si) =IT p(cj I Si) j=-k In TLC, we have made this assumption and have estimated p(cj I si) from the training.",
                    "sid": 109,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of course, the sparse data problem affects these probabilities too, and so TLC uses the Good-Turing formula (Good 1953; Chiang, Lin, and Su 1995), to smooth the values of p(cj I si), including providing probabilities for cues that did not occur in the training.",
                    "sid": 110,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TLC actually uses the mean of the Good-Turing value and the training-derived value for p(cj I si)· When cues do not appear in training, it uses the mean of the Good­ Turing value and the global probability of the cue p(cj), obtained from a large text corpus.",
                    "sid": 111,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach to smoothing has yielded consistently better performance than relying on the Good-Turing values alone.",
                    "sid": 112,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TLC uses: (1) topical cues consisting of open-class words found in a wide window that includes the sentence in which the target is located plus the preceding sentence; (2) local open-class words found in a narrow window around the target; (3) local closed-class items; (4) local part-of-speech tags.",
                    "sid": 113,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The procedures for estimating p(cj I si) and p(cj) differ somewhat for the various types of cue.",
                    "sid": 114,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 115,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The counts for open-class words (nouns, verbs, adjectives, and adverbs) from.",
                    "sid": 116,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "which the topical cue probabilities p(cj I si) and p(cj) are calculated are not sensitive to position within the wide window (the \"bag-of-words\" method).",
                    "sid": 117,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By contrast, the local cue probabilities do take into account position relative to the target.",
                    "sid": 118,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 119,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For open-class words found in the three positions to the left of the target (i.e.,.",
                    "sid": 120,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "j = -3, -2, -1), p( Cj I si) is the probability that word Cj appears in any of these positions.",
                    "sid": 121,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This permits TLC to generalize over variations in the placement of premodifiers, for example.",
                    "sid": 122,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a similar manner, there is generalization over the three positions to the right of the target.",
                    "sid": 123,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The local window does not extend beyond a sentence boundary.",
                    "sid": 124,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A window size of ±3 was chosen on empirical grounds; a preliminary study using parts of the Brown corpus that had been manually tagged with senses in WordNet (Landes, Leacock, and Tengi 1998) and a version of TLC that looked only at local open-class words performed best with this width when tested on a large number of nouns, verbs, and adjectives.",
                    "sid": 125,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 126,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Local closed-class items include those elements not assigned a noun, verb, adjec­.",
                    "sid": 127,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tive, or adverb tag.",
                    "sid": 128,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among these are determiners, prepositions, pronouns, and punc tuation.",
                    "sid": 129,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this cue type, p(cj I si) is the probability that item Cj appears precisely at location j for sense si.",
                    "sid": 130,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Positions j = -2, -1, 1, 2 are used.",
                    "sid": 131,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The global probabilities, for example p(the_1 ), are based on counts of closed-class items found at these positions relative to the nouns in a large text corpus.",
                    "sid": 132,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The local window width of ±2 was selected after pilot testing on the semantically tagged Brown corpus.",
                    "sid": 133,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in (2) above, the local window does not extend beyond a sentence boundary.",
                    "sid": 134,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 135,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Part-of-speech tags in the positions j = -2, -1, 0, 1, 2 are also used as cues.",
                    "sid": 136,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probabilities for these tags are computed for specific positions (e.g., p(DT1 I si), p(DT _ 1)) in a manner similar to that described in (3) above.",
                    "sid": 137,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When TLC is configured to use only topical information, cue type (1) is employed.",
                    "sid": 138,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When it is configured for local information, cue types (2), (3), and (4) are used.",
                    "sid": 139,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, in combined mode, the set of cues contains all four types.",
                    "sid": 140,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Results.",
                    "sid": 141,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figures 1 to 3 show the accuracy of the classifier as a function of the size of the training set when using local context, topical context, and a combination of the two, averaged across three runs for each training set.",
                    "sid": 142,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To the extent that the words used are representative, some clear differences appear as a function of syntactic category.",
                    "sid": 143,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the verb serve, local context was more reliable than topical context at all levels of training (78% versus 68% with 200 training examples for the least frequent sense).",
                    "sid": 144,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The combination of local and topical context showed improvement (83%) over either form alone (see Figure 1).",
                    "sid": 145,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the adjective hard, local context was much more reliable as an indicator of sense than topical context for all training sizes (83% versus 60% with 200 training examples) and the combined classifier's performance (at 83%) was the same as for local (see Figure 2).",
                    "sid": 146,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of the noun line, topical was slightly better than local at all set sizes, but with 200 training examples, their combination yielded 84% accuracy, greater than either topical (78%) or local (67%) alone (see Figure 3).",
                    "sid": 147,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To summarize, local context was more reliable than topical context as an indicator of sense for this verb and this adjective, but slightly less reliable for this noun.",
                    "sid": 148,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The combination of local and topical context showed improved or equal performance for all three words.",
                    "sid": 149,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance for all of the classifiers improved with increased training size.",
                    "sid": 150,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All classifiers performed best with at least 200 training examples per sense, but the learning curve tended to level off beyond a minimum 100 training examples.",
                    "sid": 151,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results are consistent with those of Yarowsky (1993), based on his exper­ iments with pseudowords, homophones, and homonyms (discussed below).",
                    "sid": 152,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He ob­ served that performance for verbs and adjectives dropped sharply as the window increased, while distant context remained useful for nouns.",
                    "sid": 153,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus one is tempted to conclude that nouns depend more on topic than do verbs and adjectives.",
                    "sid": 154,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But such a conclusion is probably an overgeneralization, inasmuch as some noun senses are clearly nontopical.",
                    "sid": 155,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, Leacock, Towell, and Voorhees (1993) found that some senses of the noun line are not susceptible to disambiguation with topical context.",
                    "sid": 156,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For exam­ ple, the 'textual' sense of line can appear with any topic, whereas the 'product' sense of line cannot.",
                    "sid": 157,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When it happens that a nontopical sense accounts for a large proportion of occurrences (in our study, all senses of hard are nontopical), then adding topical context to local will have little benefit and may even reduce accuracy.",
                    "sid": 158,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One should not conclude from these results that the topical classifiers and TLC are inferior to the classifiers reviewed in Section 2.",
                    "sid": 159,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, monosemous collocations in WordNet that contain the target word were systematically removed from the training and testing materials.",
                    "sid": 160,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This was done on the assumption that these words are not ambiguous.",
                    "sid": 161,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Removing them undoubtedly made the task more difficult than it would normally be.",
                    "sid": 162,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How much more difficult?",
                    "sid": 163,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An estimate is possible.",
                    "sid": 164,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We 0 ....",
                    "sid": 165,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0.,.... en 0 CX ) 0,......",
                    "sid": 166,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "- - <> - - - --¢ - - topica lo- o- local • • combined -8 0<>----- - -­ c: (!)",
                    "sid": 167,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "u.... a..",
                    "sid": 168,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "<0 0 1.0 0 \"'f\" 0 (\"') ( ) / , <I 0 C\\1 25 50 100 200 tr a i n i n g s i z e o f l e a s t fr e q u e n t s e n s e Figure 1 Classifier performance on four senses of the verb serve.",
                    "sid": 169,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Percentage accounted for by most frequent sense = 41%.",
                    "sid": 170,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "searched through 7,000 sentences containing line and found 1,470 sentences contained line as the head of a monosemous collocation in WordNet, i.e., line could be correctly disambiguated in some 21% of those 7,000 sentences simply on the basis of the Word­ Net entries in which it occurred.",
                    "sid": 171,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, if these sentences had been included in the experiment-and had been identified by automatic lookup-overall accuracy would have increased from 83% to 87%.",
                    "sid": 172,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using topical context alone, TLC performs no worse than other topical classifiers.",
                    "sid": 173,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Leacock, Towell, and Voorhees (1993) report that the three topical classifiers tested averaged 74% accuracy on six senses of the noun line.",
                    "sid": 174,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With these same training and testing data, TLC performed at 73% accuracy.",
                    "sid": 175,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, when the content vector and neural network classifiers were run on manually tagged training and testing examples of the verb serve, they averaged 74% accuracy-as did TLC using only topical context.",
                    "sid": 176,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When local context is combined with topical, TLC is superior to the topical classifiers compared in the Leacock, Towell, and Voorhees (1993) study.",
                    "sid": 177,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4 Improving the Precision of Sense Identification.",
                    "sid": 178,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Just how useful is a sense classifier whose accuracy is 85% or less?",
                    "sid": 179,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Probably not very useful if it is part of a fully automated NLP application, but its performance might be adequate in an interactive application (e.g., machine-assisted translation, online thesaurus functions in word processing, interactive information retrieval).",
                    "sid": 180,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, when recall does not have to be 100% (as when a human is in the loop) the precision of the classifier can be improved considerably.",
                    "sid": 181,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classifier described above always selects the sense that has the highest probability.",
                    "sid": 182,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have observed that when 0 0 0m 0 <X> t> 0,......",
                    "sid": 183,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 u c co Q)---------------------------------------- --,-0-- o - topic alo- o- local • • combined _ p o ­ / a / a..",
                    "sid": 184,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 LO 0 \"\"\" 0 C') o / / /-o-- 0 C\\J 25 50 100 200 t r a i n i n g s i z e o f l e a s t f r e q u e n t s e n s e Figure 2 Classifier performance on three senses of the adjective hard.",
                    "sid": 185,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Percentage accounted for by most frequent sense = 8Q'X,.",
                    "sid": 186,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the difference between the probability of this sense and that of the second highest is relatively small, the classifier's choice is often incorrect.",
                    "sid": 187,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One way to improve the precision of the classifier, though at the price of reduced recall, is to identify these situations and allow it to respond do not know rather than forcing a decision.",
                    "sid": 188,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What is needed is a measure of the difference in the probabilities of the two senses.",
                    "sid": 189,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following the approach of Dagan and Itai (1994), we use the log of the ratio of the probabilities ln(p1 jp 2 ) for this purpose.",
                    "sid": 190,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on this value, a threshold 8 can be set to control when the classifier selects the most probable sense.",
                    "sid": 191,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if 8 = 2, then ln(pJ/pz) must be 2 or greater for a decision to be made.",
                    "sid": 192,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dagan and Itai (1994) also describe a way to make the threshold dynamic so that it adjusts for the amount of evidence used to estimate P1 and p2 . The basic idea is to create a one-tailed confidence interval so that we can state with probability 1 -a that the true value of the difference measure is greater than 8.",
                    "sid": 193,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When the amount of evidence is small, the value of the measure must be larger in order to insure that 8 is indeed exceeded.",
                    "sid": 194,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows precision and recall values for serve, hard, and line at eight different settings of 8 using a 60% confidence interval.",
                    "sid": 195,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TLC was first trained on 100 examples of each sense, and it was then tested on separate 100-example sets.",
                    "sid": 196,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all cases, precision was positively correlated with the square root of 8 (all r values > .97), and recall was negatively correlated with the square root of 8 (r values < -.96).",
                    "sid": 197,
                    "ssid": 169,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As cross-validation, the equations of the lines that fit the precision and recall results on the test sample were used to predict the precision and recall at the various values of 8 on a second test sample.",
                    "sid": 198,
                    "ssid": 170,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They provided a good fit to the new data, accounting for an average of 93% of the variance.",
                    "sid": 199,
                    "ssid": 171,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The standard errors of estimate for hard, serve, and line were .028, 0 --<>-----¢ - - topical 0m --o---o-· local • • co u 0 combined------------------- <> .... f'-..",
                    "sid": 200,
                    "ssid": 172,
                    "kind_of_tag": "s"
                },
                {
                    "text": "-8 0 _.o---- --­ c: <0 Q) a..IJ r---- LO I 0 \"<t I I C\") d 0 C\\J 25 50 100 200 training size of least frequent sense Figure 3 Classifier performance on six senses of the noun line.",
                    "sid": 201,
                    "ssid": 173,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Percentage accounted for by most frequent sense= 54%.",
                    "sid": 202,
                    "ssid": 174,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 Recall and precision at various levels of the threshold for one test sample, following training with 200 examples of each sense.",
                    "sid": 203,
                    "ssid": 175,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ThresholdValue serve hard line for ln(pJ/p2) Recall(%) Precision (%j Recall (07o) Precision (07o j Recall (o/o) Precision (07o j 0 100 78 100 77 100 76 .25 99 78 97 78 97 78 .5 97 79 95 79 92 80 1 94 80 90 80 88 82 2 88 82 79 82 77 86 4 72 89 62 88 61 91 8 45 94 39 98 38 97 16 14 98 18 100 14 100 Most Frequent Sense 41 80 54 .030, and .029 for precision, and .053, .068, and .041 for recall.",
                    "sid": 204,
                    "ssid": 176,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This demonstrates that it is possible to produce accurate predictions of precision and recall as a function of e for new test sets.",
                    "sid": 205,
                    "ssid": 177,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When the threshold is set to a large value, precision approaches 100%.",
                    "sid": 206,
                    "ssid": 178,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The criterion thus provides a way to locate those cases that can be identified automatically with very high accuracy.",
                    "sid": 207,
                    "ssid": 179,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When TLC uses a high criterion for assigning senses, it can be used to augment the training examples by automatically collecting new examples from the test corpus.",
                    "sid": 208,
                    "ssid": 180,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In summary, the results obtained with TLC support the following preliminary conclusions: (a) improvement with training levels off after about 100 training examples for the least frequent sense; (b) the high predictive power of local context for the verb and adjective indicate that the local parameters effectively capture syntactically mediated relations, e.g., the subject and object or complement of verbs, or the noun that an adjective modifies; (c) nouns may be more \"topical\" than verbs and adjectives, and therefore benefit more from the combination of topical and local context; (d) the precision of TLC can be considerably improved at the price of recall, a trade-off that may be desirable in some interactive NLP applications.",
                    "sid": 209,
                    "ssid": 181,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A final observation we can make is that when topical and local information is combined, what we have called \"nontopical senses\" can reduce overall accuracy.",
                    "sid": 210,
                    "ssid": 182,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the 'textual' sense of line is relatively topic-independent.",
                    "sid": 211,
                    "ssid": 183,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of the line experiment were not affected too adversely because the nontopical sense of line accounted for only 10% of the training examples.",
                    "sid": 212,
                    "ssid": 184,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The effects of nontopical senses will be more serious when most senses are nontopical, as in the case of many adjectives and verbs.",
                    "sid": 213,
                    "ssid": 185,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The generality of these conclusions must, of course, be tested with additional words, which brings us to the problem of obtaining training and testing corpora.",
                    "sid": 214,
                    "ssid": 186,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On one hand, it is surprising that a purely statistical classifier can \"learn\" how to identify a sense of a polysemous word with as few as 100 example contexts.",
                    "sid": 215,
                    "ssid": 187,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, anyone who has manually built such sets knows that even collecting 100 examples of each sense is a long and tedious process.",
                    "sid": 216,
                    "ssid": 188,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The next section presents one way in which the lexical knowledge in WordNet can be used to extract training examples automatically.",
                    "sid": 217,
                    "ssid": 189,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "unsupervised training. ",
            "number": "3",
            "sents": [
                {
                    "text": "Corpus-based word sense identifiers are data hungry-it takes them mere seconds to digest all of the information contained in training materials that take months to prepare manually.",
                    "sid": 218,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, although statistical classifiers are undeniably effective, they are not fea­ sible until we can obtain reliable unsupervised training data.",
                    "sid": 219,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the Gale, Church, and Yarowsky (1992a) study, training and testing materials were automatically acquired using an aligned French-English bilingual corpus by searching for English words that have two different French translations.",
                    "sid": 220,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, English tokens of sentence were translated as either peine or phrase.",
                    "sid": 221,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They collected contexts of sentence translated as peine to build a corpus for the judicial sense, and collected contexts of sentence translated as phrase to build a corpus for the grammatical sense.",
                    "sid": 222,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One problem with relying on bilin­ gual corpora for data collection is that bilingual corpora are rare, and aligned bilingual corpora are even rarer.",
                    "sid": 223,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another is that since French and English are so closely related, different senses of polysemous English words often translate to the same French word.",
                    "sid": 224,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, line is equally polysemous in French and English-and most senses of line translate into French as ligne.",
                    "sid": 225,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several artificial techniques have been used so that classifiers can be developed and tested without having to invest in manually tagging the data: Yarowsky (1993) and Schi.itze (1995) have acquired training and testing materials by creating pseudo­ words from existing nonhomographic forms.",
                    "sid": 226,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, a pseudoword was created by combining abused/escorted.",
                    "sid": 227,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples containing the string escorted were collected to train on one sense of the pseudoword and examples containing the string abused were collected to train on the other sense.",
                    "sid": 228,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, Yarowsky (1993) used homophones (e.g., cellar/seller) and Yarowsky (1994) created homographs by stripping accents from French and Spanish words.",
                    "sid": 229,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although these latter techniques are useful in their own right (e.g., spoken language systems or corrupted transmissions), the resulting materi­ als do not generalize to the acquisition of tagged training for real polysemous or even homographic words.",
                    "sid": 230,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of disambiguation strategies reported for pseudo­ words and the like are consistently above 95% overall accuracy, far higher than those reported for disambiguating three or more senses of polysemous words (Wilks et al. 1993; Leacock, Towell, and Voorhees 1993).",
                    "sid": 231,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yarowsky (1992) used a thesaurus to collect training materials.",
                    "sid": 232,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He tested the un­ supervised training materials on 12 nouns with almost perfect results on homonyms (9599%), 72% accuracy for four senses of interest, and 77% on three senses of cone.",
                    "sid": 233,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training was collected in the following manner.",
                    "sid": 234,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Take a Roget's category-his examples were TOOL and ANIMAL-and collect sentences from a corpus (in this case, GraZier's Encyclopedia) using the words in each category.",
                    "sid": 235,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the noun crane, which appears in both the Roget's categories TOOL and ANIMAL.",
                    "sid": 236,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To represent the TOOL category, Yarowsky extracted contexts from GraZier's Encyclopedia.",
                    "sid": 237,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, contexts with the words adz, shovel, crane, sickle, and so on.",
                    "sid": 238,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly he collected sentences with names of animals from the ANIMAL category.",
                    "sid": 239,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In these samples, crane and drill appeared under both categories.",
                    "sid": 240,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yarowsky points out that the resulting noise will be a prob­ lem only when one of the spurious senses is salient, dominating the training set, and he uses frequency-based weights to minimize these effects.",
                    "sid": 241,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose to minimize spurious training by using monosemous words and collocations-on the assumption that, if a word has only one sense in WordNet, it is monosemous.",
                    "sid": 242,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Schtitze (1995) developed a statistical topical approach to word sense identification that provides its own automatically extracted training examples.",
                    "sid": 243,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each occurrence t of a polysemous word in a corpus, a context vector is constructed by summing all the vectors that represent the co-occurrence patterns of the open-class words in t's context (i.e., topical information is expressed as a kind of second-order co-occurrence).",
                    "sid": 244,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These context vectors are clustered, and the centroid of each cluster is used to repre­ sent a \"sense.\"",
                    "sid": 245,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When given a new occurrence of the word, a vector of the words in its context is constructed, and this vector is compared to the sense representations to find the closest match.",
                    "sid": 246,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Schtitze has used the method to disambiguate pseudowords, homographs, and polysemous words.",
                    "sid": 247,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance varies depending, in part, on the number of clusters that are created to represent senses, and on the degree to which the distinctions correspond to different topics.",
                    "sid": 248,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach performs very well, es­ pecially with pseudowords and homographs.",
                    "sid": 249,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, there is no automatic means to map the sense representations derived from the system onto the more conventional word senses found in dictionaries.",
                    "sid": 250,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, it does not provide disambiguated examples that can be used by other systems.",
                    "sid": 251,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yarowsky (1995) has proposed automatically augmenting a small set of experi­ menter-supplied seed collocations (e.g., manufacturing plant and plant life for two dif­ ferent senses of the noun plant) into a much larger set of training materials.",
                    "sid": 252,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He resolved the problem of the sparseness of his collocations by iteratively bootstrapping acquisi­ tion of training materials from a few seed collocations for each sense of a homograph.",
                    "sid": 253,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He locates examples containing the seeds in the corpus and analyzes these to find new predictive patterns in these sentences and retrieves examples containing these patterns.",
                    "sid": 254,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He repeats this step iteratively.",
                    "sid": 255,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results for the 12 pairs of homographs re­ ported are almost perfect.",
                    "sid": 256,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In his paper, Yarowsky suggests WordNet as a source for the seed collocations-a suggestion that we pursue in the next section.",
                    "sid": 257,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WordNet is particularly well suited to the task of locating sense-relevant context because each word sense is represented as a node in a rich semantic lexical network with synonymy, hyponymy, and meronymy links to other words, some of them poly­ semous and others monosemous.",
                    "sid": 258,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These lexical \"relatives\" provide a key to finding relevant training sentences in a corpus.",
                    "sid": 259,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the noun suit is polysemous, but one sense of it has business suit as a monosemous daughter and another has legal proceeding as a hypernym.",
                    "sid": 260,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By collecting sentences containing the unambiguous nouns business suit and legal proceeding we can build two corpora of contexts for the respective senses of the polysemous word.",
                    "sid": 261,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the systems described in Section 2.1 could benefit from the additional training materials that monosemous relatives can provide.",
                    "sid": 262,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 WordNet: A Lexical Database for English.",
                    "sid": 263,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The WordNet online lexical database (Miller 1990, 1995) has been developed at Prince­ ton University over the past 10 years.4 Like a standard dictionary, WordNet contains the definitions of words.",
                    "sid": 264,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It differs from a standard dictionary in that, instead of be­ ing organized alphabetically, WordNet is organized conceptually.",
                    "sid": 265,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic unit in WordNet is a synonym set, or synset, which represents a lexicalized concept.",
                    "sid": 266,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For ex­ ample, WordNet Version 1.5 distinguishes between two senses of the noun shot with the synsets {shot, snapshot} and {shot, injection}.",
                    "sid": 267,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the context, \"The photographer took a shot of Mary,\" the word snapshot can be substituted for one sense of shot.",
                    "sid": 268,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the context, \"The nurse gave Mary a flu shot,\" the word injection can be substituted for another sense of shot.",
                    "sid": 269,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nouns, verbs, adjectives, and adverbs are each organized differently in WordNet.",
                    "sid": 270,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All are organized in synsets, but the semantic relations among the synsets differ de­ pending on the grammatical category, as can be seen in Table 3.",
                    "sid": 271,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nouns are organized in a hierarchical tree structure based on hypernymy /hypo­ nymy.",
                    "sid": 272,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hyponym of a noun is its subordinate, and the relation between a hyponym and its hypernym is an is a kind of relation.",
                    "sid": 273,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, maple is a hyponym of tree, which is to say that a maple is a kind of tree.",
                    "sid": 274,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hypernymy (supername) and its inverse, hyponymy (subname), are transitive semantic relations between synsets.",
                    "sid": 275,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Meronymy (part-name), and its inverse holonymy (whole-name), are complex semantic relations that distinguish component parts, substantive parts, and member parts.",
                    "sid": 276,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbal hierarchy is based on troponymy, the is a manner of relation.",
                    "sid": 277,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For exam­ ple, stroll is a troponym of walk, which is to say that strolling is a manner of walking.",
                    "sid": 278,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Entailment relations between verbs are also coded in WordNet.",
                    "sid": 279,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The organization of attributive adjectives is based on the antonymy relation.",
                    "sid": 280,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Where direct antonyms exist, adjective synsets point to antonym synsets.",
                    "sid": 281,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A head adjective is one that has a direct antonym (e.g., hot versus cold or long versus short).",
                    "sid": 282,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many adjec­ tives, like sultry, have no direct antonyms.",
                    "sid": 283,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When an adjective has no direct antonym, its synset points to a head that is semantically similar to it.",
                    "sid": 284,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus sultry and torrid are similar in meaning to hot, which has the direct antonym of cold.",
                    "sid": 285,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, although sultry has no direct antonym, it has cold as its indirect antonym.",
                    "sid": 286,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Relational adjectives do not have antonyms; instead they point to nouns.",
                    "sid": 287,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the difference between a nervous disorder and a nervous student.",
                    "sid": 288,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the former, nervous pertains to a noun, as in nervous system, whereas the latter is defined by its relation to other adjectives-its synonyms (e.g., edgy) and antonyms (e.g., relaxed).",
                    "sid": 289,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adverbs have synonymy and antonymy relations.",
                    "sid": 290,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When the adverb is morpho­ logically related to an adjective (when an -ly suffix is added to an adjective) and semantically related to the adjective as well, the adverb points to the adjective.",
                    "sid": 291,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have had some success in exploiting WordNet's semantic relations for word sense identification.",
                    "sid": 292,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the main problem with classifiers that use local context is",
                    "sid": 293,
                    "ssid": 76,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "available by anonymous ftp from clarity.princeton.edu cd pub/wordnet or. ",
            "number": "4",
            "sents": [
                {
                    "text": "http:/ /www.cogsci.princeton.edu/ wn/ Table 3 Semantic relations in WordNet.",
                    "sid": 294,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Se man tic Rel atio n S y n t a c t i c C a t e g o r y E x a m p l e s Syn ony my (si mil ar) N o u n V e r b A d j A d v p i p e , t u b e r i s e , a s c e n d s a d , u n h a p p y r a p i d l y , s p e e d i l y Ant ony my A d j w e t , d r y (op posi te) A d v r a p i d l y , s l o w l y N o u n V e r b t o p , b o t t o m r i s e , f a l l Hy pon ym y N o u n s u g a r m a p l e , m a p l e (su bor din ate) m a p l e , t r e e t r e e , p l a n t Mer ony my N o u n b r i m , h a t (par t) g i n , m a r t i n i s h i p , f l e e t Tro pon ym y V e r b m a r c h , w a l k (ma nne r) w h i s p e r , s p e a k Ent ail me nt V e r b d r i v e , r i d e d i v o r c e , m a r r y Der ivat ion A d j m a g n e t i c , m a g n e t i s m A d v s i m p l y , s i m p l e the sparseness of the training data, Leacock and Chodorow (1998) used a proximity measure on the hypernym relation to replace the subject and complement of the verb serve in the testing examples with the subject and complement from training examples that were \"closest\" to them in the noun hierarchy.",
                    "sid": 295,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, one of the test sen­ tences was \"Sauerbraten is usually served with dumplings,\" where neither sauerbraten nor dumpling appeared in any training sentence.",
                    "sid": 296,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The similarity measures on WordNet found that sauerbraten was most similar to dinner in the training, and dumpling to bacon.",
                    "sid": 297,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These nouns were substituted for the novel ones in the test sets.",
                    "sid": 298,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the sentence \"Dinner is usually served with bacon\" was substituted for the original sentence.",
                    "sid": 299,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Aug­ mentation of the local context classifier with WordNet similarity measures showed a small but consistent improvement in the classifier's performance.",
                    "sid": 300,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The improvement was greater with the smaller training sets.",
                    "sid": 301,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Resnik (1992) uses an information-based measure, the most informative class, on the WordNet taxonomy.",
                    "sid": 302,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A class consists of the synonyms found at a node and the synonyms at all the nodes that it dominates (all of its hyponyms).",
                    "sid": 303,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on verb/ object pairs collected from a corpus, Resnik found, for example, that the objects for the verb open fall into two classes: receptacle and oral communication.",
                    "sid": 304,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conversely, the class of a verb's object could be used to determine the appropriate sense of that verb.",
                    "sid": 305,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments in the next section depend on a subset of the WordNet lexical relations, those involving monosemous relatives, so we were interested in determining just what proportion of word senses have such relatives.",
                    "sid": 306,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We examined 8,500 polyse­ mous nouns that appeared in a moderate-size, 25-million-word corpus.",
                    "sid": 307,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all, these8,500 nouns have more than 24,000 WordNet senses.",
                    "sid": 308,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Restricting the relations to syn Table 4 Training materials and their frequencies for five senses of line.",
                    "sid": 309,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "product formation text cord phone pro duc t line 95 picket line 46 headline 52 rope 28 ho t lin e 48 busi nes s line 5 line of p u n c h l i n e 23 ropes 27 ph on e lin e 48 s u c c e s s i o n 10 opening line 10 clothesline 12 pr iv at e lin e 2 b r e a d l i n e 7 tag line 7 fishing line 11 tol l lin e 2 si ng le fil e 7 line of poetry 4 shoelaces 4 c o n g a l i n e 7 newspaper t w i n e 3 r e c e p t i o n l i n e 3 headline 2 dental floss 2 t i c k e t l i n e 3 gag line 2 high wire 2 c h o w l i n e 2 j u m p r o p e 2 r i v e t l i n e 1 l a s s o 2 s i n g l e f i l e s 1 l e a d l i n e 1 t r a p l i n e 1 m o o r i n g l i n e 1 onyms, immediate hyponyms (i.e., daughters), and immediate hypernyms (parents), we found that about 64% (15,400) have monosemous relatives attested in the cor­ pus.",
                    "sid": 310,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With larger corpora (e.g., with text obtained by Web crawling) and more lexical relations (e.g., meronymy), this percentage can be expected to increase.",
                    "sid": 311,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Training on WordNet's Monosemous Relatives.",
                    "sid": 312,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach we have used is related to that of Yarowsky (1992) in that training ma­ terials are collected using a knowledge base, but it differs in other respects, notably in the selection of training and testing materials, the choice of a knowledge base, and use of both topical and local classifiers.",
                    "sid": 313,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yarowsky collects his training and testing ma­ terials from a specialized corpus, Grolier's Encyclopedia.",
                    "sid": 314,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It remains to be seen whether a statistical classifier trained on a topically organized corpus such as an encyclopedia will perform in the same way when tested on general unrestricted text, such as news­ papers, periodicals, and books.",
                    "sid": 315,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of our goals is to determine whether automatic extraction of training examples is feasible using general corpora.",
                    "sid": 316,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In his experiment, Yarowsky uses an updated online version of Roget's Thesaurus that is not generally available to the research community.",
                    "sid": 317,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The only generally available version of Roget's is the 1912 edition, which contains many lexical gaps.",
                    "sid": 318,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are using WordNet, which can be obtained via anonymous ftp.",
                    "sid": 319,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yarowsky's classifier is purely topical, but we also examine local context.",
                    "sid": 320,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we hope to avoid inclusion of spurious senses by using monosemous relatives.",
                    "sid": 321,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this experiment we collected monosemous relatives of senses of 14 nouns.",
                    "sid": 322,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Train­ ing sets are created in the following manner.",
                    "sid": 323,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A program called AutoTrain retrieves from WordNet all of the monosemous relatives of a polysemous word sense, sam­ ples and retrieves example sentences containing these monosemous relatives from a 30-million-word corpus of the San Jose Mercury News, and formats them for TLC.",
                    "sid": 324,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sampling process retrieves the \"closest\" relatives first.",
                    "sid": 325,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, suppose that the system is asked to retrieve 100 examples for each sense of the noun court.",
                    "sid": 326,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system first looks for the strongest or top-level relatives: for monosemous synonyms of the sense (e.g., tribunal) and for daughter collocations that contain the target word as the head (e.g., superior court) and tallies the number of examples in the corpus for each.",
                    "sid": 327,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the corpus has 100 or more examples for these top-level relatives, it retrieves a sam­ pling of them and formats them for TLC.",
                    "sid": 328,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If there are not enough top-level examples, Table 5 TLC's performance when training on (1) manually tagged data and (2) monosemous relatives of polysemous words.",
                    "sid": 329,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Targ et Wor d S e n s e a n d P r i o r s ( % ) M a n u a l l y T a g g e d T r a i n i n g M o n o s e m o u s R e l a t i v e T r a i n i n g bill 8 9 . 1 % 8 8 . 5 % l e g a l 85 9 7 9 8 i n v o i c e 15 5 6 3 5 dut y 9 4 . 3 % 9 3 . 5 % t a r i f f 56 9 5 9 7 o b l i g a t i o n 44 9 9 9 1 line 8 2 . 6 % 7 4 . 7 % p r o d u c t 67 9 7 8 6 p h o n e 10 6 7 5 1 c o r d 9 7 9 7 4 f o r m a t i o n 8 4 9 2 6 t e x t 6 6 7 5 2 rate 8 1 % 7 9 % m o n e t a r y 65 9 0 8 0 f r e q u e n c y 35 6 6 7 7 sho t 8 9 . 8 % 8 9 . 1 % s p o r t s 74 9 9 9 5 g u n s h o t 17 7 7 8 7 o p p o r t u n i t y 8 3 6 4 7 wor k 7 5 . 3 % 6 5 . 2 % a c t i v i t y 55 8 1 8 1 p r o d u c t 45 6 8 4 6 the remainder of the target's monosemous relatives are inspected in the order: all other daughters; hyponym collocations that contain the target; all other hyponyms; hyper­ nyms; and, finally, sisters.",
                    "sid": 330,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "AutoTrain takes as broad a sampling as possible across the corpus and never takes more than one example from an article.",
                    "sid": 331,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of ex­ amples for each relative is based on the relative proportion of its occurrences in the corpus.",
                    "sid": 332,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 shows the monosemous relatives that were used to train five senses of the noun line-the monosemous relatives of the sixth sense in the original study, line as an abstract division, are not attested in the SJM corpus.",
                    "sid": 333,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The purpose of the experiment was to see how well TLC performed using un­ supervised training and, when possible, to compare this with its performance when training on the manually tagged materials being produced at Princeton's Cognitive Sci­ ence Laboratory.5 When a sufficient number of examples for two or more senses were available, 100 examples of each sense were set aside to use in training.",
                    "sid": 334,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remainder were used for testing.",
                    "sid": 335,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only the topical and local open-class cues were used, since pre­ liminary tests showed that performance declined when using local closed-class and part-of-speech cues obtained from the monosemous relatives.",
                    "sid": 336,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not surprising, as many of the relatives are collocations whose local syntax is quite different from that 5 These materials are being produced under the direction of Shari Landes.",
                    "sid": 337,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Monosemous collocations that.",
                    "sid": 338,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "contain the target as the head have not been removed from the materials reported here-except for the noun line.",
                    "sid": 339,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6 TLC's performance when training on monosemous relatives of polysemous words.",
                    "sid": 340,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Manually tagged data were used for scoring but there were not enough examples to train on.)",
                    "sid": 341,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Target Sense and Monosemous Target Sense and Monosemous Word Priors (%) Relative Training Word Priors(%) Relative Training bank 92.8% security 67.4% institution 92 98 certificate 67 85 land form 8 35 precaution 37 63 company 86.9% stock 99.9% business 87 90 capital 95 100 troupe 7 67 broth 5 98 guests 6 70 court 97.5% strike 80.8% tribunal 96 99 work stoppage 78 98 sports 4 71 attack 23 21 party 87.8% trade 80.2% political 77 96 commerce 81 92 social 23 59 swap 19 31 of the polysemous word in its typical usage.",
                    "sid": 342,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the 'formation' sense of line is often followed by an of-phrase as in a line of children, but its relative, picket line, is not.",
                    "sid": 343,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prior probabilities for the sense were taken from the manually tagged materials.",
                    "sid": 344,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 shows the results when TLC was trained on monosemous relatives and on manually tagged training materials.",
                    "sid": 345,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Baseline performance is when the classifier always chooses the most frequent sense.",
                    "sid": 346,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Eight additional words had a sufficient number of manually tagged examples for testing but not for training TLC.",
                    "sid": 347,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are shown in Table 6.",
                    "sid": 348,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For four of the examples in Table 5, training with relatives produced results within 1% or 2% of manually tagged training.",
                    "sid": 349,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Line and work, however, showed a substantial decrease in performance.",
                    "sid": 350,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of line, this might be due to overly specific training contexts.",
                    "sid": 351,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Almost half of the training examples for the 'formation' sense of line come from one relative, picket line.",
                    "sid": 352,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, all of the monosemous relatives, except for rivet line and trap line, are human formations.",
                    "sid": 353,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This may have skewed training so that the classifier performs poorly on other uses of line as formation.",
                    "sid": 354,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to compare our results with those reported in Yarowsky (1992}, we trained and tested on the same two senses of the noun duty that Yarowsky had tested ('obliga­ tion' and 'tax').",
                    "sid": 355,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He reported that his thesaurus-based approach yielded 96% precision with 100% recall.",
                    "sid": 356,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TLC used training examples based on monosemous WordNet rela­ tives and correctly identified the senses with 93.5% precision at 100% recall.",
                    "sid": 357,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6 shows TLC's performance on the other eight words after training with monosemous relatives and testing on manually tagged examples.",
                    "sid": 358,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance is about the same as, or only slightly better than, the highest prior probability.",
                    "sid": 359,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In part, this is due to the rather high probability of the most frequent sense for this set.",
                    "sid": 360,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The values in the table are based on decisions made on all test examples.",
                    "sid": 361,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a threshold is set for TLC (see Section 2.4), precision of the classifier can be increased substantially, at the expense of recall.",
                    "sid": 362,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 7 shows recall levels when TLC is trained on monosemous relatives and the value of 8 is set for 95% precision.",
                    "sid": 363,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Operating in this mode, the classifier can gather new training materials, automatically, and with Table 7 Percentage of recall when the precision is 95%.",
                    "sid": 364,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Wor d Re call at 95 % Pre cis ion W ord Re call at 95 % Pre cisi on ban k 9 5 % rat e 3 6 % bill 7 3 % sec uri ty 3 5 % co mp any 7 2 % sh ot 7 7 % dut y 9 3 % str ike 3 7 % line 4 5 % tra de 4 2 % part y 7 8 % wo rk 2 % high precision.",
                    "sid": 365,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a particularly good way to find clear cases of the most frequent sense.",
                    "sid": 366,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results also show that not all words are well suited to this kind of operation.",
                    "sid": 367,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Little can be gained for a word like work, where the two senses, 'activity' and 'product,' are closely related and therefore difficult for the classifier to distinguish, due to a high degree of overlap in the training contexts.",
                    "sid": 368,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Problems of this sort can be detected even before testing, by computing correlations between the vectors of open-class words for the different senses.",
                    "sid": 369,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cosine correlation between the 'activity' and 'product' senses of work is r = .49, indicating a high degree of overlap.",
                    "sid": 370,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The mean correlation between pairs of senses for the other words in Table 7 is r = .31.",
                    "sid": 371,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 372,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conclusion.",
                    "sid": 373,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our evidence indicates that local context is superior to topical context as an indicator of word sense when using a statistical classifier.",
                    "sid": 374,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The benefits of adding topical to local context alone depend on syntactic category as well as on the characteristics of the individual word.",
                    "sid": 375,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The three words studied yielded three different patterns; a substantial benefit for the noun line, slightly less for the verb serve, and none for the adjective hard.",
                    "sid": 376,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some word senses are simply not limited to specific topics, and appear freely in many different domains of discourse.",
                    "sid": 377,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The existence of nontopical senses also limits the applicability of the \"one sense per discourse\" generalization of Gale, Church, and Yarowsky (1992b), who observed that, within a document, a repeated word is almost always used in the same sense.",
                    "sid": 378,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Future work should be directed toward developing methods for determining when a word has a nontopical sense.",
                    "sid": 379,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One approach to this problem is to look for a word that appears in many more topical domains than its total number of senses.",
                    "sid": 380,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because the supply of manually tagged training data will always be limited, we propose a method to obtain training data automatically using commonly available materials: exploiting WordNet's lexical relations to harvest training examples from LDC corpora or even the World Wide Web.",
                    "sid": 381,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found this method to be effective, although not as effective as using manually tagged training.",
                    "sid": 382,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have presented the components of a system for acquiring unsupervised training materials that can be used with any statistical classifier.",
                    "sid": 383,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The components can be fit together in the following manner.",
                    "sid": 384,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a polysemous word, locate the monosemous relatives for each of its senses in WordNet and extract examples containing these relatives from a large corpus.",
                    "sid": 385,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Senses whose contexts greatly overlap can be identified with a simple cosine correlation.",
                    "sid": 386,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Often, correlations are high between senses of a word that are systematically related, as we saw for the 'activity' and 'product' senses of work.",
                    "sid": 387,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In some cases, the contexts for the two closely related senses may be combined.",
                    "sid": 388,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the frequencies of the monosemous relatives do not correlate with the fre­ quencies of the senses, prior probabilities must be estimated for classifiers that use them.",
                    "sid": 389,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the experiments of Section 3.2, these were estimated from the testing mate­ rials.",
                    "sid": 390,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They can also be estimated from a small manually tagged sample, such as the parts of the Brown corpus that have been tagged with senses in WordNet.",
                    "sid": 391,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When the threshold is set to maximize precision, the results are highly reliable and can be used to support an interactive application, such as machine-assisted translation, with the goal of reducing the amount of interaction.",
                    "sid": 392,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although we have looked at only a few examples, it is clear that, given WordNet and a large enough corpus, the methods outlined for training on monosemous relatives can be generalized to build training materials for thousands of polysemous words.",
                    "sid": 393,
                    "ssid": 100,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "We are indebted to the other members of the WordNet group who have provided advice and technical support: Christiane Fellbaum, Shari Landes, and Randee Tengi.",
                    "sid": 394,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are also grateful to Paul Bagyenda, Ben JohnsonLaird and Joshua Schecter.",
                    "sid": 395,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thank Scott Wayland, Tim Allison and Jill Hollifield for tagging the serve and hard corpora.",
                    "sid": 396,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally we are grateful to the three anonymous CL reviewers for their comments and advice.",
                    "sid": 397,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This material is based upon work supported in part by the National ScienceFoundation under NSF Award No.",
                    "sid": 398,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "IRI95 28983 and by the Defense Advanced Research Projects Agency, Grant No.",
                    "sid": 399,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "N0001491-1634.",
                    "sid": 400,
                    "ssid": 107,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}