{
    "ID": "N04-1038",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Unsupervised Learning of Contextual Role Knowledge for Coreference Resolution",
                    "sid": 0,
                    "ssid": null,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present a coreference resolver called BABAR that uses contextual role knowledge to evaluate possible antecedents for an anaphor.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BABAR uses information extraction patterns to identify contextual roles and creates four contextual role knowledge sources using unsupervised learning.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These knowledge sources determine whether the contexts surrounding an anaphor and antecedent are compatible.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BABAR applies a DempsterShafer probabilistic model to make resolutions based on evidence from the contextual role knowledge sources as well as general knowledge sources.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experiments in two domains showed that the contextual role knowledge improved coreference performance, especially on pronouns.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The problem of coreference resolution has received considerable attention, including theoretical discourse models (e.g., (Grosz et al., 1995; Grosz and Sidner, 1998)), syntactic algorithms (e.g., (Hobbs, 1978; Lappin and Le- ass, 1994)), and supervised machine learning systems (Aone and Bennett, 1995; McCarthy and Lehnert, 1995; Ng and Cardie, 2002; Soon et al., 2001).",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most computational models for coreference resolution rely on properties of the anaphor and candidate antecedent, such as lexical matching, grammatical and syntactic features, semantic agreement, and positional information.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The focus of our work is on the use of contextual role knowledge for coreference resolution.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A contextual role represents the role that a noun phrase plays in an event or relationship.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work is motivated by the observation that contextual roles can be critically important in determining the referent of a noun phrase.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the following sentences: (a) Jose Maria Martinez, Roberto Lisandy, and Dino Rossy, who were staying at a Tecun Uman hotel, were kidnapped by armed men who took them to an unknown place.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(b) After they were released...",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(c) After they blindfolded the men...",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (b) “they” refers to the kidnapping victims, but in (c) “they” refers to the armed men.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The role that each noun phrase plays in the kidnapping event is key to distinguishing these cases.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The correct resolution in sentence (b) comes from knowledge that people who are kidnapped are often subsequently released.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The correct resolution in sentence (c) depends on knowledge that kidnappers frequently blindfold their victims.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have developed a coreference resolver called BABAR that uses contextual role knowledge to make coreference decisions.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BABAR employs information extraction techniques to represent and learn role relationships.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each pattern represents the role that a noun phrase plays in the surrounding context.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BABAR uses unsupervised learning to acquire this knowledge from plain text without the need for annotated training data.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training examples are generated automatically by identifying noun phrases that can be easily resolved with their antecedents using lexical and syntactic heuristics.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BABAR then computes statistics over the training examples measuring the frequency with which extraction patterns and noun phrases co-occur in coreference resolutions.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, Section 2 begins by explaining how contextual role knowledge is represented and learned.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 describes the complete coreference resolution model, which uses the contextual role knowledge as well as more traditional coreference features.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our coreference resolver also incorporates an existential noun phrase recognizer and a DempsterShafer probabilistic model to make resolution decisions.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 presents experimen tal results on two corpora: the MUC4 terrorism corpus, and Reuters texts about natural disasters.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our results show that BABAR achieves good performance in both domains, and that the contextual role knowledge improves performance, especially on pronouns.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, Section 5 explains how BABAR relates to previous work, and Section 6 summarizes our conclusions.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "learning contextual role knowledge. ",
            "number": "2",
            "sents": [
                {
                    "text": "In this section, we describe how contextual role knowledge is represented and learned.",
                    "sid": 30,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2.1 describes how BABAR generates training examples to use in the learning process.",
                    "sid": 31,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We refer to this process as Reliable Case Resolution because it involves finding cases of anaphora that can be easily resolved with their antecedents.",
                    "sid": 32,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2.2 then describes our representation for contextual roles and four types of contextual role knowledge that are learned from the training examples.",
                    "sid": 33,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Reliable Case Resolutions.",
                    "sid": 34,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first step in the learning process is to generate training examples consisting of anaphor/antecedent resolutions.",
                    "sid": 35,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BABAR uses two methods to identify anaphors that can be easily and reliably resolved with their antecedent: lexical seeding and syntactic seeding.",
                    "sid": 36,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.1 Lexical Seeding It is generally not safe to assume that multiple occurrences of a noun phrase refer to the same entity.",
                    "sid": 37,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the company may refer to Company X in one paragraph and Company Y in another.",
                    "sid": 38,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, lexically similar NPs usually refer to the same entity in two cases: proper names and existential noun phrases.",
                    "sid": 39,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BABAR uses a named entity recognizer to identify proper names that refer to people and companies.",
                    "sid": 40,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Proper names are assumed to be coreferent if they match exactly, or if they closely match based on a few heuristics.",
                    "sid": 41,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, a person’s full name will match with just their last name (e.g., “George Bush” and “Bush”), and a company name will match with and without a corporate suffix (e.g., “IBM Corp.” and “IBM”).",
                    "sid": 42,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Proper names that match are resolved with each other.",
                    "sid": 43,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second case involves existential noun phrases (Allen, 1995), which are noun phrases that uniquely specify an object or concept and therefore do not need a prior referent in the discourse.",
                    "sid": 44,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In previous work (Bean and Riloff, 1999), we developed an unsupervised learning algorithm that automatically recognizes definite NPs that are existential without syntactic modification because their meaning is universally understood.",
                    "sid": 45,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, a story can mention “the FBI”, “the White House”, or “the weather” without any prior referent in the story.",
                    "sid": 46,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although these existential NPs do not need a prior referent, they may occur multiple times in a document.",
                    "sid": 47,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By definition, each existential NP uniquely specifies an object or concept, so we can infer that all instances of the same existential NP are coreferent (e.g., “the FBI” always refers to the same entity).",
                    "sid": 48,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using this heuristic, BABAR identifies existential definite NPs in the training corpus using our previous learning algorithm (Bean and Riloff, 1999) and resolves all occurrences of the same existential NP with each another.1 2.1.2 Syntactic Seeding BABAR also uses syntactic heuristics to identify anaphors and antecedents that can be easily resolved.",
                    "sid": 49,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 briefly describes the seven syntactic heuristics used by BABAR to resolve noun phrases.",
                    "sid": 50,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Words and punctuation that appear in brackets are considered optional.",
                    "sid": 51,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The anaphor and antecedent appear in boldface.",
                    "sid": 52,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 53,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reflexive pronouns with only 1 NP in scope..",
                    "sid": 54,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ex: The regime gives itself the right...",
                    "sid": 55,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 56,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Relative pronouns with only 1 NP in scope..",
                    "sid": 57,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ex: The brigade, which attacked ...",
                    "sid": 58,
                    "ssid": 29,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "some cases of the pattern “np to-be np”.. ",
            "number": "3",
            "sents": [
                {
                    "text": "Ex: Mr. Cristiani is the president ...",
                    "sid": 59,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "some cases of “np said [that] it/they”. ",
            "number": "4",
            "sents": [
                {
                    "text": "Ex: The government said it ...",
                    "sid": 60,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "some cases of “[locative-prep] np [,] where”. ",
            "number": "5",
            "sents": [
                {
                    "text": "Ex: He was found in San Jose, where ...",
                    "sid": 61,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "simple appositives of the form “np, np”. ",
            "number": "6",
            "sents": [
                {
                    "text": "Ex: Mr. Cristiani, president of the country ...",
                    "sid": 62,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "pps containing “by” and a gerund followed by “it”. ",
            "number": "7",
            "sents": [
                {
                    "text": "Ex: Mr. Bush disclosed the policy by reading it...",
                    "sid": 63,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1: Syntactic Seeding Heuristics BABAR’s reliable case resolution heuristics produced a substantial set of anaphor/antecedent resolutions that will be the training data used to learn contextual role knowledge.",
                    "sid": 64,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For terrorism, BABAR generated 5,078 resolutions: 2,386 from lexical seeding and 2,692 from syntactic seeding.",
                    "sid": 65,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For natural disasters, BABAR generated 20,479 resolutions: 11,652 from lexical seeding and 8,827 from syntactic seeding.",
                    "sid": 66,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Contextual Role Knowledge.",
                    "sid": 67,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our representation of contextual roles is based on information extraction patterns that are converted into simple caseframes.",
                    "sid": 68,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we describe how the caseframes are represented and learned.",
                    "sid": 69,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, we describe four contextual role knowledge sources that are created from the training examples and the caseframes.",
                    "sid": 70,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2.1 The Caseframe Representation Information extraction (IE) systems use extraction patterns to identify noun phrases that play a specific role in 1 Our implementation only resolves NPs that occur in the same document, but in retrospect, one could probably resolve instances of the same existential NP in different documents too.",
                    "sid": 71,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "an event.",
                    "sid": 72,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For IE, the system must be able to distinguish between semantically similar noun phrases that play different roles in an event.",
                    "sid": 73,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, management succession systems must distinguish between a person who is fired and a person who is hired.",
                    "sid": 74,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Terrorism systems must distinguish between people who perpetrate a crime and people who are victims of a crime.",
                    "sid": 75,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We applied the AutoSlog system (Riloff, 1996) to our unannotated training texts to generate a set of extraction patterns for each domain.",
                    "sid": 76,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each extraction pattern represents a linguistic expression and a syntactic position indicating where a role filler can be found.",
                    "sid": 77,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, kidnapping victims should be extracted from the subject of the verb “kidnapped” when it occurs in the passive voice (the shorthand representation of this pattern would be “<subject> were kidnapped”).",
                    "sid": 78,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The types of patterns produced by AutoSlog are outlined in (Riloff, 1996).",
                    "sid": 79,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ideally we’d like to know the thematic role of each extracted noun phrase, but AutoSlog does not generate thematic roles.",
                    "sid": 80,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a (crude) approximation, we normalize the extraction patterns with respect to active and passive voice and label those extractions as agents or patients.",
                    "sid": 81,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the passive voice pattern “<subject> were kidnapped” and the active voice pattern “kidnapped <direct object>” are merged into a single normalized pattern “kidnapped <patient>”.2 For the sake of sim plicity, we will refer to these normalized extraction patterns as caseframes.3 These caseframes can capture two types of contextual role information: (1) thematic roles corresponding to events (e.g, “<agent> kidnapped” or “kidnapped <patient>”), and (2) predicate-argument relations associated with both verbs and nouns (e.g., “kidnapped for <np>” or “vehicle with <np>”).",
                    "sid": 82,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We generate these caseframes automatically by running AutoSlog over the training corpus exhaustively so that it literally generates a pattern to extract every noun phrase in the corpus.",
                    "sid": 83,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The learned patterns are then normalized and applied to the corpus.",
                    "sid": 84,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This process produces a large set of caseframes coupled with a list of the noun phrases that they extracted.",
                    "sid": 85,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The contextual role knowledge that BABAR uses for coreference resolution is derived from this caseframe data.",
                    "sid": 86,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2.2 The Caseframe Network The first type of contextual role knowledge that BABAR learns is the Caseframe Network (CFNet), which identifies caseframes that co-occur in anaphor/antecedent resolutions.",
                    "sid": 87,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our assumption is that caseframes that co-occur in resolutions often have a 2 This normalization is performed syntactically without semantics, so the agent and patient roles are not guaranteed to hold, but they usually do in practice.",
                    "sid": 88,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 These are not full case frames in the traditional sense, but they approximate a simple case frame with a single slot.",
                    "sid": 89,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "conceptual relationship in the discourse.",
                    "sid": 90,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, co-occurring caseframes may reflect synonymy (e.g., “<patient> kidnapped” and “<patient> abducted”) or related events (e.g., “<patient> kidnapped” and “<patient> released”).",
                    "sid": 91,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do not attempt to identify the types of relationships that are found.",
                    "sid": 92,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BABAR merely identifies caseframes that frequently co-occur in coreference resolutions.",
                    "sid": 93,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Te rro ris m Na tur al Dis ast ers mu rde r of < NP > kill ed <p atie nt > <a ge nt > da ma ged wa s inj ure d in < NP > <a ge nt > rep ort ed <a ge nt > add ed <a ge nt > occ urr ed cau se of < NP > <a ge nt > stat ed <a ge nt > add ed <a ge nt > wr eak ed <a ge nt > cro sse d per pet rat ed <p atie nt > con de mn ed <p atie nt > dri ver of < NP > <a ge nt > car ryi ng Figure 1: Caseframe Network Examples Figure 1 shows examples of caseframes that co-occur in resolutions, both in the terrorism and natural disaster domains.",
                    "sid": 94,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The terrorism examples reflect fairly obvious relationships: people who are murdered are killed; agents that “report” things also “add” and “state” things; crimes that are “perpetrated” are often later “condemned”.",
                    "sid": 95,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the natural disasters domain, agents are often forces of nature, such as hurricanes or wildfires.",
                    "sid": 96,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 reveals that an event that “damaged” objects may also cause injuries; a disaster that “occurred” may be investigated to find its “cause”; a disaster may “wreak” havoc as it “crosses” geographic regions; and vehicles that have a “driver” may also “carry” items.",
                    "sid": 97,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During coreference resolution, the caseframe network provides evidence that an anaphor and prior noun phrase might be coreferent.",
                    "sid": 98,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given an anaphor, BABAR identifies the caseframe that would extract it from its sentence.",
                    "sid": 99,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each candidate antecedent, BABAR identifies the caseframe that would extract the candidate, pairs it with the anaphor’s caseframe, and consults the CF Network to see if this pair of caseframes has co-occurred in previous resolutions.",
                    "sid": 100,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If so, the CF Network reports that the anaphor and candidate may be coreferent.",
                    "sid": 101,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2.3 Lexical Caseframe Expectations The second type of contextual role knowledge learned by BABAR is Lexical Caseframe Expectations, which are used by the CFLex knowledge source.",
                    "sid": 102,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each case- frame, BABAR collects the head nouns of noun phrases that were extracted by the caseframe in the training corpus.",
                    "sid": 103,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each resolution in the training data, BABAR also associates the co-referring expression of an NP with the NP’s caseframe.",
                    "sid": 104,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if X and Y are coreferent, then both X and Y are considered to co-occur with the caseframe that extracts X as well as the caseframe that extracts Y. We will refer to the set of nouns that co-occur with a caseframe as the lexical expectations of the case- frame.",
                    "sid": 105,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows examples of lexical expectations that were learned for both domains.",
                    "sid": 106,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "collected too.",
                    "sid": 107,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will refer to the semantic classes that co-occur with a caseframe as the semantic expectations of the caseframe.",
                    "sid": 108,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 shows examples of semantic expectations that were learned.",
                    "sid": 109,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, BABAR learned that agents that “assassinate” or “investigate a cause” are usually humans or groups (i.e., organizations).",
                    "sid": 110,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "T e r r o r i s m Ca sef ra me Semantic Classes <a ge nt > ass ass ina ted group, human inv esti gat ion int o < N P> event exp lod ed out sid e < N P> building N a t u r a l D i s a s t e r s Ca sef ra me Semantic Classes <a ge nt > inv esti gat ing cau se group, human sur viv or of < N P> event, natphenom hit wit h < N P> attribute, natphenom Figure 3: Semantic Caseframe Expectations Figure 2: Lexical Caseframe Expectations To illustrate how lexical expectations are used, suppose we want to determine whether noun phrase X is the antecedent for noun phrase Y. If they are coreferent, then X and Y should be substitutable for one another in the story.4 Consider these sentences: (S1) Fred was killed by a masked man with a revolver.",
                    "sid": 111,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(S2) The burglar fired the gun three times and fled.",
                    "sid": 112,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“The gun” will be extracted by the caseframe “fired <patient>”.",
                    "sid": 113,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its correct antecedent is “a revolver”, which is extracted by the caseframe “killed with <NP>”.",
                    "sid": 114,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If “gun” and “revolver” refer to the same object, then it should also be acceptable to say that Fred was “killed with a gun” and that the burglar “fireda revolver”.",
                    "sid": 115,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During coreference resolution, BABAR checks (1) whether the anaphor is among the lexical expectations for the caseframe that extracts the candidate antecedent, and (2) whether the candidate is among the lexical expectations for the caseframe that extracts the anaphor.",
                    "sid": 116,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If either case is true, then CFLex reports that the anaphor and candidate might be coreferent.",
                    "sid": 117,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2.4 Semantic Caseframe Expectations The third type of contextual role knowledge learned by BABAR is Semantic Caseframe Expectations.",
                    "sid": 118,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantic expectations are analogous to lexical expectations except that they represent semantic classes rather than nouns.",
                    "sid": 119,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each caseframe, BABAR collects the semantic classes associated with the head nouns of NPs that were extracted by the caseframe.",
                    "sid": 120,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As with lexical expections, the semantic classes of co-referring expressions are 4 They may not be perfectly substitutable, for example one NP may be more specific (e.g., “he” vs. “John F. Kennedy”).",
                    "sid": 121,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But in most cases they can be used interchangably.",
                    "sid": 122,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each domain, we created a semantic dictionary by doing two things.",
                    "sid": 123,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we parsed the training corpus, collected all the noun phrases, and looked up each head noun in WordNet (Miller, 1990).",
                    "sid": 124,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We tagged each noun with the top-level semantic classes assigned to it in Word- Net.",
                    "sid": 125,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, we identified the 100 most frequent nouns in the training corpus and manually labeled them with semantic tags.",
                    "sid": 126,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This step ensures that the most frequent terms for each domain are labeled (in case some of them are not in WordNet) and labeled with the sense most appropriate for the domain.",
                    "sid": 127,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initially, we planned to compare the semantic classes of an anaphor and a candidate and infer that they might be coreferent if their semantic classes intersected.",
                    "sid": 128,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, using the top-level semantic classes of WordNet proved to be problematic because the class distinctions are too coarse.",
                    "sid": 129,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, both a chair and a truck would be labeled as artifacts, but this does not at all suggest that they are coreferent.",
                    "sid": 130,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So we decided to use semantic class information only to rule out candidates.",
                    "sid": 131,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If two nouns have mutually exclusive semantic classes, then they cannot be coreferent.",
                    "sid": 132,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This solution also obviates the need to perform word sense disambiguation.",
                    "sid": 133,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each word is simply tagged with the semantic classes corresponding to all of its senses.",
                    "sid": 134,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If these sets do not overlap, then the words cannot be coreferent.",
                    "sid": 135,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The semantic caseframe expectations are used in two ways.",
                    "sid": 136,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One knowledge source, called WordSemCFSem, is analogous to CFLex: it checks whether the anaphor and candidate antecedent are substitutable for one another, but based on their semantic classes instead of the words themselves.",
                    "sid": 137,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given an anaphor and candidate, BABAR checks (1) whether the semantic classes of the anaphor intersect with the semantic expectations of the caseframe that extracts the candidate, and (2) whether the semantic classes of the candidate intersect with the semantic ex pectations of the caseframe that extracts the anaphor.",
                    "sid": 138,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If one of these checks fails then this knowledge source reports that the candidate is not a viable antecedent for the anaphor.",
                    "sid": 139,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A different knowledge source, called CFSemCFSem, compares the semantic expectations of the caseframe that extracts the anaphor with the semantic expectations of the caseframe that extracts the candidate.",
                    "sid": 140,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the semantic expectations do not intersect, then we know that the case- frames extract mutually exclusive types of noun phrases.",
                    "sid": 141,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, this knowledge source reports that the candidate is not a viable antecedent for the anaphor.",
                    "sid": 142,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Assigning Evidence Values.",
                    "sid": 143,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Contextual role knowledge provides evidence as to whether a candidate is a plausible antecedent for an anaphor.",
                    "sid": 144,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two knowledge sources that use semantic expectations, WordSemCFSem and CFSemCFSem, always return values of -1 or 0.",
                    "sid": 145,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "-1 means that an NP should be ruled out as a possible antecedent, and 0 means that the knowledge source remains neutral (i.e., it has no reason to believe that they cannot be coreferent).",
                    "sid": 146,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CFLex and CFNet knowledge sources provide positive evidence that a candidate NP and anaphor might be coreferent.",
                    "sid": 147,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They return a value in the range [0,1], where 0 indicates neutrality and 1 indicates the strongest belief that the candidate and anaphor are coreferent.",
                    "sid": 148,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BABAR uses the log-likelihood statistic (Dunning, 1993) to evaluate the strength of a co-occurrence relationship.",
                    "sid": 149,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each co-occurrence relation (noun/caseframe for CFLex, and caseframe/caseframe for CFNet), BABAR computes its log-likelihood value and looks it up in the χ2 table to obtain a confidence level.",
                    "sid": 150,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The confidence level is then used as the belief value for the knowledge source.",
                    "sid": 151,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if CFLex determines that the log- likelihood statistic for the co-occurrence of a particular noun and caseframe corresponds to the 90% confidence level, then CFLex returns .90 as its belief that the anaphor and candidate are coreferent.",
                    "sid": 152,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 The Coreference Resolution Model.",
                    "sid": 153,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a document to process, BABAR uses four modules to perform coreference resolution.",
                    "sid": 154,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, a non-anaphoric NP classifier identifies definite noun phrases that are existential, using both syntactic rules and our learned existential NP recognizer (Bean and Riloff, 1999), and removes them from the resolution process.",
                    "sid": 155,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, BABAR performs reliable case resolution to identify anaphora that can be easily resolved using the lexical and syntactic heuristics described in Section 2.1.",
                    "sid": 156,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Third, all remaining anaphora are evaluated by 11 different knowledge sources: the four contextual role knowledge sources just described and seven general knowledge sources.",
                    "sid": 157,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, a DempsterShafer probabilistic model evaluates the evidence provided by the knowledge sources for all candidate antecedents and makes the final resolution decision.",
                    "sid": 158,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we describe the seven general knowledge sources and explain how the DempsterShafer model makes resolutions.",
                    "sid": 159,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 General Knowledge Sources.",
                    "sid": 160,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 4 shows the seven general knowledge sources (KSs) that represent features commonly used for coreference resolution.",
                    "sid": 161,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The gender, number, and scoping KSs eliminate candidates from consideration.",
                    "sid": 162,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The scoping heuristics are based on the anaphor type: for reflexive pronouns the scope is the current clause, for relative pronouns it is the prior clause following its VP, for personal pronouns it is the anaphor’s sentence and two preceding sentences, and for definite NPs it is the anaphor’s sentence and eight preceding sentences.",
                    "sid": 163,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The semantic agreement KS eliminates some candidates, but also provides positive evidence in one case: if the candidate and anaphor both have semantic tags human, company, date, or location that were assigned via NER or the manually labeled dictionary entries.",
                    "sid": 164,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rationale for treating these semantic labels differently is that they are specific and reliable (as opposed to the WordNet classes, which are more coarse and more noisy due to polysemy).",
                    "sid": 165,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "KS Function Ge nde r filters candidate if gender doesn’t agree.",
                    "sid": 166,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nu mb er filters candidate if number doesn’t agree.",
                    "sid": 167,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sc opi ng filters candidate if outside the anaphor’s scope.",
                    "sid": 168,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Se ma nti c (a) filters candidate if its semantic tags d o n ’ t i n t e r s e c t w i t h t h o s e o f t h e a n a p h o r .",
                    "sid": 169,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "( b ) s u p p o r t s c a n d i d a t e i f s e l e c t e d s e m a n t i c t a g s m a t c h t h o s e o f t h e a n a p h o r . Le xic al computes degree of lexical overlap b e t w e e n t h e c a n d i d a t e a n d t h e a n a p h o r . Re cen cy computes the relative distance between the c a n d i d a t e a n d t h e a n a p h o r . Sy nR ole computes relative frequency with which the c a n d i d a t e ’ s s y n t a c t i c r o l e o c c u r s i n r e s o l u t i o n s . Figure 4: General Knowledge Sources The Lexical KS returns 1 if the candidate and anaphor are identical, 0.5 if their head nouns match, and 0 otherwise.",
                    "sid": 170,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Recency KS computes the distance between the candidate and the anaphor relative to its scope.",
                    "sid": 171,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The SynRole KS computes the relative frequency with which the candidates’ syntactic role (subject, direct object, PP object) appeared in resolutions in the training set.",
                    "sid": 172,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During development, we sensed that the Recency and Syn- role KSs did not deserve to be on equal footing with the other KSs because their knowledge was so general.",
                    "sid": 173,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, we cut their evidence values in half to lessen their influence.",
                    "sid": 174,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 The DempsterShafer Decision Model.",
                    "sid": 175,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BABAR uses a DempsterShafer decision model (Stefik, 1995) to combine the evidence provided by the knowledge sources.",
                    "sid": 176,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our motivation for using DempsterShafer is that it provides a well-principled framework for combining evidence from multiple sources with respect to competing hypotheses.",
                    "sid": 177,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our situation, the competing hypotheses are the possible antecedents for an anaphor.",
                    "sid": 178,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An important aspect of the DempsterShafer model is that it operates on sets of hypotheses.",
                    "sid": 179,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If evidence indicates that hypotheses C and D are less likely than hypotheses A and B, then probabilities are redistributed to reflect the fact that {A, B} is more likely to contain the answer than {C, D}.",
                    "sid": 180,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ability to redistribute belief values across sets rather than individual hypotheses is key.",
                    "sid": 181,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evidence may not say anything about whether A is more likely than B, only that C and D are not likely.",
                    "sid": 182,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each set is assigned two values: belief and plausibility.",
                    "sid": 183,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initially, the DempsterShafer model assumes that all hypotheses are equally likely, so it creates a set called θ that includes all hypotheses.",
                    "sid": 184,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "θ has a belief value of 1.0, indicating complete certainty that the correct hypothesis is included in the set, and a plausibility value of 1.0, indicating that there is no evidence for competing hypotheses.5 As evidence is collected and the likely hypotheses are whittled down, belief is redistributed to subsets of θ.",
                    "sid": 185,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Formally, the DempsterShafer theory defines a probability density function m(S), where S is a set of hypotheses.",
                    "sid": 186,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "m(S) represents the belief that the correct hypothesis is included in S. The model assumes that evidence also arrives as a probability density function (pdf) over sets of hypotheses.6 Integrating new evidence into the existing model is therefore simply a matter of defining a function to merge pdfs, one representing the current belief system and one representing the beliefs of the new evidence.",
                    "sid": 187,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The DempsterShafer rule for combining pdfs is: to {C}, meaning that it is 70% sure the correct hypothesis is C. The intersection of these sets is the null set because these beliefs are contradictory.",
                    "sid": 188,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The belief value that would have been assigned to the intersection of these sets is .60*.70=.42, but this belief has nowhere to go because the null set is not permissible in the model.7 So this probability mass (.42) has to be redistributed.",
                    "sid": 189,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DempsterShafer handles this by re-normalizing all the belief values with respect to only the non-null sets (this is the purpose of the denominator in Equation 1).",
                    "sid": 190,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our coreference resolver, we define θ to be the set of all candidate antecedents for an anaphor.",
                    "sid": 191,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each knowledge source then assigns a probability estimate to each candidate, which represents its belief that the candidate is the antecedent for the anaphor.",
                    "sid": 192,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probabilities are incorporated into the DempsterShafer model using Equation 1.",
                    "sid": 193,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To resolve the anaphor, we survey the final belief values assigned to each candidate’s singleton set.",
                    "sid": 194,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a candidate has a belief value ≥ .50, then we select that candidate as the antecedent for the anaphor.",
                    "sid": 195,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If no candidate satisfies this condition (which is often the case), then the anaphor is left unresolved.",
                    "sid": 196,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the strengths of the DempsterShafer model is its natural ability to recognize when several credible hypotheses are still in play.",
                    "sid": 197,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this situation, BABAR takes the conservative approach and declines to make a resolution.",
                    "sid": 198,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 Evaluation Results.",
                    "sid": 199,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Corpora.",
                    "sid": 200,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluated BABAR on two domains: terrorism and natural disasters.",
                    "sid": 201,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the MUC4 terrorism corpus (MUC4 Proceedings, 1992) and news articles from the Reuter’s text collection8 that had a subject code corresponding to natural disasters.",
                    "sid": 202,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each domain, we created a blind test set by manually annotating 40 doc uments with anaphoric chains, which represent sets of m3 (S) = ) X ∩Y =S 1 − ) m1 (X ) ∗ m2 (Y ) m1 (X ) ∗ m2 (Y ) (1) noun phrases that are coreferent (as done for MUC6 (MUC6 Proceedings, 1995)).",
                    "sid": 203,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the terrorism domain, 1600 texts were used for training and the 40 test docu X ∩Y =∅ All sets of hypotheses (and their corresponding belief values) in the current model are crossed with the sets of hypotheses (and belief values) provided by the new evidence.",
                    "sid": 204,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sometimes, however, these beliefs can be contradictory.",
                    "sid": 205,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, suppose the current model assigns a belief value of .60 to {A, B}, meaning that it is 60% sure that the correct hypothesis is either A or B. Then new evidence arrives with a belief value of .70 assigned 5 Initially there are no competing hypotheses because all hypotheses are included in θ by definition.",
                    "sid": 206,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 Our knowledge sources return some sort of probability estimate, although in some cases this estimate is not especially well-principled (e.g., the Recency KS).",
                    "sid": 207,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ments contained 322 anaphoric links.",
                    "sid": 208,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the disasters domain, 8245 texts were used for training and the 40 test documents contained 447 anaphoric links.",
                    "sid": 209,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In recent years, coreference resolvers have been evaluated as part of MUC6 and MUC7 (MUC7 Proceedings, 1998).",
                    "sid": 210,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We considered using the MUC6 and MUC7 data sets, but their training sets were far too small to learn reliable co-occurrence statistics for a large set of contextual role relationships.",
                    "sid": 211,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore we opted to use the much 7 The DempsterShafer theory assumes that one of the hypotheses in θ is correct, so eliminating all of the hypotheses violates this assumption.",
                    "sid": 212,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 Volume 1, English language, 19961997, Format version 1, correction level 0 An ap ho r T e r r o r i s m R e c Pr F D i s a s t e r s R e c Pr F De f. NP s Pro no uns .43 .79 .55 .50 .72 .59 .42 .91 .58 .42 .82 .56 Tot al .46 .76 .57 .42 .87 .57 Table 2: General Knowledge Sources Table 4: Individual Performance of KSs for Terrorism Table 3: General + Contextual Role Knowledge Sources larger MUC4 and Reuters corpora.9 4.2 Experiments.",
                    "sid": 213,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopted the MUC6 guidelines for evaluating coreference relationships based on transitivity in anaphoric chains.",
                    "sid": 214,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if {N P1, N P2, N P3} are all coreferent, then each NP must be linked to one of the other two NPs.",
                    "sid": 215,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we evaluated BABAR using only the seven general knowledge sources.",
                    "sid": 216,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows BABAR’s performance.",
                    "sid": 217,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We measured recall (Rec), precision (Pr), and the F-measure (F) with recall and precision equally weighted.",
                    "sid": 218,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BABAR achieved recall in the 4250% range for both domains, with 76% precision overall for terrorism and 87% precision for natural disasters.",
                    "sid": 219,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We suspect that the higher precision in the disasters domain may be due to its substantially larger training corpus.",
                    "sid": 220,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows BABAR’s performance when the four contextual role knowledge sources are added.",
                    "sid": 221,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The F- measure score increased for both domains, reflecting a substantial increase in recall with a small decrease in precision.",
                    "sid": 222,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The contextual role knowledge had the greatest impact on pronouns: +13% recall for terrorism and +15% recall for disasters, with a +1% precision gain in terrorism and a small precision drop of -3% in disasters.",
                    "sid": 223,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The difference in performance between pronouns and definite noun phrases surprised us.",
                    "sid": 224,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Analysis of the data revealed that the contextual role knowledge is especially helpful for resolving pronouns because, in general, they are semantically weaker than definite NPs.",
                    "sid": 225,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since pronouns carry little semantics of their own, resolving them depends almost entirely on context.",
                    "sid": 226,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, even though context can be helpful for resolving definite NPs, context can be trumped by the semantics of the nouns themselves.",
                    "sid": 227,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, even if the contexts surrounding an anaphor and candidate match exactly, they are not coreferent if they have substantially different meanings 9 We would be happy to make our manually annotated test data available to others who also want to evaluate their coreference resolver on the MUC4 or Reuters collections.",
                    "sid": 228,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5: Individual Performance of KSs for Disasters (e.g., “the mayor” vs. “the journalist”).",
                    "sid": 229,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also performed experiments to evaluate the impact of each type of contextual role knowledge separately.",
                    "sid": 230,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tables 4 and 5 show BABAR’s performance when just one contextual role knowledge source is used at a time.",
                    "sid": 231,
                    "ssid": 169,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For definite NPs, the results are a mixed bag: some knowledge sources increased recall a little, but at the expense of some precision.",
                    "sid": 232,
                    "ssid": 170,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For pronouns, however, all of the knowledge sources increased recall, often substantially, and with little if any decrease in precision.",
                    "sid": 233,
                    "ssid": 171,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result suggests that all of contextual role KSs can provide useful information for resolving anaphora.",
                    "sid": 234,
                    "ssid": 172,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tables 4 and 5 also show that putting all of the contextual role KSs in play at the same time produces the greatest performance gain.",
                    "sid": 235,
                    "ssid": 173,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are two possible reasons: (1) the knowledge sources are resolving different cases of anaphora, and (2) the knowledge sources provide multiple pieces of evidence in support of (or against) a candidate, thereby acting synergistically to push the DempsterShafer model over the belief threshold in favor of a single candidate.",
                    "sid": 236,
                    "ssid": 174,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Related Work.",
                    "sid": 237,
                    "ssid": 175,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many researchers have developed coreference resolvers, so we will only discuss the methods that are most closely related to BABAR.",
                    "sid": 238,
                    "ssid": 176,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dagan and Itai (Dagan and Itai, 1990) experimented with co-occurrence statistics that are similar to our lexical caseframe expectations.",
                    "sid": 239,
                    "ssid": 177,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their work used subject-verb, verb-object, and adjective-noun relations to compare the contexts surrounding an anaphor and candidate.",
                    "sid": 240,
                    "ssid": 178,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However their work did not consider other types of lexical expectations (e.g., PP arguments), semantic expectations, or context comparisons like our case- frame network.(Niyu et al., 1998) used unsupervised learning to ac quire gender, number, and animacy information from resolutions produced by a statistical pronoun resolver.",
                    "sid": 241,
                    "ssid": 179,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The learned information was recycled back into the resolver to improve its performance.",
                    "sid": 242,
                    "ssid": 180,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach is similar to BABAR in that they both acquire knowledge from earlier resolutions.",
                    "sid": 243,
                    "ssid": 181,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Kehler, 1997) also used a DempsterShafer model to merge evidence from different sources for template-level coreference.",
                    "sid": 244,
                    "ssid": 182,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several coreference resolvers have used supervised learning techniques, such as decision trees and rule learners (Aone and Bennett, 1995; McCarthy and Lehnert, 1995; Ng and Cardie, 2002; Soon et al., 2001).",
                    "sid": 245,
                    "ssid": 183,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These systems rely on a training corpus that has been manually annotated with coreference links.",
                    "sid": 246,
                    "ssid": 184,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 Conclusions.",
                    "sid": 247,
                    "ssid": 185,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The goal of our research was to explore the use of contextual role knowledge for coreference resolution.",
                    "sid": 248,
                    "ssid": 186,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We identified three ways that contextual roles can be exploited: (1) by identifying caseframes that co-occur in resolutions, (2) by identifying nouns that co-occur with case- frames and using them to crosscheck anaphor/candidate compatibility, (3) by identifying semantic classes that co- occur with caseframes and using them to crosscheck anaphor/candidate compatability.",
                    "sid": 249,
                    "ssid": 187,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We combined evidence from four contextual role knowledge sources with evidence from seven general knowledge sources using a DempsterShafer probabilistic model.",
                    "sid": 250,
                    "ssid": 188,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our coreference resolver performed well in two domains, and experiments showed that each contextual role knowledge source contributed valuable information.",
                    "sid": 251,
                    "ssid": 189,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found that contextual role knowledge was more beneficial for pronouns than for definite noun phrases.",
                    "sid": 252,
                    "ssid": 190,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that different types of anaphora may warrant different treatment: definite NP resolution may depend more on lexical semantics, while pronoun resolution may depend more on contextual semantics.",
                    "sid": 253,
                    "ssid": 191,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In future work, we plan to follow-up on this approach and investigate other ways that contextual role knowledge can be used.",
                    "sid": 254,
                    "ssid": 192,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 Acknowledgements.",
                    "sid": 255,
                    "ssid": 193,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work was supported in part by the National Science Foundation under grant IRI9704240.",
                    "sid": 256,
                    "ssid": 194,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The inventions disclosed herein are the subject of a patent application owned by the University of Utah and licensed on an exclusive basis to Attensity Corporation.",
                    "sid": 257,
                    "ssid": 195,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}