{
    "ID": "N09-3012",
    "sections": [
        {
            "text": "introduction. ",
            "number": "1",
            "sents": [
                {
                    "text": "One of the contemporary demanding NLP tasks is information extraction, which is the procedure of extracting structured information such as entities, relations, and events from free text documents.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an information extraction sub-task, semantic relation extraction is the procedure of finding predefined semantic relations between textual entity mentions.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, assuming a semantic relation with type Physical and subtype Located between an entity of type Person and another entity of type Location, the sentence \"Police arrested Mark at the airport last week.\" conveys two mentions of this relation between \"Mark\" and Kernel functions can implicitly capture a large amount of features efficiently; thus, they have been widely used in various NLP tasks.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Various types of features have been exploited so far for relation extraction.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (Bunescu and Mooney, 2005b) sequence of words features are utilized using a sub-sequence kernel.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (Bunescu and Mooney, 2005a) dependency graph features are exploited, and in (Zhang et al., 2006a) syntactic features are employed for relation extraction.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although in order to achieve the best performance, it is necessary to use a proper combination of these features (Zhou et al., 2005), in this paper, we will concentrate on how to better capture the syntactic features for relation extraction.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "66 Proceedings of the NAACL HLT Student Research Workshop and Doctoral Consortium, pages 66–71, Boulder, Colorado, June 2009.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2009 Association for Computational Linguistics In CD’01 (Collins and Duffy, 2001) a convolution syntactic tree kernel is proposed that generally measures the syntactic similarity between parse trees.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, a generalized version of CD’01 convolution tree kernel is proposed by associating generic weights to the nodes and sub-trees of the parse tree.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These weights can be used to incorporate domain knowledge into the kernel and make it more flexible and customizable.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The generalized kernel can be conveniently used to generate a variety of syntactic sub-kernels (including the original CD’01 kernel), by adopting appropriate weighting mechanisms.As a result, in this paper, novel syntactic sub finally found to be the best performing tree portion.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PT is a portion of parse tree that is enclosed by the shortest path between the two relation arguments.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, this tree kernel is combined with an entity kernel to form a reportedly high quality composite kernel in (Zhang et al., 2006b).",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 CD’01 Convolution Tree Kernel.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (Collins and Duffy, 2001), a convolution tree kernel has been introduced that measures the syntactic similarity between parse trees.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This kernel computes the inner products of the following feature vector.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "kernels are generated from the generalized kernel for the task of relation extraction.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluations size1 H (T ) = (λ 2 sizen sizei # subTree1 (T ),..., λ 2 # subTreei (T ),..., demonstrate that these kernels outperform theoriginal CD’01 kernel in the extraction of ACE 2005 main relation types λ 2 0 < λ ≤ 1 # subTreen (T )) (2) The remainder of this paper is structured as follows.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In section 2, the most related works are briefly reviewed.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In section 3, CD’01 tree kernel is described.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed generalized convolution tree kernel is explained in section 4 and its produced sub-kernels for relation extraction are Each feature of this vector is the occurrence count of a sub-tree type in the parse tree decayed exponentially by the parameter λ . Without this decaying mechanism used to retain the kernel values within a fairly small range, the value of the kernel for identical trees becomes far higher than illustrated in section 5.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experimental results are discussed in section 6.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work is concluded its value for different trees.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Term sizei is defined in section 7 and some possible future works are presented in section 8.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "In (Collins and Duffy, 2001), a convolution parse tree kernel has been introduced.",
                    "sid": 26,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This kernel is generally designed to measure syntactic similarity to be the number of rules or internal nodes of the ith sub-tree type.",
                    "sid": 27,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Samples of such sub-trees are shown in Fig.",
                    "sid": 28,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 for a simple parse tree.",
                    "sid": 29,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the number of sub-trees of a tree is exponential in its size (Collins and Duffy, 2001), direct inner product calculation is computationally infeasible.",
                    "sid": 30,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, Collins and Duffy (2001) proposed an ingenious kernel function that implicitly between parse trees and is especially exploited for parsing English sentences in their paper.",
                    "sid": 31,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since calculates the inner product in on the trees of size N and N . O( N1 × N 2 ) time then, the kernel has been widely used in different 1 2 applications such as semantic role labeling (Moschitti, 2006b) and relation extraction (Zhang et al., 2006a; Zhang et al., 2006b; Zhou et al., 2007; Li et al. 2008).",
                    "sid": 32,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the first time, in (Zhang et al., 2006a), this convolution tree kernel was used for relation extraction.",
                    "sid": 33,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the whole syntactic parse tree of the sentence that holds the relation arguments 4 A Generalized Convolution Tree Kernel In order to describe the kernel, a feature vector over the syntactic parse tree is firstly defined in eq.",
                    "sid": 34,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3), in which the ith feature equals the weighted sum of the number of instances of sub-tree type ith in the tree.",
                    "sid": 35,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "contains a plenty of misleading features, several parse tree portions are studied to find the most Function I subtreei (n) is an indicator function that feature-rich portion of the syntactic tree for returns 1 if the subtreei occurs with its root at relation extraction, and Path-Enclosed Tree (PT) is node n and 0 otherwise.",
                    "sid": 36,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As described in eq.",
                    "sid": 37,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4), function tw(T) (which stands for \"tree weight\") assigns a weight to a tree T which is equal to the product of the weights of all its nodes.",
                    "sid": 38,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "H (T ) = ( ∑ [ I subtree (n ) × tw( subtree 1 (n ))],..., n∈T a Cgc(n1,n2 ) function over all tree node pairs of T1 and T2.",
                    "sid": 39,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Function Cgc(n1,n2 ) is the weighted sum of the common sub-trees rooted at n1 and n2, and can be recursively computed in a similar way to ∑ [ I subtree i (n ) × tw( subtree i (n ))],..., (3) function C (n , n ) of (Collins and Duffy, 2001) as n∈T 1 2 follows.",
                    "sid": 40,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "∑ [ I subtree m (n ) × tw( subtree m (n ))]) n∈T (1) if the production rules of nodes n1 and n2 are tw(T ) = ∏ inw( n) n∈InternalNode s (T ) × ∏ enw(n) n∈Extern alNodes (T ) (4) diff eren t then Cgc (n1 , n2 ) = 0 (2) els e if n1 an d n2 ar e th e sa me pre ter mi na ls (th e sa me pa rt of sp ee ch es) th en (1) (2) (3) NP NP NP PP DT the PP IN NP C gc (n1 , n2 ) = inw(n1 ) × enw (child (n1 )) × inw(n2 ) × enw(child (n2 )) NP PP (4) (5) DT NN at (3) else if both n1 and n2 have the same producti on NNP IN NP DT NN NP NP PP NN airport the airport rules then C gc (n1 , n2 ) = inw(n1 ) × inw(n2 ) × Mark at (6) (7) the airport NNP IN Mark NP NP DT NN NP NP PP ∏[enw(chil di (n1 )) × enw(childi (n2 )) +C gc (childi (n1 ), childi (n2 ))] i In the first case, when the two nodes repres ent the airport NNP Figure 1.",
                    "sid": 41,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Samples of sub-trees used in convolution tree kernel calculation.",
                    "sid": 42,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since each node of the whole syntactic tree can either happen as an internal node or as an external node of a supposed sub-tree (presuming its existence in the sub-tree), two types of weights are respectively associated to each node by the different production rules they can't accordingly have any sub-trees in common.",
                    "sid": 43,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second case, there is exactly one common sub-tree of size two.",
                    "sid": 44,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It should be noted that all the leaf nodes of the tree (or words of the sentence) are considered identical in the calculation of the tree kernel.",
                    "sid": 45,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The value of the function in this case is the weight of this common sub-tree.",
                    "sid": 46,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the third case, when the nodes functions inw(n) and enw(n) (which respectivel y generally represent the same productio n rules the stand for \"internal node weight\" and \"external node weight\").",
                    "sid": 47,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, in Fig.",
                    "sid": 48,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1, the node with label PP is an external node for sub-trees (1) and (7) while it is an internal node of sub-trees (3) and (4).",
                    "sid": 49,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "K (T1 ,T2 ) = < H (T1 ), H (T2 ) > weighted sum of the common sub-trees are calculated recursively.",
                    "sid": 50,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The equation holds because the existence of common sub-trees rooted at n1 and n2 implies the existence of common sub trees rooted at their corresponding children, which can be combined multiplicatively to form their parents' common sub-trees.",
                    "sid": 51,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "= ∑[ i [ ∑ I subtreei (n1 ) × tw(subT reei (n1 ))] n1∈T1 D ue to the equi valen t proc edur e of kern el calcu latio n, this gene raliz ed versi on of the tree × [ ∑ I subtreei (n2 ) × tw(subTreei (n2 ))]] n2∈T2 (5) kernel preserves the nice O( N1 × N2 ) time = ∑ ∑[∑ I subtreei (n1 ) × I subtreei (n2 ) × complexity property of the original kernel.",
                    "sid": 52,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is worthy of note that in (Moschitti, 2006b) a sorting n1∈T1 n2∈T2 i tw(subTre ei (n1 )) × tw(subTre ei (n2 ))] based method is proposed for the fast implementation of such tree kernels that reduces = ∑ ∑Cgc (n1 , n2 ) n1∈T1 n2∈T2 the average running time to O( N1 + N2 ) . As shown in eq.",
                    "sid": 53,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5), A similar procedure to The generalized kernel can be converted to (Collins and Duffy, 2001) can be employed to CD’01 kernel by defining inw(n) = λ and develop a kernel function for the calculation of dot products on H(T) vectors.",
                    "sid": 54,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to eq.",
                    "sid": 55,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5) the calculation of the kernel finally leads to the sum of enw(n) = 1 . Likewise, other definitions can be utilized to produce other useful sub-kernels.",
                    "sid": 56,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Kernels for Relation Extraction.",
                    "sid": 57,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, three sub-kernels of the generalized convolution tree kernel will be proposed for relation extraction.",
                    "sid": 58,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using the embedded weights of the generalized kernel, these sub-kernels differentiate among sub-trees based on their ancestor path, the less it is decayed by this weighting method.",
                    "sid": 59,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "S NP VP expected relevance to semantic relations.",
                    "sid": 60,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More specifically, the sub-trees are weighted according to how their nodes interact to the arguments of the relation.",
                    "sid": 61,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NNP Police VBN arrested NP NP PP NP JJ NN NNP IN NP last week 5.1 Argument Ancestor Path Kernel (AAP).",
                    "sid": 62,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "AAPDist(airport, NP)=1 Mark at DT NN Definition of weighting functions is shown in eq. the airport (6) and (7).",
                    "sid": 63,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parameter parameter similar to λ . 0 < α ≤ 1 is a decaying Figure 2.",
                    "sid": 64,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The syntactic parse tree of the sentence \"Police arrested Mark at the airport last week\" that conveys a Phys.Located(Mark, airport) relation.",
                    "sid": 65,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The α inw(n) =   0 1 enw(n) =   0 if n is on the argument ancestor path or a direct child of a node on it otherwi se if n is on the argument ancestor path or a direct child of a node on it otherwise (6) (7) ancestor path of the argume nt \"airport \" (dashed curve) and the distance of the node NP of \"Mark\" from it (dotted curve) is shown.",
                    "sid": 66,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.3 Threshold Sensitive Argument Ancestor Path Dista nce Kern el (TSA APD ) This weighting method is equivalent to applying CD’01 tree kernel (by setting λ = α 2 ) on a portion of the parse tree that exclusively includes the arguments ancestor nodes and their direct children.",
                    "sid": 67,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Argument Ancestor Path Distance Kernel.",
                    "sid": 68,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This kernel is intuitively similar to the previous kernel but uses a rough threshold based decaying technique instead of a smooth one.",
                    "sid": 69,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The definition of weighting functions is shown in eq.",
                    "sid": 70,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(10) and (11).",
                    "sid": 71,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both functions are again identical in this case.",
                    "sid": 72,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(AAPD) Min ( AAPDist ( n ,arg1 ), AAPDist ( n ,arg 2 )) 1 inw(n) =  α AAPDist (n) ≤ Threshold AAPDist (n) ≥ Threshold (10) inw(n ) = α enw (n ) = α M A X _ D I S T Min ( AAPDist ( n ,arg1 ), AAPDist ( n ,arg 2 )) M A X _ D I S T (8) (9) 1 enw(n) =  α AAPDist (n) ≤ Threshold AAPDist (n) ≥ Threshold (11) Definition of weighting functions is shown in eq.",
                    "sid": 73,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(8) and (9).",
                    "sid": 74,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both functions have identical definitions for this kernel.",
                    "sid": 75,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Function AAPDist(n,arg) calculates the distance of the node n from the argument arg on the parse tree as illustrated by Fig.",
                    "sid": 76,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 77,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MAX_DIST is used for normalization, and is the maximum of AAPDist(n,arg) in the whole tree.",
                    "sid": 78,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, the closer a tree node is to one of the arguments 6 Experiments.",
                    "sid": 79,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1 Experiments.",
                    "sid": 80,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Setting The proposed kernels are evaluated on ACE-2005 multilingual corpus (Walker et al., 2006).",
                    "sid": 81,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to avoid parsing problems, the more formal parts of the corpus in \"news wire\" and \"broadcast news\" sections are used for evaluation as in (Zhang et al., 2006b) . R e l a t i o n K e r n e l P E R S O C A R T G E N A F F O R G A F F PA RT W H OL E P H Y S C D ’ 0 1 0 . 6 2 0 . 5 1 0 . 0 9 0 . 4 3 0 . 3 0 0 . 3 2 A A P 0 . 5 8 0 . 4 9 0 . 1 0 0 . 4 3 0 . 2 8 0 . 3 6 A A P D 0 . 7 0 0 . 5 0 0 . 1 2 0 . 4 3 0 . 2 9 0 . 2 9 T S A A P D 0 0 . 6 3 0 . 4 8 0 . 1 1 0 . 4 3 0 . 3 0 0 . 3 3 T S A A P D 1 0 . 7 3 0 . 4 7 0 . 1 1 0 . 4 5 0 . 2 8 0 . 3 3 Table 1: The F1-Measure value is shown for every kernel on each ACE-2005 main relation type.",
                    "sid": 82,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For every relation type the best result is shown in bold font.",
                    "sid": 83,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have used LIBSVM (Chang and Lin 2001) java source for the SVM classification and Stanford NLP package1 for tokenization, sentence segmentation and parsing.",
                    "sid": 84,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following [Bunescu and Mooney, 2007], every pair of entities within a sentence is regarded as a negative relation instance unless it is annotated as a positive relation in the corpus.",
                    "sid": 85,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The total number of negative training instances, constructed in this way, is about 20 times more than the number of annotated positive instances.",
                    "sid": 86,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we also imposed the restriction of maximum argument distance of 10 words.",
                    "sid": 87,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This constraint eliminates half of the negative constructed instances while slightly decreases positive instances.",
                    "sid": 88,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, since the resulted training set is still unbalanced, we used LIBSVM weighting mechanism.",
                    "sid": 89,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Precisely, if there are P positive and N negative instances in the training set, a weight value of except for AAP are computed on the PT portion described in section 2.",
                    "sid": 90,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "AAP is computed over the MCT tree portion which is also proposed by (Zhang et al., 2006a) and is the sub-tree rooted at the first common ancestor of relation arguments.",
                    "sid": 91,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the proposed kernels α is set to 0.44 which is tuned on a development set that contained 5000 instances of type PHYS.",
                    "sid": 92,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The λ parameter of CD’01 kernel is set to 0.4 according to (Zhang et al., 2006a).",
                    "sid": 93,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The C parameter of SVM classification is set to 2.4 for all the kernels after tuning it individually for each kernel on the mentioned development set.",
                    "sid": 94,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.2 Experiments Results.",
                    "sid": 95,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of the experiments are shown in Table 1.",
                    "sid": 96,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed kernels outperform the original.",
                    "sid": 97,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CD’01 kernel in four of the six relation types.",
                    "sid": 98,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The N / P is used for positiv e instan ces while the perfor manc e of TSAAPD1 is especially default weight value of 1 is used for negative ones.",
                    "sid": 99,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A binary SVM is trained for every relation type separately, and type compatible annotated and constructed relation instances are used to train it.",
                    "sid": 100,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each relation type, only type compatible relation instances are exploited for training.",
                    "sid": 101,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example to learn an ORGAFF relation (which applies to (PER, ORG) or (ORG, ORG) argument types) it is meaningless to use a relation instance between two entities of type PERSON.",
                    "sid": 102,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, the total number of training instances used for training every relation type is restricted to 5000 instances to shorten the duration of the evaluation process.",
                    "sid": 103,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reported results are achieved using a 5-fold cross validation method.",
                    "sid": 104,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The kernels AAP, AAPD and TSAAPD0 (TSAAPD with threshold = 0) and TSAAPD1 (TSAAPD with threshold = 1) are compared with CD’01 convolution tree kernel.",
                    "sid": 105,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the kernels 1 http://nlp.stanford.edu/software/index.shtmlremarkable because it is the best kernel in ORG AFF and PER-SOC relations.",
                    "sid": 106,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It particularly performs very well in the extraction of PER-SOC relation with an F1-measure of 0.73.",
                    "sid": 107,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It should be noted that the general low performance of all the kernels on the GENAFF type is because of its extremely small number of annotated instances in the training set (40 in 5000).",
                    "sid": 108,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The AAPD kernel has the best performance with a remarkable improvement over the Collins kernel in GENAFF relation type.",
                    "sid": 109,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results clearly demonstrate that the nodes closer to the ancestor path of relation arguments contain the most useful syntactic features for relation extraction 7 Conclusion.",
                    "sid": 110,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we proposed a generalized convolution tree kernel that can generate various syntactic sub-kernels including the CD’01 kernel.",
                    "sid": 111,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The kernel is generalized by assigning weights to the sub-trees.",
                    "sid": 112,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The weight of a sub-tree is the product of the weights assigned to its nodes by two types of weighting functions.",
                    "sid": 113,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, impacts of the tree nodes on the kernel value can be discriminated purposely based on the application.",
                    "sid": 114,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Context information can also be injected to the kernel via context sensitive weighting mechanisms.",
                    "sid": 115,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using the generalized kernel, various sub- kernels can be produced by different definitions of the two weighting functions.",
                    "sid": 116,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We consequently used the generalized kernel for systematic generation of useful kernels in relation extraction.",
                    "sid": 117,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In these kernels, the closer a node is to the relation arguments ancestor paths, the less it is decayed by the weighting functions.",
                    "sid": 118,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation on the ACE 2005 main relation types demonstrates the effectiveness of the proposed kernels.",
                    "sid": 119,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They show remarkable performance improvement over CD’01 kernel.",
                    "sid": 120,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 Future Work.",
                    "sid": 121,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the path-enclosed tree portion (PT) (Zhang et al., 2006a) seems to be an appropriate portion of the syntactic tree for relation extraction, it only takes into account the syntactic information between the relation arguments, and discards many useful features (before and after the arguments features).",
                    "sid": 122,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It seems that the generalized kernel can be used with larger tree portions that contain syntactic features before and after the arguments, because it can be more easily targeted to related features.",
                    "sid": 123,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Currently, the proposed weighting mechanisms are solely based on the location of the tree nodes in the parse tree; however other useful information such as labels of nodes can also be used in weighting.",
                    "sid": 124,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another future work can be utilizing the generalized kernel for other applicable NLP tasks such as co-reference resolution.",
                    "sid": 125,
                    "ssid": 100,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgement",
            "number": "",
            "sents": [
                {
                    "text": "This work is supported by Iran Telecommunication Research Centre under contract No. 5007725.",
                    "sid": 126,
                    "ssid": 101,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}