{
    "ID": "N09-1057",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Work on sentiment analysis often focuses on the words and phrases that people use in overtly opinionated text.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we introduce a new approach to the problem that focuses not on lexical indicators, but on the syntactic “packaging” of ideas, which is well suited to investigating the identification of implicit sentiment, or perspective.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We establish a strong predictive connection between linguistically well motivated features and implicit sentiment, and then show how computational approximations of these features can be used to improve on existing state-of-the-art sentiment classification results.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "As Pang and Lee (2008) observe, the last several years have seen a “land rush” in research on sentiment analysis and opinion mining, with a frequent emphasis on the identification of opinions in evaluative text such as movie or product reviews.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, sentiment also may be carried implicitly by statements that are not only non-evaluative, but not even visibly subjective.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider, for example, the following two descriptions of the same (invented) event: 1(a) On November 25, a soldier veered his jeep into a crowded market and killed three civilians.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(b) On November 25, a soldier’s jeep veered into a crowded market, causing three civilian deaths.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both descriptions appear on the surface to be objective statements, and they use nearly the same words.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexically, the sentences’ first clauses differ only in the difference between ’s and his to express the relationship between the soldier and the jeep, and in the second clauses both kill and death are terms with negative connotations, at least according to the General Inquirer lexicon (Stone, 1966).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yet the descriptions clearly differ in the feelings they evoke: if the soldier were being tried for his role in what happened on November 25, surely the prosecutor would be more likely to say (1a) to the jury, and the defense attorney (1b), rather than the reverse.1 Why, then, should a description like (1a) be perceived as less sympathetic to the soldier than (1b)?",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the difference is not in the words, it must be in the way they are put together; that is, the structure of the sentence.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 2, we offer a specific hypothesis about the connection between structure and implicit sentiment: we suggest that the relationship is mediated by a set of “grammatically relevant” semantic properties well known to be important cross- linguistically in characterizing the interface between syntax and lexical semantics.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 3, we validate this hypothesis by means of a human ratings study, showing that these properties are highly predictive of human sentiment ratings.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 4, we introduce observable proxies for underlying semantics (OPUS), a practical way to approximate the relevant semantic properties automatically as features in a supervised learning setting.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 5, we show that these features improve on the existing state ofthe art in automatic sentiment classification.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sec ∗This work was done while the first author was a student in the Department of Linguistics, University of Maryland.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 We refer readers not sharing this intuition to Section 3..",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "503 Human Language Technologies: The 2009 Annual Conference of the North American Chapter of the ACL, pages 503–511, Boulder, Colorado, June 2009.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2009 Association for Computational Linguistics tions 6 and 7 discuss related work and summarize.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "linguistic motivation. ",
            "number": "2",
            "sents": [
                {
                    "text": "Verbal descriptions of an event often carry along with them an underlying attitude toward what is being described.",
                    "sid": 20,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By framing the same event in different ways, speakers or authors “select some aspects of a perceived reality and make them more salient in a communicating text, in such a way as to promote a particular problem definition, causal interpretation, moral evaluation, and/or treatment recommendation” (Entman, 1993, p. 52).",
                    "sid": 21,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clearly lexical choices can accomplish this kind of selection, e.g. choosing to describe a person as a terrorist rather than a freedom fighter, or referencing killer whales rather than orcas.2 Syntactic choices can also have framing effects.",
                    "sid": 22,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Ronald Reagan’s famous use of the passive construction, “Mistakes were made” (in the context of the IranContra scandal), is a classic example of framing or spin: used without a by-phrase, the passive avoids identifying a causal agent and therefore sidesteps the issue of responsibility (Broder, 2007).",
                    "sid": 23,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A toddler who says “My toy broke” instead of “I broke my toy” is employing the same linguistic strategy.",
                    "sid": 24,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Linguists have long studied syntactic variation in descriptions of the same event, often under the general heading of syntactic diathesis alternations (Levin, 1993; Levin and Hovav, 2005).",
                    "sid": 25,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This line of research has established a set of semantic properties that are widely viewed as “grammatically relevant” in the sense that they enable generalizations about syntactic “packaging” of meaning within (and across) the world’s languages.",
                    "sid": 26,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the verb break in English participates in the causative- inchoative alternation (causative event X broke Y can also be expressed without overt causation as Y broke), but the verb climb does not (X also causes the event in X climbed Y, but that event cannot be expressed as Y climbed).",
                    "sid": 27,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These facts about participation in the alternation turn out to be connected with the fact that a breaking event entails a change of state in Y but a climbing event does not.",
                    "sid": 28,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Grammatically relevant semantic properties of events and their 2 Supporters of an endangered species listing in Puget Sound generally referred to the animals as orcas, while opponents generally said killer whales (Harden, 2006).",
                    "sid": 29,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "participants — causation, change of state, and others — are central not only in theoretical work on lexical semantics, but in computational approaches to the lexicon, as well (e.g.",
                    "sid": 30,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Pustejovsky, 1991; Dorr, 1993; Wu and Palmer, 1994; Dang et al., 1998)).",
                    "sid": 31,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach we propose draws on two influential discussions about grammatically relevant semantic properties in theoretical work on lexical semantics.",
                    "sid": 32,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, Dowty (1991) characterizes grammatically relevant properties of a verb’s arguments (e.g. subject and object) via inferences that follow from the meaning of the verb.",
                    "sid": 33,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, expressions like X murders Y or X interrogates Y entail that subject X caused the event.3 Second, Hopper and Thompson (1980) characterize “semantic transitivity” using similar properties, connecting semantic features to morphosyntactic behavior across a wide variety of languages.",
                    "sid": 34,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bringing together Dowty with Hopper and Thompson, we find 13 semantic properties organized into three groups, corresponding to the three components of a canonical transitive clause, expressed as X verb Y in English.4 Properties associated with X involve volitional involvement in the event or state, causation of the event, sentience/awareness and/or perception, causing a change of state in Y , kinesis or movement, and existence independent of the event.",
                    "sid": 35,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Properties associated with the event or state conveyed by the verb include aspectual features of telicity (a defined end- point) and punctuality (the latter of which may be inversely related to a property known as incremental theme).",
                    "sid": 36,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Properties associated with Y include affectedness, change of state, (lack of) kinesis or movement, and (lack of) existence independent of the event.",
                    "sid": 37,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now, observe that this set of semantic properties involves many of the questions that would naturally help to shape one’s opinion about the event described by veer in (1).",
                    "sid": 38,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Was anyone or anything affected by what took place, and to what degree?",
                    "sid": 39,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Did the event just happen or was it caused?",
                    "sid": 40,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Did the event reach a defined endpoint?",
                    "sid": 41,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Did participation in 3 Kako (2006) has verified that people make these inferences based on X’s syntactic position even when a semantically empty nonsense verb is used.",
                    "sid": 42,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 We are deliberately sidestepping the choice of terminology.",
                    "sid": 43,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "for X and Y, e.g. proto-Patient, theme, etc. the event involve conscious thought or intent?",
                    "sid": 44,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our hypothesis is that the syntactic aspects of “framing”, as characterized by Entman, involve manipulation of these semantic properties, even when overt opinions are not being expressed.",
                    "sid": 45,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, we propose a connection between syntactic choices and implicit sentiment mediated by the very same semantic properties that linguists have already identified as central when connecting surface expression to underlying meaning more generally.",
                    "sid": 46,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "empirical validation. ",
            "number": "3",
            "sents": [
                {
                    "text": "We validated the hypothesized connection between implicit sentiment and grammatically relevant semantic properties using psycholinguistic methods, by varying the syntactic form of event descriptions, and showing that the semantic properties of descriptions do indeed predict perceived sentiment.5 3.1 Semantic property ratings.",
                    "sid": 47,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Materials.",
                    "sid": 48,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Stimuli were constructed using 11 verbs of killing, which are widely viewed as proto- typical for the semantic properties of interest here (Lemmens, 1998): X killed Y normally involves conscious, intentional causation by X of a kinetic event that causes a (rather decisive and clearly terminated!)",
                    "sid": 49,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "change of state in Y . The verbs comprise two classes: the “transitive” class, involving externally caused change-of-state verbs (kill, slaughter, assassinate, shoot, poison), and the “ergative” class (strangle, smother, choke, drown, suffocate, starve), within which verbs are internally caused (McKoon and MacFarland, 2000) or otherwise emphasize properties of the object.",
                    "sid": 50,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Variation of syntactic description involved two forms: a transitive syntactic frame with a human agent as subject (“transitive form”, 2a), and a nominalization of the verb as properties as well as Hopper and Thompson’s semantic transitivity components, responding via ratings on a 1-to-7 scale.",
                    "sid": 51,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the questions probing volition were: “In this event, how likely is it that (subject) chose to be involved?”, where(subject) was the gunmen and the shooting, for 2(a b), respectively.6 3.2 Sentiment ratings.",
                    "sid": 52,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Materials.",
                    "sid": 53,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the materials above to construct short, newspaper-like paragraphs, each one accompanied by a “headline” version of the same syntactic descriptions used above.",
                    "sid": 54,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, given this paragraph: A man has been charged for the suffocation of a woman early Tuesday morning.",
                    "sid": 55,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "City police say the man suffocated the 24-year-old woman using a plastic garbage bag.",
                    "sid": 56,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The woman, who police say had a previous relationship with her attacker, was on her way to work when the incident happened.",
                    "sid": 57,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on information provided by neighbors, police were able to identify the suspect, who was arrested at gunpoint later the same day.",
                    "sid": 58,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the three alternative headlines would be: 3(a) Man suffocates 24-year old woman (b) Suffocation kills 24-year-old woman (c) 24-year-old woman is suffocated Some paragraphs were based on actual news stories.7 In all paragraphs, there is an obvious nominal referent for both the perpetrator and the victim, it is clear that the victim dies, and the perpetrator in the scenario is responsible for the resulting death directly rather than indirectly (e.g. through negli subject and the verb kill as the predicate (“nominal- ized form”, 2b).",
                    "sid": 59,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2(a) The gunmen shot the opposition leader (b) The shooting killed the opposition leader Participants and procedure.",
                    "sid": 60,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A set of 18 volunteer participants, all native speakers of English, were presented with event descriptions and asked to answer questions probing both Dowty’s proto-role 5 Full details and materials in Greene (2007)..",
                    "sid": 61,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 Standard experimental design methods were followed with.",
                    "sid": 62,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "respect to counterbalancing, block design, and distractor stimuli; for example, no participant saw more than one of 2(a) or 2(b), and all participants saw equal numbers of transitive and nominalized descriptions.",
                    "sid": 63,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The phrase In this event was repeated in each question and emphasized visually in order to encourage participants to focus on the particular event described in the sentence, rather than on the entities or events denoted in general.",
                    "sid": 64,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 In those cases no proper names were used, to avoid any.",
                    "sid": 65,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "inadvertent emotional reactions or legal issues, although the descriptions retained emotional impact because we wanted readers to have some emotional basis with which to judge the headlines.",
                    "sid": 66,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "gence).8 The stem of the nominalization always appeared in the event description in either verbal or nominal form.",
                    "sid": 67,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Participants and procedure.",
                    "sid": 68,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A set of 31 volunteers, all native speakers of English, were presented with the paragraph-length descriptions and accompanying headlines.",
                    "sid": 69,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a measure of sentiment, participants were asked to rate headlines on a 1-to-7 scale with respect to how sympathetic they perceive the headline to be toward the perpetrator.",
                    "sid": 70,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, given the paragraph and one of the associated headlines in (3), a participant would be asked to rate “How sympathetic or unsympathetic is this headline to the man?”9 3.3 Analysis and discussion.",
                    "sid": 71,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unsurprisingly, but reassuringly, an analysis of the sentiment ratings yields a significant effect of syntactic form on sympathy toward the perpetrator (F (2, 369) = 33.902, p < .001), using a mixed model ANOVA run with the headline form as fixed effect.",
                    "sid": 72,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The transitive form of the headline yielded significantly lower sympathy ratings than the nominalized or passive forms in pairwise comparisons (both p < .001).",
                    "sid": 73,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have thus confirmed empirically that Reagan’s “Mistakes were made” was a wise choice of phrasing on his part.",
                    "sid": 74,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More important, we are now in a position to examine the relationship between syntactic forms and perceived sentiment in more detail.",
                    "sid": 75,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We performed regression analyses treating the 13 semantic property ratings plus the identity of the verb as independent variables to predict sympathy rating as a dependent variable, using the 24 stimulus sentences that bridged both collections of ratings.10 Consid 8 An alert reader may observe that headlines with nominal- ized subjects using the verb kill require some other nominalization, so they don’t say “Killing kills victim”.",
                    "sid": 76,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For these cases in the data, an appropriate nominalization drawn from the event description was used (e.g., explosion).",
                    "sid": 77,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 Again, standard experimental design methods were used.",
                    "sid": 78,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "with respect to block design, distractor stimuli, etc. The phrase this headline was emphasized to stress that it is the headline being rated, not the story.",
                    "sid": 79,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A second question rating sympathy toward the victim was also asked in each case, as an additional distractor.",
                    "sid": 80,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ering semantic properties individually, we find that volition has the strongest correlation with sympathy (a negative correlation, with r = −.",
                    "sid": 81,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "776), followed by sentience (r = −.",
                    "sid": 82,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "764) and kinesis/movement(r = −.",
                    "sid": 83,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "751).",
                    "sid": 84,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although performing a multiple regression with all variables for this size dataset is im possible, owing to overfitting (as a rule of thumb, 5 to 10 observed items are necessary per each independent variable), a multiple regression involving verb, volition, and telicity as independent variables yields R = .88, R2 = .78 (p < .001).",
                    "sid": 85,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The value for adjusted R2, which explicitly takes into account the small number of observations, is 74.1.",
                    "sid": 86,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In summary, then, this ratings study confirms the influence of syntactic choices on perceptions of implicit sentiment.",
                    "sid": 87,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, it provides support for the idea that this influence is mediated by “grammatically relevant” semantic properties, demonstrating that these accounted for approximately 75% of the variance in implicit sentiment expressed by alternative headlines describing the same event.",
                    "sid": 88,
                    "ssid": 42,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "observable approximation. ",
            "number": "4",
            "sents": [
                {
                    "text": "Thus far, we have established a predictive connection between syntactic choices and underlying or implicit sentiment, mediated by grammatically relevant semantic properties.",
                    "sid": 89,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In an ideal world, we could harness the predictive power of those properties by using volition, causation, telicity, etc. as features for regression or classification in sentiment prediction tasks.",
                    "sid": 90,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, the properties are not directly observable, and neither automatic annotators nor labeled training data currently exist.",
                    "sid": 91,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We therefore pursue a different strategy, which we refer to as observable proxies for underlying semantics (OPUS).",
                    "sid": 92,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be viewed as a middle ground between relying on construction-level syntactic distinctions (such as the 3-way transitive, nominalized subject, passive distinction in Section 3) and annotation of fine-grained semantic properties.",
                    "sid": 93,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The key idea is to use observable grammatical relations, drawn from the usages of terms determined to be relevant to a domain, as proxies for the underlying semantic properties that gave rise to their syntacticrealization using those relations.",
                    "sid": 94,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Automatically cre 10These involved only the transitive and nominalized forms, because many of the questions were inapplicable to the passive form.",
                    "sid": 95,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the two ratings studies involved different subject pools, regression models were run over the mean values of each observation in the experimental data.",
                    "sid": 96,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ated features based on those observable proxies are then used in classification as described in Section 5.",
                    "sid": 97,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to identify the set T of terms relevant to a particular document collection, we adopt the relative frequency ratio (Damerau, 1993), R(t) = t The N O O B J features can capture a habitual reading, or in some cases a detransitivizing effect associated with omission of the direct object (Olsen and Resnik, 1997).",
                    "sid": 98,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bold text in (5) yields N O O B J:kill as a feature.",
                    "sid": 99,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rt t t fc domain/Rreference , where Rc = Nc is the ratio of 5(a) At the same time, we should never ignore the term t’s frequency in corpus c to the size Nc of that corpus.",
                    "sid": 100,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "R(t) is a simple but effective comparison of a term’s prevalence in a particular collection as compared to a general reference corpus.",
                    "sid": 101,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the British National Corpus as the reference because it is both very large and representative of text from a wide variety of domains and genres.",
                    "sid": 102,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The threshold of R(t) permitting membership in T is an experimental parameter.",
                    "sid": 103,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "OPUS features are defined in terms of syntactic dependency relations involving terms in T . Given a set D of syntactic dependency relations, features are of the form t : d or d : t, with d ∈ D, t ∈ T . That is, they are term-dependency pairs extracted from term-dependency-term dependency tuples, preserving whether the term is the head or the dependent in the dependency relation.",
                    "sid": 104,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we add two construction-specific features: TR A N S:v, which represents verb v in a canonical, syntactically transitive usage, and N O O B J:v, present when verb v is used without a direct object.11 Example 4 shows source text (bolded clause in 4a), an illustrative subset of parser dependencies (4b), and corresponding OPUS features (4c): 4(a) Life Without Parole does not eliminate the risk that the prisoner will murder a guard, a visitor, or another inmate.",
                    "sid": 105,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(b) nsubj(murder, prisoner); aux(murder, will); dobj(murder, guard) (c) TR A N S:murder, murder:nsubj, nsubj:prisoner, murder:aux, aux:will, murder:dobj, dobj:guard Intuitively the presence of TR A N S:murder suggests the entire complex of semantic properties discussed in Section 2, bringing together the impliciation of volition, causation, etc. on the part of prisoner (as does nsubj:prisoner), affectedness and change of state on the part of guard (as does dobj:guard), and so forth.",
                    "sid": 106,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "11We parsed English text using the Stanford parser.",
                    "sid": 107,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "risks of allowing the inmate to kill again.",
                    "sid": 108,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, omitting the direct object decreases the extent to which the killing event is interpreted as telic, and it eliminates the possibility of attributing change-of-state to a specific affected object (much like “Mistakes were made” avoids attributing cause to a specified subject), placing the phrasing at a less “semantically transitive” point on the transitivity continuum (Hopper and Thompson, 1980).",
                    "sid": 109,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some informants find a perceptible increase in negative sentiment toward inmate when the sentence is phrased as in 5(b): 5(b) At the same time, we should never ignore the risks of allowing the inmate to kill someone again.",
                    "sid": 110,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "computational application. ",
            "number": "5",
            "sents": [
                {
                    "text": "Having discussed linguistic motivation, empirical validation, and practical approximation of semantically relevant features, we now present two studies demonstrating their value in sentiment classification.",
                    "sid": 111,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the first study, we have constructed a new data set particularly well suited for testing our approach, based on writing about the death penalty.",
                    "sid": 112,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our second study, we make a direct comparison with prior state-of-the-art classification using the Bitter Lemons corpus of Lin et al.",
                    "sid": 113,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006).",
                    "sid": 114,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Predicting Opinions of the Death Penalty.",
                    "sid": 115,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Corpus.",
                    "sid": 116,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We constructed a new corpus for experimentation on implicit sentiment by downloading the contents of pro- and anti-death-penalty Web sites and manually checking, for a large subset, that the viewpoints expressed in documents were as expected.",
                    "sid": 117,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The collection, which we will refer to as the DP corpus, comprises documents from five pro-death-penalty sites and three anti-death-penalty sites, and the corpus was engineered to have an even balance, 596 documents per side.12 12Details in Greene (2007).",
                    "sid": 118,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Frequent bigram baseline.",
                    "sid": 119,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopted a supervised classification approach based on word n-gram features, using SVM classification in the WEKA machine learning package.",
                    "sid": 120,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In initial exploration using both unigrams and bigrams, and using both word forms and stems, we found that performance did not differ significantly, and chose stemmed bigrams for our baseline comparisons.",
                    "sid": 121,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to control for the difference in the number of features available to the classifier in our comparisons, we use the N most frequent stemmed bigrams as the baseline feature set where N is matched to number of OPUS features used in the comparison condition.",
                    "sid": 122,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "OPUS-kill verbs: OPUS features for manually selected verbs.",
                    "sid": 123,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We created OPUS features for 14 verbs — those used in Section 3, plus murder, execute, and stab and their nominalizations (including both event and -er nominals, e.g. both killing and killer) — generating N = 1016 distinct features.",
                    "sid": 124,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "OPUS-domain: OPUS features for domain- relevant verbs.",
                    "sid": 125,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We created OPUS features for the 117 verbs for which the relative frequency ratio was greater than 1.",
                    "sid": 126,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This list includes many of the kill verbs we used in Section 3, and introduces, among others, many transitive verbs describing acts of physical force (e.g. rape, rob, steal, beat, strike, force, fight) as well as domain-relevant verbs such as testify, convict, and sentence.",
                    "sid": 127,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Included verbs near the borderline included, for example, hold, watch, allow, and try.",
                    "sid": 128,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extracting OPUS features for these verbs yielded N = 7552 features.",
                    "sid": 129,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation.",
                    "sid": 130,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cross-validation at the document level does not test what we are interested in, since a classifier might well learn to bucket documents according to Web site, not according to pro- or anti- death-penalty sentiment.",
                    "sid": 131,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To avoid this difficulty, we performed site-wise cross-validation.",
                    "sid": 132,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We restricted our attention to the two sites from each perspective with the most documents, which we refer to as pro1, pro2, anti1, and anti2, yielding 4-fold cross- validation.",
                    "sid": 133,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each fold ftrain,test is defined as containing all documents from one pro and one anti site for training, using all documents from the remaining pro and anti sites for testing.",
                    "sid": 134,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, for example, fold f11,22 uses all documents from pro1 and anti1 in training, and all documents from pro2 and Co nd iti on N fea tur es SV M ac cu ra cy Ba sel ine OP US kil l ver bs 10 16 10 16 68.",
                    "sid": 135,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "37 82.",
                    "sid": 136,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "09 Ba sel ine OP US do ma in 75 52 75 52 71.",
                    "sid": 137,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "96 88.",
                    "sid": 138,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10 Table 1: Results for 4-fold site-wise cross-validation using the DP corpus Co nd iti on N fea tur es SV M ac cu ra cy Ba sel ine OP US fre qu ent ver bs OP US kil l ver bs 15 18 15 18 10 62 55.",
                    "sid": 139,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "95 55.",
                    "sid": 140,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "95 66.",
                    "sid": 141,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "67 Table 2: DP corpus comparison for OPUS features based on frequent vs. domain-relevant verbs anti2 for testing.13 As Table 1 shows, OPUS features provide substantial and statistically significant gains (p < .001).",
                    "sid": 142,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a reality check to verify that it is domain- relevant verb usages and the encoding of events they embody that truly drives improved classification, we extracted OPUS features for the 14 most frequent verbs found in the DP Corpus that were not in our manually created list of kill verbs, along with their nominalizations.",
                    "sid": 143,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows the results of a classification experiment using a single train-test split, training on 1062 documents from pro1, pro2, anti1, anti2 and testing on 84 test documents from the significantly smaller remaining sites.",
                    "sid": 144,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using OPUS features for the most frequent non-kill verbs fails to beat the baseline, establishing that it is not simply term frequency, the presence of particular grammatical relations, or a larger feature set that the kill- verb OPUS model was able to exploit, but rather the properties of event encodings involving the kill verbs themselves.",
                    "sid": 145,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Predicting Points of View in the.",
                    "sid": 146,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "IsraeliPalestinian Conflict In order to make a direct comparison here with prior state-of-the-art work on sentiment analysis, we report on sentiment classification using OPUS features in experiments using a publicly available corpus involving opposing perspectives, the Bitter Lemons 13Site (# of documents): pro1= clarkprosecutor.org (437), pro2= prodeathpenalty.com (117), anti1= deathpenaltyinfo.org (319), anti2= nodeathpenalty.org (212) (hence BL) corpus introduced by Lin et al.",
                    "sid": 147,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006).",
                    "sid": 148,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Corpus.",
                    "sid": 149,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Bitter Lemons corpus comprises essays posted at www.bitterlemons.org, which, in the words of the site, “present Israeli and Palestinian viewpoints on prominent issues of concern”.",
                    "sid": 150,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a corpus, it has a number of interesting properties.",
                    "sid": 151,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, its topic area is one of significant interest and considerable controversy, yet the general tenor of the web site is one that eschews an overly shrill or extreme style of writing.",
                    "sid": 152,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, the site is organized in terms of issue-focused weekly editions that include essays with contrasting viewpoints from the site’s two editors, plus two essays, also contrasting, from guest editors.",
                    "sid": 153,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This creates a natural balance between the two sides and across the subtopics being discussed.",
                    "sid": 154,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The BL corpus as prepared by Lin et al. contains 297 documents from each of the Israeli and C lassification Accuracy, B L C orpus Test S cenario 1 (GeneralFilter) 12 98 10 96 8 94 92 6 90 4 88 2 86 0 84 Individua l Ex pe rim e nt (ρ va lue s a nd a ccura cy) C lassification Accuracy, B L C orpus Test Scenario 2 (GeneralFilter) 12 85 10 8 80 6 ρ (Verb) ρ (Noun) OPUS Lin 2006 NB-B Lin 2006 SVM ρ (Verb) ρ (Noun) OPUS Palestinian viewpoints, averaging 700800 words in length.",
                    "sid": 155,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lin et al. classifiers.",
                    "sid": 156,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lin et al. report results on 4 2 0 Individua l Ex pe rim e nt (ρ va lue s a nd a ccura cy) 75 Lin 2006 NB-B Lin 2006 SVM.",
                    "sid": 157,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "70 65 distinguishing Israeli vs. Palestinian perspectives using an SVM classifier, a naive Bayes classifier NB-M using maximum a posteriori estimation, and a naive Bayes classifier NB-B using full Bayesian inference.",
                    "sid": 158,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Document perspectives are labeled clearly on the site.)",
                    "sid": 159,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We continue to use the WEKA SVM classifier, but compare our results to both their SVM and NB-B, since the latter achieved their best results.",
                    "sid": 160,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "OPUS features.",
                    "sid": 161,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in Section 5.1, we experimented with OPUS features driven by automatically extracted lists of domain-relevant verbs.",
                    "sid": 162,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For these experiments, we included domain-relevant nouns, and we varied a threshold ρ for the relative frequency ratio, including only terms for which log(R(t)) > ρ.",
                    "sid": 163,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we introduced a general filter on OPUS features, eliminating syntactic dependency types that do not usefully reflect semantically relevant properties: det, predet, preconj, prt, aux, auxpas, cc, punct, complm, mark, rel, ref, expl.",
                    "sid": 164,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation.",
                    "sid": 165,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lin et al. describe two test scenarios.",
                    "sid": 166,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first, referred to as Test Scenario 1, they trained on documents written by the site’s guests, and tested on documents from the site’s editors.",
                    "sid": 167,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Test Scenario 2 represents the reverse, training on documents from the site editors and testing on documents Figure 1: Results on the Bitter Lemons corpus from guest authors.",
                    "sid": 168,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in our site-wise cross validation for the DP corpus, this strategy ensures that what is being tested is classification according to the viewpoint, not author or topic.",
                    "sid": 169,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 (top) summarizes a large set of experiments for Test Scenario 1, in which we varied the values of ρ for verbs and nouns.",
                    "sid": 170,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each experiment, using a particular (ρ(verbs), ρ(nouns)), corresponds to a vertical strip on the x-axis.",
                    "sid": 171,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The points on that strip include the ρ values for verbs and nouns, measured by the scale on the y-axis at the left of the figure; the accuracy of Lin et al.’s SVM (88.22% accuracy, constant across all our variations); the accuracy of Lin et al.’s NB-B classifier (93.46% accuracy, constant across all our variations), and the accuracy of our SVM classifier using OPUS features, which varies depending on the ρ values.",
                    "sid": 172,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Across 423 experiments, our average accuracy is 95.41%, with the best accuracy achieved being 97.64%.",
                    "sid": 173,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our classifier underperformed NB-B slightly, with accuracies from 92.93% to 93.27%, in just 8 of the 423 experiments.",
                    "sid": 174,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 (bottom) provides a similar summary for experiments in Test Scenario 2.",
                    "sid": 175,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first thing to notice is that accuracy for all methods is lower than for Test Scenario 1.",
                    "sid": 176,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not terribly surprising: it is likely that training a classifier on the more uniform authorship of the editor documents builds a model that generalizes less well to the more diverse authorship of the guest documents (though accuracy is still quite high).",
                    "sid": 177,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, the editor-authored documents comprise a smaller training set, consisting of 7,899 sentences, while the guest documents have a total of 11,033 sentences, a 28% difference.",
                    "sid": 178,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In scenario 2, we obtain average accuracy across experiments of 83.12%, with a maximum of 85.86%, in this case outperforming the 81.48% obtained by Lin’s SVM fairly consistently, and in some cases approaching or matching NB-B at 85.85%.",
                    "sid": 179,
                    "ssid": 69,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "6",
            "sents": [
                {
                    "text": "Pang and Lee’s (2008) excellent monograph provides a thorough, well organized, and relatively recent description of computational work on sentiment, opinion, and subjectivity analysis.",
                    "sid": 180,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The problem of classifying underlying sentiment in statements that are not overtly subjective is less studied within the NLP literature, but it has received some attention in other fields.",
                    "sid": 181,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These include, for example, research on content analysis in journalism, media studies, and political economy (Gentzkow and Shapiro, 2006a; Gentzkow and Shapiro, 2006b; Groseclose and Milyo, 2005; Fader et al., 2007); automatic identification of customer attitudes for business email routing (Durbin et al., 2003).",
                    "sid": 182,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And, of course, the study of perceptions in politics and media bears a strong family resemblance to real-world marketing problems involving reputation management and business intelligence (Glance et al., 2005).",
                    "sid": 183,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Within computational linguistics, what we call implicit sentiment was introduced as a topic of study by Lin et al.",
                    "sid": 184,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006) under the rubric of identifying perspective, though similar work had begun earlier in the realm of political science (e.g.",
                    "sid": 185,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Laver et al., 2003)).",
                    "sid": 186,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other recent work focusing on the notion of perspective or ideology has been reported by Martin and Vanberg (2008) and Mullen and Malouf (2008).",
                    "sid": 187,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among prior authors, Gamon’s (2004) research is perhaps closest to the work described here, in that he uses some features based on a sentence’s logical form, generated using a proprietary system.",
                    "sid": 188,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, his features are templatic in nature in that they do not couple specific lexical entries with their logical form.",
                    "sid": 189,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hearst (1992) and Mulder et al.",
                    "sid": 190,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) describe systems that make use of argument structure features coupled with lexical information, though neither provides implementation details or experimental results.",
                    "sid": 191,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In terms of computational experimentation, work by Thomas et al.",
                    "sid": 192,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006), predicting yes and no votes in corpus of United States Congressional floor debate speeches, is quite relevant.",
                    "sid": 193,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They combined SVM classification with a min-cut model on graphs in order to exploit both direct textual evidence and constraints suggested by the structure of Congressional debates, e.g. the fact that the same individual rarely gives one speech in favor of a bill and another opposing it.",
                    "sid": 194,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have extend their method to use OPUS features in the SVM and obtained significant improvements over their classification accuracy (Greene, 2007; Greene and Resnik, in preparation).",
                    "sid": 195,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "7",
            "sents": [
                {
                    "text": "In this paper we have introduced an approach to implicit sentiment motivated by theoretical work in lexical semantics, presenting evidence for the role of semantic properties in human sentiment judgments.",
                    "sid": 196,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This research is, to our knowledge, the first to draw an explicit and empirically supported connection between theoretically motivated work in lexical semantics and readers’ perception of sentiment.",
                    "sid": 197,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we have reported positive sentiment classification results within a standard supervised learning setting, employing a practical first approximation to those semantic properties, including positive results in a direct comparison with the previous state of the art.",
                    "sid": 198,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because we computed OPUS features for opinionated as well as non-evaluative language in our corpora, obtaining overall positive results, we believe these features may also improve conventional opinion labeling for subjective text.",
                    "sid": 199,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This will be investigated in future work.",
                    "sid": 200,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "The authors gratefully acknowledge useful discussions with Don Hindle and Chip Denman.",
                    "sid": 201,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}