{
    "ID": "N09prod",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "More and more product reviews emerge on E-commerce sites and microblog systems nowadays.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This information is useful for consumers to know the others' opinion on the products before purchasing, or companies who want to learn the public sentiment of their products.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to effectively utilize this information, this paper has done some sentiment analysis on these multi-source reviews.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For one thing, a binary classification framework based on the aspects of product is proposed.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both explicit and implicit aspect is considered and multiple kinds of feature weighing and classifiers are compared in our framework.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For another, we use several machine learning algorithms to classify the product reviews in microblog systems into positive, negative and neutral classes, and find OVA-SVMs perform best.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Part of our work in this paper has been applied in a Chinese Product Review Mining System.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Keywords: product review, sentiment analysis, microblog, SVM.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "With the development of Internet, more and more customers get used to purchasing products on E-commerce sites such as 360buy1 and Newegg2.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They also write reviews on the products after using them, which produce a large number of reviews on the Internet.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, microblog, a system that allows users to post messages of no more than 140 words, and share information instantaneously based on the relationship between users, is under rapid development, such as Twitter3, Sina microblog4 and Tencent microblog5.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A lot of microblogs contain latest product reviews.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reviews from the above two large data sources contain much useful information for users and companies.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Users can make better purchasing decisions based on these reviews, while companies can also analyze customers' satisfaction according to these reviews, and further improve the quality of their products.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since there is a mass of 1 http://www.360buy.com 2 http://www.newegg.com.cn 3 http://www.twitter.com 4 http://weibo.com 5 http://t.qq.cn D.-S.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Huang et al.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Eds.): ICIC 2012, LNCS 7389, pp.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "301–308, 2012.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "© SpringerVerlag Berlin Heidelberg 2012 product reviews and a single user cannot read all of them, automatically mining the reviews from multiple sources is particularly important.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most reviews in Chinese E-commerce sites are labeled with advantage or disadvantage, which is naturally suitable for binary classification.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The state-of-art research in Chinese sentiment analysis mainly focuses on the whole review classification, while customers often desire a more detailed understanding of products.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, they want to know others' opinion on the battery of a cell phone.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we propose a framework of sentiment classification at aspect level to solve this problem.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our framework, not only explicit but also implicit aspects are taken into account.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To our knowledge, no implicit aspect discovery work of product review in Chinese language has been reported before.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the reviews of each aspect, the unigram features of words are used as text features.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also compare the performance of three feature weighing strategies, three reduction dimension, and three classification approaches.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sentiment analysis for reviews of products on microblogs is in its infancy.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides the microblogs that express opinion on the products, some microblogs only give some statements relative to the products, which contain no sentiment polarity, or are neutral.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, in this paper, we exploit linear regression, multi-class classification, two-stage classification and Mincut model optimization to classify the product related microblogs into three classes, and compare the performance of these methods.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Sentiment classification mainly includes two methods: supervised learning and unsupervised learning.",
                    "sid": 31,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Turney[1] proposed a simple unsupervised method to classify reviews into positive and negative categories.",
                    "sid": 32,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pang[2] used Naive Bayes (NB), Max entropy (ME) and SVM separately as supervised learning algorithms for binary classification of reviews.",
                    "sid": 33,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides these, Pang[3] exploited regression and One-Vs-All SVMs to predict the score for classification, namely the multi-classification, which can also be realized by combining binary classifiers in a two-stage manner.",
                    "sid": 34,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pang[4] and Su[5] both optimized their multi-classification results using the Mincut model.",
                    "sid": 35,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For sentiment classification in microblogs, Go[6] was the first to classify Twitter data into two classes (positive and negative).",
                    "sid": 36,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Barbosa[7] classified Twitter data into three classes in a two-stage manner.",
                    "sid": 37,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Jiang[8] analyzed topic related sentiment for Twitter text.",
                    "sid": 38,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on the two-stage binary classification result, and the forwarding relationship between users, the performance was promoted using the method of graph.",
                    "sid": 39,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But for Chinese microblogs systems, only text can be obtained instead of the relationship between users and microblogs.",
                    "sid": 40,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "binary sentiment classification based on product aspect. ",
            "number": "3",
            "sents": [
                {
                    "text": "The overall flow chart about polarity classification (positive and negative) based on product aspect is shown in Fig.1.",
                    "sid": 41,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fig.",
                    "sid": 42,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 43,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The polarity classification (positive and negative) based on product aspect framework Aspect, Aspect Word.",
                    "sid": 44,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Product aspect refers to some attribute, component, or function of the product.",
                    "sid": 45,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word or phrase used to represent the aspect of product is called the aspect word.",
                    "sid": 46,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Aspect is actually the concept at semantic level, and the aspect word is the external presentation form of the aspect.",
                    "sid": 47,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different categories of products generally have a different set of aspects.",
                    "sid": 48,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Product aspect can be divided into explicit aspect and implicit aspect.",
                    "sid": 49,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Explicit aspect refers to the aspect word which describes the product performance or function can be directly found in the product reviews.",
                    "sid": 50,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Implicit aspect may be found after the sentence semantic understanding because there are no aspect words in review sentence.",
                    "sid": 51,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Preprocessing.",
                    "sid": 52,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to get relatively clean text about product reviews, messy code will be removed in the preprocessing stage according to a user-defined messy code list.",
                    "sid": 53,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next we use the word segmentation software tools to make the sentence processed.",
                    "sid": 54,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are some words that appear in almost all of the text which are called stop words.",
                    "sid": 55,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The text content is represented more accurately after deleting stop words.",
                    "sid": 56,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some words in the traditional stop words list is retained because they have sentiment polarity which is useful information for sentiment classification.",
                    "sid": 57,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Build Aspect Words List.",
                    "sid": 58,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use a statistics-based algorithm to automatically build the vocabulary about the product aspects.",
                    "sid": 59,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here is the algorithm: 1.",
                    "sid": 60,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Count occurrences number of all the nominal words..",
                    "sid": 61,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We count the occurrences number of all the unigram whose part of speech(POS) tagging is noun in the reviews of same product category.",
                    "sid": 62,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 63,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Filter high-frequency words.",
                    "sid": 64,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final aspect words list is filtered by threshold of high frequency and product specifications.",
                    "sid": 65,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Review Sentences Breakup.",
                    "sid": 66,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First of all, we break a review into sentences according to various sentence end punctuations, each of which is further cut into short sentences (SS) with comma.",
                    "sid": 67,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then each SS is assigned to different sentiment categories of different aspects according to the aspect vocabulary made in advance.",
                    "sid": 68,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, if an SS has implicit aspect, its words should also be correctly distributed.",
                    "sid": 69,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Implicit Aspect Discovery.",
                    "sid": 70,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if there is a word \"beautiful\" in the sentence and without any explicit aspect word appeared, we also need to know \"beautiful\" is likely in the description of the product's appearance which is just the implicit aspect of product.",
                    "sid": 71,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The discovery of implicit aspects needs to balance the following factors: 1.",
                    "sid": 72,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Calculate mutual information (MI) scores between adjectives in the current SS and each aspect.",
                    "sid": 73,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adjectives with most relevant aspects will be calculated and the aspect of the entire SS is determined by voting.",
                    "sid": 74,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 75,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the above rule doesn't work, the SS is just assigned to the previous SS's aspect..",
                    "sid": 76,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.5 Text Feature Representation.",
                    "sid": 77,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After the processing mentioned above, we get all the review sentences in each aspect in each category, and vector space model is employed to represent them.",
                    "sid": 78,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Features of the review text using word-based unigram, but different word have the different ability and importance to represent the text which is called weight.",
                    "sid": 79,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, BOOL, TF, and TFIDF are used as feature weights.",
                    "sid": 80,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BOOL weight means that if the count of the term appears in the current document greater than zero, the weight is 1, otherwise 0.",
                    "sid": 81,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TF (term frequency) refers to the frequency of the words occurrence in the file.",
                    "sid": 82,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "IDF (inverse document frequency) measure the common importance of the word.",
                    "sid": 83,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we use chi-square statistics to reduce feature dimension.",
                    "sid": 84,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.6 Classifier.",
                    "sid": 85,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Naive Bayes.",
                    "sid": 86,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Navie Bayes is a simple model which calculates posterior probability of each class based on the priori probability and the likelihood.",
                    "sid": 87,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Class with the largest posterior probability is assigned as the class of the document.",
                    "sid": 88,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "KNN.",
                    "sid": 89,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic idea of the KNN algorithm is considering the K nearest (the most K similar) texts in the training set of the new given text.",
                    "sid": 90,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The label of the new text is determined by these K texts.",
                    "sid": 91,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SVM.",
                    "sid": 92,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SVM is a popular classification algorithm which compresses the raw data set to support vector set and learn a decision hyperplane in the vector space.",
                    "sid": 93,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This hyperplane best splits the data points into the two classes.",
                    "sid": 94,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, NB, KNN and SVM are implemented using data mining tool Weka6.",
                    "sid": 95,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 http://www.cs.waikato.ac.nz/ml/weka/",
                    "sid": 96,
                    "ssid": 56,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "sentiment analysis on product reviews in microblog system. ",
            "number": "4",
            "sents": [
                {
                    "text": "4.1 Text Feature Extraction.",
                    "sid": 97,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Like mentioned in Section 3.1, stop words and messy code in the microblog will be removed, and then the Chinese word segmentation and POS tagging will be done.",
                    "sid": 98,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The vector space model is still employed to represent each microblog.",
                    "sid": 99,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features are unigrams and the weight is BOOL value.",
                    "sid": 100,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we can take the advantage of characteristic of microblog to portray it better and reduce the feature dimension.",
                    "sid": 101,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Emoticons.",
                    "sid": 102,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the text form of emoticon in microblog text is \"[ha ha]\".",
                    "sid": 103,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the positive emoticons will be converted into token \"POS\", and all negative into token \"NEG\" according to the manual defined emotions list.",
                    "sid": 104,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Usernames.",
                    "sid": 105,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Forwarding mechanism of microblog systems makes microblog amazing transmitted.",
                    "sid": 106,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is in the form of @ + username (such as @ryanking1219).",
                    "sid": 107,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So we use string \"USERNAME\" to instead all words beginning with @.",
                    "sid": 108,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Links.",
                    "sid": 109,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Users like to include the URL which usually begins with \"http\" when they share videos or news, such as http://t.cn/aCKddG.",
                    "sid": 110,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All website links are normalized to the token \"URL\".",
                    "sid": 111,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Topics.",
                    "sid": 112,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In microblog systems, topic starts with \"#\" and also ends with \"#\".",
                    "sid": 113,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will replace all the string in this form with an equivalence class string \"TOPIC\".",
                    "sid": 114,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Two-Stage SVM.",
                    "sid": 115,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 1: Subjectivity Classifier Neutral samples in the training data is considered as positive examples, while positive and negative samples as negative cases to train the classifier.",
                    "sid": 116,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Do binary classification on the test data for subjective and objective detection.",
                    "sid": 117,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 2: Polarity Classifier Positive samples in the training data is considered as positive examples, while negative samples as negative cases to train the classifier.",
                    "sid": 118,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Do binary classification on the test data which is correctly divided into subject class in Step 1 for positive and negative detection.",
                    "sid": 119,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Minimum Cut Model Optimization.",
                    "sid": 120,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inspired by work of Pang[4] and Su[5], we also use Minimum cut (Mincut) model to optimize the Two-stage SVM result.",
                    "sid": 121,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Binary classification with Mincut in graph is based on the idea that similar items should be split in the same cut.",
                    "sid": 122,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We build an undirected graph G with vertices {s, t, v1, v2, …, vn}; s is the source and t is the sink, and all items in the test data are seen as vertices vi.",
                    "sid": 123,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each vertex v is connected to s and t via a weighted edge.",
                    "sid": 124,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The weight is the estimation of the probability converted from SVM classifier output.",
                    "sid": 125,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each edges (vi, vk) with weight assoc(vi, vk) expresses the similarity between vi and vk and how important they should be in the same class.",
                    "sid": 126,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we remove a set of edges to divide graph into two disconnected sub-graphs.",
                    "sid": 127,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The vertices via s are positive instances and the vertices via t are negative instances.",
                    "sid": 128,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We penalize when putting highly similar items into different classes, so the best split is one which removes edges with lowest weights.",
                    "sid": 129,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is exactly the Mincut of graph.",
                    "sid": 130,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because the capacity of the Mincut equals the max flow value, we can employ EdmondsKarp algorithm to compute the Mincut.",
                    "sid": 131,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In experiment, we set α * cos (vi , v j ) , if α * cos (vi , v j ) > t i j  0 , otherwise (1) where cos(vi, vj) is the text similarity between vi and vj.",
                    "sid": 132,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Constant α is the scale factor of association scores.",
                    "sid": 133,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only scores higher than threshold t will be taken into consideration.",
                    "sid": 134,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.4 Regression.",
                    "sid": 135,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Text classification is also a problem that utilizes text features to predict a category label, and similar entries should have similar category labels.",
                    "sid": 136,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most classic model is the linear regression function which is actually a linear weighted sum of all the features.",
                    "sid": 137,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final score is rounded as a category label.",
                    "sid": 138,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.5 OVA-SVMs.",
                    "sid": 139,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the original SVM is used to solve binary classification problem, we can combine several SVM classifiers to achieve multi-class classification, such as one- versus-all method (for short of OVA-SVMs).",
                    "sid": 140,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When Training each classifier we mark one category samples as positive examples, and all the rest samples as negative examples.",
                    "sid": 141,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So that k categories of samples can construct k SVM classifiers in turn.",
                    "sid": 142,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Class label of the test sample assigned to the class which has the largest classification function value.",
                    "sid": 143,
                    "ssid": 47,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "5",
            "sents": [
                {
                    "text": "5.1 Sentiment Classification Based on Product Aspect.",
                    "sid": 144,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We downloaded 821 cell phone products data from the 360buy and Newegg, and finally get 663,537 advantages reviews and 314,529 disadvantage reviews.",
                    "sid": 145,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CHI dimension reduction selects 5%, 20% and 100% words most relevant to each aspect of each product category, represented as CHI-5, CHI-20, and CHI-100.",
                    "sid": 146,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of course, from the whole view of each product category, the most relevant words of each aspect will be overlapped with each other.",
                    "sid": 147,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance evaluation methods commonly apply PRECISION, RECALL, and F- values, but these only represent local significance (i.e., the performance of each aspect in each product category).",
                    "sid": 148,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If you want to evaluate the overall classification performance, all the aspects of product category need to be taken into account to calculate the F-value of the MICRO AVERAGING and MACRO AVERAGING.",
                    "sid": 149,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Micro-average gives the same weight to each document in each product category while Macro-average gives the same weight to each aspect in each product category.",
                    "sid": 150,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results are illustrated in Fig.2.",
                    "sid": 151,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fig.",
                    "sid": 152,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 153,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cell phone experiment result (17 aspects) The following conclusions could be drawn from the experimental result: First, the best combination is BOOLSVM.",
                    "sid": 154,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, the consequent of TF is very close to the TFIDF, but is slightly lower than BOOL.",
                    "sid": 155,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, the SVM classification performance is better than NB and KNN.",
                    "sid": 156,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Last but not least, CHI-5 result is similar with CHI-20 and CHI-100, even sometimes CHI-5 perform best, so dimension reduction is proved effective.",
                    "sid": 157,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Sentiment Analysis on Product Reviews in Microblog System.",
                    "sid": 158,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We select 5 popular items including \"Nokia\", \"iphone 4s\", \"E72i\", \"Lenovo\" and \"Canon\".",
                    "sid": 159,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For all of these items, we downloaded 2,100 microblogs through the API provided by Sina microblog and Tencent microblog from October 2011 to November 2011.",
                    "sid": 160,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We manually labeled all the microblogs and finally obtain 729 positive, 345 negative, and 1,026 neutral microblogs respectively.",
                    "sid": 161,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are listed in Table 1.",
                    "sid": 162,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1.",
                    "sid": 163,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Result for microblog classification Regression OVA-SV Ms Two-stage SVM Two-stage SVM + MinCut Accuracy 51.6% 64.5% 62.6% 64.0% As shown in Table 1, the OVA-SVMs classifier is best.",
                    "sid": 164,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two-stage SVM classifier after optimization with the minimum cut model (when parameter α = 0.2, t = 0.5) has 1.4% increase in performance, and reach almost the same effect of OVA-SVMs.",
                    "sid": 165,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "6",
            "sents": [
                {
                    "text": "This paper makes sentiment analysis on product reviews from multiple data sources.",
                    "sid": 166,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Firstly, a binary sentiment classification framework based on the aspects of the product is proposed.",
                    "sid": 167,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the granularity of aspect, we use unigram as review feature, and adopt BOOL weight and SVM classifier to get the best results.",
                    "sid": 168,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondly, we classify our product review in microblog systems into three classes.",
                    "sid": 169,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "OVA-SVMs method offers the optimal result.",
                    "sid": 170,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, Work in Section 3 has been partially applied in a Chinese Product Review Mining System7, and Section 4 will be applied soon.",
                    "sid": 171,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}