{
    "ID": "N10-1019",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We present results from a range of experiments on article and preposition error correction for non-native speakers of English.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first compare a language model and error- specific classifiers (all trained on large English corpora) with respect to their performance in error detection and correction.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then combine the language model and the classifiers in a meta-classification approach by combining evidence from the classifiers and the language model as input features to the metaclassifier.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The metaclassifier in turn is trained on error-annotated learner data, optimizing the error detection and correction performance on this domain.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The meta-classification approach results in substantial gains over the classifier- only and language-model-only scenario.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the metaclassifier requires error-annotated data for training, we investigate how much training data is needed to improve results over the baseline of not using a metaclassifier.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All evaluations are conducted on a large error- annotated corpus of learner English.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Research on the automatic correction of grammatical errors has undergone a renaissance in the past decade.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is, at least in part, based on the recognition that non-native speakers of English now outnumber native speakers by 2:1 in some estimates, so any tool in this domain could be of tremendous value.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While earlier work in both native and non-native error correction was focused on the construction of grammars and analysis systems to detect and correct specific errors (see Heift and Schulze, 2005 for a detailed overview), more recent approaches have been based on data-driven methods.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The majority of the data-driven methods use a classification technique to determine whether a word is used appropriately in its context, continuing the tradition established for contextual spelling correction by Golding (1995) and Golding and Roth (1996).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The words investigated are typically articles and prepositions.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They have two distinct advantages as the subject matter for investigation: They are a closed class and they comprise a substantial proportion of learners’ errors.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The investigation of preposition corrections can even be narrowed further: amongst the more than 150 English prepositions, the usage of the ten most frequent prepositions accounts for 82% of preposition errors in the 20 million word Cambridge University Press Learners’ Corpus.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Learning correct article use is most difficult for native speakers of an L1 that does not overtly mark definiteness and indefiniteness as English does.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prepositions, on the other hand, pose difficulties for language learners from all L1 backgrounds (Dalgish, 1995; Bitchener et al., 2005).",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Contextual classification methods represent the context of a preposition or article as a feature vector gleaned from a window of a few words around the preposition/article.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different systems typically vary along three dimensions: choice of features, choice of classifier, and choice of training data.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Features range from words and morphological information (Knight and Chander, 1994) to the inclusion of part-of-speech tags (Minnen et al., 2000; Han et al., 2004, 2006; Chodorow et al., 2007; Gamon et al., 2008, 2009; Izumi et al., 2003, 2004; Tetrault and Chodorow, 2008) to features based on linguistic analysis and on WordNet (Lee, 2004; DeFelice and Pulman, 2007, 2008).",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Knight and Chander (1994) and Gamon et al.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) used decision tree classifiers but, in general, maximum entropy classifiers have become the classification 163 Human Language Technologies: The 2010 Annual Conference of the North American Chapter of the ACL, pages 163–171, Los Angeles, California, June 2010.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2010 Association for Computational Linguistics algorithm of choice.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training data are normally drawn from sizeable corpora of native English text (British National Corpus for DeFelice and Pulman (2007, 2008), Wall Street Journal in Knight and Chander (1994), a mix of Reuters and Encarta in Gamon et al.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008, 2009).",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to partially address the problem of domain mismatch between learners’ writing and the news-heavy data sets often used in data-driven NLP applications, Han et al.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004, 2006) use 31.5 million words from the MetaMetrics corpus, a diverse corpus of fiction, nonfiction and textbooks categorized by reading level.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the classification approach to error detection, there is a line of research - going back to at least Atwell (1987) - that uses language models.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idea here is to detect errors in areas where the language model score is suspiciously low.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Atwell (1987) uses a part-of-speech tag language model to detect errors, Chodorow and Leacock (2000) use mutual information and chi square statistics to identify unlikely function word and part-of-speech tag sequences, Turner and Charniak (2007) employ a language model based on a generative statistical parser, and Stehouwer and van Zaanen (2009) investigate a diverse set of language models with different backoff strategies to determine which choice, from a set of confusable words, is most likely in a given context.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gamon et al.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008, 2009) use a combination of error-specific classifiers and a large generic language model with hand- tuned heuristics for combining their scores to maximize precision.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, Yi et al.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) and Her- met et al.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) use n-gram counts from the web as a language model approximation to identify likely errors and correction candidates.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "our approach. ",
            "number": "2",
            "sents": [
                {
                    "text": "We combine evidence from the two kinds of data- driven models that have been used for error detection and correction (error-specific classifiers and a language model) through a metaclassifier.",
                    "sid": 35,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the term primary models for both the initial error- specific classifiers and a large generic language model.",
                    "sid": 36,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The metaclassifier takes the output of the primary models (language model scores and class probabilities) as input.",
                    "sid": 37,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using a metaclassifier for ensemble learning has been proven effective for many machine learning problems (see e.g. Diette- rich 1997), especially when the combined models are sufficiently different to make distinct kinds of errors.",
                    "sid": 38,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The meta-classification approach also has an advantage in terms of data requirements: Our primary models are trained on large sets of widely available well-formed English text.",
                    "sid": 39,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The metaclassifier, in contrast, is trained on a smaller set of error-annotated learner data.",
                    "sid": 40,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This allows us to address the problem of domain mismatch: We can leverage large well-formed data sets that are substantially different from real-life learner language for the primary models, and then fine-tune the output to learner English using a much smaller set of expensive and hard-to-come-by annotated learner writing.",
                    "sid": 41,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the purpose of this paper, we restrict ourselves to article and preposition errors.",
                    "sid": 42,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The questions we address are: 1.",
                    "sid": 43,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How effective is the meta-classification ap-.",
                    "sid": 44,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "proach compared to either a classifier or a lan guage model alone?",
                    "sid": 45,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 46,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How much error-annotated data are sufficient.",
                    "sid": 47,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "to produce positive results above the baseline of using either a language model or a classifier alone?",
                    "sid": 48,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our evaluation is conducted on a large data set of error-annotated learner data.",
                    "sid": 49,
                    "ssid": 15,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental design. ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 Primary Models.",
                    "sid": 50,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our error-specific primary models are maximum entropy classifiers (Rathnaparki 1997) for articles and for prepositions.",
                    "sid": 51,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Features include contextual features from a window of six tokens to the right and left, such as lexical features (word), part-of- speech tags, and a handful of “custom features”, for example lexical head of governing VP or governed NP (as determined by part-of-speech-tag based heuristics).",
                    "sid": 52,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For both articles and prepositions, we employ two classifiers: the first determines the probability that a preposition/article is present in a given context (presence classifier), the second classifier determines the probability that a specific article or preposition is chosen (choice classifier).",
                    "sid": 53,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A training event for the presence classifier is any noun phrase boundary that is a potential location for a preposition or article.",
                    "sid": 54,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whether a location is an NP boundary and a potential site for an article/preposition is determined by a simple heuristic based on part-of-speech tags.",
                    "sid": 55,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The candidates for article choice are the and a/an, and the choice for prepositions is limited to twelve very frequent prepositions (in, at, on, for, since, with, to, by, about, from, of, as) which account for 86.2 % of preposition errors in our learner data.",
                    "sid": 56,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At prediction time, the presence and choice classifiers produce a list of potential changes in preposition/article usage for the given context.",
                    "sid": 57,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the application of our system consists of suggesting corrections to a user, we do not consider identity operations where the suggested word choice equals the actual word choice.",
                    "sid": 58,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a potential preposition/article location where there is no preposition/article, each of the candidates is considered for an insertion operation.",
                    "sid": 59,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a potential location that contains a preposition/article, the possible operations include deletion of the existing token or substitution with another preposition/article from the candidate set.",
                    "sid": 60,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training data for the classifiers is a mix of primarily well-formed data sources: There are about 2.5 million sentences, distributed roughly equally across Reuters newswire, Encarta encyclopedia, UN proceedings, Europarl and web-scraped general domain data1.",
                    "sid": 61,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the total set of candidate operations (substitutions, insertions, and deletions) that each combi nation of presence and choice classifier produces for prepositions, we consider only the top three highest-scoring operations2.",
                    "sid": 62,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our language model is trained on the Gigaword corpus (Linguistic Data Consortium, 2003) and utilizes 7-grams with absolute discount smoothing (Gao, Goodman, and Miao, 2001; Nguyen, Gao, and Mahajan, 2007).",
                    "sid": 63,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each suggested revision from the preposition/article classifiers (top three for pre positions, all revisions from the article classifiers) are scored by the language model: for each revision, the language model score of the original and the suggested rewrite is recorded, as is the language model entropy (defined as the language model probability of the sentence, normalized by sentence length).",
                    "sid": 64,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 We are not able to train the error-specific classifiers on a. larger data set like the one we use for the language model.",
                    "sid": 65,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the 2.5 million sentences used in the classifier training already produce 16.5 million training vectors.",
                    "sid": 66,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 This increases runtime performance because fewer calls need.",
                    "sid": 67,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "to be made to the language model which resides on a server.",
                    "sid": 68,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we noticed that overall precision is increased by not considering the less likely suggestions by the classifier.",
                    "sid": 69,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 MetaClassifier.",
                    "sid": 70,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the metaclassifier we chose to use a decision tree, trained with the WinMine toolkit (Chickering 2002).",
                    "sid": 71,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The motivation for this choice is that decision trees are well-suited for continuously valued features and for non-linear decision surfaces.",
                    "sid": 72,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An obvious alternative would be to use a support vector machine with non-linear kernels, a route that we have not explored yet.",
                    "sid": 73,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The feature set for the metaclassifier consists of the following scores from the primary models, including some arithmet ic combinations of scores: Ratio and delta of Log LM score of the original word choice and the suggested revision (2 features) Ratio and delta of the LM entropy for original and suggested revision (2 features).",
                    "sid": 74,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Products of the above ratios/deltas and classifier choice/presence probabilities Type of operation: deletion, insertion, substitution (3 features) P(presence) (1 feature) For each preposition/article choice: P(choice): 13 features for prepositions (12 prepositions and other for a preposition not in that set), 2 for articles Original token: none (for insertion) or the original preposition/article (13 features for prepositions, 2 for articles) Suggested token: none (for deletion) or the suggested preposition/article (13 features for prepositions, 2 for articles)The total number of features is 63 for preposi tions and 36 for articles.",
                    "sid": 75,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The metaclassifier is trained by collecting suggested corrections from the primary models on the error annotated data.",
                    "sid": 76,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The error-annotation provides the binary class label, i.e. whether the suggested revision is correct or incorrect.",
                    "sid": 77,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the suggested revision matches an annotated correction, it counts as correct, if it does not match it counts as incorrect.",
                    "sid": 78,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To give an example, the top three preposition operations for the position before this test in the sentence I rely to this test are: Change_to_on Delete_to Change_to_of The class label in this example is \"suggestion correct\", assuming that the change of preposition is annotated in the data.",
                    "sid": 79,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The operation Change_to_on in this example has the following feature values for the basic classifier and LM scores: classifier P(choice): 0.755 classifier P(presence): 0.826 LM logP(original): -17.373 LM logP(rewrite): -14.184 An example of a path through the decision tree metaclassifier for prepositions is: LMLogDelta is Not < -8.59 and LMLogDelta is Not < -3.7 and ProductRewriteLogRatioConf is Not < 0.00115 and LMLogDelta is Not < -1.58 andProductOrigEntropyRatioChoiceConf is Not < 0.00443 and choice_prob is Not < 0.206 and Original_of is 0 and choice_prob is Not < 0.329 and to_prob is < 0.108 and Suggested_on is 1 and Original_in is 0 and choice_prob is Not < 0.497 and choice_prob is Not < 0.647 and presence_prob is Not < 0.553 The leaf node at the end of this path has a 0.21 probability of changing “to” to “on” being a cor rect rewrite suggestion.",
                    "sid": 80,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features selected by the decision trees range across all of the features discussed above.",
                    "sid": 81,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For both the article and preposition metaclassifiers, the ranking of features by importance (as measured by how close to the root the decision tree uses the feature) follows the order in which features are listed.",
                    "sid": 82,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Data.",
                    "sid": 83,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast to the training data for the primary models, the metaclassifier is trained on error- annotated data from the Cambridge University Press Learners’ Corpus (CLC).",
                    "sid": 84,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The version of CLC that we have licensed currently contains a total of 20 million words from learner English essays written as part of one of Cambridge’s English Language Proficiency Tests (ESOL) – at all proficiency levels.",
                    "sid": 85,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The essays are annotated for error type, erroneous span and suggested correction.",
                    "sid": 86,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first perform a random split of the essays into 70% training, 20% test and 10% for parameter tuning.",
                    "sid": 87,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, we create error-specific training, tuning and test sets by performing a number of clean up steps on the data.",
                    "sid": 88,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we correct all errors that were flagged as being spelling errors, since we presume that the user will perform a spelling check on the data before proceeding to grammatical proofing.",
                    "sid": 89,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Spelling errors that were flagged as morphology errors were left alone.",
                    "sid": 90,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By the same token, we corrected confused words that are covered by MS Word.",
                    "sid": 91,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then revised British English spelling to American English spelling conventions.",
                    "sid": 92,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we eliminated all annotations for non- pertinent errors (i.e., non-preposition/article errors, or errors that do not involve any of the targeted prepositions), but we maintained the original (erroneous) text for these.",
                    "sid": 93,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This makes our task harder since we will have to learn how to make predictions in text containing multiple errors, but it also is a more realistic scenario given real learner writing.",
                    "sid": 94,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we eliminated sentences containing nested errors and immediately adjacent errors when they involve pertinent (preposition/article) errors.",
                    "sid": 95,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, an annotated error \"take a picture\" with the correction \"take pictures\" is annotated as two consecutive errors: \"delete a\" and \"rewrite picture as pictures\".",
                    "sid": 96,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the error involves operations on both the article and the noun, which our article correction module is not designed to cover, we eliminated the sentence from the data.",
                    "sid": 97,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(This last step eliminated 31% of the sentences annotated with preposition errors and 29% or the sentences annotated with article errors.)",
                    "sid": 98,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentences that were flagged for a replacement error but contained no replacement were also eliminated from the data.",
                    "sid": 99,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final training, tuning and test set sizes are as follows (note that for prepositions we had to re duce the size of the training set by an additional 20% in order to avoid memory limitations of our decision tree tools).",
                    "sid": 100,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prepositions: train: 584,485 sentences, 68,806 prep errors tuning: 105,166 sentences, 9918 prep errors test: 208,724 sentences, 19,706 prep errors Articles: train: 737,091 sentences, 58,356 article errors tuning: 106,052 sentences, 8341 article errors test: 210,577 sentences, 16,742 article errors This mix is strongly biased towards “correct” usage.",
                    "sid": 101,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After all, there are many more correct uses of articles and prepositions in the CLC data than incorrect ones.",
                    "sid": 102,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Again, this is likely to make ourtask harder, but more realistic, since both at train ing and test time we are working with the error distribution that is observed in learner data.",
                    "sid": 103,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Evaluation.",
                    "sid": 104,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To evaluate, we run our metaclassifier system on the preposition and article test sets described in above and calculate precision and recall.",
                    "sid": 105,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Precision and recall for the overall system are controlled by thresholding the metaclassifier class probability.",
                    "sid": 106,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a point of comparison, we also evaluate the performance of the primary models (the error-specific classifier and the language model) in isolation.",
                    "sid": 107,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Precision and recall for the error-specific classifier is controlled by thresholding class probability.",
                    "sid": 108,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To control the precision-recall tradeoff for the language model, we calculate the difference between the log probabilities of the original user input and the suggested correction.",
                    "sid": 109,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then vary that difference across all observed values in small increments, which affects precision and recall: the higher the difference, the fewer instances we find, but the higher the reliability of these instances is. This evaluation differs from many of the evaluations reported in the error detection/correction literature in several respects.",
                    "sid": 110,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the test set is a broad random sample across all proficiency levels in the CLC data.",
                    "sid": 111,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, it is far larger than any sets that have been so far to report results of preposition/article correction on learner data.",
                    "sid": 112,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we are only considering cases in which the system suggests a correction.",
                    "sid": 113,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, we do not count as correct instances where the system's prediction matches a correct preposition/article.",
                    "sid": 114,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This evaluation scheme, however, ignores one aspect of a real user scenario.",
                    "sid": 115,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of all the suggestedchanges that are counted as wrong in our evalua tion because they do not match an annotated error, some may in fact be innocuous or even helpful for a real user.",
                    "sid": 116,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such a situation can arise for a variety of reasons: In some cases, there are legitimate alternative ways to correct an error.",
                    "sid": 117,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other cases, the classifier has identified the location of an error although that error is of a different kind (which can be beneficial because it causes the user to make a correction - see Leacock et al., 2009).",
                    "sid": 118,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gamon et al.",
                    "sid": 119,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009), for example manually evaluate preposition suggestions as belonging to one of three categories: (a) properly correcting an existing error, (b) offering a suggestion that neither improves nor degrades the user sentence, (c) offering a sugges tion that would degrade the user input.",
                    "sid": 120,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obviously, (c) is a more serious error than (b).",
                    "sid": 121,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, Tetrault and Chodorow (2008) annotate their test set with preposition choices that are valid alternatives.",
                    "sid": 122,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do not have similar information in the CLC data, but we can perform a manual analysis of a random subset of test data to estimate an \"upper bound\" for our precision/recall curve.",
                    "sid": 123,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our annota- tor manually categorized each suggested correction into one of seven categories.",
                    "sid": 124,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Details of the distribution of suggested corrections into the seven categories are shown in Table 1.",
                    "sid": 125,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1: Manual analysis of suggested corrections on CLC data.",
                    "sid": 126,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This analysis involves costly manual evaluation, so we only performed it at one point of the precision/recall curve (our current runtime system setting).",
                    "sid": 127,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sample size was 6,000 sentences for prepositions and 5981 sentences for articles (half of the sentences were flagged as containing at least one article/preposition error while the other half were not).",
                    "sid": 128,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On this manual evaluation, we achieve 32.87% precision if we count all flags that do not perfectly match a CLC annotation as a false posi tive.",
                    "sid": 129,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only counting the last category (introduction of an error) as a false positive, precision is at 85.34%.",
                    "sid": 130,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, for articles, the manual estimation arrives at 76.74% precision, where pure CLC annotation matching gives us 33.34%.",
                    "sid": 131,
                    "ssid": 82,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results. ",
            "number": "4",
            "sents": [
                {
                    "text": "Figure 1 and Figure 2 show the evaluation results of the metaclassifier for prepositions and articles, compared to the performance of the error-specific classifier and language model alone.",
                    "sid": 132,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For both prepositions and articles, the first notable observation is that the language model outperforms the classifier by a large margin.",
                    "sid": 133,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This came as a surprise to us, given the recent prevalence of classification approaches in this area of research and the fact that our classifiers produce state-of-the art performance when compared to other systems, on well-formed 1 0.9 0.8 0.7 0.6 0.5 0.4 0.3 0.2 0.1 0 Articles 0 0.2 0.4 0.6 0.8 1 Recall data.",
                    "sid": 134,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, the combination of scores from the classifier and language model through a meta Learned thresholds LM only classifier only classifier clearly outperforms either one of them in isolation.",
                    "sid": 135,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result, again, is consistent across prepositions and articles.",
                    "sid": 136,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We had previously used a hand-tuned score combination instead of a metaclassifier.",
                    "sid": 137,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also established that this heuristic performs worse than the language model for prepositions, and just about at the same level as the language model for ar ticles.",
                    "sid": 138,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note, though, that the manual tuning was performed to optimize performance against a dif ferent data set (the Chinese Learners of English Corpus: CLEC), so the latter point is not really comparable and hence is not included in the charts.",
                    "sid": 139,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prepositions 1 0.9 0.8 0.7 0.6 0.5 0.4 0.3 0.2 0.1 0 0 0.2 0.4 0.6 Recall Figure 2: Precision and recall for articles.",
                    "sid": 140,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now turn to the question of the required amount of annotated training data for the metaclassifier.",
                    "sid": 141,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CLC is commercially available, but it is obvious that for many researchers such a corpus will be too expensive and they will have to create or license their own error-annotated corpus.",
                    "sid": 142,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the question of whether one could use less annotated data to train a metaclassifier and still achieve reasonable results becomes important.",
                    "sid": 143,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 and Figure 4 show results obtained by using decreasing amounts of training data.",
                    "sid": 144,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The dotted line shows the language model baseline.",
                    "sid": 145,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Any result below the language model performance shows that the training data is insufficient to warrant the use of a metaclassifier.",
                    "sid": 146,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In these experiments there is a clear difference between prepositions and articles.",
                    "sid": 147,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can reduce the amount of training data for prepositions to 10% of the original data and still outperform the language model baseline.",
                    "sid": 148,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10% of the data corresponds to 6,800 annotated preposition errors and 58,400 sentences.",
                    "sid": 149,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When we reduce the training data to 1% of the original amount (680 annotated errors, 5,800 sentences) we clearly see degraded results compared to the language model.",
                    "sid": 150,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With ar LM only learned thresholds classifier only ticles, the system is much less data-hungry.",
                    "sid": 151,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reducing the training data to 1% (580 annotated errors, 7,400 sentences) still outperforms the language Figure 1: Precision and recall for prepositions.",
                    "sid": 152,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "model alone.",
                    "sid": 153,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result can most likely be explained by the different complexity of the preposition and article tasks.",
                    "sid": 154,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Article operations include only six distinct operations: deletion of the, deletion of a/an, insertion of the, insertion of a/an, change of the to a/an, and change of a/an to the.",
                    "sid": 155,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the twelve prepositions that we work with, the total number of insertions, deletions and substitutions that require sufficient training events and might need different score combinations is 168, making the problem much harder.",
                    "sid": 156,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prepositions 1 0.9 0.8 0.7 0.6 0.5 0.4 0.3 0.2 0.1 0 0 0.2 0.4 0.6 Recall",
                    "sid": 157,
                    "ssid": 26,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "error analysis. ",
            "number": "5",
            "sents": [
                {
                    "text": "We have conducted a failure analysis on examples where the system produces a blatantly bad suggestion in order to see whether this decision could be attributed to the error-specific classifier or to the language model, or both, and what the underlying cause is. This preliminary analysis highlights two common causes for bad flags.",
                    "sid": 158,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One is that of frequent lower order n-grams that dominate the language model score.",
                    "sid": 159,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the CLEC sentence I get to know the world outside the campus by newspaper and television.",
                    "sid": 160,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system suggests deleting by.",
                    "sid": 161,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cause of this bad decision is that the bi- gram campus newspaper is extremely likely, trumping all other n-grams, and leading to a high probability for the suggested string compared to 100% training data 10% training data LM only 1% training data the original: Log (P(original)) = -26.2 and Log (P(suggestion)) = -22.4.",
                    "sid": 162,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This strong imbalance of Figure 3: Using different amounts of annotated training data for the preposition metaclassifier.",
                    "sid": 163,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Articles 1 0.9 0.8 0.7 0.6 0.5 0.4 0.3 0.2 0.1 0 0 0.2 0.4 0.6 0.8 1 Recall the language model score causes the metaclassifier to assign a relatively high probability to this being a correct revision, even though the error specific classifier is on the right track and gives a relatively high probability for the presence of a preposition and the choice of by.",
                    "sid": 164,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A similar exam ple, but for substitution, occurs in They give discounts to their workers on books.",
                    "sid": 165,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here the bigram in books has a very high probability and the system incorrectly suggests replacing on with in.",
                    "sid": 166,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example for insertion is seen in Please send me the letter back writing what happened.",
                    "sid": 167,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, the bi- gram back to causes the bad suggestion of inserting to after back.",
                    "sid": 168,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the language model is generally more accurate than the error-specific classifier, 100% training data Language model alone 10% training data 1% training data the metaclassifier tends to trust its score more than that of the classifier.",
                    "sid": 169,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result we see this kind of error quite frequently.",
                    "sid": 170,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 4: Using different amounts of annotated training data for the article metaclassifier.",
                    "sid": 171,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To find out if it is possible to reduce the required amount of annotated preposition errors for a system that still covers more than one third of the preposition errors, we ran the same learning curve experiments but now only taking the four most frequent prepositions into account: to, of, in, for.",
                    "sid": 172,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the CLC, these four prepositions account for 39.8% of preposition error flags.",
                    "sid": 173,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in the previous experiments, however, we found that we are not able to outperform the baseline by using just 1% of annotated data.",
                    "sid": 174,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another common error class is the opposite situation: the language model is on the right track, but the classifier makes a wrong assessment.",
                    "sid": 175,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider Whatever direction my leg fought to stretch, with the suggested insertion of on before my leg.",
                    "sid": 176,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here Log (P(original)) = -31.5 and Log (P(suggestion)) = -32.1, a slight preference for the original string.",
                    "sid": 177,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The error-specific classifier, however, assigns a probability of 0.65 for a preposition to be present, and 0.80 for that preposition to be on.",
                    "sid": 178,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The contex tual features that are important in that decision are: the insertion site is between a pronoun and a noun, it is relatively close to the beginning of the sen tence, and the head of the NP my leg has a possible mass noun sense.",
                    "sid": 179,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example involving deletion is in Someone came to sort of it.",
                    "sid": 180,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the language model assigns a high probability for deleting of, the error-specific classifier does not.",
                    "sid": 181,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, for substitution, in Your experience is very interesting for our company, the language model suggests substituting for with to while the classifier gives the substitution a very low probability.",
                    "sid": 182,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As can be seen from the learner sentences cited above, often, even though the sentences are gram matical, they are not idiomatic, which can confuse all of the classifiers.",
                    "sid": 183,
                    "ssid": 26,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion and future work. ",
            "number": "6",
            "sents": [
                {
                    "text": "We have addressed two questions in this paper: 1.",
                    "sid": 184,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How effective is a meta-classification ap-.",
                    "sid": 185,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "proach that combines language modeling and error-specific classification to the detection and correction of preposition and article errors by non-native speakers?",
                    "sid": 186,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 187,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How much error-annotated data is sufficient to.",
                    "sid": 188,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "produce positive results using that approach?",
                    "sid": 189,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have shown that a metaclassifier approach outperforms using a language model or a classifier alone.",
                    "sid": 190,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An interesting side result is that the language model solidly outperforms the contextual classifier for both article and preposition correc tion, contrary to current practice in the field.",
                    "sid": 191,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training data requirements for the metaclassifier vary significantly between article and preposition error detection.",
                    "sid": 192,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The article metaclassifier can be trained with as few as 600 annotated errors, but the prepo sition metaclassifier requires more annotated data by an order of magnitude.",
                    "sid": 193,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Still, the overall amount of expensive error-annotated data is relatively small, and the meta-classification approach makes it possible to leverage large amounts of well- formed text in the primary models, tuning to the non-native domain in the metaclassifier.",
                    "sid": 194,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe that the logical next step is to combine more primary models in the metaclassifier.",
                    "sid": 195,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Candidates for additional primary models include (1) more classifiers trained either on different data sets or with a different classification algorithm, and (2) more language models, such as skip models or part-of-speech n-gram language models.",
                    "sid": 196,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "We thank Claudia Leacock from the Butler HillGroup for detailed error analysis and the anonym ous reviewers for helpful and constructive feedback.",
                    "sid": 197,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}