{
    "ID": "P02-1061",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper describes how a machine- learning named entity recognizer (NER) on upper case text can be improved by using a mixed case NER and some unlabeled text.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The mixed case NER can be used to tag some unlabeled mixed case text, which are then used as additional training material for the upper case NER.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that this approach reduces the performance Mixed Case: Consuela Washington, a longtime House staffer and an expert in securities laws, is a leading candidate to be chairwoman of the Securities and Exchange Commission in the Clinton administration.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Upper Case: CONSUELA WASHINGTON, A LONGTIME HOUSE STAFFER AND AN EXPERT IN SECURITIES LAWS, IS A LEADING CANDIDATE TO BE CHAIRWOMAN OF THE SECURITIES AND EXCHANGE COMMISSION IN THE CLINTON ADMINISTRATION.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "gap between the mixed case NER and the upper case NER substantially, by 39% for MUC6 and 22% for MUC7 named entity test data.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our method is thus useful in improving the accuracy of NERs on upper case text, such as transcribed text from automatic speech recognizers where case information is missing.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "In this paper, we propose using a mixed case named entity recognizer (NER) that is trained on labeled text, to further train an upper case NER.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the Sixth and Seventh Message Understanding Conferences (MUC6, 1995; MUC7, 1998), the named entity task consists of labeling named entities with the classes PERSON, ORGANIZATION, LOCATION, DATE, TIME, MONEY, and PERCENT.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We conducted experiments on upper case named entity recognition, and showed how unlabeled mixed case text can be used to improve the results of an upper case NER on the official MUC6 and MUC7 Figure 1: Examples of mixed and upper case text test data.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides upper case text, this approach can also be applied on transcribed text from automatic speech recognizers in Speech Normalized Orthographic Representation (SNOR) format, or from optical character recognition (OCR) output.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the English language, a word starting with a capital letter often designates a named entity.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Upper case NERs do not have case information to help them to distinguish named entities from non-named entities.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When data is sparse, many named entities in the test data would be unknown words.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This makes upper case named entity recognition more difficult than mixed case.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even a human would experience greater difficulty in annotating upper case text than mixed case text (Figure 1).",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose using a mixed case NER to “teach” an upper case NER, by making use of unlabeled mixed case text.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the abundance of mixed case un the Internet, it will be easy to apply our approach to improve the performance of NER on upper case text.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach does not satisfy the usual assumptions of co-training (Blum and Mitchell, 1998).",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intuitively, however, one would expect some information to be gained from mixed case unlabeled text, where case information is helpful in pointing out new words that could be named entities.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show empirically that such an approach can indeed improve the performance of an upper case NER.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 5, we show that for MUC6, this way of using unlabeled text can bring a relative reduction in errors of 38.68% between the upper case and mixed case NERs.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For MUC7 the relative reduction in errors is 22.49%.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Considerable amount of work has been done in recent years on NERs, partly due to the Message Understanding Conferences (MUC6, 1995; MUC7, 1998).",
                    "sid": 23,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Machine learning methods such as BBN’s IdentiFinder (Bikel, Schwartz, and Weischedel, 1999) and Borthwick’s MENE (Borth- wick, 1999) have shown that machine learning NERs can achieve comparable performance with systems using hand-coded rules.",
                    "sid": 24,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bikel, Schwartz, and Weischedel (1999) have also shown how mixed case text can be automatically converted to upper case SNOR or OCR format to train NERs to work on such formats.",
                    "sid": 25,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is also some work on unsupervised learning for mixed case named entity recognition (Collins and Singer, 1999; Cucerzan and Yarowsky, 1999).",
                    "sid": 26,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Collins and Singer (1999) investigated named entity classification using Ad- aboost, CoBoost, and the EM algorithm.",
                    "sid": 27,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, features were extracted using a parser, and performance was evaluated differently (the classes were person, organization, location, and noise).",
                    "sid": 28,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cucerzan and Yarowsky (1999) built a cross language NER, and the performance on English was low compared to supervised single-language NER such as Identi- Finder.",
                    "sid": 29,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We suspect that it will be hard for purely unsupervised methods to perform as well as supervised ones.",
                    "sid": 30,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Seeger (2001) gave a comprehensive summary of recent work in learning with labeled and unlabeled such as (Blum and Mitchell, 1998; Collins and Singer, 1999; Pierce and Cardie, 2001).",
                    "sid": 31,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most co- training methods involve using two classifiers built on different sets of features.",
                    "sid": 32,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of using distinct sets of features, Goldman and Zhou (2000) used different classification algorithms to do co-training.",
                    "sid": 33,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Blum and Mitchell (1998) showed that in order for PAC-like guarantees to hold for co-training, features should be divided into two disjoint sets satisfying: (1) each set is sufficient for a classifier to learn a concept correctly; and (2) the two sets are conditionally independent of each other.",
                    "sid": 34,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each set of features can be used to build a classifier, resulting in two independent classifiers, A and B. Classifications by A on unlabeled data can then be used to further train classifier B, and vice versa.",
                    "sid": 35,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intuitively, the independence assumption is there so that the classifications of A would be informative to B. When the independence assumption is violated, the decisions of A may not be informative to B. In this case, the positive effect of having more data may be offset by the negative effect of introducing noise into the data (classifier A might not be always correct).",
                    "sid": 36,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nigam and Ghani (2000) investigated the difference in performance with and without a feature split, and showed that co-training with a feature split gives better performance.",
                    "sid": 37,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the comparison they made is between co-training and self-training.",
                    "sid": 38,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In self-training, only one classifier is used to tag unlabeled data, after which the more confidently tagged data is reused to train the same classifier.",
                    "sid": 39,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many natural language processing problems do not show the natural feature split displayed by the web page classification task studied in previous co- training work.",
                    "sid": 40,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work does not really fall under the paradigm of co-training.",
                    "sid": 41,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of cooperation between two classifiers, we used a stronger classifier to teach a weaker one.",
                    "sid": 42,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, it exhibits the following differences: (1) the features are not at all independent (upper case features can be seen as a subset of the mixed case features); and (2) The additional features available to the mixed case system will never be available to the upper case system.",
                    "sid": 43,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Co-training often involves combining the two different sets of features to obtain a final system that outperforms either system alone.",
                    "sid": 44,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our context, however, the upper case system will never have access to some of the case-based features available to the mixed case system.",
                    "sid": 45,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the above reason, it is unreasonable to expect the performance of the upper case NER to match that of the mixed case NER.",
                    "sid": 46,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we still manage to achieve a considerable reduction of errors between the two NERs when they are tested on the official MUC6 and MUC7 test data.",
                    "sid": 47,
                    "ssid": 25,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "system description. ",
            "number": "3",
            "sents": [
                {
                    "text": "We use the maximum entropy framework to build two classifiers: an upper case NER and a mixed case NER.",
                    "sid": 48,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The upper case NER does not have access to case information of the training and test data, and hence cannot make use of all the features used by the mixed case NER.",
                    "sid": 49,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will first describe how the mixed case NER is built.",
                    "sid": 50,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More details of this mixed case NER and its performance are given in (Chieu and Ng, 2002).",
                    "sid": 51,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach is similar to the MENE system of (Borthwick, 1999).",
                    "sid": 52,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each word is assigned a name class based on its features.",
                    "sid": 53,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each name class is subdivided into 4 classes, i.e., N begin, N continue, N end, and N unique.",
                    "sid": 54,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, there is a total of 29 classes (7 name classes 4 sub-classes 1 not-a-name class).",
                    "sid": 55,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Maximum Entropy.",
                    "sid": 56,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The maximum entropy framework estimates probabilities based on the principle of making as few assumptions as possible, other than the constraints imposed.",
                    "sid": 57,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such constraints are derived from training data, expressing some relationship between features and outcome.",
                    "sid": 58,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability distribution that satisfies the above property is the one with the highest entropy.",
                    "sid": 59,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is unique, agrees with the maximum- likelihood distribution, and has the exponential form (Della Pietra, Della Pietra, and Lafferty, 1997): where refers to the outcome, the history (or context), and is a normalization function.",
                    "sid": 60,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, each feature function is a binary function.",
                    "sid": 61,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in predicting if a word belongs to a word class, is either true or false, and refers to the surrounding context: if = true, previous word = the otherwise The parameters are estimated by a procedure called Generalized Iterative Scaling (GIS) (Darroch and Ratcliff, 1972).",
                    "sid": 62,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is an iterative method that improves the estimation of the parameters at each iteration.",
                    "sid": 63,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Features for Mixed Case NER.",
                    "sid": 64,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features we used can be divided into 2 classes: local and global.",
                    "sid": 65,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Local features are features that are based on neighboring tokens, as well as the token itself.",
                    "sid": 66,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Global features are extracted from other occurrences of the same token in the whole document.",
                    "sid": 67,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Features in the maximum entropy framework are binary.",
                    "sid": 68,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feature selection is implemented using a feature cutoff: features seen less than a small count during training will not be used.",
                    "sid": 69,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We group the features used into feature groups.",
                    "sid": 70,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each group can be made up of many binary features.",
                    "sid": 71,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each token , zero, one, or more of the features in each group are set to 1.",
                    "sid": 72,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The local feature groups are: Non-Contextual Feature: This feature is set to 1 for all tokens.",
                    "sid": 73,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This feature imposes constraints that are based on the probability of each name class during training.",
                    "sid": 74,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zone: MUC data contains SGML tags, and a document is divided into zones (e.g., headlines and text zones).",
                    "sid": 75,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The zone to which a token belongs is used as a feature.",
                    "sid": 76,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in MUC6, there are four zones (TXT, HL, DATELINE, DD).",
                    "sid": 77,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, for each token, one of the four features zone-TXT, zone-HL, zone-DATELINE, or zone-DD is set to 1, and the other 3 are set to 0.",
                    "sid": 78,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Case and Zone: If the token starts with a capital letter (initCaps), then an additional feature (init- Caps, zone) is set to 1.",
                    "sid": 79,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If it is made up of all capital letters, then (allCaps, zone) is set to 1.",
                    "sid": 80,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If it contains both upper and lower case letters, then (mixedCaps, zone) is set to 1.",
                    "sid": 81,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A token that is allCaps will also be initCaps.",
                    "sid": 82,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This group consists of (3 total number of possible zones) features.",
                    "sid": 83,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Case and Zone of and : Similarly, if (or ) is initCaps, a feature (initCaps, Table 1: Features based on the token string zone) (or (initCaps, zone) ) is set to 1, etc. Token Information: This group consists of 10 features based on the string , as listed in Table 1.",
                    "sid": 84,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if a token starts with a capital letter and ends with a period (such as Mr.), then the feature InitCapPeriod is set to 1, etc. First Word: This feature group contains only one feature firstword.",
                    "sid": 85,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the token is the first word of a sentence, then this feature is set to 1.",
                    "sid": 86,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise, it is set to 0.",
                    "sid": 87,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexicon Feature: The string of the token is used as a feature.",
                    "sid": 88,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This group contains a large number of features (one for each token string present in the training data).",
                    "sid": 89,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At most one feature in this group will be set to 1.",
                    "sid": 90,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If is seen infrequently during training (less than a small count), then will not selected as a feature and all features in this group are set to 0.",
                    "sid": 91,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexicon Feature of Previous and Next Token: The string of the previous token and the next token is used with the initCaps information of . If has initCaps, then a feature (initCaps, ) is set to 1.",
                    "sid": 92,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If is not initCaps, then (not- initCaps, ) is set to 1.",
                    "sid": 93,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Same for . In the case where the next token is a hyphen, then is also used as a feature: (initCaps, ) of hyphens can be considered to be optional (e.g., “third-quarter” or “third quarter”).",
                    "sid": 94,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Out-of-Vocabulary: We derived a lexicon list from WordNet 1.6, and words that are not found in this list have a feature out-of-vocabulary set to 1.",
                    "sid": 95,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dictionaries: Due to the limited amount of training material, name dictionaries have been found to be useful in the named entity task.",
                    "sid": 96,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sources of our dictionaries are listed in Table 2.",
                    "sid": 97,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A token is tested against the words in each of the four lists of location names, corporate names, person first names, and person last names.",
                    "sid": 98,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If is found in a list, the corresponding feature for that list will be set to 1.",
                    "sid": 99,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if Barry is found in the list of person first names, then the feature PersonFirstName will be set to 1.",
                    "sid": 100,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, the tokens and are tested against each list, and if found, a corresponding feature will be set to 1.",
                    "sid": 101,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if is found in the list of person first names, the feature PersonFirstName is set to 1.",
                    "sid": 102,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Month Names, Days of the Week, and Numbers: If is one of January, February, . . .",
                    "sid": 103,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", December, then the feature MonthName is set to 1.",
                    "sid": 104,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If is one of Monday, Tuesday, . . .",
                    "sid": 105,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", Sunday, then the feature DayOfTheWeek is set to 1.",
                    "sid": 106,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If is a number string (such as one, two, etc), then the feature NumberString is set to 1.",
                    "sid": 107,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suffixes and Prefixes: This group contains only two features: Corporate-Suffix and Person-Prefix.",
                    "sid": 108,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two lists, Corporate-Suffix-List (for corporate suffixes) and Person-Prefix-List (for person prefixes), are collected from the training data.",
                    "sid": 109,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a token that is in a consecutive sequence of initCaps tokens , if any of the tokens from to is in Corporate-Suffix-List, then a fea ture Corporate-Suffix is set to 1.",
                    "sid": 110,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If any of the tokens from to is in Person-Prefix-List, then another feature Person-Prefix is set to 1.",
                    "sid": 111,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that we check for , the word preceding the consecutive sequence of initCaps tokens, since person prefixes like Mr., Dr. etc are not part of person names, whereas corporate suffixes like Corp., Inc. etc are part of corporate names.",
                    "sid": 112,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The global feature groups are: InitCaps of Other Occurrences: There are 2 features in this group, checking for whether the first occurrence of the same word in an unambiguous posi De scr ipt io n So ur ce Lo cat io n Na m es h t t p : / / w w w . t i m e a n d d a t e . c o m h t t p : / / w w w . c i t y g u i d e . t r a v e l g u i d e s . c o m h t t p : / / w w w . w o r l d t r a v e l g u i d e . n e t Co rp or ate Na m es htt p:/ /w w w. fm lx.",
                    "sid": 113,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "co m Pe rs on Fir st Na m es htt p:/ /w w w. ce ns us.",
                    "sid": 114,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "go v/ ge ne al og y/ na m es Pe rs on La st Na m es Table 2: Sources of Dictionaries tion (non first-words in the TXT or TEXT zones) in the same document is initCaps or not-initCaps.",
                    "sid": 115,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a word whose initCaps might be due to its position rather than its meaning (in headlines, first word of a sentence, etc), the case information of other occurrences might be more accurate than its own.",
                    "sid": 116,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Corporate Suffixes and Person Prefixes of Other Occurrences: With the same Corporate- Suffix-List and Person-Prefix-List used in local features, for a token seen elsewhere in the same document with one of these suffixes (or prefixes), another feature Other-CS (or Other-PP) is set to 1.",
                    "sid": 117,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Acronyms: Words made up of all capitalized letters in the text zone will be stored as acronyms (e.g., IBM).",
                    "sid": 118,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system will then look for sequences of initial capitalized words that match the acronyms found in the whole document.",
                    "sid": 119,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such sequences are given additional features of A begin, A continue, or A end, and the acronym is given a feature A unique.",
                    "sid": 120,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if “FCC” and “Federal Communications Commission” are both found in a document, then “Federal” has A begin set to 1, “Communications” has A continue set to 1, “Commission” has A end set to 1, and “FCC” has A unique set to 1.",
                    "sid": 121,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sequence of Initial Caps: In the sentence “Even News Broadcasting Corp., noted for its accurate reporting, made the erroneous announcement.”, a NER may mistake “Even News Broadcasting Corp.” as an organization name.",
                    "sid": 122,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it is unlikely that other occurrences of “News Broadcasting Corp.” in the same document also co-occur with “Even”.",
                    "sid": 123,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This group of features attempts to capture such information.",
                    "sid": 124,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For every sequence of initial capitalized words, its longest substring that occurs in the same document is identified.",
                    "sid": 125,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this example, since the sequence “Even News Broadcasting Corp.” only appears once in the document, its longest substring that occurs in the same document is “News Broadcasting Corp.”.",
                    "sid": 126,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, “News” has an additional feature of I begin set to 1,“Broadcasting” has an additional feature of I continue set to 1, and “Corp.” has an additional feature of I end set to 1.",
                    "sid": 127,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unique Occurrences and Zone: This group of features indicates whether the word is unique in the whole document.",
                    "sid": 128,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "needs to be in initCaps to be considered for this feature.",
                    "sid": 129,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If is unique, then a feature (Unique, Zone) is set to 1, where Zone is the document zone where appears.",
                    "sid": 130,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Features for Upper Case NER.",
                    "sid": 131,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All features used for the mixed case NER are used by the upper case NER, except those that require case information.",
                    "sid": 132,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among local features, Case and Zone, InitCap- Period, and OneCap are not used by the upper case NER.",
                    "sid": 133,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among global features, only Other-CS and Other-PP are used for the upper case NER, since the other global features require case information.",
                    "sid": 134,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Corporate-Suffix and Person-Prefix, as the sequence of initCaps is not available in upper case text, only the next word (previous word) is tested for Corporate-Suffix (Person-Prefix).",
                    "sid": 135,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Testing.",
                    "sid": 136,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During testing, it is possible that the classifier produces a sequence of inadmissible classes (e.g., person begin followed by location unique).",
                    "sid": 137,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To eliminate such sequences, we define a transition probability between word classes to be equal to 1 if the sequence is admissible, and 0 otherwise.",
                    "sid": 138,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability of the classes assigned to the words in a sentence in a document is defined as follows: Figure 2: The whole process of retraining the upper case NER.",
                    "sid": 139,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "signifies that the text is converted to upper case before processing.",
                    "sid": 140,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "where is determined by the maximum entropy classifier.",
                    "sid": 141,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A dynamic programming algorithm is then used to select the sequence of word classes with the highest probability.",
                    "sid": 142,
                    "ssid": 95,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "teaching process. ",
            "number": "4",
            "sents": [
                {
                    "text": "The teaching process is illustrated in Figure 2.",
                    "sid": 143,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This process can be divided into the following steps: Training NERs.",
                    "sid": 144,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, a mixed case NER (MNER) is trained from some initial corpus , manually tagged with named entities.",
                    "sid": 145,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This corpus is also converted to upper case in order to train another upper case NER (UNER).",
                    "sid": 146,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "UNER is required by our method of example selection.",
                    "sid": 147,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Baseline Test on Unlabeled Data.",
                    "sid": 148,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Apply the trained MNER on some unlabeled mixed case texts to produce mixed case texts that are machine-tagged with named entities (text-mner-tagged).",
                    "sid": 149,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Convert the original unlabeled mixed case texts to upper case, and similarly apply the trained UNER on these texts to obtain upper case texts machine-tagged with named entities (text-uner-tagged).",
                    "sid": 150,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example Selection.",
                    "sid": 151,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compare text-mner-tagged and text-uner-tagged and select tokens in which the classification by MNER differs from that of UNER.",
                    "sid": 152,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The class assigned by MNER is considered to be correct, and will be used as new training data.",
                    "sid": 153,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These tokens are collected into a set . Retraining for Final Upper Case NER.",
                    "sid": 154,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both and are used to retrain an upper case NER.",
                    "sid": 155,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, tokens from are given a weight of 2 (i.e., each token is used twice in the training data), and tokens from a weight of 1, since is more reliable than (human-tagged versus machine-tagged).",
                    "sid": 156,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental results. ",
            "number": "5",
            "sents": [
                {
                    "text": "For manually labeled data (corpus C), we used only the official training data provided by the MUC6 and MUC7 conferences, i.e., using MUC6 training data and testing on MUC6 test data, and using MUC7 training data and testing on MUC7 test data.1 The task definitions for MUC6 and MUC 7 are not exactly identical, so we could not combine the training data.",
                    "sid": 157,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The original MUC6 training data has a total of approximately 160,000 tokens and 1 MUC data can be obtained from the Linguistic Data Consortium: http://www.ldc.upenn.edu Figure 3: Improvements in F-measure on MUC6 plotted against amount of selected unlabeled data used MUC7 a total of approximately 180,000 tokens.",
                    "sid": 158,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The unlabeled text is drawn from the TREC (Text REtrieval Conference) corpus, 1992 Wall Street Journal section.",
                    "sid": 159,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have used a total of 4,893 articles with a total of approximately 2,161,000 tokens.",
                    "sid": 160,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After example selection, this reduces the number of tokens to approximately 46,000 for MUC6 and 67,000 for MUC7.",
                    "sid": 161,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 and Figure 4 show the results for MUC6 and MUC7 obtained, plotted against the number of unlabeled instances used.",
                    "sid": 162,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As expected, it increases the recall in each domain, as more names or their contexts are learned from unlabeled data.",
                    "sid": 163,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, as more unlabeled data is used, precision drops due to the noise introduced in the machine tagged data.",
                    "sid": 164,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For MUC6, F-measure performance peaked at the point where 30,000 tokens of machine labeled data are added to the original manually tagged 160,000 tokens.",
                    "sid": 165,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For MUC7, performance peaked at 20,000 tokens of machine labeled data, added to the original manually tagged 180,000 tokens.",
                    "sid": 166,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The improvements achieved are summarized in Table 3.",
                    "sid": 167,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is clear from the table that this method of using unlabeled data brings considerable improvement for both MUC6 and MUC7 named entity task.",
                    "sid": 168,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result of the teaching process for MUC6 is a lot better than that of MUC7.",
                    "sid": 169,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We think that this isFigure 4: Improvements in F-measure on MUC 7 plotted against amount of selected unlabeled data used Table 3: F-measure on MUC6 and MUC7 test data due to the following reasons: Better Mixed Case NER for MUC6 than MUC7.",
                    "sid": 170,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The mixed case NER trained on the MUC 6 officially released training data achieved an F- measure of 93.27% on the official MUC6 test data, while that of MUC7 (also trained on only the official MUC7 training data) achieved an F measure of only 87.24%.",
                    "sid": 171,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the mixed case NER is used as the teacher, a bad teacher does not help as much.",
                    "sid": 172,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Domain Shift in MUC7.",
                    "sid": 173,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another possible cause is that there is a domain shift in MUC7 for the formal test (training articles are aviation disasters articles and test articles are missile/rocket launch articles).",
                    "sid": 174,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The domain of the MUC7 test data is also very specific, and hence it might exhibit different properties from the training and the unlabeled data.",
                    "sid": 175,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Source of Unlabeled Data.",
                    "sid": 176,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The unlabeled data used is from the same source as MUC6, but different for MUC7 (MUC6 articles and the unlabeled articles are all Wall Street Journal articles, whereas MUC7 articles are New York Times articles).",
                    "sid": 177,
                    "ssid": 21,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "6",
            "sents": [
                {
                    "text": "In this paper, we have shown that the performance of NERs on upper case text can be improved by using a mixed case NER with unlabeled text.",
                    "sid": 178,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Named entity recognition on mixed case text is easier than on upper case text, where case information is unavailable.",
                    "sid": 179,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By using the teaching process, we can reduce the performance gap between mixed and upper case NER by as much as 39% for MUC6 and 22% for MUC7.",
                    "sid": 180,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach can be used to improve the performance of NERs on speech recognition output, or even for other tasks such as part-of-speech tagging, where case information is helpful.",
                    "sid": 181,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the abundance of unlabeled text available, such an approach requires no additional annotation effort, and hence is easily applicable.",
                    "sid": 182,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This way of teaching a weaker classifier can also be used in other domains, where the task is to infer , and an abundance of unlabeled data is available.",
                    "sid": 183,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If one possesses a second classifier such that provides additional “useful” information that can be utilized by this second classifier, then one can use this second classifier to automatically tag the unlabeled data , and select from examples that can be used to supplement the training data for training .",
                    "sid": 184,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}