{
    "ID": "P04-1080",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper presents an unsupervised word sense learning algorithm, which induces senses of target word by grouping its occurrences into a “natural” number of clusters based on the similarity of their contexts.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For removing noisy words in feature set, feature selection is conducted by optimizing a clus­ter validation criterion subject to some constraint in an unsupervised manner.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gaussian mixture model and Minimum Description Length criterion are used to estimate cluster structure and cluster number.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experimental results show that our algorithm can .nd important feature subset, estimate model or­der (cluster number) and achieve better performance than another algorithm which requires cluster num­ber to be provided.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Sense disambiguation is essential for many lan­guage applications such as machine translation, in­formation retrieval, and speech processing (Ide and Ve´ronis, 1998).",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Almost all of sense disambigua­tion methods are heavily dependant on manually compiled lexical resources.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However these lexical resources often miss domain speci.c word senses, even many new words are not included inside.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Learning word senses from free text will help us dispense of outside knowledge source for de.ning sense by only discriminating senses of words.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An­other application of word sense learning is to help enriching or even constructing semantic lexicons (Widdows, 2003).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The solution of word sense learning is closely re­lated to the interpretation of word senses.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different interpretations of word senses result in different so­lutions to word sense learning.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One interpretation strategy is to treat a word sense as a set of synonyms like synset in WordNet.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The committee based word sense discovery algorithm (Pantel and Lin, 2002) followed this strategy, which treated senses as clusters of words occurring in sim­ilar contexts.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their algorithm initially discovered tight clusters called committees by grouping top n words similar with target word using average­ Chew-Lim Tan Department of Computer Science National University of Singapore 3 Science Drive 2.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "117543 Singapore tancl@comp.nus.edu.sg link clustering.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then the target word was assigned to committees if the similarity between them was above a given threshold.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each committee that the target word belonged to was interpreted as one of its senses.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are two dif.culties with this committee based sense learning.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The .rst dif.culty is about derivation of feature vectors.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A feature for target word here consists of a contextual content word and its grammatical relationship with target word.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ac­quisition of grammatical relationship depends on the output of a syntactic parser.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But for some lan­guages, ex.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chinese, the performance of syntactic parsing is still a problem.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second dif.culty with this solution is that two parameters are required to be provided, which control the number of commit­tees and the number of senses of target word.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another interpretation strategy is to treat a word sense as a group of similar contexts of target word.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The context group discrimination (CGD) algorithm presented in (Schu¨tze, 1998) adopted this strategy.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Firstly, their algorithm selected important contex­tual words using .2 or local frequency criterion.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the .2 based criterion, those contextual words whose occurrence depended on whether the am­biguous word occurred were chosen as features.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When using local frequency criterion, their algo­rithm selected top n most frequent contextual words as features.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then each context of occurrences of target word was represented by second order co-occurrence based context vector.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Singular value de­composition (SVD) was conducted to reduce the di­mensionality of context vectors.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then the reduced context vectors were grouped into a prede.ned number of clusters whose centroids corresponded to senses of target word.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some observations can be made about their fea­ture selection and clustering procedure.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One ob­servation is that their feature selection uses only .rst order information although the second order co-occurrence data is available.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other observation is about their clustering procedure.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar with committee based sense discovery algorithm, their clustering procedure also requires the prede.nition of cluster number.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their method can capture both coarse-gained and .negrained sense distinction as the prede.ned cluster number varies.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But from a point of statistical view, there should exist a parti­tioning of data at which the most reliable, “natural” sense clusters appear.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we follow the second order repre­sentation method for contexts of target word, since it is supposed to be less sparse and more robust than .rst order information (Schu¨tze, 1998).",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We intro­duce a cluster validation based unsupervised fea­ture wrapper to remove noises in contextual words, which works by measuring the consistency between cluster structures estimated from disjoint data sub­sets in selected feature space.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is based on the assumption that if selected feature subset is impor­tant and complete, cluster structure estimated from data subset in this feature space should be stable and robust against random sampling.",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After deter­mination of important contextual words, we use a Gaussian mixture model (GMM) based clustering algorithm (Bouman et al., 1998) to estimate cluster structure and cluster number by minimizing Min­imum Description Length (MDL) criterion (Ris­sanen, 1978).",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We construct several subsets from widely used benchmark corpus as test data.",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experi­mental results show that our algorithm (F SGMM) can .nd important feature subset, estimate cluster number and achieve better performance compared with CGD algorithm.",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper is organized as follows.",
                    "sid": 45,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In section 2 we will introduce our word sense learning al­gorithm, which incorporates unsupervised feature selection and model order identi.cation technique.",
                    "sid": 46,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we will give out the experimental results of our algorithm and discuss some .ndings from these results in section 3.",
                    "sid": 47,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 will be devoted to a brief review of related efforts on word sense dis­crimination.",
                    "sid": 48,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In section 5 we will conclude our work and suggest some possible improvements.",
                    "sid": 49,
                    "ssid": 49,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "learning procedure. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Feature selection.",
                    "sid": 50,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feature selection for word sense learning is to .nd important contextual words which help to discrim­inate senses of target word without using class la­bels in data set.",
                    "sid": 51,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This problem can be generalized as selecting important feature subset in an unsuper­vised manner.",
                    "sid": 52,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many unsupervised feature selection algorithms have been presented, which can be cate­gorized as feature .lter (Dash et al., 2002; Talav­era, 1999) and feature wrapper (Dy and Brodley, 2000; Law et al., 2002; Mitra et al., 2002; Modha and Spangler, 2003).",
                    "sid": 53,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we propose a cluster valida­tion based unsupervised feature subset evaluation method.",
                    "sid": 54,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cluster validation has been used to solve model order identi.cation problem (Lange et al., 2002; Levine and Domany, 2001).",
                    "sid": 55,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 gives out our feature subset evaluation algorithm.",
                    "sid": 56,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If some features in feature subset are noises, the estimated cluster structure on data subset in selected feature space is not stable, which is more likely to be the artifact of random splitting.",
                    "sid": 57,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then the consistency between cluster structures estimated from disjoint data subsets will be lower.",
                    "sid": 58,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise the estimated cluster structures should be more consistent.",
                    "sid": 59,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here we assume that splitting does not eliminate some of the underlying modes in data set.",
                    "sid": 60,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For comparison of different clustering structures, predictors are constructed based on these clustering solutions, then we use these predictors to classify the same data subset.",
                    "sid": 61,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The agreement between class memberships computed by different predictors can be used as the measure of consistency between clus­ter structures.",
                    "sid": 62,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the stability measure (Lange et al., 2002) (given in Table 1) to assess the agree­ment between class memberships.",
                    "sid": 63,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each occurrence, one strategy is to construct its second order context vector by summing the vec­tors of contextual words, then let the feature selec­tion procedure start to work on these second order contextual vectors to select features.",
                    "sid": 64,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, since the sense associated with a word’s occurrence is al­ways determined by very few feature words in its contexts, it is always the case that there exist more noisy words than the real features in the contexts.",
                    "sid": 65,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, simply summing the contextual word’s vectors together may result in noise-dominated second or­der context vectors.",
                    "sid": 66,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To deal with this problem, we extend the feature selection procedure further to the construction of second order context vectors: to select better feature words in contexts to construct better second order context vectors enabling better feature selection.",
                    "sid": 67,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the sense associated with a word’s occur­rence is always determined by some feature words in its contexts, it is reasonable to suppose that the selected features should cover most of occurrences.",
                    "sid": 68,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Formally, let coverage(D, T ) be the coverage rate of the feature set T with respect to a set of con­texts D, i.e., the ratio of the number of the occur­rences with at least one feature in their local con­texts against the total number of occurrences, then we assume that coverage(D, T ) = t . In practice, we set t =0.9.",
                    "sid": 69,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This assumption also helps to avoid the bias to­ward the selection of fewer features, since with fewer features, there are more occurrences without features in contexts, and their context vectors will be zero valued, which tends to result in more stable cluster structure.",
                    "sid": 70,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let D be a set of local contexts of occurrences of target word, then D = {di}N , where di represents i=1 local context of the i-th occurrence, and N is the total number of this word’s occurrences.",
                    "sid": 71,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "W is used to denote bag of words occurring in context set D, then W = {wi}M , where wi de­ i=1 notes a word occurring in D, and M is the total number of different contextual words.",
                    "sid": 72,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let V denote a M × M second-order co-occurrence symmetric matrix.",
                    "sid": 73,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suppose that the i-th , 1 = i = M, row in the second order matrix corre­sponds to word wi and the j-th , 1 = j = M, col­umn corresponds to word wj, then the entry speci­.ed by i-th row and j-th column records the number of times that word wi occurs close to wj in corpus.",
                    "sid": 74,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use v(wi) to represent the word vector of con­textual word wi, which is the i-th row in matrix V . HT is a weight matrix of contextual word subset T , T . W . Then each entry hi,j represents the weight of word wj in di, wj . T , 1 = i = N. We use binary term weighting method to derive context vectors: hi,j =1 if word wj occurs in di, otherwise zero.",
                    "sid": 75,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "T Let CT = {ci }N be a set of context vectors in i=1 T feature space T , where cis the context vector of i the i-th occurrence.",
                    "sid": 76,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "cTi is de.ned as: T c = L (1) i (hi,j v(wj )),wj . T, 1 = i = N. j The feature subset selection in word set W can be formulated as: ˆ T = arg max {criterion(T, H, V, q)},T . W, (2) T subject to coverage(D, T ) = t , where Tˆis the op­timal feature subset, criterion is the cluster valida­tion based evaluation function (the function in Ta­ble 1), q is the resampling frequency for estimate of stability, and coverage(D, T ) is the proportion of contexts with occurrences of features in T . This constrained optimization results in a solution which maximizes the criterion and meets the given con­straint at the same time.",
                    "sid": 77,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we use se­quential greedy forward .oating search (Pudil et al., 1994) in sorted word list based on .2 or local fre­quency criterion.",
                    "sid": 78,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We set l =1, m =1, where l is plus step, and m is take-away step.",
                    "sid": 79,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Clustering with order identi.cation.",
                    "sid": 80,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After feature selection, we employ a Gaussian mix­ture modelling algorithm, Cluster (Bouman et al., Table 1: Unsupervised Feature Subset Evaluation Algorithm.",
                    "sid": 81,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intuitively, for a given feature subset T , we iteratively split data set into disjoint halves, and compute the agreement of cluster­ing solutions estimated from these sets using stability measure.",
                    "sid": 82,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The average of stability over q resampling is the estimation of the score of T . Function criterion(T , H, V , q) Input parameter: feature subset T , weight matrix H, second order co-occurrence matrix V , resampling frequency q; (1) ST =0; (2) For i =1 to q do (2.1) Randomly split CT into disjoint halves, denoted as CT and CT AB ; (2.2) Estimate GMM parameter and cluster number on CT A using Cluster, and the parameter set is denoted as .ˆA; The solution .ˆA can be used to construct a predictor .A; (2.3) Estimate GMM parameter and cluster number on CT B using Cluster, and the parameter set is denoted as .ˆB, The solution .ˆB can be used to construct a predictor .B ; (2.4) Classify CT B using .A and .B; The class labels assigned by .A and .B are denoted as LA and LB ; TT (2.5) ST += maxp |C1 T | Li 1{p(LA(cBi)) = LB(cBi)}, B where p denotes possible permutation relating indices between LA and LB , and c TB ; Bi . CT (3) ST = q 1 ST ; (4) Return ST ; 1998), to estimate cluster structure and cluster num­ber.",
                    "sid": 83,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let Y = {yn}N be a set of M dimen­ n=1 sional vectors to be modelled by GMM.",
                    "sid": 84,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Assuming that this model has K subclasses, let pk denote the prior probability of subclass k, µk denote the M di­mensional mean vector for subclass k, Rk denote the M × M dimensional covariance matrix for sub­class k, 1 = k = K. The subclass label for pixel yn is represented by xn.",
                    "sid": 85,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MDL criterion is used for GMM parameter estimation and order identi.­cation, which is given by: N 1 MDL(K, .)= - Llog (pyn|xn (yn|T)) + L log (NM), 2 n=1 (3) K pyn|xn (yn|T) = Lpyn|xn (yn|k, .)pk, (4) k=1 (M + 1)M L = K(1 + M +) - 1, (5) 2 The log likelihood measures the goodness of .t of a model to data sample, while the second term pe­nalizes complex model.",
                    "sid": 86,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This estimator works by at­tempting to .nd a model order with minimum code length to describe the data sample Y and parameter set T. If the cluster number is .xed, the estimation of GMM parameter can be solved using EM algorithm to address this type of incomplete data problem (Dempster et al., 1977).",
                    "sid": 87,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The initialization of mix­ture parameter .(1) is given by: (1) 1 pk = (6)Ko (1) µk = yn, where n = l(k - 1)(N - 1)/(Ko1)J +1 (7) (1) 1 Nt Rk =Sn=1ynyn (8) N Ko is a given initial subclass number.",
                    "sid": 88,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then EM algorithm is used to estimate model pa­rameters by minimizing MDL: E-step: re-estimate the expectations based on pre­vious iteration: (i)pyn|xn (yn|k, .(i))pk pxn|yn (k|yn,.)= , (9)LK (pyn|xn (yn|l, .(i))pl) l=1 M-step: estimate the model parameter .(i) to maximize the log-likelihood in MDL: N L Nk = Table 2: Four ambiguous words, their senses and frequency distribution of each sense.",
                    "sid": 89,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word Sense Percentage hard not easy (dif.cult) 82.8% (adjective) not soft (metaphoric) 9.6% not soft (physical) 7.6% interest money paid for the use of money 52.4% a share in a company or business 20.4% readiness to give attention 14% advantage, advancement or favor 9.4% activity that one gives attention to 3.6% causing attention to be given to 0.2% line product 56% (noun) telephone connection 10.6% written or spoken text 9.8% cord 8.6% division 8.2% formation 6.8% serve supply with food 42.6% (verb) hold an of.ce 33.6% function as something 16% provide a service 7.8%",
                    "sid": 90,
                    "ssid": 41,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments and evaluation. ",
            "number": "3",
            "sents": [
                {
                    "text": "(k|yn,.(i)) (10) pxn|yn 3.1 Test data.",
                    "sid": 91,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "n=1 We constructed four datasets from hand-tagged cor­pk = Nk (11) pus 1 by randomly selecting 500 instances for each N ambiguous word -“hard”, “interest”, “line”, and “serve”.",
                    "sid": 92,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The details of these datasets are given in Table 2.",
                    "sid": 93,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our preprocessing included lowering the N Nk n=1 L 1 ynpxn|yn (k|yn,.(i)) (12) µk = upper case characters, ignoring all words that con­tain digits or non alphanumeric characters, remov N n=1 L (13) 1 Nk (yn - µk)(yn - µk)t pxn|yn (k|yn,.(i)) ing words from a stop word list, and .ltering out Rk = low frequency words which appeared only once in entire set.",
                    "sid": 94,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We did not use stemming procedure.",
                    "sid": 95,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sense tags were removed when they were used 1 (i)|Rk|-1/2 pyn|xn (yn|k, .) = exp{.}",
                    "sid": 96,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(14) (2p)M/2 1)t-1 . = - (yn - µkRk (yn - µk) (15) 2 The EM iteration is terminated when the change of MDL(K, .) is less than E: 1(M + 1)M E = (1+ M +)log(NM) (16) 100 2 For inferring the cluster number, EM algorithm is applied for each value of K, 1 = K = Ko, and ˆ the value K which minimizes the value of MDL is chosen as the correct cluster number.",
                    "sid": 97,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To make by F SGMM and CGD.",
                    "sid": 98,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In evaluation procedure, these sense tags were used as ground truth classes.",
                    "sid": 99,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A second order co-occurrence matrix for English words was constructed using English version of Xinhua News (Jan. 1998Dec.",
                    "sid": 100,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1999).",
                    "sid": 101,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The win­dow size for counting second order co-occurrence was 50 words.",
                    "sid": 102,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Evaluation method for feature selection.",
                    "sid": 103,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For evaluation of feature selection, we used mutual information between feature subset and class label set to assess the importance of selected feature sub­set.",
                    "sid": 104,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our assessment measure is de.ned as: L L this process more ef.cient, two cluster pair l and m 1 M(T )= p(w, l) , (17) p(w, l)log |T | p(w)p(l)are selected to minimize the change in MDL crite w.Tl.L ria when reducing K to K - 1.",
                    "sid": 105,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These two clusters l and m are then merged.",
                    "sid": 106,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting parameter set is chosen as an initial condition for EM iteration with K - 1 subclasses.",
                    "sid": 107,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This operation will avoid a complete minimization with respect to p, µ, and R for each value of K. where T is the feature subset to be evaluated, T . W , L is class label set, p(w, l) is the joint distri­bution of two variables w and l, p(w) and p(l) are marginal probabilities.",
                    "sid": 108,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "p(w, l) is estimated based 1http://www.d.umn.edu/~tpederse/data.html on contingency table of contextual word set W and class label set L. Intuitively, if M(T1) >M(T2), T1 is more important than T2 since T1 contains more information about L. 3.3 Evaluation method for clustering result.",
                    "sid": 109,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When assessing the agreement between clustering result and hand-tagged senses (ground truth classes) in benchmark data, we encountered the dif.culty that there was no sense tag for each cluster.",
                    "sid": 110,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (Lange et al., 2002), they de.ned a permu­tation procedure for calculating the agreement be­tween two cluster memberships assigned by differ­ent unsupervised learners.",
                    "sid": 111,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we applied their method to assign different sense tags to only min(|U|, |C|) clusters by maximizing the accuracy, where |U| is the number of clusters, and |C| is the number of ground truth classes.",
                    "sid": 112,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The underlying as­sumption here is that each cluster is considered as a class, and for any two clusters, they do not share same class labels.",
                    "sid": 113,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At most |C| clusters are assigned sense tags, since there are only |C| classes in bench­mark data.",
                    "sid": 114,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the contingency table Q between clusters and ground truth classes, each entry Qi,j gives the number of occurrences which fall into both the i-th cluster and the j-th ground truth class.",
                    "sid": 115,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If |U| < |C|, we constructed empty clusters so that |U| = |C|.",
                    "sid": 116,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let O represent a one-to-one mapping function from C to U. It means that O(j1) .O(j2) if j1 = j2 and vice versa, 1 = j1,j2 =|C|.",
                    "sid": 117,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then O(j) is the index of the cluster associated with the j-th class.",
                    "sid": 118,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Searching a mapping function to maximize the accuracy of U can be formulated as: |C| O = arg max ˆLQO(j),j .",
                    "sid": 119,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(18) O j=1 Then the accuracy of solution U is given by Lj Qˆ O(j),j Accuracy(U)= .",
                    "sid": 120,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(19) Qi,jLi,j In fact, Li,j Qi,j is equal to N, the number of occurrences of target word in test set.",
                    "sid": 121,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Experiments and results.",
                    "sid": 122,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each dataset, we tested following procedures: CGDterm:We implemented the context group discrimination algorithm.",
                    "sid": 123,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Top max(|W |× 20%, 100) words in contextual word list was se­lected as features using frequency or .2 based rank­ing.",
                    "sid": 124,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then k-means clustering2 was performed on context vector matrix using normalized Euclidean distance.",
                    "sid": 125,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "K-means clustering was repeated 5 times 2We used k-means function in statistics toolbox of Matlab.",
                    "sid": 126,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and the partition with best quality was chosen as .­nal result.",
                    "sid": 127,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of clusters used by k-means was set to be identical with the number of ground truth classes.",
                    "sid": 128,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We tested CGDterm using various word vector weighting methods when deriving con­text vectors, ex.",
                    "sid": 129,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "binary, idf, tf · idf.",
                    "sid": 130,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CGDSV D: The context vector matrix was de­rived using same method in CGDterm.",
                    "sid": 131,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then k-means clustering was conducted on latent seman­tic space transformed from context vector matrix, using normalized Euclidean distance.",
                    "sid": 132,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Speci.cally, context vectors were reduced to 100 dimensions us­ing SVD.",
                    "sid": 133,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the dimension of context vector was less than 100, all of latent semantic vectors with nonzero eigenvalue were used for subsequent clus­tering.",
                    "sid": 134,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also tested it using different weighting methods, ex.",
                    "sid": 135,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "binary, idf, tf · idf.",
                    "sid": 136,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F SGMM: We performed cluster validation based feature selection in feature set used by CGD.",
                    "sid": 137,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then Cluster algorithm was used to group target word’s instances using Euclidean distance measure.",
                    "sid": 138,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "t was set as 0.90 in feature subset search procedure.",
                    "sid": 139,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The random splitting frequency is set as 10 for es­timation of the score of feature subset.",
                    "sid": 140,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The initial subclass number was 20 and full covariance matrix was used for parameter estimation of each subclass.",
                    "sid": 141,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For investigating the effect of different context window size on the performance of three proce­dures, we tested these procedures using various con­text window sizes: ±1, ±5, ±15, ±25, and all of contextual words.",
                    "sid": 142,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The average length of sentences in 4 datasets is 32 words before preprocessing.",
                    "sid": 143,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Per­formance on each dataset was assessed by equation 19.",
                    "sid": 144,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The scores of feature subsets selected by F SGMM and CGD are listed in Table 3 and 4.",
                    "sid": 145,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The average accuracy of three procedures with different feature ranking and weighting method is given in Table 5.",
                    "sid": 146,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each .gure is the average over 5 different context window size and 4 datasets.",
                    "sid": 147,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We give out the detailed results of these three proce­dures in Figure 1.",
                    "sid": 148,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several results should be noted speci.cally:.",
                    "sid": 149,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From Table 3 and 4, we can .nd that F SGMM achieved better score on mutual information (MI) measure than CGD over 35 out of total 40 cases.",
                    "sid": 150,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is the evidence that our feature selection pro­cedure can remove noise and retain important fea­tures.",
                    "sid": 151,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As it was shown in Table 5, with both .2 and freq based feature ranking, F SGMM algorithm performed better than CGDterm and CGDSV D if we used average accuracy to evaluate their per­formance.",
                    "sid": 152,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Speci.cally, with .2 based feature ranking, F SGMM attained 55.4% average accu­racy, while the best average accuracy of CGDterm and CGDSV D were 40.9% and 51.3% respec­tively.",
                    "sid": 153,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With freq based feature ranking, F SGMM achieved 51.2% average accuracy, while the best av­erage accuracy of CGDterm and CGDSV D were 45.1% and 50.2%.",
                    "sid": 154,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The automatically estimated cluster numbers by F SGMM over 4 datasets are given in Table 6.",
                    "sid": 155,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The estimated cluster number was 2 ~ 4 for “hard”, 3 ~ 6 for “interest”, 3 ~ 6 for “line”, and 2 ~ 4 for “serve”.",
                    "sid": 156,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is noted that the estimated cluster number was less than the number of ground truth classes in most cases.",
                    "sid": 157,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are some reasons for this phenomenon.",
                    "sid": 158,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the data is not balanced, which may lead to that some important features can­not be retrieved.",
                    "sid": 159,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the fourth sense of “serve”, and the sixth sense of “line”, their corre­sponding features are not up to the selection criteria.",
                    "sid": 160,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, some senses can not be distinguished using only bag-of-words information, and their difference lies in syntactic information held by features.",
                    "sid": 161,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the third sense and the sixth sense of “in­terest” may be distinguished by syntactic relation of feature words, while the bag of feature words occur­ring in their context are similar.",
                    "sid": 162,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Third, some senses are determined by global topics, rather than local contexts.",
                    "sid": 163,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, according to global topics, it may be easier to distinguish the .rst and the second sense of “interest”.",
                    "sid": 164,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows the average accuracy over three procedures in Figure 1 as a function of context window size for 4 datasets.",
                    "sid": 165,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For “hard”, the per­formance dropped as window size increased, and the best accuracy(77.0%) was achieved at win­dow size 1.",
                    "sid": 166,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For “interest”, sense discrimination did not bene.t from large window size and the best accuracy(40.1%) was achieved at window size 5.",
                    "sid": 167,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For “line”, accuracy dropped when increas­ing window size and the best accuracy(50.2%) was achieved at window size 1.",
                    "sid": 168,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For “serve”, the per­formance bene.tted from large window size and the best accuracy(46.8%) was achieved at window size.",
                    "sid": 169,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "15.",
                    "sid": 170,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (Leacock et al., 1998), they used Bayesian ap­proach for sense disambiguation of three ambiguous words, “hard”, “line”, and “serve”, based on cues from topical and local context.",
                    "sid": 171,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They observed that local context was more reliable than topical context as an indicator of senses for this verb and adjective, but slightly less reliable for this noun.",
                    "sid": 172,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared with their conclusion, we can .nd that our result.",
                    "sid": 173,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is consistent with it for “hard”.",
                    "sid": 174,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But there is some differences for verb “serve” and noun “line”.",
                    "sid": 175,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Table 3: Mutual information between feature subset and class label with .2 based feature ranking.",
                    "sid": 176,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word Cont.",
                    "sid": 177,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "wind.",
                    "sid": 178,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "size Size of feature subset of CGD MI ×102 Size of feature subset of FSGMM MI ×102 hard 1 5 15 25 all 18 100 100 133 145 6.4495 0.4018 0.1362 0.0997 0.0937 14 80 80 102 107 8.1070 0.4300 0.1416 0.1003 0.0890 interest 1 5 15 25 all 64 100 157 190 200 1.9697 0.3234 0.1558 0.1230 0.1163 55 89 124 138 140 2.0639 0.3355 0.1531 0.1267 0.1191 line 1 5 15 25 all 39 100 183 263 351 4.2089 0.4628 0.1488 0.1016 0.0730 32 84 128 163 192 4.6456 0.4871 0.1429 0.0962 0.0743 serve 1 5 15 25 all 22 100 188 255 320 6.8169 0.5057 0.2078 0.1503 0.1149 20 85 164 225 244 6.7043 0.5227 0.2094 0.1536 0.1260 Table 4: Mutual information between feature subset and class label with freq based feature ranking.",
                    "sid": 179,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word Cont.",
                    "sid": 180,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "wind.",
                    "sid": 181,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "size Size of feature subset of CGD MI ×102 Size of feature subset of FSGMM MI ×102 hard 1 5 15 25 all 18 100 100 133 145 6.4495 0.4194 0.1647 0.1150 0.1064 14 80 80 102 107 8.1070 0.4832 0.1774 0.1259 0.1269 interest 1 5 15 25 all 64 100 157 190 200 1.9697 0.6015 0.2526 0.1928 0.1811 55 89 124 138 140 2.7051 0.8309 0.3495 0.2982 0.2699 line 1 5 15 25 all 39 100 183 263 351 4.2089 0.6895 0.2301 0.1498 0.1059 32 84 128 163 192 4.4606 0.7816 0.2929 0.2181 0.1630 serve 1 5 15 25 all 22 100 188 255 320 6.8169 0.7045 0.2763 0.1901 0.1490 20 85 164 225 244 7.0021 0.8422 0.3418 0.2734 0.2309 “serve”, the possible reason is that we do not use position of local word and part of speech informa­tion, which may deteriorate the performance when local context(= 5 words) is used.",
                    "sid": 182,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For “line”, the reason might come from the feature subset, which is not good enough to provide improvement when Table 5: settings over 4 datasets.",
                    "sid": 183,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Algorithm Feature Feature Average ranking weighting accuracy method method FSGMM .2 binary 0.554 CGDterm binary 0.404 .2 CGDterm idf 0.407.",
                    "sid": 184,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": ".2 CGDterm tf · idf 0.409.",
                    "sid": 185,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": ".2 CGDSV D .2 binary 0.513 CGDSV D idf 0.512.",
                    "sid": 186,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": ".2 CGDSV D tf · idf 0.508.",
                    "sid": 187,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": ".2 FSGMM freq binary 0.512 CGDterm freq binary 0.451 CGDterm freq idf 0.437 CGDterm freq tf · idf 0.447 CGDSV D freq binary 0.502 CGDSV D freq idf 0.498 CGDSV D freq tf · idf 0.485.",
                    "sid": 188,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6: ber.",
                    "sid": 189,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word Context Model Model window order order size with .2 with freq hard 1 3 4 5 2 2 15 2 3 25 2 3 all 2 3 interest 1 5 4 5 3 4 15 4 6 25 4 6 all 3 4 line 1 5 6 5 4 3 15 5 4 25 5 4 all 3 4 serve 1 3 3 5 3 4 15 3 3 25 3 3 all 2 4 context window size is no less than 5.",
                    "sid": 190,
                    "ssid": 100,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "4",
            "sents": [
                {
                    "text": "Besides the two works (Pantel and Lin, 2002; Schu¨tze, 1998), there are other related efforts on word sense discrimination (Dorow and Widdows, 2003; Fukumoto and Suzuki, 1999; Pedersen and Bruce, 1997).",
                    "sid": 191,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (Pedersen and Bruce, 1997), they described an experimental comparison of three clustering algo­rithms for word sense discrimination.",
                    "sid": 192,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their feature sets included morphology of target word, part of speech of contextual words, absence or presence of particular contextual words, and collocation of fre Figure 2: Average accuracy over three procedures in Figure 1 as a function of context window size (horizontal axis) for 4 datasets.",
                    "sid": 193,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "quent words.",
                    "sid": 194,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then occurrences of target word were grouped into a prede.ned number of clusters.",
                    "sid": 195,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sim­ilar with many other algorithms, their algorithm also required the cluster number to be provided.",
                    "sid": 196,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (Fukumoto and Suzuki, 1999), a term weight learning algorithm was proposed for verb sense dis­ambiguation, which can automatically extract nouns co-occurring with verbs and identify the number of senses of an ambiguous verb.",
                    "sid": 197,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The weakness of their method is to assume that nouns co-occurring with verbs are disambiguated in advance and the number of senses of target verb is no less than two.",
                    "sid": 198,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm in (Dorow and Widdows, 2003) represented target noun word, its neighbors and their relationships using a graph in which each node denoted a noun and two nodes had an edge between them if they co-occurred with more than a given number of times.",
                    "sid": 199,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then senses of target word were iteratively learned by clustering the local graph of similar words around target word.",
                    "sid": 200,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their algorithm required a threshold as input, which controlled the number of senses.",
                    "sid": 201,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion and future work. ",
            "number": "5",
            "sents": [
                {
                    "text": "Our word sense learning algorithm combined two novel ingredients: feature selection and order iden­ti.cation.",
                    "sid": 202,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feature selection was formalized as a constrained optimization problem, the output of which was a set of important features to determine word senses.",
                    "sid": 203,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both cluster structure and cluster num­ber were estimated by minimizing a MDL crite­rion.",
                    "sid": 204,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experimental results showed that our algo­rithm can retrieve important features, estimate clus­ter number automatically, and achieve better per­formance in terms of average accuracy than CGD algorithm which required cluster number as input.",
                    "sid": 205,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our word sense learning algorithm is unsupervised in two folds: no requirement of sense tagged data, and no requirement of prede.nition of sense num­ber, which enables the automatic discovery of word senses from free text.",
                    "sid": 206,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our algorithm, we treat bag of words in lo­cal contexts as features.",
                    "sid": 207,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has been shown that local collocations and morphology of target word play important roles in word sense disambiguation or discrimination (Leacock et al., 1998; Widdows, 2003).",
                    "sid": 208,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is necessary to incorporate these more structural information to improve the performance of word sense learning.",
                    "sid": 209,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}