{
    "ID": "P05-1053",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Exploring Various Knowledge in Relation Extraction",
                    "sid": 0,
                    "ssid": null,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extracting semantic relationships between entities is challenging.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper investigates the incorporation of diverse lexical, syntactic and semantic knowledge in feature-based relation extraction using SVM.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our study illustrates that the base phrase chunking information is very effective for relation extraction and contributes to most of the performance improvement from syntactic aspect while additional information from full parsing gives limited further enhancement.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that most of useful information in full parse trees for relation extraction is shallow and can be captured by chunking.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also demonstrate how semantic information such as WordNet and Name List, can be used in feature-based relation extraction to further improve the performance.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation on the ACE corpus shows that effective incorporation of diverse features enables our system outperform previously best-reported systems on the 24 ACE relation subtypes and significantly outperforms tree kernel-based systems by over 20 in F-measure on the 5 ACE relation types.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "With the dramatic increase in the amount of textual information available in digital archives and the WWW, there has been growing interest in techniques for automatically extracting information from text.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Information Extraction (IE) systems are expected to identify relevant information (usually of predefined types) from text documents in a certain domain and put them in a structured format.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to the scope of the NIST Automatic Content Extraction (ACE) program, current research in IE has three main objectives: Entity Detection and Tracking (EDT), Relation Detection and Characterization (RDC), and Event Detection and Characterization (EDC).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The EDT task entails the detection of entity mentions and chaining them together by identifying their coreference.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In ACE vocabulary, entities are objects, mentions are references to them, and relations are semantic relationships between entities.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Entities can be of five types: persons, organizations, locations, facilities and geopolitical entities (GPE: geographically defined regions that indicate a political boundary, e.g. countries, states, cities, etc.).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mentions have three levels: names, nomial expressions or pronouns.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The RDC task detects and classifies implicit and explicit relations1 between entities identified by the EDT task.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, we want to determine whether a person is at a location, based on the evidence in the context.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extraction of semantic relationships between entities can be very useful for applications such as question answering, e.g. to answer the query “Who is the president of the United States?”.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper focuses on the ACE RDC task and employs diverse lexical, syntactic and semantic knowledge in feature-based relation extraction using Support Vector Machines (SVMs).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our study illustrates that the base phrase chunking information contributes to most of the performance inprovement from syntactic aspect while additional full parsing information does not contribute much, largely due to the fact that most of relations defined in ACE corpus are within a very short distance.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also demonstrate how semantic information such as WordNet (Miller 1990) and Name List can be used in the feature-based framework.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation shows that the incorporation of diverse features enables our system achieve best reported performance.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also shows that our fea 1 In ACE (http://www.ldc.upenn.edu/Projects/ACE),.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "explicit relations occur in text with explicit evidence suggesting the relationships.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Implicit relations need not have explicit supporting evidence in text, though they should be evident from a reading of the document.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "427 Proceedings of the 43rd Annual Meeting of the ACL, pages 427–434, Ann Arbor, June 2005.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2005 Association for Computational Linguistics ture-based approach outperforms tree kernel-based approaches by 11 F-measure in relation detection and more than 20 F-measure in relation detection and classification on the 5 ACE relation types.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of this paper is organized as follows.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2 presents related work.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 and Section 4 describe our approach and various features employed respectively.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we present experimental setting and results in Section 5 and conclude with some general observations in relation extraction in Section 6.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "The relation extraction task was formulated at the 7th Message Understanding Conference (MUC7 1998) and is starting to be addressed more and more within the natural language processing and machine learning communities.",
                    "sid": 30,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Miller et al (2000) augmented syntactic full parse trees with semantic information corresponding to entities and relations, and built generative models for the augmented trees.",
                    "sid": 31,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zelenko et al (2003) proposed extracting relations by computing kernel functions between parse trees.",
                    "sid": 32,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Culotta et al (2004) extended this work to estimate kernel functions between augmented dependency trees and achieved 63.2 F-measure in relation detection and 45.8 F-measure in relation detection and classification on the 5 ACE relation types.",
                    "sid": 33,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Kambhatla (2004) employed Maximum Entropy models for relation extraction with features derived from word, entity type, mention level, overlap, dependency tree and parse tree.",
                    "sid": 34,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It achieves 52.8 F- measure on the 24 ACE relation subtypes.",
                    "sid": 35,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhang (2004) approached relation classification by combining various lexical and syntactic features with bootstrapping on top of Support Vector Machines.",
                    "sid": 36,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tree kernel-based approaches proposed by Zelenko et al (2003) and Culotta et al (2004) are able to explore the implicit feature space without much feature engineering.",
                    "sid": 37,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yet further research work is still expected to make it effective with complicated relation extraction tasks such as the one defined in ACE.",
                    "sid": 38,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Complicated relation extraction tasks may also impose a big challenge to the modeling approach used by Miller et al (2000) which integrates various tasks such as part-of-speech tagging, named entity recognition, template element extraction and relation extraction, in a single model.",
                    "sid": 39,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper will further explore the feature-based approach with a systematic study on the extensive incorporation of diverse lexical, syntactic and semantic information.",
                    "sid": 40,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared with Kambhatla (2004), we separately incorporate the base phrase chunking information, which contributes to most of the performance improvement from syntactic aspect.",
                    "sid": 41,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also show how semantic information like WordNet and Name List can be equipped to further improve the performance.",
                    "sid": 42,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation on the ACE corpus shows that our system outperforms Kambhatla (2004) by about 3 F-measure on extracting 24 ACE relation subtypes.",
                    "sid": 43,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also shows that our system outperforms tree kernel-based systems (Culotta et al 2004) by over 20 F-measure on extracting 5 ACE relation types.",
                    "sid": 44,
                    "ssid": 15,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "support vector machines. ",
            "number": "3",
            "sents": [
                {
                    "text": "Support Vector Machines (SVMs) are a supervised machine learning technique motivated by the statistical learning theory (Vapnik 1998).",
                    "sid": 45,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on the structural risk minimization of the statistical learning theory, SVMs seek an optimal separating hyper-plane to divide the training examples into two classes and make decisions based on support vectors which are selected as the only effective instances in the training set.",
                    "sid": 46,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basically, SVMs are binary classifiers.",
                    "sid": 47,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we must extend SVMs to multi-class (e.g. K) such as the ACE RDC task.",
                    "sid": 48,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For efficiency, we apply the one vs. others strategy, which builds K classifiers so as to separate one class from all others, instead of the pairwise strategy, which builds K*(K-1)/2 classifiers considering all pairs of classes.",
                    "sid": 49,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final decision of an instance in the multiple binary classification is determined by the class which has the maximal SVM output.",
                    "sid": 50,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, we only apply the simple linear kernel, although other kernels can peform better.",
                    "sid": 51,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason why we choose SVMs for this purpose is that SVMs represent the state-of–the-art in the machine learning research community, and there are good implementations of the algorithm available.",
                    "sid": 52,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we use the binary-class SVMLight2 deleveloped by Joachims (1998).",
                    "sid": 53,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Joachims has just released a new version of SVMLight.",
                    "sid": 54,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "for multi-class classification.",
                    "sid": 55,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, this paper only uses the binary-class version.",
                    "sid": 56,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For details about SVMLight, please see http://svmlight.joachims.org/",
                    "sid": 57,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "features. ",
            "number": "4",
            "sents": [
                {
                    "text": "The semantic relation is determined between two mentions.",
                    "sid": 58,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we distinguish the argument order of the two mentions (M1 for the first mention and M2 for the second mention), e.g. M1-Parent- Of-M2 vs. M2-Parent-Of-M1.",
                    "sid": 59,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each pair of mentions3, we compute various lexical, syntactic and semantic features.",
                    "sid": 60,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Words.",
                    "sid": 61,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to their positions, four categories of words are considered: 1) the words of both the mentions, 2) the words between the two mentions, 3) the words before M1, and 4) the words after M2.",
                    "sid": 62,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the words of both the mentions, we also differentiate the head word4 of a mention from other words since the head word is generally much more important.",
                    "sid": 63,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The words between the two mentions are classified into three bins: the first word in between, the last word in between and other words in between.",
                    "sid": 64,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both the words before M1 and after M2 are classified into two bins: the first word next to the mention and the second word next to the mention.",
                    "sid": 65,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since a pronominal mention (especially neutral pronoun such as ‘it’ and ‘its’) contains little information about the sense of the mention, the co- reference chain is used to decide its sense.",
                    "sid": 66,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is done by replacing the pronominal mention with the most recent non-pronominal antecedent when determining the word features, which include: • WM1: bag-of-words in M1 • HM1: head word of M1 3 In ACE, each mention has a head annotation and an.",
                    "sid": 67,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "extent annotation.",
                    "sid": 68,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all our experimentation, we only consider the word string between the beginning point of the extent annotation and the end point of the head annotation.",
                    "sid": 69,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This has an effect of choosing the base phrase contained in the extent annotation.",
                    "sid": 70,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, this also can reduce noises without losing much of information in the mention.",
                    "sid": 71,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the case where the noun phrase “the former CEO of McDonald” has the head annotation of “CEO” and the extent annotation of “the former CEO of McDonald”, we only consider “the former CEO” in this paper.",
                    "sid": 72,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 In this paper, the head word of a mention is normally.",
                    "sid": 73,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "set as the last word of the mention.",
                    "sid": 74,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, when a preposition exists in the mention, its head word is set as the last word before the preposition.",
                    "sid": 75,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the head word of the name mention “University of Michigan” is “University”.",
                    "sid": 76,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• WM2: bag-of-words in M2 • HM2: head word of M2 • HM12: combination of HM1 and HM2 • WBNULL: when no word in between • WBFL: the only word in between when only one word in between • WBF: first word in between when at least two words in between • WBL: last word in between when at least two words in between • WBO: other words in between except first and last words when at least three words in between • BM1F: first word before M1 • BM1L: second word before M1 • AM2F: first word after M2 • AM2L: second word after M2 4.2 Entity Type.",
                    "sid": 77,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This feature concerns about the entity type of both the mentions, which can be PERSON, ORGANIZATION, FACILITY, LOCATION and GeoPolitical Entity or GPE: • ET12: combination of mention entity types 4.3 Mention Level.",
                    "sid": 78,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This feature considers the entity level of both the mentions, which can be NAME, NOMIAL and PRONOUN: • ML12: combination of mention levels 4.4 Overlap.",
                    "sid": 79,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This category of features includes: • #MB: number of other mentions in between • #WB: number of words in between • M1>M2 or M1<M2: flag indicating whether M2/M1is included in M1/M2.",
                    "sid": 80,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normally, the above overlap features are too general to be effective alone.",
                    "sid": 81,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, they are HM12+M1>M2; 4) HM12+M1<M2.",
                    "sid": 82,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.5 Base Phrase Chunking.",
                    "sid": 83,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is well known that chunking plays a critical role in the Template Relation task of the 7th Message Understanding Conference (MUC7 1998).",
                    "sid": 84,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The related work mentioned in Section 2 extended to explore the information embedded in the full parse trees.",
                    "sid": 85,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we separate the features of base phrase chunking from those of full parsing.",
                    "sid": 86,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, we can separately evaluate the contributions of base phrase chunking and full parsing.",
                    "sid": 87,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, the base phrase chunks are derived from full parse trees using the Perl script5 written by Sabine Buchholz from Tilburg University and the Collins’ parser (Collins 1999) is employed for full parsing.",
                    "sid": 88,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of the chunking features concern about the head words of the phrases between the two mentions.",
                    "sid": 89,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar to word features, three categories of phrase heads are considered: 1) the phrase heads in between are also classified into three bins: the first phrase head in between, the last phrase head in between and other phrase heads in between; 2) the phrase heads before M1 are classified into two bins: the first phrase head before and the second phrase head before; 3) the phrase heads after M2 are classified into two bins: the first phrase head after and the second phrase head after.",
                    "sid": 90,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, we also consider the phrase path in between.",
                    "sid": 91,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• CPHBNULL when no phrase in between • CPHBFL: the only phrase head when only one phrase in between • CPHBF: first phrase head in between when at least two phrases in between • CPHBL: last phrase head in between when at least two phrase heads in between • CPHBO: other phrase heads in between except first and last phrase heads when at least three phrases in between • CPHBM1F: first phrase head before M1 • CPHBM1L: second phrase head before M1 • CPHAM2F: first phrase head after M2 • CPHAM2F: second phrase head after M2 • CPP: path of phrase labels connecting the two mentions in the chunking • CPPH: path of phrase labels connecting the two mentions in the chunking augmented with head words, if at most two phrases in between 4.6 Dependency Tree.",
                    "sid": 92,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This category of features includes information about the words, part-of-speeches and phrase labels of the words on which the mentions are dependent in the dependency tree derived from the syntactic full parse tree.",
                    "sid": 93,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The dependency tree is built by using the phrase head information returned by the Collins’ parser and linking all the other fragments in a phrase to its head.",
                    "sid": 94,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also includes flags indicating whether the two mentions are in the same NP/PP/VP.",
                    "sid": 95,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• ET1DW1: combination of the entity type and the dependent word for M1 • H1DW1: combination of the head word and the dependent word for M1 • ET2DW2: combination of the entity type and the dependent word for M2 • H2DW2: combination of the head word and the dependent word for M2 • ET12SameNP: combination of ET12 and whether M1 and M2 included in the same NP • ET12SamePP: combination of ET12 and whether M1 and M2 exist in the same PP • ET12SameVP: combination of ET12 and whether M1 and M2 included in the same VP 4.7 Parse Tree.",
                    "sid": 96,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This category of features concerns about the information inherent only in the full parse tree.",
                    "sid": 97,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• PTP: path of phrase labels (removing duplicates) connecting M1 and M2 in the parse tree • PTPH: path of phrase labels (removing duplicates) connecting M1 and M2 in the parse tree augmented with the head word of the top phrase in the path.",
                    "sid": 98,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.8 Semantic Resources.",
                    "sid": 99,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantic information from various resources, such as WordNet, is used to classify important words into different semantic lists according to their indicating relationships.",
                    "sid": 100,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Country Name List This is to differentiate the relation subtype “ROLE.Citizen-Of”, which defines the relationship between a person and the country of the person’s citizenship, from other subtypes, especially “ROLE.Residence”, where defines the relationship between a person and the location in which the person lives.",
                    "sid": 101,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two features are defined to include this information: • ET1Country: the entity type of M1 when M2 is a country name • CountryET2: the entity type of M2 when M1 is a country name 5 http://ilk.kub.nl/~sabine/chunklink/ Personal Relative Trigger Word List This is used to differentiate the six personal social relation subtypes in ACE: Parent, Grandparent, Spouse, Sibling, Other-Relative and Other- Personal.",
                    "sid": 102,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This trigger word list is first gathered from WordNet by checking whether a word has the semantic class “person|…|relative”.",
                    "sid": 103,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, all the trigger words are semi-automatically6 classified into different categories according to their related personal social relation subtypes.",
                    "sid": 104,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also extend the list by collecting the trigger words from the head words of the mentions in the training data according to their indicating relationships.",
                    "sid": 105,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two features are defined to include this information: • ET1SC2: combination of the entity type of M1 and the semantic class of M2 when M2 triggers a personal social subtype.",
                    "sid": 106,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• SC1ET2: combination of the entity type of M2 and the semantic class of M1 when the first mention triggers a personal social subtype.",
                    "sid": 107,
                    "ssid": 50,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimentation. ",
            "number": "5",
            "sents": [
                {
                    "text": "This paper uses the ACE corpus provided by LDC to train and evaluate our feature-based relation extraction system.",
                    "sid": 108,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ACE corpus is gathered from various newspapers, newswire and broadcasts.",
                    "sid": 109,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we only model explicit relations because of poor inter-annotator agreement in the annotation of implicit relations and their limited number.",
                    "sid": 110,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Experimental Setting.",
                    "sid": 111,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the official ACE corpus from LDC.",
                    "sid": 112,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training set consists of 674 annotated text documents (~300k words) and 9683 instances of relations.",
                    "sid": 113,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During development, 155 of 674 documents in the training set are set aside for fine-tuning the system.",
                    "sid": 114,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The testing set is held out only for final evaluation.",
                    "sid": 115,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It consists of 97 documents (~50k words) and 1386 instances of relations.",
                    "sid": 116,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 lists the types and subtypes of relations for the ACE Relation Detection and Characterization (RDC) task, along with their frequency of occurrence in the ACE training set.",
                    "sid": 117,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that the",
                    "sid": 118,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "those words that have the semantic classes “parent”,. ",
            "number": "6",
            "sents": [
                {
                    "text": "“GrandParent”, “Spouse” and “Sibling” are automatically set with the same classes without change.",
                    "sid": 119,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, The remaining words that do not have above four classes are manually classified.",
                    "sid": 120,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ACE corpus suffers from a small amount of annotated data for a few subtypes such as the subtype “Founder” under the type “ROLE”.",
                    "sid": 121,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also shows that the ACE RDC task defines some difficult sub- types such as the subtypes “Based-In”, “Located” and “Residence” under the type “AT”, which are difficult even for human experts to differentiate.",
                    "sid": 122,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Type Subtype Freq Residence 308 Other 6 ROLE(4756) General-Staff 1331 Management 1242 Member 1091 Owner 232 Other 158 SOCIAL(827) Associate 91 Grandparent 12 Other-Personal 85 Spouse 77 Table 1: Relation types and subtypes in the ACE training data In this paper, we explicitly model the argument order of the two mentions involved.",
                    "sid": 123,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, when comparing mentions m1 and m2, we distinguish between m1-ROLE.Citizen-Of-m2 and m2- ROLE.Citizen-Of-m1.",
                    "sid": 124,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that only 6 of these 24 relation subtypes are symmetric: “Relative- Location”, “Associate”, “Other-Relative”, “Other- Professional”, “Sibling”, and “Spouse”.",
                    "sid": 125,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, we model relation extraction as a multi-class classification problem with 43 classes, two for each relation subtype (except the above 6 symmetric subtypes) and a “NONE” class for the case where the two mentions are not related.",
                    "sid": 126,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Experimental Results.",
                    "sid": 127,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we only measure the performance of relation extraction on “true” mentions with “true” chaining of coreference (i.e. as annotated by the corpus annotators) in the ACE corpus.",
                    "sid": 128,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 measures the performance of our relation extrac tion system over the 43 ACE relation subtypes on the testing set.",
                    "sid": 129,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that our system achieves best performance of 63.1%/49.5%/ 55.5 in precision/recall/F-measure when combining diverse lexical, syntactic and semantic features.",
                    "sid": 130,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 also measures the contributions of different features by gradually increasing the feature set.",
                    "sid": 131,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that: Features P R F Words 69.2 23.7 35.3 +Entity Type 67.1 32.1 43.4 +Mention Level 67.1 33.0 44.2 +Overlap 57.4 40.9 47.8 +Chunking 61.5 46.5 53.0 +Dependency Tree 62.1 47.2 53.6 +Parse Tree 62.3 47.6 54.0 +Semantic Resources 63.1 49.5 55.5 Table 2: Contribution of different features over 43 relation subtypes in the test data • Using word features only achieves the performance of 69.2%/23.7%/35.3 in precision/recall/F- measure.",
                    "sid": 132,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Entity type features are very useful and improve the F-measure by 8.1 largely due to the recall increase.",
                    "sid": 133,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• The usefulness of mention level features is quite limited.",
                    "sid": 134,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It only improves the F-measure by 0.8 due to the recall increase.",
                    "sid": 135,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Incorporating the overlap features gives some balance between precision and recall.",
                    "sid": 136,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It increases the F-measure by 3.6 with a big precision decrease and a big recall increase.",
                    "sid": 137,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Chunking features are very useful.",
                    "sid": 138,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It increases the precision/recall/F-measure by 4.1%/5.6%/ 5.2 respectively.",
                    "sid": 139,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• To our surprise, incorporating the dependency tree and parse tree features only improve the F- measure by 0.6 and 0.4 respectively.",
                    "sid": 140,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This may be due to the fact that most of relations in the ACE corpus are quite local.",
                    "sid": 141,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows that about 70% of relations exist where two mentions are embedded in each other or separated by at most one word.",
                    "sid": 142,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While short-distance relations dominate and can be resolved by above simple features, the dependency tree and parse tree features can only take effect in the remaining much less long-distance relations.",
                    "sid": 143,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, full parsing is always prone to long distance errors although the Collins’ parser used in our system represents the state-of-the-art in full parsing.",
                    "sid": 144,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Incorporating semantic resources such as the country name list and the personal relative trigger word list further increases the F-measure by 1.5 largely due to the differentiation of the relation subtype “ROLE.Citizen-Of” from “ROLE.",
                    "sid": 145,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Residence” by distinguishing country GPEs from other GPEs.",
                    "sid": 146,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The effect of personal relative trigger words is very limited due to the limited number of testing instances over personal social relation subtypes.",
                    "sid": 147,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 separately measures the performance of different relation types and major subtypes.",
                    "sid": 148,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also indicates the number of testing instances, the number of correctly classified instances and the number of wrongly classified instances for each type or subtype.",
                    "sid": 149,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not surprising that the performance on the relation type “NEAR” is low because it occurs rarely in both the training and testing data.",
                    "sid": 150,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Others like “PART.Subsidary” and “SOCIAL.",
                    "sid": 151,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other-Professional” also suffer from their low occurrences.",
                    "sid": 152,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also shows that our system performs best on the subtype “SOCIAL.Parent” and “ROLE.",
                    "sid": 153,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Citizen-Of”.",
                    "sid": 154,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is largely due to incorporation of two semantic resources, i.e. the country name list and the personal relative trigger word list.",
                    "sid": 155,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 also indicates the low performance on the relation type “AT” although it frequently occurs in both the training and testing data.",
                    "sid": 156,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests the difficulty of detecting and classifying the relation type “AT” and its subtypes.",
                    "sid": 157,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 separates the performance of relation detection from overall performance on the testing set.",
                    "sid": 158,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that our system achieves the performance of 84.8%/66.7%/74.7 in precision/recall/F- measure on relation detection.",
                    "sid": 159,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also shows that our system achieves overall performance of 77.2%/60.7%/68.0 and 63.1%/49.5%/55.5 in precision/recall/F-measure on the 5 ACE relation types and the best-reported systems on the ACE corpus.",
                    "sid": 160,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that our system achieves better performance by ~3 F-measure largely due to its gain in recall.",
                    "sid": 161,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also shows that feature-based methods dramatically outperform kernel methods.",
                    "sid": 162,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that feature-based methods can effectively combine different features from a variety of sources (e.g. WordNet and gazetteers) that can be brought to bear on relation extraction.",
                    "sid": 163,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tree kernels developed in Culotta et al (2004) are yet to be effective on the ACE RDC task.",
                    "sid": 164,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, Table 6 shows the distributions of errors.",
                    "sid": 165,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that 73% (627/864) of errors results from relation detection and 27% (237/864) of errors results from relation characterization, among which 17.8% (154/864) of errors are from misclassification across relation types and 9.6% (83/864) # of relations of errors are from misclassification of relation sub- types inside the same relation types.",
                    "sid": 166,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that relation detection is critical for relation extraction.",
                    "sid": 167,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "# of other mentions in between 0 1 2 3 >= 4 Ov era ll # 0 3 9 9 1 1 6 1 1 1 0 0 4 1 6 3 o f 1 2 3 5 0 3 1 5 2 6 2 0 2 6 9 3 th e w o r d s 2 4 6 5 9 5 7 2 0 5 6 9 i n 3 3 1 1 2 3 4 1 4 0 0 5 5 9 b e t w e e n 4 2 0 4 2 2 5 2 9 2 3 4 6 3 5 1 1 1 1 1 3 3 8 2 1 2 6 5 > = 6 2 6 2 2 9 7 2 7 7 1 4 8 13 4 1 1 1 8 O v e r a l l 7 6 9 4 1 4 4 0 4 0 2 1 5 6 13 8 9 8 3 0 Table 3: Distribution of relations over #words and #other mentions in between in the training data Ty pe Subtyp e #Test ing Insta nces #C orr ect #E rro r P R F A T 3 9 2 2 2 4 1 0 5 68.",
                    "sid": 168,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 5 7 . 1 6 2 . 1Based In 8 5 3 9 1 0 79.",
                    "sid": 169,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 4 5 . 9 5 8 . 2 Locate d 2 4 1 1 3 2 1 2 0 52.",
                    "sid": 170,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 5 4 . 8 5 3 . 5 Reside nce 6 6 1 9 9 67.",
                    "sid": 171,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 2 8 . 8 4 0 . 4 N EA R 3 5 8 1 88.",
                    "sid": 172,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 2 2 . 9 3 6 . 4 Relative Locati on 3 5 8 1 88.",
                    "sid": 173,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 2 2 . 9 3 6 . 4 P A R T 1 6 4 1 0 6 3 9 73.",
                    "sid": 174,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 6 4 . 6 6 8 . 6Part Of 1 3 6 7 6 3 2 70.",
                    "sid": 175,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 5 5 . 9 6 2 . 3 Subsid iary 2 7 1 4 2 3 37.",
                    "sid": 176,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 5 1 . 9 4 3 . 8 R O LE 6 9 9 4 4 3 8 2 84.",
                    "sid": 177,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 6 3 . 4 7 2 . 4 Citize n-Of 3 6 2 5 8 75.",
                    "sid": 178,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 6 9 . 4 7 2 . 6 General Staff 2 0 1 1 0 8 4 6 71.",
                    "sid": 179,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 5 3 . 7 6 2 . 3 Manag ement 1 6 5 1 0 6 7 2 59.",
                    "sid": 180,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 6 4 . 2 6 1 . 8 Memb er 2 2 4 1 0 4 3 6 74.",
                    "sid": 181,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 4 6 . 4 5 7 . 1 S O CI A L 9 5 6 0 2 1 74.",
                    "sid": 182,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 6 3 . 2 6 8 . 5Other Profes sional 2 9 1 6 3 2 33.",
                    "sid": 183,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 5 5 . 2 4 1 . 6 Parent 2 5 1 7 0 10 0 6 8 . 0 8 1 . 0 System Table 4: Performa nce of different relation types and major subtypes in the test data R e l a t i o n D e t e c t i o n R D C o n T y p e s R D C o n S u b t y p e s P R F P R F P R F Ou rs: fea ture bas ed 8 4.",
                    "sid": 184,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 66 .7 74 .7 77 .2 60 .7 68 .0 6 3.",
                    "sid": 185,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 4 9.",
                    "sid": 186,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 55 .5 Ka mb hat la (20 04) :fe ature bas ed 6 3.",
                    "sid": 187,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 4 5.",
                    "sid": 188,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 52 .8 Cu lott a et al (20 04) :tre e ker nel 8 1.",
                    "sid": 189,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 51 .8 63 .2 67 .1 35 .0 45 .8 Table 5: Comparison of our system with other best-reported systems on the ACE corpus Error Type #Errors first.",
                    "sid": 190,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation on the ACE corpus shows that Detection Error False Negative 462 base phrase chunking contributes to most of the False Positive 165 Table 6: Distribution of errors 6 Discussion and Conclusion.",
                    "sid": 191,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we have presented a feature-based approach for relation extraction where diverse lexical, syntactic and semantic knowledge are employed.",
                    "sid": 192,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of exploring the full parse tree information directly as previous related work, we incorporate the base phrase chunking information performance improvement from syntactic aspect while further incorporation of the parse tree and dependence tree information only slightly improves the performance.",
                    "sid": 193,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This may be due to three reasons: First, most of relations defined in ACE have two mentions being close to each other.",
                    "sid": 194,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While short-distance relations dominate and can be resolved by simple features such as word and chunking features, the further dependency tree and parse tree features can only take effect in the remaining much less and more difficult long-distance relations.",
                    "sid": 195,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, it is well known that full parsing is always prone to long-distance parsing errors although the Collins’ parser used in our system achieves the state-of-the-art performance.",
                    "sid": 196,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the state-of-art full parsing still needs to be further enhanced to provide accurate enough information, especially PP (Preposition Phrase) attachment.",
                    "sid": 197,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Last, effective ways need to be explored to incorporate information embedded in the full Collins M.",
                    "sid": 198,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1999).",
                    "sid": 199,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Head-driven statistical models for natural language parsing.",
                    "sid": 200,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ph.D. Dissertation, University of Pennsylvania.",
                    "sid": 201,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Collins M. and Duffy N.",
                    "sid": 202,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2002).",
                    "sid": 203,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Covolution kernels for natural language.",
                    "sid": 204,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Dietterich T.G., Becker S. and Ghahramani Z. editors.",
                    "sid": 205,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Advances in Neural Information Processing Systems 14.",
                    "sid": 206,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cambridge, MA.",
                    "sid": 207,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Culotta A. and Sorensen J.",
                    "sid": 208,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004).",
                    "sid": 209,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dependency tree th parse trees.",
                    "sid": 210,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides, we also demonstrate how semantic information such as WordNet and Name List, can be used in feature-based relation extraction to further improve the performance.",
                    "sid": 211,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The effective incorporation of diverse features enables our system outperform previously best- reported systems on the ACE corpus.",
                    "sid": 212,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although tree kernel-based approaches facilitate the exploration of the implicit feature space with the parse tree structure, yet the current technologies are expected to be further advanced to be effective for relatively complicated relation extraction tasks such as the one defined in ACE where 5 types and 24 subtypes need to be extracted.",
                    "sid": 213,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation on the ACE RDC task shows that our approach of combining various kinds of evidence can scale better to problems, where we have a lot of relation types with a relatively small amount of annotated data.",
                    "sid": 214,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiment result also shows that our feature-based approach outperforms the tree kernel-based approaches by more than 20 F-measure on the extraction of 5 ACE relation types.",
                    "sid": 215,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the future work, we will focus on exploring more semantic knowledge in relation extraction, which has not been covered by current research.",
                    "sid": 216,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, our current work is done when the Entity Detection and Tracking (EDT) has been perfectly done.",
                    "sid": 217,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, it would be interesting to see how imperfect EDT affects the performance in relation extraction.",
                    "sid": 218,
                    "ssid": 100,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}