{
    "ID": "P06-1126",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper presents a discriminative pruning method of n-gram language model for Chinese word segmentation.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To reduce the size of the language model that is used in a Chinese word segmentation system, importance of each bigram is computed in terms of discriminative pruning criterion that is related to the performance loss caused by pruning the bi- gram.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we propose a step-by-step growing algorithm to build the language model of desired size.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experimental results show that the discriminative pruning method leads to a much smaller model compared with the model pruned using the state-of-the-art method.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the same Chinese word segmentation F-measure, the number of bigrams in the model can be reduced by up to 90%.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Correlation between language model perplexity and word segmentation performance is also discussed.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Chinese word segmentation is the initial stage of many Chinese language processing tasks, and has received a lot of attention in the literature (Sproat et al., 1996; Sun and Tsou, 2001; Zhang et al., 2003; Peng et al., 2004).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Gao et al.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2003), an approach based on source-channel model for Chinese word segmentation was proposed.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gao et al.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2005) further developed it to a linear mixture model.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In these statistical models, language models are essential for word segmentation disambiguation.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, an uncom pressed language model is usually too large for practical use since all realistic applications have memory constraints.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, language model pruning techniques are used to produce smaller models.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pruning a language model is to eliminate a number of parameters explicitly stored in it, according to some pruning criteria.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The goal of research for language model pruning is to find criteria or methods, using which the model size could be reduced effectively, while the performance loss is kept as small as possible.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A few criteria have been presented for language model pruning, including count cutoff (Jelinek, 1990), weighted difference factor (Seymore and Rosenfeld, 1996), KullbackLeibler distance (Stolcke, 1998), rank and entropy (Gao and Zhang, 2002).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These criteria are general for language model pruning, and are not optimized according to the performance of language model in specific tasks.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In recent years, discriminative training has been introduced to natural language processing applications such as parsing (Collins, 2000), machine translation (Och and Ney, 2002) and language model building (Kuo et al., 2002; Roark et al., 2004).",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To the best of our knowledge, it has not been applied to language model pruning.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we propose a discriminative pruning method of n-gram language model for Chinese word segmentation.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It differentiates from the previous pruning approaches in two respects.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the pruning criterion is based on performance variation of word segmentation.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, the model of desired size is achieved by adding valuable bigrams to a base model, instead of by pruning bigrams from an unpruned model.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We define a misclassification function that approximately represents the likelihood that a sentence will be incorrectly segmented.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 1001 Proceedings of the 21st International Conference on Computational Linguistics and 44th Annual Meeting of the ACL, pages 1001–1008, Sydney, July 2006.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2006 Association for Computational Linguistics variation value of the misclassification function caused by adding a parameter to the base model is used as the criterion for model pruning.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We called relative entropy or KullbackLeibler distance.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is computed as: also suggest a step-by-step growing algorithm − ∑ P( wi , h j )[log P ′( wi | h j ) − log P ( wi | h j )] w ,h (2) that can generate models of any reasonably de- i j sired size.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We take the pruning method based on KullbackLeibler distance as the baseline.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experimental results show that our method outperforms the baseline significantly with small model size.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the F-Measure of 96.33%, number of bigrams decreases by up to 90%.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, by combining the discriminative pruning method with the baseline method, we obtain models that achieve better performance for any model size.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Correlation between language model perplexity and system performance is also discussed.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remainder of the paper is organized as follows.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2 briefly discusses the related work on language model pruning.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 proposes our discriminative pruning method for Chinese word segmentation.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 describes the experimental settings and results.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Result analysis and discussions are also presented in this section.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We draw the conclusions in section 5.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "A simple way to reduce the size of an n-gram language model is to exclude those n-grams occurring infrequently in training corpus.",
                    "sid": 41,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is named as count cutoff method (Jelinek, 1990).",
                    "sid": 42,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because counts are always integers, the size of the model can only be reduced to discrete values.Gao and Lee (2000) proposed a distribution The sum is over all words wi and histories hj.",
                    "sid": 43,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This criterion removes some of the approximations employed in Seymore and Rosenfeld (1996).",
                    "sid": 44,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, Stolcke (1998) presented a method for efficient computation of the Kull- back-Leibler distance of each n-gram.",
                    "sid": 45,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Gao and Zhang (2002), three measures are studied for the purpose of language model pruning.",
                    "sid": 46,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are probability, rank, and entropy.",
                    "sid": 47,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among them, probability is very similar to that proposed by Seymore and Rosenfeld (1996).",
                    "sid": 48,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gao and Zhang (2002) also presented a method of combining two criteria, and showed the combination of rank and entropy achieved the smallest models.",
                    "sid": 49,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discriminative pruning for. ",
            "number": "3",
            "sents": [
                {
                    "text": "Chinese Word Segmentation 3.1 Problem.",
                    "sid": 50,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Definition In this paper, discussions are restricted to bigram language model P(wy|wx).",
                    "sid": 51,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a bigram model, three kinds of parameters are involved: bigram probability Pm(wy|wx) for seen bigram wxwy in training corpus, unigram probability Pm(w) and backoff coefficient αm(w) for any word w. For any wx and wy in the vocabulary, bigram probability P(wy|wx) is computed as: based pruning.",
                    "sid": 52,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of pruning n-grams that ⎧ Pm (wy | wx ) if c(wx , wy ) > 0 are infrequent in training data, they prune n- grams that are likely to be infrequent in a new P(wy | wx ) = ⎨ ⎩ m (w x ) × Pm ( wy ) if c(wx , wy ) = 0 (3) document.",
                    "sid": 53,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experimental results show that it is better than traditional count cutoff method.",
                    "sid": 54,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Seymore and Rosenfeld (1996) proposed a method to measure the difference of the models before and after pruning each n-gram, and the difference is computed as: As equation (3) shows, the probability of an unseen bigram is computed by the product of the unigram probability and the corresponding back- off coefficient.",
                    "sid": 55,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we remove a seen bigram from the model, we can still yield a bigram probability for it, by regarding it as an unseen bigram.",
                    "sid": 56,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, − N (h j , wi ) × [log P ′( wi | h j ) − log P( wi | h j )] (1) we can reduce the number of bigram probabilities explicitly stored in the model.",
                    "sid": 57,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By doing this, Where P(wi|hj) denotes the conditional probabilities assigned by the original model, and P′(wi|hj) denotes the probabilities in the pruned model.",
                    "sid": 58,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "N(hj, wi) is the discounted frequency of n- gram event hjwi.",
                    "sid": 59,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Seymore and Rosenfeld (1996) showed that this method is more effective than the traditional cutoff method.",
                    "sid": 60,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Stolcke (1998) presented a more sound criterion for computing the difference of models before and after pruning each n-gram, which is model size decreases.",
                    "sid": 61,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is the foundation for bigram model pruning.",
                    "sid": 62,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The research issue is to find an effective criterion to compute \"importance\" of each bigram.",
                    "sid": 63,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, \"importance\" indicates the performance loss caused by pruning the bigram.",
                    "sid": 64,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generally,given a target model size, the method for lan guage model pruning is described in Figure 1.",
                    "sid": 65,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, deciding which bigrams should be excluded from the model is equivalent to deciding which bigrams should be included in the model.",
                    "sid": 66,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, we suggest a growing algorithm through g(S,W ; Λ, Γ) = log P(W ) + log P(S | W ) (5) which a model of desired size can also be achieved.",
                    "sid": 67,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is illustrated in Figure 2.",
                    "sid": 68,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, two terms are introduced.",
                    "sid": 69,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Full-bigram model is the unpruned model containing all seen bigrams in training corpus.",
                    "sid": 70,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And base model is currently the unigram model.For the discriminative pruning method sug Where Г denotes a language model that is used to compute P(W), and Λ denotes a generative model that is used to compute P(S|W).",
                    "sid": 71,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In language model pruning, Λ is an invariable.",
                    "sid": 72,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The discriminative pruning criterion is inspired by the comparison of segmented sentences using full-bigram model ГF and using base model gested in this paper, growing algorithm instead ГB.B Given a sentence S, full-bigram model of pruning algorithm is applied to generate the chooses W * as the segmentation result, and base model of desired size.",
                    "sid": 73,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, \"importance\" of each bigram indicates the performance improvement caused by adding a bigram into the model chooses * satisfying: as the segmentation result, base model.",
                    "sid": 74,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "W * = arg max g (S ,W ; Λ, Γ ) (6) F F W 1.",
                    "sid": 75,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the desired model size, compute.",
                    "sid": 76,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "W * = arg max g(S ,W ; Λ, Γ ) (7) the number of bigrams that should be B W B pruned.",
                    "sid": 77,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number is denoted as m; 2.",
                    "sid": 78,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compute \"importance\" of each bigram;.",
                    "sid": 79,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 80,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sort all bigrams in the language model,.",
                    "sid": 81,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "according to their \"importance\"; Here, given a language model Г, we define a misclassification function representing the differ ence between discriminant functions of W * and",
                    "sid": 82,
                    "ssid": 33,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "remove m most \"unimportant\" bigrams. ",
            "number": "4",
            "sents": [
                {
                    "text": "from the model;",
                    "sid": 83,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "re-compute backoff coefficients in the. ",
            "number": "5",
            "sents": [
                {
                    "text": "W * : d(S;Λ,Γ) = g(S,W*;Λ,Γ) − g(S,W*;Λ,Γ) (8) B F model.",
                    "sid": 84,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The misclassification function reflects which Figure 1.",
                    "sid": 85,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Language Model Pruning Algorithm one of W * and W * is inclined to be chosen as the segmentation result.",
                    "sid": 86,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If W * ≠ W * , we may 1.",
                    "sid": 87,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the desired model size, compute F B. the number of bigrams that should be added into the base model.",
                    "sid": 88,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number is denoted as n; 2.",
                    "sid": 89,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compute \"importance\" of each bigram.",
                    "sid": 90,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "included in the full-bigram model but excluded from the base model; 3.",
                    "sid": 91,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sort the bigrams according to their \"im-.",
                    "sid": 92,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "portance\"; extract some hints from the comparison of them, and select a few valuable bigrams.",
                    "sid": 93,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By adding these bigrams to base model, we should make the model choose the correct answer between W * and W * . If W * = W * , no hints can be extracted.",
                    "sid": 94,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "B F B Let W0 be the known correct word sequence.",
                    "sid": 95,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Under the precondition W * ≠ W * , we describe F B 4.",
                    "sid": 96,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Add n most \"important\" bigrams into.",
                    "sid": 97,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "our method in the following three cases.",
                    "sid": 98,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the base model; W * = W W * ≠ W 5.",
                    "sid": 99,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Re-compute backoff coefficients in the.",
                    "sid": 100,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Case 1: F 0 and B 0 base model.",
                    "sid": 101,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2.",
                    "sid": 102,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Growing Algorithm for Language Model Pruning 3.2 Discriminative Pruning Criterion.",
                    "sid": 103,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a Chinese character string S, a word segmentation system chooses a sequence of words W* as the segmentation result, satisfying: Here, full-bigram model chooses the correct answer, while base model does not.",
                    "sid": 104,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on equation (6), (7) and (8), we know that d(S;Λ,ГB)> 0 and d(S;Λ,ГF) < 0.",
                    "sid": 105,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It implies that adding bigrams into base model may lead the misclassifi cation function from positive to negative.",
                    "sid": 106,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Which bigram should be added depends on the variation of misclassification function caused by adding it.",
                    "sid": 107,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If adding a bigram makes the misclassification W * = arg max(log P(W ) + log P(S |W )) W (4) function become smaller, it should be added with higher priority.",
                    "sid": 108,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sum of the two logarithm probabilities in We add each bigram individually to ГB,B and equation (4) is called discriminant function: then compute the variation of the misclassifica tion function.",
                    "sid": 109,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let Г′ denotes the model after add ing bigram wxwy into ГBB.",
                    "sid": 110,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to equation (5) and (8), we can write the misclassification provement caused by adding wxwy.",
                    "sid": 111,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, \"importance\" of bigram wxwy on S is computed as: function using ГBB and Г′ separately: imp(wx wy ; S ) = Δd (S; wx wy ) (14) d ( S; Λ, Γ ) = log P (W * ) + log P (S | W * ) B B B Λ B (9) Case 2: W * ≠ W and W * = W − log P (W * ) − log P (S | W * ) F 0 B 0 B F Λ F d (S; Λ, Γ′) = log P′(W * ) + log P (S | W * ) Here, it is just contrary to case 1.",
                    "sid": 112,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, we have: B Λ B (10) − log P′(W * ) − log P (S |W * ) F Λ F imp(wx w y ; S ) = −Δd (S; wx wy ) (15) Where PB(.), P′(.), PΛ(.)",
                    "sid": 113,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "represent probabilities * * in base model, model Г′ and model Λ separately.",
                    "sid": 114,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The variation of the misclassification function is computed as: Δd (S; wx wy ) = d (S; Λ, ΓB ) − d (S; Λ, Γ′) Case 3: WF ≠ W0 ≠ WB In case 1 and 2, bigrams are added so that discriminant function of correct word sequence becomes bigger, and that of incorrect word sequence becomes smaller.",
                    "sid": 115,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In case 3, both W * and = [log P′(W * ) − log P (W * )] (11) * F B F − [log P′(W * ) − log P (W * )] B B B Because the only difference between base model and model Г′ is that model Г′ involves the bigram probability P′(wy|wx), we have: logP′(W* ) − logP (W * ) WB are incorrect.",
                    "sid": 116,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the misclassification function in equation (8) does not represent the likelihood that S will be incorrectly segmented.",
                    "sid": 117,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, variation of the misclassification function in equation (13) can not be used to measure the \"importance\" of a bigram.",
                    "sid": 118,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, sentence S is ignored, and the \"importance\" of all F B ∑ F (i) F F (i−1) B F (i) F (i−1) bigrams on S are zero.",
                    "sid": 119,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "= [logP′(w* i | w* ) − logP (w* | w* ] (12) The above three cases are designed for one = n(W* , w w )[logP′(w | w ) − logP (w ) sentence.",
                    "sid": 120,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The \"importance\" of each bigram on F x y y x B y the whole training corpus is the sum of its \"im − logαB (wx )] portance\" on each single sentence, as equation (16) shows.",
                    "sid": 121,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Where n(W * , w w ) denotes the number of F x y times the bigram wxwy appears in sequence W * . x y ∑ x y imp(w w ) = F imp(w w ; S) S (16) Note that in equation (12), base model is treated as a bigram model instead of a unigram model.",
                    "sid": 122,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason lies in two respects.",
                    "sid": 123,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the uni- gram model can be regarded as a particular bi- gram model by setting all backoff coefficients to 1.",
                    "sid": 124,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, the base model is not always a uni-.",
                    "sid": 125,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To sum up, the \"importance\" of each bigram is computed as Figure 3 shows.",
                    "sid": 126,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 127,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each wxwy, set imp(wxwy) = 0;.",
                    "sid": 128,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 129,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each sentence in training corpus:.",
                    "sid": 130,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each wxwy: * = W * ≠ Wgram model during the step-by-step growing al if WF 0 and WB 0 :gorithm, which will be discussed in the next sub section.",
                    "sid": 131,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "imp(wxwy) += Δd(S;wxwy); * W * WIn fact, bigram probability P′(wy|wx) is ex else if WF ≠ 0 and WB = 0 : tracted from full-bigram model, so P′(wy|wx) = PF(wy|wx).",
                    "sid": 132,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, similar deductions can be conducted to the second bracket in equation (11).",
                    "sid": 133,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we have: imp(wxwy) −= Δd(S;wxwy); Figure 3.",
                    "sid": 134,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Calculation of \"Importance\" of Bigrams Δd (S; w w ) = [n(W * , w w ) − n(W * , w w )] We illustrate the process of computing \"im x y F x y B x y (13) portance\" of bigrams with a simple example.",
                    "sid": 135,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "× [log PF (wy | wx ) − log PB (wy ) − logα B (wx )] Note that d(S;Λ,Г) approximately indicates the likelihood that S will be incorrectly segmented, so Δd(S;wxwy) represents the performance im Suppose S is \" 这 (zhe4) 样 (yang4) 才 (cai2) 能 (neng2) 更 (geng4) 方 (fang1) 便 (bian4)\".",
                    "sid": 136,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The segmented result using full-bigram model is \"这 样(zhe4yang4)/才(cai2)/能(neng2)/更(geng4)/方 便(fang1bian4)\", which is the correct word se quence.",
                    "sid": 137,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The segmented result using base model is \" 这样 (zhe4yang4)/ 才能 (cai2neng2)/ 更 (geng4)/ 方 便 (fang1bian4)\".",
                    "sid": 138,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obviously, it matches case 1.",
                    "sid": 139,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For bigram \"这样(zhe4yang4)才 (cai2)\", it occurs in W * once, and does not occur in W * . According to equation (13), its \"importance\" on sentence S is: imp(这样(zhe4yang4)才(cai2);S) = logPF(才(cai2)|这样(zhe4yang4)) − [logPB(B 才(cai2)) + logαBB(这样(zhe4yang4))] For bigram \" 更 (geng4) 方便 (fang1bian4)\", 4 Experiments.",
                    "sid": 140,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Experiment Settings.",
                    "sid": 141,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training corpus comes from People's daily 2000, containing about 25 million Chinese characters.",
                    "sid": 142,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is manually segmented into word sequences, according to the word segmentation specification of Peking University (Yu et al., 2003).",
                    "sid": 143,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The testing text that is provided by Peking University comes from the second international Chinese word segmentation bakeoff organized by SIGHAN.",
                    "sid": 144,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The testing text is a part of People's daily 2001, consisting of about 170K Chi since it occurs once both in W * \"importance\" on S is zero.",
                    "sid": 145,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Step-by-step Growing.",
                    "sid": 146,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and W * , its nese characters.",
                    "sid": 147,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The vocabulary is automatically extracted from the training corpus, and the words occurring only once are removed.",
                    "sid": 148,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, about 67K words are included in the vocabulary.",
                    "sid": 149,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The full Given the target model size, we can add exact number of bigrams to the base model at one time by using the growing algorithm illustrated in Figure 2.",
                    "sid": 150,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But it is more suitable to adopt a step- by-step growing algorithm illustrated in Figure 4.",
                    "sid": 151,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in equation (13), the \"importance\" of each bigram depends on the base model.",
                    "sid": 152,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initially, the base model is set to the unigram model.",
                    "sid": 153,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With bigrams added in, it becomes a growing bigram model and the unigram model are trained by CMU language model toolkit (Clarkson and Rosenfeld, 1997).",
                    "sid": 154,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Without any count cutoff, the full-bigram model contains about 2 million bi- grams.",
                    "sid": 155,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word segmentation system is developed based on a source-channel model similar to that described in (Gao et al., 2003).",
                    "sid": 156,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Viterbi algorithm is applied to find the best word segmentation bigram model.",
                    "sid": 157,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, * and log α B (wx ) will path.",
                    "sid": 158,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "change.",
                    "sid": 159,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, the added bigrams will affect the calculation of \"importance\" of bigrams to be added.",
                    "sid": 160,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generally, adding more bigrams at one time will lead to more negative impacts.",
                    "sid": 161,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, it is expected that models produced by step-by-step growing algorithm may achieve better performance than growing algorithm, and smaller step size will lead to even better performance.",
                    "sid": 162,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 163,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given step size s;.",
                    "sid": 164,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 165,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Set the base model to be the unigram.",
                    "sid": 166,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "model; 3.",
                    "sid": 167,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Segment corpus with full-bigram model;.",
                    "sid": 168,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Evaluation Metrics.",
                    "sid": 169,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The language models built in our experiments are evaluated by two metrics.",
                    "sid": 170,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One is F-Measure of the word segmentation result; the other is language model perplexity.",
                    "sid": 171,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For F-Measure evaluation, we firstly segment the raw testing text using the model to be evaluated.",
                    "sid": 172,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, the segmented result is evaluated by comparing with the gold standard set.",
                    "sid": 173,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evaluation tool is also from the word segmentation bakeoff.",
                    "sid": 174,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F-Measure is calculated as: 4.",
                    "sid": 175,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Segment corpus with base model;.",
                    "sid": 176,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.",
                    "sid": 177,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compute \"importance\" of each bigram.",
                    "sid": 178,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F-Measure = 2 × Precision × Recall Precision + Recall (17) included in the full-bigram model but excluded from the base model;",
                    "sid": 179,
                    "ssid": 96,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "sort the bigrams according to their \"im-. ",
            "number": "6",
            "sents": [
                {
                    "text": "portance\";",
                    "sid": 180,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "add s bigrams with the biggest \"impor-. ",
            "number": "7",
            "sents": [
                {
                    "text": "tance\" to the base model; For perplexity evaluation, the language model to be evaluated is used to provide the bigram probabilities for each word in the testing text.",
                    "sid": 181,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The perplexity is the mean logarithm probability as shown in equation (18): 1 N",
                    "sid": 182,
                    "ssid": 2,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "re-compute backoff coefficients in the. ",
            "number": "8",
            "sents": [
                {
                    "text": "base model;",
                    "sid": 183,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "if the base model is still smaller than the. ",
            "number": "9",
            "sents": [
                {
                    "text": "desired size, go to step 4; otherwise, stop.",
                    "sid": 184,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "− ∑ log2 P ( wi |wi −1 ) PP( M ) = 2 N i =1 4.3 Comparison of Pruning Methods.",
                    "sid": 185,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(18) Figure 4.",
                    "sid": 186,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step-by-step Growing Algorithm The KullbackLeibler Distance (KLD) based method is the state-of-the-art method, and is taken as the baseline 1 . Pruning algorithm illustrated in Figure 1 is used for KLD based pruning.",
                    "sid": 187,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Growing algorithms illustrated in Figure 2 and Figure 4 are used for discriminative pruning method.",
                    "sid": 188,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Growing algorithms are not applied to KLD based pruning, because the computation of KLD is independent of the base model.",
                    "sid": 189,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At step 1 for KLD based pruning, m is set to produce ten models containing 10K, 20K, …, 100K bigrams.",
                    "sid": 190,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We apply each of the models to the word segmentation system, and evaluate the segmented results with the evaluation tool.",
                    "sid": 191,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The F-Measures of the ten models are illustrated in Figure 5, denoted by \"KLD\".",
                    "sid": 192,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the discriminative pruning criterion, the growing algorithm illustrated in Figure 2 is firstly used.",
                    "sid": 193,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unigram model acts as the base model.",
                    "sid": 194,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At step 1, n is set to 10K, 20K, …, 100K separately.",
                    "sid": 195,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At step 2, \"importance\" of each bi- gram is computed following Figure 3.",
                    "sid": 196,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ten models are produced and evaluated.",
                    "sid": 197,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The F-Measures are also illustrated in Figure 5, denoted by \"Dis- crim\".",
                    "sid": 198,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By adding bigrams step by step as illustrated in Figure 4, and setting step size to 10K, 5K, and 2K separately, we obtain other three series of models, denoted by \"Step-10K\", \"Step-5K\" and \"Step-2K\" in Figure 5.",
                    "sid": 199,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also include in Figure 5 the performance of the count cutoff method.",
                    "sid": 200,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obviously, it is inferior to other methods.",
                    "sid": 201,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "96.6 such as those models containing less than 70K bigrams, the performance of \"Discrim\" is better than \"KLD\".",
                    "sid": 202,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the models containing more than 70K bigrams, \"KLD\" gets better performance than \"Discrim\".",
                    "sid": 203,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason is that the added bigrams affect the calculation of \"importance\" of bigrams to be added, which has been discussed in section 3.3.",
                    "sid": 204,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we add the bigrams step by step, better performance is achieved.",
                    "sid": 205,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From Figure 5, it can be seen that all of the models generated by step-by- step growing algorithm outperform \"KLD\" and \"Discrim\" consistently.",
                    "sid": 206,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared with the baseline KLD based method, step-by-step growing methods result in at least 0.2 percent improvement for each model size.Comparing \"Step-10K\", \"Step-5K\" and \"Step 2K\", they perform differently before the 60Kbigram point, and perform almost the same after that.",
                    "sid": 207,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason is that they are approaching their saturation states, which will be discussed in section 4.5.",
                    "sid": 208,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Before 60Kbigram point, smaller step size yields better performance.",
                    "sid": 209,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of detailed comparison result is shown in Table 1, where the F-Measure is 96.33%.",
                    "sid": 210,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last column shows the relative model sizes with respect to the KLD pruned model.",
                    "sid": 211,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that with the F-Measure of 96.33%, number of bigrams decreases by up to 90%.",
                    "sid": 212,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "96.5 96.4 96.3 96.2 96.1 96.0 K L D D i s c r i m S t e p 1 0 K S t e p 5 K S t e p 2 K C u t o f f 1 2 3 4 5 6 7 8 9 10 B i g r a m N u m ( 1 0 K ) T a b l e 1 . C o m p a r i s o n o f N u m b e r o f B i g r a m s a t F M e a s u r e 9 6 . 3 3 % 4.4 C o r r e l a t i o n b e t w e e n P e r p l e x i t y a n d F - M e a s u r e Perple xities of the models built above are evaluated over the gold standar d set.",
                    "sid": 213,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 6 shows how the perple xities vary with the bigram numbers in models . Here,.",
                    "sid": 214,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "we notice that the KLD models achiev e the lowest perple xities.",
                    "sid": 215,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not a Figure 5.",
                    "sid": 216,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance Comparison of Different Pruning Methods First, we compare the performance of \"KLD\" and \"Discrim\".",
                    "sid": 217,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When the model size is small, 1 Our pilot study shows that the method based on Kullback-.",
                    "sid": 218,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Leibler distance outperforms methods based on other criteria introduced in section 2.",
                    "sid": 219,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "surprising result, because the goal of KLD based pruning is to minimize the KullbackLeibler distance that can be interpreted as a relative change of perplexity (Stolcke, 1998).",
                    "sid": 220,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now we compare Figure 5 and Figure 6.",
                    "sid": 221,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Perplexities of KLD models are much lower than that of the other models, but their F-Measures are much worse than that of step-by-step growing models.",
                    "sid": 222,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It implies that lower perplexity does not always lead to higher F-Measure.",
                    "sid": 223,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the mis-aligned part of the segmented corpus, where W * ≠ W * . It is likely that not all bigrams F B However, when the comparison is restricted in a single pruning method, the case is different.",
                    "sid": 224,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each pruning method, as more bigrams are included in the model, the perplexity curve falls, and the F-Measure curve rises.",
                    "sid": 225,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It implies there are correlations between them.",
                    "sid": 226,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compute the Pearson product-moment correlation coefficient for each pruning method, as listed in Table 2.",
                    "sid": 227,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that the correlation between perplexity and F-Measure is very strong.",
                    "sid": 228,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To sum up, the correlation between language model perplexity and system performance (here represented by F-Measure) depends on whether the models come from the same pruning method.",
                    "sid": 229,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If so, the correlation is strong.",
                    "sid": 230,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise, the correlation is weak.",
                    "sid": 231,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "700 650 600 550 have the opportunity.",
                    "sid": 232,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As more and more bigrams are added into the base model, the segmented training corpus using the current base model approaches to that using the full-bigram model.",
                    "sid": 233,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gradually, none bigram can be added into the current base model.",
                    "sid": 234,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At that time, the model stops growing, and reaches its saturation state.",
                    "sid": 235,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The model that reaches its saturation state is named as saturated model.",
                    "sid": 236,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, three step-by-step growing models reach their saturation states when about 100K bigrams are added in.",
                    "sid": 237,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By combining with the baseline KLD based method, we obtain models that outperform the baseline for any model size.",
                    "sid": 238,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We combine them as follows.",
                    "sid": 239,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the desired model size is smaller than that of the saturated model, step-by-step growing is applied.",
                    "sid": 240,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise, KullbackLeibler distance is used for further growing over the saturated model.",
                    "sid": 241,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, by growing over the saturated model of \"Step-2K\", we obtain combined models containing from 100K to 2 500 450 400 350 300 K L D D i s c r i m S t e p 1 0 K S t e p 5 K S t e p 2 K C u t o f f 1 2 3 4 5 6 7 8 9 10 B i g r a m N u m ( 1 0 K ) millio n bigra ms. The perfor manc e of the combined model s and that of the baseli ne KLD models are illustr ated in Figur e 7.",
                    "sid": 242,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that the combi ned model perfor ms consis tently better than KLD model over all of bigra m numb ers.",
                    "sid": 243,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finall y, the two curve s conve rge at the perform a n c e o f t h e f u l l b i g r a m m o d e l . 97.0 Figure 6.",
                    "sid": 244,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Perplexity Comparison of Different Pruning Methods 96.9 96.8 96.7 96.6 96.5 96.4 96.3 KLD Combined Model Table 2.",
                    "sid": 245,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Correlation between Perplexity and F-Measure 4.5 Combination of Saturated Model and.",
                    "sid": 246,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "KLD The above experimental results show that step- by-step growing models achieve the best performance when less than 100K bigrams are added in.",
                    "sid": 247,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, they can not grow up into any desired size.",
                    "sid": 248,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A bigram has no chance to be added into the base model, unless it appears in Bigram Num(10K) Figure 7.",
                    "sid": 249,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance Comparison of Combined Model and KLD Model 5 Conclusions and Future Work.",
                    "sid": 250,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A discriminative pruning criterion of n-gram language model for Chinese word segmentation was proposed in this paper, and a step-by-step growing algorithm was suggested to generate the model of desired size based on a full-bigram model and a base model.",
                    "sid": 251,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experimental results showed that the discriminative pruning method achieves significant improvements over the baseline KLD based method.",
                    "sid": 252,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the same F-measure, the number of bigrams can be reduced by up to 90%.",
                    "sid": 253,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By combining the saturated model and the baseline KLD based method, we achieved better performance for any model size.",
                    "sid": 254,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Analysis shows that, if the models come from the same pruning method, the correlation between perplexity and performance is strong.",
                    "sid": 255,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise, the correlation is weak.",
                    "sid": 256,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pruning methods discussed in this paper focus on bigram pruning, keeping unigram probabilities unchanged.",
                    "sid": 257,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The future work will attempt to prune bigrams and unigrams simultaneously, according to a same discriminative pruning criterion.",
                    "sid": 258,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And we will try to improve the efficiency of the step-by-step growing algorithm.",
                    "sid": 259,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, the method described in this paper can be extended to other applications, such as IME and speech recognition, where language models are applied in a similar way.",
                    "sid": 260,
                    "ssid": 77,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}