{
    "ID": "P06-1016",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper proposes a novel hierarchical learning strategy to deal with the data sparseness problem in relation extraction by modeling the commonality among related classes.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each class in the hierarchy either manually predefined or automatically clustered, a linear dis- criminative function is determined in a top- down way using a perceptron algorithm with the lower-level weight vector derived from the upper-level weight vector.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the upper-level class normally has much more positive training examples than the lower-level class, the corresponding linear discriminative function can be determined more reliably.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The upper- level discriminative function then can effectively guide the discriminative function learning in the lower-level, which otherwise might suffer from limited training data.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation on the ACE RDC 2003 corpus shows that the hierarchical strategy much improves the performance by 5.6 and 5.1 in F-measure on least- and medium- frequent relations respectively.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also shows that our system outperforms the previous best-reported system by 2.7 in F-measure on the 24 subtypes using the same feature set.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "With the dramatic increase in the amount of textual information available in digital archives and the WWW, there has been growing interest in techniques for automatically extracting information from text.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Information Extraction (IE) is such a technology that IE systems are expected to identify relevant information (usually of predefined types) from text documents in a certain domain and put them in a structured format.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to the scope of the ACE program (ACE 20002005), current research in IE has three main objectives: Entity Detection and Tracking (EDT), Relation Detection and Characterization (RDC), and Event Detection and Characterization (EDC).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper will focus on the ACE RDC task, which detects and classifies various semantic relations between two entities.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, we want to determine whether a person is at a location, based on the evidence in the context.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extraction of semantic relationships between entities can be very useful for applications such as question answering, e.g. to answer the query “Who is the president of the United States?”.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One major challenge in relation extraction is due to the data sparseness problem (Zhou et al 2005).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the largest annotated corpus in relation extraction, the ACE RDC 2003 corpus shows that different subtypes/types of relations are much unevenly distributed and a few relation subtypes, such as the subtype “Founder” under the type “ROLE”, suffers from a small amount of annotated data.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further experimentation in this paper (please see Figure 2) shows that most relation subtypes suffer from the lack of the training data and fail to achieve steady performance given the current corpus size.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the relative large size of this corpus, it will be time-consuming and very expensive to further expand the corpus with a reasonable gain in performance.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even if we can somehow expend the corpus and achieve steady performance on major relation subtypes, it will be still far beyond practice for those minor sub- types given the much unevenly distribution among different relation subtypes.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While various machine learning approaches, such as generative modeling (Miller et al 2000), maximum entropy (Kambhatla 2004) and support vector machines (Zhao and Grisman 2005; Zhou et al 2005), have been applied in the relation extraction task, no explicit learning strategy is proposed to deal with the inherent data sparseness problem caused by the much uneven distribution among different relations.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper proposes a novel hierarchical learning strategy to deal with the data sparseness problem by modeling the commonality among related classes.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Through organizing various classes hierarchically, a linear discriminative function is determined for each class in a top- down way using a perceptron algorithm with the lower-level weight vector derived from the upper-level weight vector.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation on the ACE RDC 2003 corpus shows that the hierarchical 121 Proceedings of the 21st International Conference on Computational Linguistics and 44th Annual Meeting of the ACL, pages 121–128, Sydney, July 2006.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2006 Association for Computational Linguistics strategy achieves much better performance than the flat strategy on least- and medium-frequent relations.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also shows that our system based on the hierarchical strategy outperforms the previous best-reported system.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of this paper is organized as follows.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2 presents related work.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 describes the hierarchical learning strategy using the perceptron algorithm.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we present experimentation in Section 4 and conclude this paper in Section 5.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "The relation extraction task was formulated at MUC7(1998).",
                    "sid": 28,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the increasing popularity of ACE, this task is starting to attract more and more researchers within the natural language processing and machine learning communities.",
                    "sid": 29,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typical works include Miller et al (2000), Zelenko et al (2003), Culotta and Sorensen (2004), Bunescu and Mooney (2005a), Bunescu and Mooney (2005b), Zhang et al (2005), Roth and Yih (2002), Kambhatla (2004), Zhao and Grisman (2005) and Zhou et al (2005).",
                    "sid": 30,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Miller et al (2000) augmented syntactic full parse trees with semantic information of entities and relations, and built generative models to integrate various tasks such as POS tagging, named entity recognition, template element extraction and relation extraction.",
                    "sid": 31,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The problem is that such integration may impose big challenges, e.g. the need of a large annotated corpus.",
                    "sid": 32,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To overcome the data sparseness problem, generative models typically applied some smoothing techniques to integrate different scales of contexts in parameter estimation, e.g. the back-off approach in Miller et al (2000).",
                    "sid": 33,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zelenko et al (2003) proposed extracting relations by computing kernel functions between parse trees.",
                    "sid": 34,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Culotta and Sorensen (2004) extended this work to estimate kernel functions between augmented dependency trees and achieved F- measure of 45.8 on the 5 relation types in the ACE RDC 2003 corpus1.",
                    "sid": 35,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bunescu and Mooney (2005a) proposed a shortest path dependency kernel.",
                    "sid": 36,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They argued that the information to model a relationship between two entities can be typically captured by the shortest path between them in the dependency graph.",
                    "sid": 37,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It achieved the F plied it in protein interaction and ACE relation extraction tasks.",
                    "sid": 38,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhang et al (2005) adopted clustering algorithms in unsupervised relation extraction using tree kernels.",
                    "sid": 39,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To overcome the data sparseness problem, various scales of sub-trees are applied in the tree kernel computation.",
                    "sid": 40,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although tree kernel-based approaches are able to explore the huge implicit feature space without much feature engineering, further research work is necessary to make them effective and efficient.",
                    "sid": 41,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparably, feature-based approaches achieved much success recently.",
                    "sid": 42,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Roth and Yih (2002) used the SNoW classifier to incorporate various features such as word, part-of-speech and semantic information from WordNet, and proposed a probabilistic reasoning approach to integrate named entity recognition and relation extraction.",
                    "sid": 43,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Kambhatla (2004) employed maximum entropy models with features derived from word, entity type, mention level, overlap, dependency tree, parse tree and achieved F- measure of 52.8 on the 24 relation subtypes in the ACE RDC 2003 corpus.",
                    "sid": 44,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhao and Grisman (2005) 2 combined various kinds of knowledge from tokenization, sentence parsing and deep dependency analysis through support vector machines and achieved F-measure of 70.1 on the 7 relation types of the ACE RDC 2004 corpus3 . Zhou et al (2005) further systematically explored diverse lexical, syntactic and semantic features through support vector machines and achieved F- measure of 68.1 and 55.5 on the 5 relation types and the 24 relation subtypes in the ACE RDC 2003 corpus respectively.",
                    "sid": 45,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To overcome the data sparseness problem, feature-based approaches normally incorporate various scales of contextsinto the feature vector extensively.",
                    "sid": 46,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These ap proaches then depend on adopted learning algorithms to weight and combine each feature effectively.",
                    "sid": 47,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, an exponential model and a linear model are applied in the maximum entropy models and support vector machines respectively to combine each feature via the learned weight vector.",
                    "sid": 48,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In summary, although various approaches have been employed in relation extraction, they implicitly attack the data sparseness problem by using features of different contexts in feature- based approaches or including different sub measure of 52.5 on the 5 relation types in the ACE RDC 2003 corpus.",
                    "sid": 49,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bunescu and Mooney(2005b) proposed a subsequence kernel and ap 1 The ACE RDC 2003 corpus defines 5/24 relation.",
                    "sid": 50,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "types/subtypes between 4 entity types.",
                    "sid": 51,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Here, we classify this paper into feature-based ap-.",
                    "sid": 52,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "proaches since the feature space in the kernels of Zhao and Grisman (2005) can be easily represented by an explicit feature vector.",
                    "sid": 53,
                    "ssid": 26,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the ace rdc 2004 corpus defines 7/27 relation. ",
            "number": "3",
            "sents": [
                {
                    "text": "types/subtypes between 7 entity types.",
                    "sid": 54,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "structures in kernel-based approaches.",
                    "sid": 55,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Until now, there are no explicit ways to capture the hierarchical topology in relation extraction.",
                    "sid": 56,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Currently, all the current approaches apply the flat learning 3.1 Perceptron Algorithm.",
                    "sid": 57,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Input: the initial weight vector w , the training example sequence strategy which equally treats training examples ( xt , yt ) ∈ X × Y , t = 1,2...,T and the number of in different relations independently and ignore the commonality among different relations.",
                    "sid": 58,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper proposes a novel hierarchical learning the maximal iterations N (e.g. 10 in this paper) of the training sequence4 Output: the weight vector w for the linear strategy to resolve this problem by considering the relatedness among different relations and discriminative function BEGIN w1 = w f = w ⋅ xcapturing the commonality among related rela tions.",
                    "sid": 59,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By doing so, the data sparseness problem REPEAT for t=1,2,…,T*N 1.",
                    "sid": 60,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Receive the instance x ∈ Rn.",
                    "sid": 61,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "can be well dealt with and much better performance can be achieved, especially for those rela 2.",
                    "sid": 62,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compute the output ot.",
                    "sid": 63,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "∧ = wt ⋅ xt tions with small amounts of annotated examples.",
                    "sid": 64,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 65,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Give the prediction.",
                    "sid": 66,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "y t = sign(ot )",
                    "sid": 67,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "receive the desired label. ",
            "number": "4",
            "sents": [
                {
                    "text": "yt ∈{−1,+1} 3 Hierarchical Learning Strategy.",
                    "sid": 68,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "update the hypothesis according to. ",
            "number": "5",
            "sents": [
                {
                    "text": "Traditional classifier learning approaches apply wt +1 = wt + δt yt xt where δt = 0 if the margin of wt (1) at the the flat learning strategy.",
                    "sid": 69,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, they equally given example ( xt , yt ) yt wt ⋅ xt > 0 treat training examples in different classes independently and ignore the commonality among related classes.",
                    "sid": 70,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The flat strategy will not and δt = 1 otherwise END REPEAT N cause any problem when there are a large amount of training examples for each class, since, in this Return w = END BEGIN ∑ wT *i +1 / 5 i = N −4 case, a classifier learning approach can always learn a nearly optimal discriminative function for each class against the remaining classes.",
                    "sid": 71,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, such flat strategy may cause big problems Figure 1: the perceptron algorithm This section first deals with binary classification using linear classifiers.",
                    "sid": 72,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Assume an instance space when there is only a small amount of training X = Rn and a binary label space Y = {−1,+1} . examples for some of the classes.",
                    "sid": 73,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, a With any weight vector w ∈ Rn and a given classifier learning approach may fail to learn areliable (or nearly optimal) discriminative func instance x ∈ R n , we associate a linear classifier 5 hw with a linear discriminative function tion for a class with a small amount of trainingexamples, and, as a result, may significantly af f ( x) = w ⋅ x by hw ( x) = sign(w ⋅ x) , where fect the performance of the class or even the sign(w ⋅ x) = −1 if w ⋅ x < 0 and sign(w ⋅ x) = +1 overall performance.",
                    "sid": 74,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "otherwise.",
                    "sid": 75,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, the margin of w at ( xt , yt ) is To overcome the inherent problems in the defined as yt w ⋅ xt . Then if the margin is positive, flat strategy, this paper proposes a hierarchical learning strategy which explores the inherent we have a correct prediction with hw ( x) = yt , and if the margin is negative, we have an error with commonality among related classes through a hw ( x) ≠ yt . Therefore, given a sequence of.",
                    "sid": 76,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "class hierarchy.",
                    "sid": 77,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, the training exam training examples ( xt , yt ) ∈ X × Y , t = 1,2...,T , ples of related classes can help in learning a reliable discriminative function for a class with only a small amount of training examples.",
                    "sid": 78,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To reduce computation time and memory requirements, we will only consider linear classifiers and apply the simple and widely-used perceptron algorithm for this purpose with more options open for future research.",
                    "sid": 79,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following, we will first introduce the perceptron algorithm in linear classifier learning, followed by the hierarchical learning strategy using the perceptron algorithm.",
                    "sid": 80,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we will consider several ways in building the linear classifier learning attemps to find a weight vector w that achieves a positive margin on as many examples as possible.",
                    "sid": 81,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 The training example sequence is feed N times for.",
                    "sid": 82,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "better performance.",
                    "sid": 83,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, this number can control the maximal affect a training example can pose.",
                    "sid": 84,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is similar to the regulation parameter C in SVM, which affects the trade-off between complexity and proportion of non-separable examples.",
                    "sid": 85,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, it can be used to control over-fitting and robustness.",
                    "sid": 86,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "class hierarchy.",
                    "sid": 87,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 (w ⋅ x) denotes the dot product of the weight vector w ∈ Rn and a given instance x ∈ R n . The well-known perceptron algorithm, as shown in Figure 1, belongs to online learning of linear classifiers, where the learning algorithm represents its t -th hyposthesis by a weight vector which builds K classifiers so as to separate one class from all others.",
                    "sid": 88,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the outputs for the perceptron algorithms of different classes may be not directly comparable since any wt ∈ R . At trial.",
                    "sid": 89,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "t , an online algorith m receives positive scalar multiple of the weight vector will an instance ∧ x ∈ Rn , makes its prediction not affect the actual prediction of a perceptron algorithm.",
                    "sid": 90,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For comparabilit y, we map the perceptron algorithm output into the probability = sign(wt ⋅ xt ) and receives the desired label by using an additional sigmoid model: yt ∈{−1,+1} . What distinguishes different online 1 algorithms is how they update wt into wt +1 based p( y = 1 | f ) = 1 + exp( Af + B) (2) on the example ( xt , yt ) received at trial t . In where f = w ⋅ x is the output of a perceptron particular, the perceptron algorithm updates the hypothesis by adding a scalar multiple of the instance, as shown in Equation 1 of Figure 1, when there is an error.",
                    "sid": 91,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normally, the tradictional perceptron algorithm initializes the hypothesis as the zero vector w1 = 0 . This is usually the most natural choice, lacking any other preference.",
                    "sid": 92,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Smoothing In order to further improve the performance, we iteratively feed the training examples for a possi ble better discriminative function.",
                    "sid": 93,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we have set the maximal iteration number to 10 for both efficiency and stable performance and the final weight vector in the discriminative function is averaged over those of the discriminative functions in the last few iterations (e.g. 5 in this paper).",
                    "sid": 94,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bagging One more problem with any online classifier learning algorithm, including the perceptron al gorithm, is that the learned discriminative function somewhat depends on the feeding order of the training examples.",
                    "sid": 95,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to eliminate such dependence and further improve the perform ance, an ensemble technique, called bagging (Breiman 1996), is applied in this paper.",
                    "sid": 96,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In bagging, the bootstrap technique is first used to build M (e.g. 10 in this paper) replicate sample sets by randomly re-sampling with replacement from the given training set repeatedly.",
                    "sid": 97,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, each training sample set is used to train a certain discriminative function.",
                    "sid": 98,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the final weight vector in the discriminative function is averaged over those of the M discriminative functions in the ensemble.",
                    "sid": 99,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Multi-Class Classification Basically, the perceptron algorithm is only for binary classification.",
                    "sid": 100,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we must extend the perceptron algorithms to multi-class classification, such as the ACE RDC task.",
                    "sid": 101,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For efficiency, we apply the one vs. others strategy, algorithm and the coefficients A & B are to be trained using the model trust alorithm as described in Platt (1999).",
                    "sid": 102,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final decision of an instance in multi-class classification is determined by the class which has the maximal probability from the corresponding perceptron algorithm.",
                    "sid": 103,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Hierarchical Learning Strategy using the.",
                    "sid": 104,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Perceptron Algorithm Assume we have a class hierarchy for a task, e.g. the one in the ACE RDC 2003 corpus as shown in Table 1 of Section 4.1.",
                    "sid": 105,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hierarchical learning strategy explores the inherent commonality among related classes in a top-down way.",
                    "sid": 106,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each class in the hierarchy, a linear discriminative function is determined in a top-down way with the lower-level weight vector derived from the upper-level weight vector iteratively.",
                    "sid": 107,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is done by initializing the weight vector in training the linear discriminative function for the lower- level class as that of the upper-level class.",
                    "sid": 108,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, the lower-level discriminative function has the preference toward the discriminative function of its upper-level class.",
                    "sid": 109,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For an example, let’s look at the training of the “Located” relation subtype in the class hierarchy as shown in Table 1: 1) Train the weight vector of the linear discriminative function for the “YES” relation vs. the “NON” relation with the weight vector initialized as the zero vector.",
                    "sid": 110,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2) Train the weight vector of the linear discriminative function for the “AT” relation type vs. all the remaining relation types (including the “NON” relation) with the weight vector initialized as the weight vector of the linear discriminative function for the “YES” relation vs. the “NON” relation.",
                    "sid": 111,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3) Train the weight vector of the linear discriminative function for the “Located” relation subtype vs. all the remaining relation subtypes under all the relation types (including the “NON” relation) with the weight vector initialized as the weight vector of the linear discriminative function for the “AT” relation type vs. all the remaining relation types.",
                    "sid": 112,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4) Return the above trained weight vector as the discriminatie function for the “Located” relation subtype.",
                    "sid": 113,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, the training examples in different classes are not treated independently any more, and the commonality among related classes can be captured via the hierarchical learning strategy.",
                    "sid": 114,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The intuition behind this strategy is that the upper-level class normally has more positive training examples than the lower-level class so that the corresponding linear discriminative function can be determined more reliably.",
                    "sid": 115,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, the training examples of related classes can help in learning a reliable discriminative function for a class with only a small amount of training examples in a top-down way and thus alleviate its data sparseness problem.",
                    "sid": 116,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Building the Class Hierarchy.",
                    "sid": 117,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have just described the hierarchical learning strategy using a given class hierarchy.",
                    "sid": 118,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normally, a rough class hierarchy can be given manually according to human intuition, such as the one in the ACE RDC 2003 corpus.",
                    "sid": 119,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to explore more commonality among sibling classes, we make use of binary hierarchical clustering for sibling classes at both lowest and all levels.",
                    "sid": 120,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be done by first using the flat learning strategy to learn the discriminative functions for individual classes and then iteratively combining the two most related classes using the cosine similarity function between their weight vectors in a bottom-up way.",
                    "sid": 121,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The intuition is that related classes should have similar hyper-planes to separate from other classes and thus have similar weight vectors.",
                    "sid": 122,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Lowest-level hybrid: Binary hierarchical clustering is only done at the lowest level while keeping the upper-level class hierarchy.",
                    "sid": 123,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, only sibling classes at the lowest level are hierarchically clustered.• All-level hybrid: Binary hierarchical cluster ing is done at all levels in a bottom-up way.",
                    "sid": 124,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, sibling classes at the lowest level are hierarchically clustered first and then sibling classes at the upper-level.",
                    "sid": 125,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, the bi nary class hierarchy can be built iteratively in a bottom-up way.",
                    "sid": 126,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 Experimentation This paper uses the ACE RDC 2003 corpus provided by LDC to train and evaluate the hierarchical learning strategy.",
                    "sid": 127,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Same as Zhou et al (2005), we only model explicit relations and explicitly model the argument order of the two mentions involved.",
                    "sid": 128,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Experimental.",
                    "sid": 129,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Setting Type Subtype Freq Bin Type AT Based-In 347 Medium Located 2126 Large Residence 308 Medium Other 6 Small ROLE Affiliate-Partner 204 Medium Citizen-Of 328 Medium Client 144 Small Founder 26 Small General-Staff 1331 Large Management 1242 Large Member 1091 Large Owner 232 Medium Other 158 Small Table 1: Statistics of relation types and subtypes in the training data of the ACE RDC 2003 corpus (Note: According to frequency, all the subtypes are divided into three bins: large/ middle/ small, with 400 as the lower threshold for the large bin and 200 as the upper threshold for the small bin).",
                    "sid": 130,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training data consists of 674 documents (~300k words) with 9683 relation examples while the held-out testing data consists of 97 documents (~50k words) with 1386 relation examples.",
                    "sid": 131,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the experiments are done five times on the 24 relation subtypes in the ACE corpus, except otherwise specified, with the final performance averaged using the same re-sampling with replacement strategy as the one in the bagging technique.",
                    "sid": 132,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 lists various types and subtypes of relations for the ACE RDC 2003 corpus, along with their occurrence frequency in the training data.",
                    "sid": 133,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that this corpus suffers from a small amount of annotated data for a few subtypes such as the subtype “Founder” under the type “ROLE”.",
                    "sid": 134,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For comparison, we also adopt the same feature set as Zhou et al (2005): word, entity type, mention level, overlap, base phrase chunking, dependency tree, parse tree and semantic information.",
                    "sid": 135,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Experimental Results.",
                    "sid": 136,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows the performance of the hierarchical learning strategy using the existing class hierarchy in the given ACE corpus and its comparison with the flat learning strategy, using the perceptron algorithm.",
                    "sid": 137,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that the pure hierarchical strategy outperforms the pure flat strategy by 1.5 (56.9 vs. 55.4) in F-measure.",
                    "sid": 138,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also shows that further smoothing and bagging improve the performance of the hierarchical and flat strategies by 0.6 and 0.9 in F-measure respectively.",
                    "sid": 139,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, the final hierarchical strategy achieves F-measure of 57.8 and outper forms the final flat strategy by 1.8 in F-measure.",
                    "sid": 140,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Strategies P R F hierarchical learning strategy when a rough class hierarchy is not available and difficult to determine manually, we also experiment using entirely automatically built class hierarchy (using the traditional binary hierarchical clustering algorithm and the cosine similarity measurement) without considering the existing class hierarchy.",
                    "sid": 141,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows that using automatically built class hierarchy performs comparably with using only the existing one.",
                    "sid": 142,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the major goal of resolving the data sparseness problem for the classes with a small amount of training examples, Table 4 compares the best-performed hierarchical and flat learning strategies on the relation subtypes of different training data sizes.",
                    "sid": 143,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we divide various relation subtypes into three bins: large/middle/small, according to their available training data sizes.",
                    "sid": 144,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the ACE RDC 2003 corpus, we use 400 as Flat+Both 59.1 53.2 56.0 Hierarchical 61.9 52.6 56.9 Hierarchical+Smoothing 62.7 53.1 57.5 Hierarchical+Bagging 62.9 53.1 57.6 Hierarchical+Both 63.0 53.4 57.8 Table 2: Performance of the hierarchical learning strategy using the existing class hierarchy and its comparison with the flat learning strategy Class Hierarchies P R F All-level Hybrid 63.6 53.6 58.2 Table 3: Performance of the hierarchical learning strategy using different class hierarchies Table 3 compares the performance of the hierarchical learning strategy using different class hierarchies.",
                    "sid": 145,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that, the lowest-level hybrid approach, which only automatically updates the existing class hierarchy at the lowest level, improves the performance by 0.3 in F-measure while further updating the class hierarchy at upper levels in the all-level hybrid approach only has very slight effect.",
                    "sid": 146,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is largely due to the fact that the major data sparseness problem occurs at the lowest level, i.e. the relation subtype level in the ACE corpus.",
                    "sid": 147,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, the final hierarchical learning strategy using the class hierarchy built with the all-level hybrid approach achieves F-measure of 58.2 in F-measure, which outperforms the final flat strategy by 2.2 in F- measure.",
                    "sid": 148,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to justify the usefulness of our relation subtypes, respectively.",
                    "sid": 149,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Please see Table 1 for details.",
                    "sid": 150,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 shows that the hierarchical strategy outperforms the flat strategy by 1.0/5.1/5.6 in F-measure on the large/middle/small bin respectively.",
                    "sid": 151,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This indicates that the hierarchical strategy performs much better than the flat strategy for those classes with a small or medium amount of annotated examples although the hierarchical strategy only performs slightly better by 1.0 and 2.2 in F- measure than the flat strategy on those classes with a large size of annotated corpus and on all classes as a whole respectively.",
                    "sid": 152,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that the proposed hierarchical strategy can well deal with the data sparseness problem in the ACE RDC 2003 corpus.",
                    "sid": 153,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An interesting question is about the similarity between the linear discriminative functions learned using the hierarchical and flat learning strategies.",
                    "sid": 154,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 compares the cosine similarities between the weight vectors of the linear dis- criminative functions using the two strategies for different bins, weighted by the training data sizes tion subtype in the ACE RC 2003 corpus has training examples in between 400 and 900.",
                    "sid": 155,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 A few minor relation subtypes only have very few examples in the testing set.",
                    "sid": 156,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason to choose this threshold is to guarantee a reasonable number of testing examples in the small bin.",
                    "sid": 157,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the ACE RC 2003 corpus, using 200 as the upper threshold will fill the small bin with about 100 testing examples while using 100 will include too few testing examples for reasonable performance evaluation.",
                    "sid": 158,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of different relation subtypes.",
                    "sid": 159,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that the linear discriminative functions learned using the two strategies are very similar (with the cosine similarity 0.98) for the relation subtypes belonging to the large bin while the linear discriminative functions learned using the two strategies are not for the relation subtypes belonging to the medium/small bin with the cosine similarity 0.92/0.81 respectively.",
                    "sid": 160,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that the use of the hierarchical strategy over the flat strategyonly has very slight change on the linear dis criminative functions for those classes with a large amount of annotated examples while its effect on those with a small amount of annotated examples is obvious.",
                    "sid": 161,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This contributes to and explains (the degree of) the performance difference between the two strategies on the different training data sizes as shown in Table 4.",
                    "sid": 162,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the difficulty of building a large annotated corpus, another interesting question is about the learning curve of the hierarchical learning strategy and its comparison with the flat learning strategy.",
                    "sid": 163,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows the effect of different training data sizes for some major relation subtypes while keeping all the training examples of remaining relation subtypes.",
                    "sid": 164,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that the hierarchical strategy performs much better than the flat strategy when only a small amount of training examples is available.",
                    "sid": 165,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also shows that the hierarchical strategy can achieve stable performance much faster than the flat strategy.",
                    "sid": 166,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, it shows that the ACE RDC 2003 task suffers from the lack of training examples.",
                    "sid": 167,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among the three major relation subtypes, only the subtype “Located” achieves steady performance.",
                    "sid": 168,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we also compare our system with the previous best-reported systems, such as Kambhatla (2004) and Zhou et al (2005).",
                    "sid": 169,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 shows that our system outperforms the previous best-reported system by 2.7 (58.2 vs. 55.5) in F- measure, largely due to the gain in recall.",
                    "sid": 170,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It indicates that, although support vector machines and maximum entropy models always perform better than the simple perceptron algorithm in most (if not all) applications, the hierarchical learning strategy using the perceptron algorithm can easily overcome the difference and outperforms the flat learning strategy using the overwhelming support vector machines and maximum entropy models in relation extraction, at least on the ACE RDC 2003 corpus.",
                    "sid": 171,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bin Type(cosine similarity) Large Bin (0.98) Midd le Bin (0.92) Smal l Bin (0.81) P R F P R F P R F Fl at Str ate gy 6 2.",
                    "sid": 172,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 6 1.",
                    "sid": 173,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 6 2.",
                    "sid": 174,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 6 0.",
                    "sid": 175,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 38 .7 4 7.",
                    "sid": 176,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 3 3.",
                    "sid": 177,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 21 .7 2 6.",
                    "sid": 178,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Hi era rc hic al Str ate gy 6 6.",
                    "sid": 179,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 6 0.",
                    "sid": 180,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 6 3.",
                    "sid": 181,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 6 7.",
                    "sid": 182,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 42 .7 5 2.",
                    "sid": 183,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 4 0.",
                    "sid": 184,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 26 .3 3 1.",
                    "sid": 185,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8Table 4: Comparison of the hierarchical and flat learning strategies on the relation subtypes of differ ent training data sizes.",
                    "sid": 186,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notes: the figures in the parentheses indicate the cosine similarities between the weight vectors of the linear discriminative functions learned using the two strategies.",
                    "sid": 187,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "HS: General-Staff 60 FS: General-Staff 50 HS: Part-Of 40 FS: Part-Of 30 20 HS: Located.",
                    "sid": 188,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10 FS: Located.",
                    "sid": 189,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training Data Size Figure 2: Learning curve of the hierarchical strategy and its comparison with the flat strategy for some major relation subtypes (Note: FS for the flat strategy and HS for the hierarchical strategy) System P e r f o r m a n c e P R F Our: Perceptron Algorithm + Hierarchical Strategy 63.6 53.6 58.2 Zhou et al (2005): SVM + Flat Strategy 63.1 49.5 55.5 Kambhatla (2004): Maximum Entropy + Flat Strategy 63.5 45.2 52.8 Table 5: Comparison of our system with other best-reported systems 5 Conclusion.",
                    "sid": 190,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper proposes a novel hierarchical learning strategy to deal with the data sparseness problem in relation extraction by modeling the common- ality among related classes.",
                    "sid": 191,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each class in a class hierarchy, a linear discriminative function is determined in a top-down way using the per- ceptron algorithm with the lower-level weight vector derived from the upper-level weight vector.",
                    "sid": 192,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, the upper-level discriminative function can effectively guide the lower-level discriminative function learning.",
                    "sid": 193,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation on the ACE RDC 2003 corpus shows that the hierarchical strategy performs much better than the flat strategy in resolving the critical data sparseness problem in relation extraction.",
                    "sid": 194,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the future work, we will explore the hierarchical learning strategy using other machine learning approaches besides online classifier learning approaches such as the simple perceptron algorithm applied in this paper.",
                    "sid": 195,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, just as indicated in Figure 2, most relation sub- types in the ACE RDC 2003 corpus (arguably the largest annotated corpus in relation extraction) suffer from the lack of training examples.",
                    "sid": 196,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, a critical research in relation extraction is how to rely on semi-supervised learning approaches (e.g. bootstrap) to alleviate its dependency on a large amount of annotated training examples and achieve better and steadier performance.",
                    "sid": 197,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, our current work is done when NER has been perfectly done.",
                    "sid": 198,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, it would be interesting to see how imperfect NER affects the performance in relation extraction.",
                    "sid": 199,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This will be done by integrating the relation extraction system with our previously developed NER system as described in Zhou and Su (2002).",
                    "sid": 200,
                    "ssid": 132,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}