{
    "ID": "P06-3008",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Both rhetorical structure and punctuation have been helpful in discourse processing.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on a corpus annotation project, this paper reports the discursive usage of 6 Chinese punctuation marks in news commentary texts: Colon, Dash, Ellipsis, Exclamation Mark, Question Mark, and Semicolon.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rhetorical patterns of these marks are compared against patterns around cue phrases in general.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results show that these Chinese punctuation marks, though fewer in number than cue phrases, are easy to identify, have strong correlation with certain relations, and can be used as distinctive indicators of nuclearity in Chinese texts.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Rhetorical structure has been proven useful in NLP projects such as text generation, summarization, machine translation and essay scoring.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Automatic discourse parsing remains an elusive task, however, despite much rule-based research on lexical cues such as anaphora and conjunctions.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parsing through machine learning has encountered a bottleneck, due to limited resources--there is only one English RST treebank publicly available, and one RST-annotated German corpus on its way.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Punctuation marks (PMs) have been proven useful in RST annotation as well as in many other NLP tasks such as Part-of-Speech tagging, Word Sense Disambiguation, Near-duplicate detection, bilingual alignment (e.g. Chuang and Yeh, 2005), etc. Dale (1991) noticed the role of PMs in determining rhetorical relations.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Say (1998) did a study on their roles in English discourse structure.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Marcu (1997) and CorstonOliver (1998) based their automatic discourse parser partially on PMs and other orthographical cues.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tsou et al.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1999) and Chan et al.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2000) use PMs to disambiguate candidate Discourse Markers for a Chinese summarization system.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reitter (2003) also used PMs to distinguish ATTRIBUTION and ELABORATION relations in his Feature-rich SVM rhetorical analysis system.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All these inspired us to survey on the rhetorical patterns around Chinese PMs, so as to provide more direct a priori scores for the coarse rhetorical analyzer by Zhang et al.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2000) in their hybrid summarization system.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper is organized into 5 parts: Section 2 gives an overview of a Chinese RST treebank under construction, and a survey on the syntax of six main PMs in the corpus: Colon, Dash, Ellipses, Exclamation Mark, Question Mark, and Semicolon.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 reports rhetorical patterns around these PMs.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 is a discussion on the effectiveness of these PMs in comparison with Chinese cue phrases.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 5 is a summary and Section 6 directions for future work.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "overview of chinese rst treebank. ",
            "number": "2",
            "sents": [
                {
                    "text": "under construction 2.1 Corpus data.",
                    "sid": 21,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the purpose of language engineering and linguistic investigation, we are constructing a Chinese corpus comparable to the English WSJRST treebank and the German Potsdam Commentary Corpus (Carlson et al. 2003; Stede 2004).",
                    "sid": 22,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Texts in our corpus were downloaded from the official website of People’s Daily 1 , where important Caijingpinlun2 (CJPL) articles 1 www.people.com.cn.",
                    "sid": 23,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Caijinpinglun (CJPL) in Chinese means “financial and.",
                    "sid": 24,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "business commentary”, and usually covers various topics in social economic life, such as fiscal policies, financial reports, 43 Proceedings of the COLING/ACL 2006 Student Research Workshop, pages 43–48, Sydney, July 2006.",
                    "sid": 25,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2006 Association for Computational Linguistics by major media entities were republished.",
                    "sid": 26,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With over 400 authors and editors involved, our texts can be regarded as a good indicator of the general use of Chinese by Mainland native speakers.",
                    "sid": 27,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the moment our CJPL corpus has a total of 395 texts, 785,045 characters, and 84,182 punctuation marks (including pruned spaces).",
                    "sid": 28,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although on average there are 9.3 characters between every two marks, sentences in CJPL are long, with 51.8 characters per common sentence delimiters (Full Stop, Question Mark and Exclamation Mark).",
                    "sid": 29,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Segmentation.",
                    "sid": 30,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are informed of the German Potsdam Commentary Corpus construction, in which they (Reitter 2003) designed a program for automatic segmentation at clausal level after each Sign=“$.”(including {., ?, !, ;, :, …}) and Sign=“$,”(including {,}) 3 . Human interference with the segmentation results was not allowed, but annotators could retie over-segmented bits by using the JOINT relation.",
                    "sid": 31,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the workload of discourse annotation, we decided to design a similar segmentation program.",
                    "sid": 32,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So we first normalized different encoding systems and variants of PMs (e.g. Dashes and Ellipses of various lengths), and then conducted a survey on the distribution (Fig.",
                    "sid": 33,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1) and syntax of major Chinese punctuation marks (e.g. syntax of Chinese Dash in Table 1).",
                    "sid": 34,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "40.0% 35.0% 30.0% 25.0% 20.0% 15.0% 10.0% 5.0% used after an independent NP or discourse marker.",
                    "sid": 35,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This rate, times the total number of C-Comma-1, means we would have to retie a huge number of over-segmented elements.",
                    "sid": 36,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So we decided not to take C-Comma-1 as a delimiter of our Elementary Unit of Discourse Analysis (EUDA) for the present.",
                    "sid": 37,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1: Syntax of Chinese Dash 42.9% of the colons in CJPL are used in the structural elements6 of the texts.",
                    "sid": 38,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other than these, 56.5% of the colons are used between clausal strings, only 0.6% of the colons are used after non-clausal strings.",
                    "sid": 39,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "99.6% instances of Exclamation Mark, Question Mark, Dash, Ellipses and Semicolon in the Chinese corpus are used after clausal strings.",
                    "sid": 40,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our corpus, 4.3% of the left quotation marks do not have a right match to indicate the end of a quote.",
                    "sid": 41,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because many articles do not give clear indications of direct or indirect quotes7 , it is very difficult for the annotator to makeup.",
                    "sid": 42,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parentheses and brackets have a similar 0.0% PM pro ble m, wit h 3.2 % mar ks mis sin g thei r mat che s. Figure 1: Percentage of major punctuation marks in the Chinese corpus4 C-Comma-1 is the most frequently used PM in the Chinese corpus.",
                    "sid": 43,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While it does delimit clauses, a study on 200 randomly selected C-Comma-1 tokens in our corpus shows that 55 of them are trading, management, economic conferences, transportation, entertainment, education, etc. Collected by professional editors, most texts in our corpus are commentaries; some are of marginal genres by the Chinese standards.",
                    "sid": 44,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "in the Potsdam Commentary Corpus.",
                    "sid": 45,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 PMs are counted by individual symbols..",
                    "sid": 46,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 The symbol “S” donates sentences with a common end.",
                    "sid": 47,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "mark, while “s” denotes structures orthographically end with one of the PMs studied here.",
                    "sid": 48,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“+” means one or more occurrences, “*” means zero or more occurrences.",
                    "sid": 49,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The category after a bracket pair indicates the syntactic role played by the unit enclosed, for example “[……]NP” means the ellipses functions as an NP within a clausal structure.",
                    "sid": 50,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“<para></para>” denotes paragraph opening and ending.",
                    "sid": 51,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 By “Structural elements” we mean documentary.",
                    "sid": 52,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "information, such as Publishing Date, Source, Link, Editor, etc. Although these are parts of a news text, they are not the article proper, on which we annotate rhetorical relations.",
                    "sid": 53,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 After a comparative study on the rhetorical structure of.",
                    "sid": 54,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "news published by some Hong Kong newspapers in both English and Chinese, Scollon and Scollon (1997) observed that “quotation is at best ambiguous in Chinese.",
                    "sid": 55,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No standard practice has been observed across newspapers in this set and even within a newspaper, it is not obvious which portions of the text are attributed to whom.” We notice that Mainland newspapers have a similar phenomenon.",
                    "sid": 56,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides, 53.9% of the marks appear in structural elements that we didn’t intend to analyze8 . Finally, we decided to use Period, the End-of-line symbol, and these six marks (Question Mark, Exclamation Mark, Colon, An intracoder accuracy test has bee taken between the 1st and 2nd versions of 97 finished trees.",
                    "sid": 57,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The intracoder accuracy rate (Rv) for a particular variable is defined as 2*(AT-AS) Semicolon, Ellipsis and Dash) as delimiters of our EUDA.",
                    "sid": 58,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Quotation mark, Parentheses, and Brackets were not selected.",
                    "sid": 59,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rv= Where TT-TS *100% A special program was designed to conduct the segmentation after each delimiter, with proper adjustment in cases when the delimiter is immediately followed by a right parenthesis, a right quotation mark, or another delimiter.",
                    "sid": 60,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A pseudo-relation, SAME-UNIT, has been used during annotation to re-tie any discourse segment cut by the segmentation program into fragments.",
                    "sid": 61,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Annotation and Validity Control.",
                    "sid": 62,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use O’Donnell’s RSTTool V3.43 9 as our annotation software.",
                    "sid": 63,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We started from the Extended-RST relation set embedded in the software, adding gradually some new relations, and finally got an inventory of 47 relations.",
                    "sid": 64,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We take the same rhetorical predicate with switched arguments as different relations, for instance, SOLUTIONHOOD-S, SOLUTIONHOOD-M and SOLUTIONHOOD-N are regarded as 3 relations.",
                    "sid": 65,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following Carlson et al.",
                    "sid": 66,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2001) and Marcu’s (1999) examples, we’ve composed a 60-page Chinese RST annotation manual, which includes preprocessing procedures, segmentation rules, definitions and examples of the relations, tag definitions for structural elements, tagging conventions for special structures, and a relation selection protocol.",
                    "sid": 67,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When annotating, we choose the most indicative relation according to the manual.",
                    "sid": 68,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Trees are constructed with binary branches except for multinuclear relations.",
                    "sid": 69,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One experienced annotator had sketched trees for all the 395 files before the completion of the manual.",
                    "sid": 70,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then she annotated 97 shortest files from 197 randomly selected texts, working independently and with constant reference to the manual.",
                    "sid": 71,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After a one-month break, she re-annotated the 97 files, with reference to the manual and with occasional consultation with Chinese journalists and linguists.",
                    "sid": 72,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last version, though far from error-free, is currently taken as the right version for reliability tests and other statistics.",
                    "sid": 73,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "AT= number of agreed tags; TT= number of total tags; TS= number of total tags for structural elements; AS= number of agreed tags for structural elements.",
                    "sid": 74,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rr for relation tags is 84.39%, Ru for unit tags is 85.61%, and Rn for nuclearity tags is 88.12%.",
                    "sid": 75,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because SPSS can only calculate Kappa Coefficient for symmetric data, we’ve only measured Kappa for relation tags to the EUDAs.",
                    "sid": 76,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The outcome, Kr=.738, is quite high.",
                    "sid": 77,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 Results The 97 double-annotated files have in the main body of their texts a total of 677 paragraphs and 1,914 EUDAs.",
                    "sid": 78,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Relational patterns of those PMs are reported in Table 27 below10 . The “N”, “S” or “M” tags after each relation indicate the nuclearity status of each EUDA ended with a certain PM.",
                    "sid": 79,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of those PMs used in structural elements of CJPL texts are also reported as they make up the total percentage.",
                    "sid": 80,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 Parentheses, and other PMs used in structural elements of.",
                    "sid": 81,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CJPL texts, are of high relevance to discourse parsing, since they can be used in a preprocessor to filter out text fragments that do not need be annotated in terms of RST.",
                    "sid": 82,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 Publicly downloadable at www.wagsoft.com..",
                    "sid": 83,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2: Rhetorical pattern of C-Question 10 Based on data from the 2nd version of annotated texts..",
                    "sid": 84,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ev alu ati on -N 1 2 . 5 0 % 0 . 7 2 % Vo liti onal res ult -S 1 2 . 5 0 % 1 . 3 2 % T T L 1 0 0 . 0 0 % N / A Table 6: Rhetorical pattern of C-Ellipses Table 3: Rhetorical pattern of C-Exclamation Table 7: Rhetorical pattern of C-Dash Table 4: Rhetorical pattern of C-Colon Table 5: Rhetorical pattern of C-Semicolon 11 This is higher than the overall 42.93% rate for colons.",
                    "sid": 85,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "used in structural elements, for we’ve only finished 97 shortest ones from the 197 randomly selected files.",
                    "sid": 86,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The above data suggest at least the following: 1) There is no one-to-one mapping between any of PM studied and a rhetorical relation.",
                    "sid": 87,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But some PMs have dominant rhetorical usages.",
                    "sid": 88,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2) C-Question Mark is not most frequently related with SOLUTIONHOOD, but with CONJUNCTION.",
                    "sid": 89,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is because a high percentage of questions in our corpus are rhetorical and used in groups to achieve certain argumentative force.",
                    "sid": 90,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3) C-Colon is most frequently related with ATTRIBUTION and ELABORATION, apart from its usage in structural elements.",
                    "sid": 91,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4) C-Semicolon is overwhelmingly associated with multinuclear relations, particularly with CONJUNCTION.",
                    "sid": 92,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5) C-Dash usually indicates an ELABORATION relation.",
                    "sid": 93,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But since it is often used in pairs, it is often bound to both the Nucleus and Satellite units of a relation.",
                    "sid": 94,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6) 82.3% tokens of the six Chinese PMs are uniquely related to EUDAs of certain nucleus status in a rhetorical relation, taking even C-Dash into account.",
                    "sid": 95,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7) The following relations have more than 10% of their instances related to one of the six PMs studied here: ADDITION, ATTRIBUTION, CONJUNCTION, DISJUNCTION, ELABORATION, LIST, OTHERWISE, PREPARTION, RESTATEMENT and SOLUTIONHOOD.",
                    "sid": 96,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8) Chinese PMs are used somewhat differently from their German equivalents, Exclamation Mark for instance (Fig.2): 35.0% 30.0% 25.0% 20.0% 15.0% 10.0% 5.0% 0.0% Relation type Chinese German relation s for their Chinese summar izer.",
                    "sid": 97,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their tests were successf ul.",
                    "sid": 98,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But like PMs, Chinese cue phrases are not in a one-to one mappin g relation ship with rhetoric al relation s, either.",
                    "sid": 99,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our finished portion of CJPL corpus, we’ve identifie d 161 Types of cue phrases1 2 at or above our EUDA level, recordin g 539 tokens.",
                    "sid": 100,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These cue phrases are scattere d in 477 EDUAs , indicati ng 20.5% of the total relation s in our Figure 2: Rhetorical Function of Exclamation Mark in Chinese and German corpora 4 Discussion.",
                    "sid": 101,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How useful are these six PMs in the prediction of rhetorical relations in Chinese texts?",
                    "sid": 102,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our opinion, this question can be answered partly through a comparison with Chinese cue phrases.",
                    "sid": 103,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cue phrases are widely discussed and exploited in the literature of both Chinese studies and RST applications as a major surface device.",
                    "sid": 104,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, Chinese cue phrases in natural texts are difficulty to identify automatically.",
                    "sid": 105,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As known, Chinese words are made up of 1, 2, or more characters, but there is no explicit word delimiter between any pair of adjacent words in a string of characters.",
                    "sid": 106,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, they are not known before tokenization (“fenci” in Chinese, meaning “separating into words”, or “word segmentation” so as to recognize meaningful words out of possible overlaps or combinations).",
                    "sid": 107,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The task may sound simple, but has been the focus of considerable research efforts (e.g. Webster and Kit, 1992; Guo 1997; Wu, 2003).",
                    "sid": 108,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since many cue phrases are made up of high-frequency characters (e.g. “而-ER” in “而 -er” meaning “but/so/and”, “ 然 而-ran’er” meaning “but/however”, “因而-yin’er” meaning “so/because of this”, “而且-erqie” meaing “in addition” etc.; “此-ci” in “此后-cihou” meaning “later/hereafter”, “ 因此-yinci” meaning “as a result”, “ 由此看来-youcikanlai” meaning “on this ground/hence”, etc.), a considerable amount of computation must be done before these cue phrases can ever been exploited.",
                    "sid": 109,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Apart from tokenization, POS and WSD are other necessary steps that should be taken before making use of some common cue phrases.",
                    "sid": 110,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are all hard nuts in Chinese language engineering.",
                    "sid": 111,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Interestingly, many researches done in these three areas have made use of the information carried by PMs (e.g. Sun et al. 1998).",
                    "sid": 112,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chan et al.",
                    "sid": 113,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2000) did a study on identify Chinese connectives as signals of rhetorical finished portion of the corpus.",
                    "sid": 114,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our six PMs, on the other hand, have 551 tokens in the same finished portion, delimiting 345 EUDAs (and 206 structural elements), and indicating 14.8% of the total relations.",
                    "sid": 115,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, since there are far more types of cue phrases than types of punctuation marks, 90.1% of cue phrases are sparser at or above our EDUA level than the least frequently used PM—Ellipsis in this case.",
                    "sid": 116,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And Chinese cue phrases don’t signal all the rhetorical relations at all levels.",
                    "sid": 117,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, CONJUNTION is the most frequently used relation in our annotated text (taking 22.1% of all the discursive relations), but it doesn’t have strong correlation with any lexical item.",
                    "sid": 118,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its most frequent lexical cue is “ 也-ye”, taking 2.4%.",
                    "sid": 119,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ELABORATION is another common relation in CJPL, but it is rarely marked by cue phrases.",
                    "sid": 120,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ATTRIBUTION, SOLUTIONHOOD and DISJUNCTION are amongst other lowest marked relations in Chinese—they happen to be signaled quite significantly by a punctuation mark.",
                    "sid": 121,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the cost to recognize Chinese cue phrases accurately, the sparseness of many of these cues, and the risk of missing all cue phrases for a particular discursive relation, punctuation marks with strong rhetorical preferences appear to be useful supplements to cue phrases.",
                    "sid": 122,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Conclusion.",
                    "sid": 123,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because rhetorical structure in Chinese texts is not explicit by itself, systematic and quantitative evaluation of various factors that can contribute to the automatic analysis of texts is quite necessary.",
                    "sid": 124,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The purpose of this study is to look into the discursive patterns of Chinese PMs, to see if they can facilitate discourse parsing without deep semantic analysis.",
                    "sid": 125,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have in this study observed the discursive usage of six Chinese PMs, from their overall distribution in our Chinese discourse corpus, their syntax in context, to their rhetorical roles at 12 We are yet to give a theoretical definition of Cue Phrases.",
                    "sid": 126,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "in our study.",
                    "sid": 127,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But the identified ones range similarly to those English cue phrases listed in Marcu (1997).",
                    "sid": 128,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "or above our EUDA level.",
                    "sid": 129,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Current statistics seem to suggest clear patterns of their rhetorical roles, and their distinctive correlation with nuclearity in most relations.",
                    "sid": 130,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These patterns and correlation may be useful in NLP projects.",
                    "sid": 131,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 Future Work.",
                    "sid": 132,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are conscious of the size and granularity of our treebank on which this analysis is based.",
                    "sid": 133,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We plan to get a larger team to work on the project, so as to make it more comparable to the English and German RST treebanks.",
                    "sid": 134,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the distinctive nucleus status of EUDAs ended with these PMs may be useful in deciding growth point for RS-tree construction or for tree pruning in summarization, we are also interested in testing how well a baseline relation classifier performs if it always predicts the most frequent relations for these PMs.",
                    "sid": 135,
                    "ssid": 115,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgement",
            "number": "",
            "sents": [
                {
                    "text": "Special thanks to Dr. Manfred Stede for licensing us to use the Potsdam Commentary Corpus.",
                    "sid": 136,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And thanks to Dr. Michael O’Donnell, FAN Taizhi, HU Fengguo, JIN Narisong, and MA Guangbin for their technical support.",
                    "sid": 137,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The author also fully appreciates the anonymous reviewers for their constructive comments.",
                    "sid": 138,
                    "ssid": 118,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}