{
    "ID": "P06-1010",
    "sections": [
        {
            "text": "introduction. ",
            "number": "1",
            "sents": [
                {
                    "text": "As part of a more general project on multilingual named entity identification, we are interested in the problem of name transliteration across languages that use different scripts.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One particular issue is the discovery of named entities in “comparable” texts in multiple languages, where by comparable we mean texts that are about the same topic, but are not in general translations of each other.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if one were to go through an English, Chinese and Arabic newspaper on the same day, it is likely that the more important international events in various topics such as politics, business, science and sports, would each be covered in each of the newspapers.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Names of the same persons, locations and so forth — which are often transliterated rather than translated — would be found in ting — many of them were clearly more novel, t conventions for transliterating foreign names.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These sample documents illustrate an important point: if a document in language L1 has a set of names, and one finds a document in L2 containing a set of names that look as if they could be transliterations of the names in the L1 document, then this should boost one’s confidence that the two sets of names are indeed transliterations of each other.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will demonstrate that this intuition is correct.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 Many names, particularly of organizations, may be translated rather than transliterated; the transliteration method we discuss here obviously will not account for such cases, though the time correlation and propagation methods we discuss will still be useful.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "73 Proceedings of the 21st International Conference on Computational Linguistics and 44th Annual Meeting of the ACL, pages 73–80, Sydney, July 2006.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2006 Association for Computational Linguistics Dai Yun Nips World No. 1 Martin to Shake off Olympic Shadow . . .",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the day’s other matches, second seed Zhou Mi overwhelmed Ling Wan Ting of Hong Kong, China 114, 114, Zhang Ning defeat Judith Meulendijks of Netherlands 11 2, 119 and third seed Gong Ruina took 21 minutes to eliminate Tine Rasmussen of Denmark 111, 111, enabling China to claim five quarterfinal places in the women’s singles.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 , 11:1 Our work differs from this work in that we use comparable corpora (in particular, news data) and leverage the time correlation information naturally available in comparable corpora.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 Chinese Transliteration with.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparable Corpora We assume that we have comparable corpora, consisting of newspaper articles in English and Chinese from the same day, or almost the same day.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In , 11 :2 11: 9 our experiments we use data from the English and n previous work on Chin ese named-entity is based on the SNoW machine learning toolkit , 11:4 11:1 Chinese stories from the Xinhua News agency forFigure 1: Sample from two stories about an inter national women’s badminton championship.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "previous work. ",
            "number": "2",
            "sents": [
                {
                    "text": "about 6 months of 2001.2 We assume that we have identified names for persons and locations—two types that have a strong tendency to be transliterated wholly or mostly phonetically—in the English text; in this work we use the named-entity recognizer described in (Li et al., 2004), which I transliteration — e.g.",
                    "sid": 15,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Meng et al., 2001; Gao et al., 2004), the problem has been cast as the problem of producing, for a given Chinese name, an English equivalent such as one might need in a machine translation system.",
                    "sid": 16,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, for wei weilian-mu-si, one (Carlson et al., 1999).",
                    "sid": 17,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To perform the transliteration task, we propose the following general three-step approach: 1.",
                    "sid": 18,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given an English name, identify candi-.",
                    "sid": 19,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "date Chinese character n-grams as possible transliterations.",
                    "sid": 20,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the name would like to arrive at the English name V(enus) Williams.",
                    "sid": 21,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Common approaches include source- channel methods, following (Knight and Graehl, 1998) or maximum-entropy models.",
                    "sid": 22,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparable corpora have been studied extensively in the literature (e.g.,(Fung, 1995; Rapp, 1995; Tanaka and Iwasaki, 1996; Franz et al., 1998; Ballesteros and Croft, 1998; Masuichi et al., 2000; Sadat et al., 2003)), but transliteration in the context of comparable corpora has not been well addressed.",
                    "sid": 23,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The general idea of exploiting frequency correlations to acquire word translations from comparable corpora has been explored in several previous studies (e.g., (Fung, 1995; Rapp, 1995; Tanaka and Iwasaki, 1996)).Recently, a method based on Pearson correlation was proposed to mine word pairs from comparable corpora (Tao and Zhai, 2005), an idea similar to the method used in (Kay and Roscheisen, 1993) for sentence alignment.",
                    "sid": 24,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our work, we adopt the method proposed in (Tao and Zhai, 2005) and apply it to the problem of transliteration.",
                    "sid": 25,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also study several variations of the similarity measures.",
                    "sid": 26,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mining transliterations from multilingual web pages was studied in (Zhang and Vines, 2004); 2.",
                    "sid": 27,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Score each candidate based on how likely the.",
                    "sid": 28,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "candidate is to be a transliteration of the English name.",
                    "sid": 29,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose two different scoring methods.",
                    "sid": 30,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first involves phonetic scoring, and the second uses the frequency profile of the candidate pair over time.",
                    "sid": 31,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will show that each of these approaches works quite well, but by combining the approaches one can achieve even better results.",
                    "sid": 32,
                    "ssid": 18,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "propagate scores of all the candidate translit-. ",
            "number": "3",
            "sents": [
                {
                    "text": "eration pairs globally based on their co- occurrences in document pairs in the comparable corpora.",
                    "sid": 33,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The intuition behind the third step is the following.",
                    "sid": 34,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suppose several high-confidence name transliteration pairs occur in a pair of English and Chinese documents.",
                    "sid": 35,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intuitively, this would increase our confidence in the other plausible transliteration pairs in the same document pair.",
                    "sid": 36,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thus propose a score propagation method to allow these high-confidence pairs to propagate some of their 2 Available from the LDC via the English Gigaword (LDC2003T05) and Chinese Gigaword (LDC2003T09) corpora.",
                    "sid": 37,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "scores to other co-occurring transliteration pairs.",
                    "sid": 38,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we will show later, such a propagation strategy can generally further improve the transliteration accuracy; in particular, it can further improve the already high performance from combining the two scoring methods.",
                    "sid": 39,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Candidate Selection.",
                    "sid": 40,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The English named entity candidate selection process was already described above.",
                    "sid": 41,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Candidate Chinese transliterations are generated by consulting a list of characters that are frequently used for transliterating foreign names.",
                    "sid": 42,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As discussed elsewhere (Sproat et al., 1996), a subset of a few hundred characters (out of several thousand) tends to be used overwhelmingly for transliterating foreign names into Chinese.",
                    "sid": 43,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use a list of 495 such characters, derived from various online dictionaries.",
                    "sid": 44,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A sequence of three or more characters from the list is taken as a possible name.",
                    "sid": 45,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the character “ ” occurs, which is frequently used to represent the space between parts of an English name, then at least one character to the left and right of this character will be collected, even if the character in question is not in the list of “foreign” characters.",
                    "sid": 46,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Armed with the English and Chinese candidate lists, we then consider the pairing of every English candidate with every Chinese candidate.",
                    "sid": 47,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obviously it would be impractical to do this for all of the candidates generated for, say, an entire year: we consider as plausible pairings those candidates that occur within a day of each other in the two corpora.",
                    "sid": 48,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Candidate scoring based on.",
                    "sid": 49,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "pronunciation We adopt a source-channel model for scoring EnglishChinese transliteration pairs.",
                    "sid": 50,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, we seek to estimate P (e|c), where e is a word in Roman script, and c is a word in Chinese script.",
                    "sid": 51,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since Chinese transliteration is mostly based on pronunciation, we estimate P (e′ |c′ ), where e′ is the pronunciation of e and c′ is the pronunciation of c. Again following standard practice, we decompose the estimate of P (e′ |c′) as P (e′ |c′ ) = n of the English phone string.",
                    "sid": 52,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For training data we have a small list of 721 names in Roman script and their Chinese equivalent.3 Pronunciations for English words are obtained using the Festival text-to- speech system (Taylor et al., 1998); for Chinese, we use the standard pinyin transliteration of the characters.",
                    "sid": 53,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "EnglishChinese pairs in our training dictionary were aligned using the alignment algorithm from (Kruskal, 1999), and a hand-derived set of 21 rules-of-thumb: for example, we have rules that encode the fact that Chinese /l/ can correspond to English /r/, /n/ or /er/; and that Chinese /w/ may be used to represent /v/.",
                    "sid": 54,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given that there are over 400 syllables in Mandarin (not counting tone) and each of these syllables can match a large number of potential English phone spans, this is clearly not enough training data to cover all the parameters, and so we use Good-Turing estimation to estimate probabilities for unseen correspondences.",
                    "sid": 55,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since we would like to filter implausible transliteration pairs we are less lenient than standard estimation techniques in that we are willing to assign zero probability to some correspondences.",
                    "sid": 56,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus we set a hard rule that for an English phone span to correspond to a Chinese syllable, the initial phone of the English span must have been seen in the training data as corresponding to the initial of the Chinese syllable some minimum number of times.",
                    "sid": 57,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For consonant-initial syllables we set the minimum to 4.",
                    "sid": 58,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We omit further details of our estimation technique for lack of space.",
                    "sid": 59,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This phonetic correspondence model can then be used to score putative transliteration pairs.",
                    "sid": 60,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Candidate Scoring based on Frequency.",
                    "sid": 61,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Correlation Names of the same entity that occur in different languages often have correlated frequency patterns due to common triggers such as a major event.",
                    "sid": 62,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus if we have comparable news articles over a sufficiently long time period, it is possible to exploit such correlations to learn the associations of names in different languages.",
                    "sid": 63,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idea of exploiting frequency correlation has been well studied.",
                    "sid": 64,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(See the previous work section.)",
                    "sid": 65,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopt the method proposed in (Tao and Zhai, 2005), which i P (e′ |c′ ).",
                    "sid": 66,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, e′ is the ith subsequence of i i i the English phone string, and ci is the ith subse3 quence of the Chinese phone string.",
                    "sid": 67,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since Chinese transliteration attempts to match the syllable- sized characters to equivalent sounding spans of the English language, we fix the c′ to be syllables, and let the e′ range over all possible subsequences The LDC provides a much larger list of transliterated ChineseEnglish names, but we did not use this here for two reasons.",
                    "sid": 68,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we have found it it be quite noisy.",
                    "sid": 69,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondly, we were interested in seeing how well one could do with a limited resource of just a few hundred names, which is a more realistic scenario for languages that have fewer resources than English and Chinese.works as follows: We pool all documents in a sin (e4, c4) w4 (e , c ) (e2, c2) gle day to form a large pseudo-document.",
                    "sid": 70,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, for each transliteration candidate (both Chinese and English), we compute its frequency in eachof those pseudo-documents and obtain a raw fre w3 (e3, c3) w5 5 5 w2 w1 w6 w7 (e7, c7)quency vector.",
                    "sid": 71,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We further normalize the raw fre (e5, c5) (e6, c6) quency vector so that it becomes a frequency distribution over all the time points (days).",
                    "sid": 72,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to compute the similarity between two distribution vectors, The Pearson correlation coefficient was used in (Tao and Zhai, 2005); here we also considered two other commonly used measures – cosine (Salton and McGill, 1983), and JensenShannon Figure 2: Graph representing transliteration pairs and cooccurence relations.",
                    "sid": 73,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "updating the scores of all the transliteration pairs.",
                    "sid": 74,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "n divergence (Lin, 1991), though our results show w(k) (k−1) (k−1) that Pearson correlation coefficient performs better than these two other methods.",
                    "sid": 75,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "i = α × wi + (1 − α) × (wj × P (j|i)), j!=i,j=1 where w(k) is the new score of the pair (ei , ci ) after an iteration, while w(k−1) is its old score 3.4 Score Propagation.",
                    "sid": 76,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "before updating; i [0 ] is a parameter to α ∈ , 1 In both scoring methods described above, scoring of each candidate transliteration pair is independent of the other.",
                    "sid": 77,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we have noted, document pairs that contain lots of plausible transliteration pairs should be viewed as more plausible document pairs; at the same time, in such a situation we control the overall amount of propagation (whenα = 1, no propagation occurs); P (j|i) is the con ditional probability of propagating a score from node (ej , cj , wj ) to node (ei, ci , wi ).",
                    "sid": 78,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We estimate P (j|i) in two different ways: 1)The number of cooccurrences in the whole collec C (i,j) should also trust the putative transliteration pairs tion (Denote as CO).",
                    "sid": 79,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P (j i) = j′ C (i,j′ ) , wheremore.",
                    "sid": 80,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus these document pairs and translitera tion pairs mutually “reinforce” each other, and this C (i, j) is the cooccurrence count of (ei , ci) and (ej , cj ); 2) A mutual information-based methodcan be exploited to further optimize our translit (Denote as MI).",
                    "sid": 81,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P (j|i) = M I (i,j ) L: M I (i,j′) eration scores by allowing transliteration pairs to propagate their scores to each other according to their co-occurrence strengths.",
                    "sid": 82,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Formally, suppose the current generation of transliteration scores are (ei, ci , wi ) i = 1, ..., n, where (ei , ci ) is a distinct pair of English and Chi nese names.",
                    "sid": 83,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that although for any i j= j, we have (ei , ci ) j= (ej , cj ), it is possible that ei = ej or ci = cj for some i j= j. wi is the transliteration score of (ei , ci ).",
                    "sid": 84,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These pairs along with their co-occurrence relation computed based on our comparable corpora can be formally represented by a graph as shown in Figure 2.",
                    "sid": 85,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In such a graph, a node represents (ei , ci, wi ).",
                    "sid": 86,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An edge between (ei , ci , wi) and (ej , cj , wj ) is constructed iff (ei , ci ) and (ej , cj ) co-occur in a certain document pair (Et, Ct), i.e. there exists a document pair (Et, Ct), such that ei , ej ∈ Et and ci , cj ∈ Ct. Given a node (ei , ci , wi), we refer to all its directly-connected nodes as its “neighbors”.",
                    "sid": 87,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The documents do not appear explicitly in the graph, but they implicitly affect the graph’s topology and the weight of each edge.",
                    "sid": 88,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our idea of score propagation can now be formulated as the following recursive equation for j ′ M I (i, j) is the mutual information of (ei, ci ) and (ej , cj ).",
                    "sid": 89,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we will show, the CO method works better.",
                    "sid": 90,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the transition probabilities between indirect neighbors are always 0.",
                    "sid": 91,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus propagation only happens between direct neighbors.",
                    "sid": 92,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This formulation is very similar to PageRank, a link-based ranking algorithm for Web retrieval (Brin and Page, 1998).",
                    "sid": 93,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, our motivation is propagating scores to exploit cooccurrences, so we do not necessarily want the equation to converge.",
                    "sid": 94,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, our results show that although the initial iterations always help improve accuracy, too many iterations actually would decrease the performance.",
                    "sid": 95,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 Evaluation We use a comparable EnglishChinese corpus to evaluate our methods for Chinese transliteration.",
                    "sid": 96,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We take one day’s worth of comparable news articles (234 Chinese stories and 322 English stories), generate about 600 English names with the entity recognizer (Li et al., 2004) as described above, and find potential Chinese transliterations also as previously described.",
                    "sid": 97,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We generated 627 Chinese can didates.",
                    "sid": 98,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In principle, all these 600 × 627 pairs are ∗paris iraq staub pei-lei-si 3.51 yi-la-ke 3.74 sita bo 4.45potential transliterations.",
                    "sid": 99,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then apply the pho netic and time correlation methods to score and canada belfast jiana-da 4.85 beier-fa-si-te 4.90 rank all the candidate ChineseEnglish correspondences.",
                    "sid": 100,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "fischer philippine fei-she-er 4.91 feilu¨ -bin 4.97 To evaluate the proposed transliteration methods quantitatively, we measure the accuracy of the ranked list by Mean Reciprocal Rank (MRR), a lesotho ∗tirana freeman laisuo-two 5.12 tyelu-na 5.15 fuli-man 5.26 measure commonly used in information retrieval when there is precisely one correct answer (Kan- tor and Voorhees, 2000).",
                    "sid": 101,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reciprocal rank is the reciprocal of the rank of the correct answer.",
                    "sid": 102,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if the correct answer is ranked as the first, the reciprocal rank would be 1.0, whereas if it is ranked the second, it would be 0.5, and so forth.",
                    "sid": 103,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To evaluate the results for a set of English names, we take the mean of the reciprocal rank of each English name.",
                    "sid": 104,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We attempted to create a complete set of answers for all the English names in our test set, but a small number of English names do not seem to have any standard transliteration according to the resources that we consulted.",
                    "sid": 105,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We ended up with a list of about 490 out of the 600 English names judged.",
                    "sid": 106,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We further notice that some answers (about 20%) are not in our Chinese candidate set.",
                    "sid": 107,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This could be due to two reasons: (1) The answer does not occur in the Chinese news articles we look at.",
                    "sid": 108,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) The answer is there, but our candidate generation method has missed it.",
                    "sid": 109,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to see more clearly how accurate each method is for ranking the candidates, we also compute the MRR for the subset of English names whose transliteration answers are in our candidate list.",
                    "sid": 110,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We distinguish the MRRs computed on these two sets of English names as “AllMRR” and “CoreMRR”.",
                    "sid": 111,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Below we first discuss the results of each of the two methods.",
                    "sid": 112,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then compare the two methods and discuss results from combining the two methods.",
                    "sid": 113,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show sample results for the phonetic scoring method in Table 1.",
                    "sid": 114,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This table shows the 10 highest scoring transliterations for each Chinese character sequence based on all texts in the Chinese and English Xinhua newswire for the 13th of August, 2001.",
                    "sid": 115,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 out of these 10 are correct.",
                    "sid": 116,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For all the English names the MRR is 0.3, and for the Table 1: Ten highest-scoring matches for the Xinhua corpus for 8/13/01.",
                    "sid": 117,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final column is the −log P estimate for the transliteration.",
                    "sid": 118,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Starred entries are incorrect.",
                    "sid": 119,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "core names it is 0.89.",
                    "sid": 120,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus on average, the correct answer, if it is included in our candidate list, is ranked mostly as the first one.",
                    "sid": 121,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Si mi lar ity Al lM R R Co re M R R P e a rs o n 0.",
                    "sid": 122,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 3 6 0 0 . 3 6 4 3 C o s i n e 0.",
                    "sid": 123,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 1 4 1 0 . 3 0 1 5 J S d i v 0.",
                    "sid": 124,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 7 8 5 0 . 2 0 1 6 Table 2: MRRs of the frequency correlation methods.",
                    "sid": 125,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We proposed three similarity measures for the frequency correlation method, i.e., the Cosine, Pearson coefficient, and JensenShannon divergence.",
                    "sid": 126,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Table 2, we show their MRRs.",
                    "sid": 127,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given that the only resource the method needs is comparable text documents over a sufficiently long period, these results are quite encouraging.",
                    "sid": 128,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, with Pearson correlation, when the Chinese transliteration of an English name is included in our candidate list, the correct answer is, on average, ranked at the 3rd place or better.",
                    "sid": 129,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results thus show that the idea of exploiting frequency correlation does work.",
                    "sid": 130,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also see that among the three similarity measures, Pearson correlation performs the best; it performs better than Cosine, which is better than JS-divergence.",
                    "sid": 131,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared with the phonetic correspondence method, the performance of the frequency correlation method is in general much worse, which is not surprising, given the fact that terms may be correlated merely because they are topically related.",
                    "sid": 132,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and frequency correlation M e t h o d Al lM R R Co re M R R P h o n e t i c 0.",
                    "sid": 133,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 9 9 9 0 . 8 8 9 5 F r e q 0.",
                    "sid": 134,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 3 6 0 0 . 3 6 4 3 Fr eq + Ph on eti cF ilt er 0.",
                    "sid": 135,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 0 6 2 0 . 9 0 8 3 Fr eq +P ho ne tic Sc or e 0.",
                    "sid": 136,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 1 9 4 0 . 9 4 7 4 Table 3: Effectiveness of combining the two scoring methods.",
                    "sid": 137,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the two methods exploit complementary resources, it is natural to see if we can improve performance by combining the two methods.",
                    "sid": 138,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, intuitively the best candidate is the one that has a good pronunciation alignment as well as a correlated frequency distribution with the English name.",
                    "sid": 139,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluated two strategies for combining the two methods.",
                    "sid": 140,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first strategy is to use the phonetic model to filter out (clearly impossible) candidates and then use the frequency correlation method to rank the candidates.",
                    "sid": 141,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second is to combine the scores of these two methods.",
                    "sid": 142,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the correlation coefficient has a maximum value of 1, we normalize the phonetic correspondence score by dividing all scores by the maximum score so that the maximum normalized value is also 1.",
                    "sid": 143,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then take the average of the two scores and rank the candidates based on their average scores.",
                    "sid": 144,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the second strategy implies the application of the first strategy.",
                    "sid": 145,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of these two combination strategies are shown in Table 3 along with the results of the two individual methods.",
                    "sid": 146,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see that both combination strategies are effective and the MRRs of the combined results are all better than those of the two individual methods.",
                    "sid": 147,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is interesting to see that the benefit of applying the phonetic correspondence model as a filter is quite significant.",
                    "sid": 148,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, although the performance of the frequency correlation method alone is much worse than that of the phonetic correspondence method, when working on the subset of candidates passing the phonetic filter (i.e., those candidates that have a reasonable phonetic alignment with the English name), it can outperform the phonetic correspondence method.",
                    "sid": 149,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This once again indicates that exploiting the frequency correlation can be effective.",
                    "sid": 150,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When combining the scores of these two methods, we not only (implicitly) apply the phonetic filter, but also exploit the discriminative power provided by the phonetic correspondence scores and this is shown to bring in additional benefit, giving the best performance among all the methods.",
                    "sid": 151,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the results above, we see that the MRRs for the core English names are substantially higher than those for all the English names.",
                    "sid": 152,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that our methods perform very well whenever we have the answer in our candidate list, but we have also missed the answers for many English names.",
                    "sid": 153,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The missing of an answer in the candidate list is thus a major source of errors.",
                    "sid": 154,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To further understand the upper bound of our method, we manually add the missing correct answers to our candidate set and apply all the methods to rank this augmented set of candidates.",
                    "sid": 155,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance is reported in Table 4 with the corresponding performance on the original candidate set.",
                    "sid": 156,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see that, Table 4: MRRs on the augmented candidate list.",
                    "sid": 157,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "as expected, the performance on the augmented candidate list, which can be interpreted as an upper bound of our method, is indeed much better, suggesting that if we can somehow improve the candidate generation method to include the answers in the list, we can expect to significantly improve the performance for all the methods.",
                    "sid": 158,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is clearly an interesting topic for further research.",
                    "sid": 159,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relative performance of different methods on this augmented candidate list is roughly the same as on the original candidate list, except that the “Freq+PhoneticFilter” is slightly worse than that of the phonetic method alone, though it is still much better than the performance of the frequency correlation alone.",
                    "sid": 160,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possible explanation may be that since these names do not necessarily occur in our comparable corpora, we may not have sufficient frequency observations for some of the names.",
                    "sid": 161,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "M e t h o d A l l M R R Co re M R R i n it . C O M I i n it . C O M I Fr eq +P ho ne tic Fil ter 0.",
                    "sid": 162,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "31 71 0.",
                    "sid": 163,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "32 55 0.",
                    "sid": 164,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "32 55 0.",
                    "sid": 165,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "90 58 0.",
                    "sid": 166,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "93 72 0.",
                    "sid": 167,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "93 72 Fr eq +P ho ne tic Sc or e 0.",
                    "sid": 168,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "32 90 0.",
                    "sid": 169,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "33 73 0.",
                    "sid": 170,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "33 92 0.",
                    "sid": 171,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "94 22 0.",
                    "sid": 172,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "96 59 0.",
                    "sid": 173,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "95 73 Table 5: Effectiveness of score propagation.",
                    "sid": 174,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To demonstrate that score propagation can further help transliteration, we use the combination scores in Table 3 as the initial scores, and apply our propagation algorithm to iteratively update them.",
                    "sid": 175,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We remove the entries when they do not co-occur with others.",
                    "sid": 176,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are 25 such English name candidates.",
                    "sid": 177,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the initial scores are actually slightly different from the values in Table 3.",
                    "sid": 178,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show the new scores and the best propagation scores in Table 5.",
                    "sid": 179,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the table, “init.” refers to the initial scores.",
                    "sid": 180,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and “CO” and “MI” stand for best scores obtained using either the co-occurrence or mutual information method.",
                    "sid": 181,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While both methods result in gains, CO very slightly outperforms the MI approach.",
                    "sid": 182,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the score propagation process, we introduce two additional parameters: the interpola 0.98 0.96 0.94 0.92 0.9 0.88 0.86 0.84 0.82 0.8 0.78 0.76 alpha=0.9, MI alpha=0.9, CO alpha=0.95, MI alpha=0.95, CO 0 2 4 6 8 10 12 14 16 18 20 number of iterations Figure 3: Propagation: Core items tion parameter α and the number of iterations k. Figure 3 and Figure 4 show the effects of these parameters.",
                    "sid": 183,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intuitively, we want to preserve the initial score of a pair, but add a slight boost from its neighbors.",
                    "sid": 184,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we set α very close to 1 (0.9 and 0.95), and allow the system to perform 20 iterations.",
                    "sid": 185,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In both figures, the first few iterations certainly leverage the transliteration, demonstrating that the propagation method works.",
                    "sid": 186,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we observe that the performance drops when more iterations are used, presumably due to noise introduced from more distantly connected nodes.",
                    "sid": 187,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, a relatively conservative approach is to choose a high α value, and run only a few iterations.",
                    "sid": 188,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note, finally, that the CO method seems to be more stable than the MI method.",
                    "sid": 189,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Conclusions and Future Work.",
                    "sid": 190,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we have discussed the problem of ChineseEnglish name transliteration as one component of a system to find matching names in comparable corpora.",
                    "sid": 191,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have proposed two methods for transliteration, one that is more traditional and based on phonetic correspondences, and one that is based on word distributions and adopts methods from information retrieval.",
                    "sid": 192,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have shown that both methods yield good results, and that even better results can be achieved by combining the methods.",
                    "sid": 193,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have further showed that one can improve upon the combined model by using reinforcement via score propagation when transliteration pairs cluster together in document pairs.",
                    "sid": 194,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The work we report is ongoing.",
                    "sid": 195,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are investigating transliterations among several language pairs, and are extending these methods to Korean, Arabic, Russian and Hindi — see (Tao et al., 200 6).",
                    "sid": 196,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6",
                    "sid": 197,
                    "ssid": 165,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}