{
    "ID": "P06-2124",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "BiTAM: Bilingual Topic AdMixture Models forWord Alignment",
                    "sid": 0,
                    "ssid": null,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose a novel bilingual topical admixture (BiTAM) formalism for word alignment in statistical machine translation.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Under this formalism, the parallel sentence-pairs within a document-pair are assumed to constitute a mixture of hidden topics; each word-pair follows a topic-specific bilingual translation model.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Three BiTAM models are proposed to capture topic sharing at different levels of linguistic granularity (i.e., at the sentence or word levels).",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These models enable word- alignment process to leverage topical contents of document-pairs.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Efficient variational approximation algorithms are designed for inference and parameter estimation.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the inferred latent topics, BiTAM models facilitate coherent pairing of bilingual linguistic entities that share common topical aspects.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our preliminary experiments show that the proposed models improve word alignment accuracy, and lead to better translation quality.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Parallel data has been treated as sets of unrelated sentence-pairs in state-of-the-art statistical machine translation (SMT) models.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most current approaches emphasize within-sentence dependencies such as the distortion in (Brown et al., 1993), the dependency of alignment in HMM (Vogel et al., 1996), and syntax mappings in (Yamada and Knight, 2001).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Beyond the sentence-level, corpus- level word-correlation and contextual-level topical information may help to disambiguate translation candidates and word-alignment choices.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the most frequent source words (e.g., functional words) are likely to be translated into words which are also frequent on the target side; words of the same topic generally bear correlations and similar translations.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extended contextual information is especially useful when translation models are vague due to their reliance solely on word-pair co- occurrence statistics.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the word shot in “It was a nice shot.” should be translated differently depending on the context of the sentence: a goal in the context of sports, or a photo within the context of sightseeing.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nida (1964) stated that sentence-pairs are tied by the logic-flow in a document-pair; in other words, the document-pair should be word-aligned as one entity instead of being uncorrelated instances.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we propose a probabilistic admixture model to capture latent topics underlying the context of document- pairs.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With such topical information, the translation models are expected to be sharper and the word-alignment process less ambiguous.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous works on topical translation models concern mainly explicit logical representations of semantics for machine translation.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This include knowledge-based (Nyberg and Mitamura, 1992) and interlingua-based (Dorr and Habash, 2002) approaches.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These approaches can be expensive, and they do not emphasize stochastic translation aspects.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recent investigations along this line includes using word-disambiguation schemes (Carpua and Wu, 2005) and non-overlapping bilingual word-clusters (Wang et al., 1996; Och, 1999; Zhao et al., 2005) with particular translation models, which showed various degrees of success.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose a new statistical formalism: Bilingual Topic AdMixture model, or BiTAM, to facilitate topic-based word alignment in SMT.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Variants of admixture models have appeared in population genetics (Pritchard et al., 2000) and text modeling (Blei et al., 2003).",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Statistically, an object is said to be derived from an admixture if it consists of a bag of elements, each sampled independently or coupled in some way, from a mixture model.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a typical SMT setting, each document- pair corresponds to an object; depending on a chosen modeling granularity, all sentence-pairs or word-pairs in the document-pair correspond to the elements constituting the object.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Correspondingly, a latent topic is sampled for each pair from a prior topic distribution to induce topic-specific translations; and the resulting sentence-pairs and word- pairs are marginally dependent.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generatively, this admixture formalism enables word translations to be instantiated by topic-specific bilingual models 969 Proceedings of the COLING/ACL 2006 Main Conference Poster Sessions, pages 969–976, Sydney, July 2006.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2006 Association for Computational Linguistics and/or monolingual models, depending on their contexts.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we investigate three instances of the BiTAM model, They are data-driven and do not need handcrafted knowledge engineering.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remainder of the paper is as follows: in section 2, we introduce notations and baselines; in section 3, we propose the topic admixture models; in section 4, we present the learning and inference algorithms; and in section 5 we show experiments of our models.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We conclude with a brief discussion in section 6.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "notations and baseline. ",
            "number": "2",
            "sents": [
                {
                    "text": "In statistical machine translation, one typically uses parallel data to identify entities such as “word-pair”, “sentence-pair”, and “document- pair”.",
                    "sid": 31,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Formally, we define the following terms1: • A word-pair (fj , ei) is the basic unit for word alignment, where fj is a French word and ei is an English word; j and i are the position indices in the corresponding French sentence f and English sentence e. • A sentence-pair (f , e) contains the source sentence f of a sentence length of J ; a target sentence e of length I . The two sentences f and e are translations of each other.• A document-pair (F, E) refers to two doc uments which are translations of each other.",
                    "sid": 32,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Assuming sentences are one-to-one correspondent, a document-pair has a sequence of N parallel sentence-pairs {(fn, en)}, where (fn, en) is the ntth parallel sentence-pair.",
                    "sid": 33,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• A parallel corpus C is a collection of M parallel document-pairs: {(Fd, Ed)}.",
                    "sid": 34,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Baseline: IBM Model-1.",
                    "sid": 35,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation process can be viewed as operations of word substitutions, permutations, and insertions/deletions (Brown et al., 1993) in noisy- channel modeling scheme at parallel sentence-pair level.",
                    "sid": 36,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation lexicon p(f |e) is the key component in this generative process.",
                    "sid": 37,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An efficient way to learn p(f |e) is IBM1: IBM1 has global optimum; it is efficient and easily scalable to large training data; it is one of the most informative components for re-ranking translations (Och et al., 2004).",
                    "sid": 38,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We start from IBM1 as our baseline model, while higher-order alignment models can be embedded similarly within the proposed framework.",
                    "sid": 39,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "bilingual topic admixture model. ",
            "number": "3",
            "sents": [
                {
                    "text": "Now we describe the BiTAM formalism that captures the latent topical structure and generalizes word alignments and translations beyond sentence-level via topic sharing across sentence- pairs: E∗ = arg max p(F|E)p(E), (2) {E} where p(F|E) is a document-level translation model, generating the document F as one entity.",
                    "sid": 40,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a BiTAM model, a document-pair (F, E) is treated as an admixture of topics, which is induced by random draws of a topic, from a pool of topics, for each sentence-pair.",
                    "sid": 41,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A unique normalized and real-valued vector θ, referred to as a topic-weight vector, which captures contributions of different topics, are instantiated for each document-pair, so that the sentence-pairs with their alignments are generated from topics mixed according to these common proportions.",
                    "sid": 42,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Marginally, a sentence- pair is word-aligned according to a unique bilingual model governed by the hidden topical assignments.",
                    "sid": 43,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the sentence-level translations are coupled, rather than being independent as assumed in the IBM models and their extensions.",
                    "sid": 44,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of this coupling of sentence-pairs (via topic sharing across sentence-pairs according to a common topic-weight vector), BiTAM is likely to improve the coherency of translations by treating the document as a whole entity, instead of uncorrelated segments that have to be independently aligned and then assembled.",
                    "sid": 45,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are at least two levels at which the hidden topics can be sampled for a document-pair, namely: the sentence- pair and the word-pair levels.",
                    "sid": 46,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose three variants of the BiTAM model to capture the latent topics of bilingual documents at different levels.",
                    "sid": 47,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "J I 3.1 BiTAM1: The Frameworks p(f |e) = n ) p(fj |ei ) · p(ei |e).",
                    "sid": 48,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) j=1 i=1 1 We follow the notations in (Brown et al., 1993) for.",
                    "sid": 49,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "English-French, i.e., e ↔ f , although our models are tested,in this paper, for EnglishChinese.",
                    "sid": 50,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the end-user ter minology for source and target languages.",
                    "sid": 51,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first BiTAM model, we assume that topics are sampled at the sentence-level.",
                    "sid": 52,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each document- pair is represented as a random mixture of latent topics.",
                    "sid": 53,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each topic, topic-k, is presented by a topic-specific word-translation table: Bk , which is e I e I β e I a α θ z f J B N M α θ z a a f J B α θ z N M f J B N M (a) (b) (c) Figure 1: BiTAM models for Bilingual document- and sentence-pairs.",
                    "sid": 54,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A node in the graph represents a random variable, and a hexagon denotes a parameter.",
                    "sid": 55,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Un-shaded nodes are hidden variables.",
                    "sid": 56,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the plates represent replicates.",
                    "sid": 57,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The outmost plate (M -plate) represents M bilingual document-pairs, while the inner N -plate represents the N repeated choice of topics for each sentence-pairs in the document; the inner J -plate represents J word-pairs within each sentence-pair.",
                    "sid": 58,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(a) BiTAM1 samples one topic (denoted by z) per sentence-pair; (b) BiTAM2 utilizes the sentence-level topics for both the translation model (i.e., p(f |e, z)) and the monolingual word distribution (i.e., p(e|z)); (c) BiTAM3 samples one topic per word-pair.",
                    "sid": 59,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a translation lexicon: Bi,j,k =p(f =fj |e=ei, z=k), where z is an indicator variable to denote the choice of a topic.",
                    "sid": 60,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a specific topic-weight vector θd for a document-pair, each sentence-pair draws its conditionally independent topics from a mixture of topics.",
                    "sid": 61,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This generative process, for a document-pair (Fd, Ed), is summarized as below: 1.",
                    "sid": 62,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sample sentence-number N from a Poisson(γ)..",
                    "sid": 63,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 64,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sample topic-weight vector θd from a Dirichlet(α)..",
                    "sid": 65,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 66,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each sentence-pair (fn , en ) in the dtth doc-pair ,.",
                    "sid": 67,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(a) Sample sentence-length Jn from Poisson(δ); (b) Sample a topic zdn from a Multinomial(θd ); (c) Sample ej from a monolingual model p(ej );(d) Sample each word alignment link aj from a uni form model p(aj ) (or an HMM); (e) Sample each fj according to a topic-specific graphical model representation for the BiTAM generative scheme discussed so far.",
                    "sid": 68,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that, the sentence-pairs are now connected by the node θd. Therefore, marginally, the sentence-pairs are not independent of each other as in traditional SMT models, instead they are conditionally independent given the topic-weight vector θd. Specifically, BiTAM1 assumes that each sentence-pair has one single topic.",
                    "sid": 69,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the word-pairs within this sentence-pair are conditionally independent of each other given the hidden topic index z of the sentence-pair.",
                    "sid": 70,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last two sub-steps (3.d and 3.e) in the BiTam sampling scheme define a translation model, in which an alignment link aj is proposed translation lexicon p(fj |e, aj , zn , B).",
                    "sid": 71,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and an observation of fj is generated accordingWe assume that, in our model, there are K pos sible topics that a document-pair can bear.",
                    "sid": 72,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each document-pair, a K -dimensional Dirichlet random variable θd, referred to as the topic-weight vector of the document, can take values in the (K −1)-simplex following a probability density: to the proposed distributions.",
                    "sid": 73,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We simplify alignment model of a, as in IBM1, by assuming that aj is sampled uniformly at random.",
                    "sid": 74,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the parameters α, B, and the English part E, the joint conditional distribution of the topic-weight vector θ, the topic indicators z, the alignment vectors A, and the document F can be written as: Γ( K αk ) p(θ|α) = k=1 θα1 −1 · · · θαK −1 , (3) p(F,A, θ, z|E, α, B) = k=1 Γ(αk ) N (4) where the hyperparameter α is a K -dimension vector with each component αk >0, and Γ(x) is the Gamma function.",
                    "sid": 75,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The alignment is represented by a J -dimension vector a = {a1, a2, · · · , aJ }; for each French word fj at the position j, an position variable aj maps it to anEnglish word eaj at the position aj in English sen p(θ | α) n p(zn |θ)p(fn , an |en , α, Bzn), n=1 where N is the number of the sentence-pair.",
                    "sid": 76,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Marginalizing out θ and z, we can obtain the marginal conditional probability of generating F from E for each document-pair: p(F, A|E, α, Bzn ) = tence.",
                    "sid": 77,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word level translation lexicon probabil- r ( (5) ities are topic-specific, and they are parameterized by the matrix B = {Bk }.",
                    "sid": 78,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "p(θ|α) n) p(zn |θ)p(fn , an |en , Bzn ) dθ, n=1 zn For simplicity, in our current models we omit the modelings of the sentence-number N and the sentence-length Jn, and focus only on the bilingual translation model.",
                    "sid": 79,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 (a) shows the where p(fn, an|en, Bzn ) is a topic-specific sentence-level translation model.",
                    "sid": 80,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For simplicity, we assume that the French words fj ’s are conditionally independent of each other; the alignment variables aj ’s are independent of other variables and are uniformly distributed a priori.",
                    "sid": 81,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the distribution for each sentence-pair is: p(fn , an |en , Bzn) = p(fn |en , an , Bzn)p(an |en , Bzn) Jn “Null” is attached to every target sentence to align the source words which miss their translations.",
                    "sid": 82,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, the latent Dirichlet allocation (LDA) in (Blei et al., 2003) can be viewed as a special case of the BiTAM3, in which the target sentence 1 n p(f n n j=1 |eanj , Bzn ).",
                    "sid": 83,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(6) contains only one word: “Null”, and the alignment link a is no longer a hidden variable.",
                    "sid": 84,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the conditional likelihood for the entire parallel corpus is given by taking the product of the marginal probabilities of each individual document-pair in Eqn.",
                    "sid": 85,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.",
                    "sid": 86,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 BiTAM2: Monolingual Admixture.",
                    "sid": 87,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, the monolingual model for English can also be a rich topic-mixture.",
                    "sid": 88,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is realized by using the same topic-weight vector θd and the same topic indicator zdn sampled according to θd, as described in §3.1, to introduce not onlytopic-dependent translation lexicon, but also topic dependent monolingual model of the source language, English in this case, for generating each sentence-pair (Figure 1 (b)).",
                    "sid": 89,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now e is generated",
                    "sid": 90,
                    "ssid": 51,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "learning and inference. ",
            "number": "4",
            "sents": [
                {
                    "text": "Due to the hybrid nature of the BiTAM models, exact posterior inference of the hidden variables A, z and θ is intractable.",
                    "sid": 91,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A variational inference is used to approximate the true posteriors of these hidden variables.",
                    "sid": 92,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The inference scheme is presented for BiTAM1; the algorithms for BiTAM2 and BiTAM3 are straight forward extensions and are omitted.",
                    "sid": 93,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Variational Approximation.",
                    "sid": 94,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To approximate: p(θ, z, A|E, F, α, B), the joint posterior, we use the fully factorized distribution over the same set of hidden variables: q(θ,z, A) ∝ q(θ|γ, α)· from a topic-based language model β, instead of a N Jn (7) uniform distribution in BiTAM1.",
                    "sid": 95,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We refer to this n q(zn |φn ) n q(anj , fnj |ϕnj , en , B), model as BiTAM2.",
                    "sid": 96,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "n=1 j=1 Unlike BiTAM1, where the information observed in ei is indirectly passed to z via the node of fj and the hidden variable aj , in BiTAM2, the topics of corresponding English and French sentences are also strictly aligned so that the information observed in ei can be directly passed to z, in the hope of finding more accurate topics.",
                    "sid": 97,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The topics are inferred more directly from the observed bilingual data, and as a result, improve alignment.",
                    "sid": 98,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 BiTAM3: Word-level Admixture.",
                    "sid": 99,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "where the Dirichlet parameter γ, the multinomial parameters (φ1, · · · , φn), and the parameters (ϕn1, · · · , ϕnJn ) are known as variational param eters, and can be optimized with respect to the KullbackLeibler divergence from q(·) to the original p(·) via an iterative fixed-point algorithm.",
                    "sid": 100,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be shown that the fixed-point equations for the variational parameters in BiTAM1 are as follows: Nd γk = αk + ) φdnk (8) n=1 K It is straightforward to extend the sentence-level BiTAM1 to a word-level admixture model, by φdnk ∝ exp (Ψ(γk ) − Ψ( Jdn Idn ) kt =1 γkt ) · sampling topic indicator zn,j for each word-pair (fj , eaj ) in the ntth sentence-pair, rather than once for all (words) in the sentence (Figure 1 (c)).",
                    "sid": 101,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "exp ( ) ) ϕdnji log Bf ,e ,k (9) j i j=1 i=1 K ( This gives rise to our BiTAM3.",
                    "sid": 102,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The conditional ϕdnji ∝ exp ) φdnk log Bf ,e ,k , (10) k=1 likelihood functions can be obtained by extending where Ψ(·) is a digamma function.",
                    "sid": 103,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that inthe formulas in §3.1 to move the variable zn,j in side the same loop over each of the fn,j . the above formulas φ dnkis the variational param 3.4 Incorporation of Word “Null”.",
                    "sid": 104,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar to IBM models, “Null” word is used for the source words which have no translation counterparts in the target language.",
                    "sid": 105,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Chinese words “de” (ffl) , “ba” (I\\) and “bei” (%i) generally do not have translations in English.",
                    "sid": 106,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "eter underlying the topic indicator zdn of the nth sentence-pair in document d, and it can be used to predict the topic distribution of that sentence-pair.",
                    "sid": 107,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following a variational EM scheme (Beal and Ghahramani, 2002), we estimate the model parameters α and B in an unsupervised fashion.",
                    "sid": 108,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Essentially, Eqs.",
                    "sid": 109,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(810) above constitute the E-step, where the posterior estimations of the latent variables are obtained.",
                    "sid": 110,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the M-step, we update α and B so that they improve a lower bound of the log-likelihood defined bellow: L(γ, φ, ϕ; α, B) = Eq [log p(θ|α)]+Eq [log p(z|θ)] +Eq [log p(a)]+Eq [log p(f |z, a, B)]−Eq [log q(θ)] −Eq [log q(z)]−Eq [log q(a)].",
                    "sid": 111,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(11) The close-form iterative updating formula B is: BDA selects iteratively, for each f , the best aligned e, such that the word-pair (f, e) is the maximum of both row and column, or its neighbors have more aligned pairs than the other combpeting candidates.A close check of {ϕdnji} in Eqn.",
                    "sid": 112,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10 re veals that it is essentially an exponential model: weighted log probabilities from individual topic- specific translation lexicons; or it can be viewed as weighted geometric mean of the individual lex M Nd Jdn Idn Bf,e,k ∝ ) ) ) ) δ(f, fj )δ(e, ei )φdnk ϕdnji (12) d n=1 j=1 i=1 For α, close-form update is not available, and we resort to gradient accent as in (Sjo¨ lander et al., 1996) with restarts to ensure each updated αk >0.",
                    "sid": 113,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Data Sparseness and Smoothing.",
                    "sid": 114,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation lexicons Bf,e,k have a potential size of V 2K , assuming the vocabulary sizes for both languages are V . The data sparsity (i.e., lack of large volume of document-pairs) poses a more serious problem in estimating Bf,e,k than the monolingual case, for instance, in (Blei et al., 2003).",
                    "sid": 115,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To reduce the data sparsity problem, we introduce two remedies in our models.",
                    "sid": 116,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First: Laplace smoothing.",
                    "sid": 117,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this approach, the matrix set B, whose columns correspond to parameters of conditional multinomial distributions, is treated as a collection of random vectors all under a symmetric Dirichlet prior; the posterior expectation of these multinomial parameter vectors can be estimated using Bayesian theory.",
                    "sid": 118,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second: interpolation smoothing.",
                    "sid": 119,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Empirically, we can employ a linear interpolation with IBM1 to avoid overfitting: Bf,e,k = λBf,e,k +(1−λ)p(f |e).",
                    "sid": 120,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(13) As in Eqn.",
                    "sid": 121,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1, p(f |e) is learned via IBM1; λ is estimated via EM on held out data.",
                    "sid": 122,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Retrieving Word Alignments.",
                    "sid": 123,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two word-alignment retrieval schemes are designed for BiTAMs: the uni-direction alignment (UDA) and the bi-direction alignment (BDA).",
                    "sid": 124,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both use the posterior mean of the alignment indicators adnji, captured by what we call the poste rior alignment matrix ϕ ≡ {ϕdnji}.",
                    "sid": 125,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "UDA uses a French word fdnj (at the jtth position of ntth sentence in the dtth document) to query ϕ to get the best aligned English word (by taking the maximum point in a row of ϕ): adnj = arg max ϕdnji .",
                    "sid": 126,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(14) i∈[1,Idn ] icon’s strength.",
                    "sid": 127,
                    "ssid": 37,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "5",
            "sents": [
                {
                    "text": "We evaluate BiTAM models on the word alignment accuracy and the translation quality.",
                    "sid": 128,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For word alignment accuracy, F-measure is reported, i.e., the harmonic mean of precision and recall against a gold-standard reference set; for translation quality, Bleu (Papineni et al., 2002) and its variation of NIST scores are reported.",
                    "sid": 129,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1: Training and Test Data Statistics Tra in #D oc.",
                    "sid": 130,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "#S ent . #T ok en s En gli sh Ch ine se Tr ee b a n k F B IS . B J Si n or a m a Xi nH ua 31 6 6,1 11 2,3 73 19, 14 0 41 72 10 5K 10 3K 11 5K 13 3K 4.1 8M 3.8 1M 3.8 5M 10 5K 3.5 4M 3.6 0M 3.9 3M Tes t 95 62 7 25, 50 0 19, 72 6 We have two training data settings with different sizes (see Table 1).",
                    "sid": 131,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The small one consists of 316 document-pairs from Tree- bank (LDC2002E17).",
                    "sid": 132,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the large training data setting, we collected additional document- pairs from FBIS (LDC2003E14, Beijing part), Sinorama (LDC2002E58), and Xinhua News (LDC2002E18, document boundaries are kept in our sentence-aligner (Zhao and Vogel, 2002)).",
                    "sid": 133,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are 27,940 document-pairs, containing 327K sentence-pairs or 12 million (12M) English tokens and 11M Chinese tokens.",
                    "sid": 134,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To evaluate word alignment, we hand-labeled 627 sentence-pairs from 95 document-pairs sampled from TIDES’01 dryrun data.",
                    "sid": 135,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It contains 14,769 alignment-links.",
                    "sid": 136,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To evaluate translation quality, TIDES’02 Eval.",
                    "sid": 137,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "test is used as development set, and TIDES’03 Eval.",
                    "sid": 138,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "test is used as the unseen test data.",
                    "sid": 139,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Model Settings.",
                    "sid": 140,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we explore the effects of Null word and smoothing strategies.",
                    "sid": 141,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Empirically, we find that adding “Null” word is always beneficial to all models regardless of number of topics selected.",
                    "sid": 142,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To pics Le xic ons To pic1 To pic2 To pic3 Co oc.",
                    "sid": 143,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "IBM 1 H M M IBM 4 p( Ch ao Xi an (Ji!",
                    "sid": 144,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "$) |K ore an) 0.",
                    "sid": 145,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "06 12 0.",
                    "sid": 146,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "21 38 0.",
                    "sid": 147,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "22 54 3 8 0.2 19 8 0.2 15 7 0.2 10 4 p( Ha nG uo (li!",
                    "sid": 148,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "� )|K ore an) 0.",
                    "sid": 149,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "83 79 0.",
                    "sid": 150,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "61 16 0.",
                    "sid": 151,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "02 43 4 6 0.5 61 9 0.4 72 3 0.4 99 3 Table 2: Topic-specific translation lexicons are learned by a 3-topic BiTAM1.",
                    "sid": 152,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third lexicon (Topic-3) prefers to translate the word Korean into ChaoXian (Ji!$:North Korean).",
                    "sid": 153,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The co-occurrence (Cooc), IBM1&4 and HMM only prefer to translate into HanGuo (li!�:South Korean).",
                    "sid": 154,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two candidate translations may both fade out in the learned translation lexicons.",
                    "sid": 155,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Uni gram rank 1 2 3 4 5 6 7 8 9 1 0 Topi c A. fo rei gn c h i n a u . s . dev elop men t trad e ente rpri ses tech nolo gy cou ntri es y e a r eco nom ic Topi c B. cho ngqi ng com pani es take over s co m pa ny cit y bi lli o n m o r e eco nom ic re a c h e d y u a n Topi c C. sp or ts dis abl ed te a m p e o p l e caus e w at e r na tio na l ga m es han dica ppe d me mb ers Table 3: Three most distinctive topics are displayed.",
                    "sid": 156,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The English words for each topic are ranked according to p(e|z) estimated from the topic-specific English sentences weighted by {φdnk }.",
                    "sid": 157,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "33 functional words were removed to highlight the main content of each topic.",
                    "sid": 158,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Topic A is about Us-China economic relationships; Topic B relates to Chinese companies’ merging; Topic C shows the sports of handicapped people.The interpolation smoothing in §4.2 is effec tive, and it gives slightly better performance than Laplace smoothing over different number of topics for BiTAM1.",
                    "sid": 159,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the interpolation leverages the competing baseline lexicon, and this can blur the evaluations of BiTAM’s contributions.",
                    "sid": 160,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Laplace smoothing is chosen to emphasize more on BiTAM’s strength.",
                    "sid": 161,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Without any smoothing, F- measure drops very quickly over two topics.",
                    "sid": 162,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all our following experiments, we use both Null word and Laplace smoothing for the BiTAM models.",
                    "sid": 163,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We train, for comparison, IBM1&4 and HMM models with 8 iterations of IBM1, 7 for HMM and 3 for IBM4 (18h743) with Null word and a maximum fertility of 3 for ChineseEnglish.",
                    "sid": 164,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Choosing the number of topics is a model selection problem.",
                    "sid": 165,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We performed a tenfold cross- validation, and a setting of three-topic is chosen for both the small and the large training data sets.",
                    "sid": 166,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall computation complexity of the BiTAM is linear to the number of hidden topics.",
                    "sid": 167,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Variational Inference.",
                    "sid": 168,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Under a non-symmetric Dirichlet prior, hyperparameter α is initialized randomly; B (K translation lexicons) are initialized uniformly as did in IBM1.",
                    "sid": 169,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Better initialization of B can help to avoid local optimal as shown in § 5.5.",
                    "sid": 170,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the learned B and α fixed, the variational parameters to be computed in Eqn.",
                    "sid": 171,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(810) are initialized randomly; the fixed-point iterative updates stop when the change of the likelihood is smaller than 10−5.",
                    "sid": 172,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The convergent variational parameters, corresponding to the highest likelihood from 20 random restarts, are used for retrieving the word alignment for unseen document-pairs.",
                    "sid": 173,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To estimate B, β (for BiTAM2) and α, at most eight variational EM iterations are run on the training data.",
                    "sid": 174,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows absolute 2∼3% better F-measure over iterations of variational EM using two and three topics of BiTAM1 comparing with IBM1.",
                    "sid": 175,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BiTam with Null and Laplace Smoothing Over Var.",
                    "sid": 176,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "EM Iterations 41 40 39 38 37 36 35 BiTam−1, Topic #=3 34 BiTam−1, Topic #=2.",
                    "sid": 177,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "IB M −1 33 32 3 3.5 4 4.5 5 5.5 6 6.5 7 7.5 8 Number of EM/Variational EM Iterations for IBM−1 and BiTam−1 Figure 2: performances over eight Variational EM iterations of BiTAM1 using both the “Null” word and the laplace smoothing; IBM1 is shown over eight EM iterations for comparison.",
                    "sid": 178,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.3 Topic-Specific Translation.",
                    "sid": 179,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexicons The topic-specific lexicons Bk are smaller in size than IBM1, and, typically, they contain topic trends.",
                    "sid": 180,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in our training data, North Korean is usually related to politics and translated into “ChaoXian” (Ji!",
                    "sid": 181,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "$); South Korean occurs more often with economics and is translated as “HanGuo”(li!",
                    "sid": 182,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "�).",
                    "sid": 183,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BiTAMs discriminate the two by considering the topics of the context.",
                    "sid": 184,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows the lexicon entries for “Korean” learned by a 3-topic BiTAM1.",
                    "sid": 185,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The values are relatively sharper, and each clearly favors one of the candidates.",
                    "sid": 186,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The co-occurrence count, however, only favors “HanGuo”, and this can easily dominate the decisions of IBM and HMM models due to their ignorance of the topical context.",
                    "sid": 187,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Monolingual topics learned by BiTAMs are, roughly speaking, fuzzy especially when the number of topics is small.",
                    "sid": 188,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With proper filtering, we find that BiTAMs do capture some topics as illustrated in Table 3.",
                    "sid": 189,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.4 Evaluating Word.",
                    "sid": 190,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alignments We evaluate word alignment accuracies in various settings.",
                    "sid": 191,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notably, BiTAM allows to test alignments in two directions: English-to Chinese (EC) and Chinese-to-English (CE).",
                    "sid": 192,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additional heuristics are applied to further improve the accuracies.",
                    "sid": 193,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inter takes the intersection of the two directions and generates high-precision alignments; the SE T TI N G IBM 1 H M M IBM 4 B I T A M 1 U D A BDA B I T A M 2 U D A BDA B I T A M 3 U D A BDA C E ( % ) E C ( % ) 36 .2 7 32 .9 4 43 .0 0 44 .2 6 45 .0 0 45 .9 6 40 .13 48.26 36 .52 46.61 40 .26 48.63 37 .35 46.30 40 .47 49.02 37 .54 46.62 R E FI N E D ( % ) U N I O N ( % ) IN TE R (% ) 41 .7 1 32 .1 8 39 .8 6 44 .4 0 42 .9 4 44 .8 7 48 .4 2 43 .7 5 48 .6 5 45 .06 49.02 35 .87 48.66 43 .65 43.85 47 .20 47.61 36 .07 48.99 44 .91 45.18 47 .46 48.18 36 .26 49.35 45 .13 45.48 N I S T B L E U 6.",
                    "sid": 194,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "45 8 15 .7 0 6.",
                    "sid": 195,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "82 2 17 .7 0 6.",
                    "sid": 196,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "92 6 18 .2 5 6.",
                    "sid": 197,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "93 7 6.954 17 .93 18.14 6.",
                    "sid": 198,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "90 4 6.976 18 .13 18.05 6.",
                    "sid": 199,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "96 7 6.962 18 .11 18.25 Table 4: Word Alignment Accuracy (F-measure) and Machine Translation Quality for BiTAM Models, comparing with IBM Models, and HMMs with a training scheme of 18 h7 43 on the Treebank data listed in Table 1.",
                    "sid": 200,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each column, the highlighted alignment (the best one under that model setting) is picked up to further evaluate the translation quality.",
                    "sid": 201,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Union of two directions gives high-recall; Refined grows the intersection with the neighboring word- pairs seen in the union, and yields high-precision and high-recall alignments.",
                    "sid": 202,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Table 4, the baseline IBM1 gives its best performance of 36.27% in the CE direc tion; the UDA alignments from BiTAM1∼3 give 40.13%, 40.26%, and 40.47%, respectively, which are significantly better than IBM1.",
                    "sid": 203,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A close look at the three BiTAMs does not yield significant difference.",
                    "sid": 204,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BiTAM3 is slightly better in most settings; BiTAM1 is slightly worse than the other two, because the topics sampled at the sentence level are not very concentrated.",
                    "sid": 205,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The BDA align ments of BiTAM1∼3 yield 48.26%, 48.63% and 49.02%, which are even better than HMM and IBM4 — their best performances are at 44.26% and 45.96%, respectively.",
                    "sid": 206,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because BDA partially utilizes similar heuristics on the approximated posterior matrix {ϕdnji} instead of di rect operations on alignments of two directions in the heuristics of Refined.",
                    "sid": 207,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Practically, we also apply BDA together with heuristics for IBM1, HMM and IBM4, and the best achieved performances are at 40.56%, 46.52% and 49.18%, respectively.",
                    "sid": 208,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall, BiTAM models achieve performances close to or higher than HMM, using only a very simple IBM1 style alignment model.",
                    "sid": 209,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar improvements over IBM models and HMM are preserved after applying the three kinds of heuristics in the above.",
                    "sid": 210,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As expected, since BDA already encodes some heuristics, it is only slightly improved with the Union heuristic; UDA, similar to the viterbi style alignment in IBM and HMM, is improved better by the Refined heuristic.",
                    "sid": 211,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also test BiTAM3 on large training data, and similar improvements are observed over those of the baseline models (see Table.",
                    "sid": 212,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5).",
                    "sid": 213,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.5 Boosting BiTAM Models.",
                    "sid": 214,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation lexicons of Bf,e,k are initialized uniformly in our previous experiments.",
                    "sid": 215,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Better ini tializations can potentially lead to better performances because it can help to avoid the undesirable local optima in variational EM iterations.",
                    "sid": 216,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the lexicons from IBM Model-4 to initialize Bf,e,k to boost the BiTAM models.",
                    "sid": 217,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is one way of applying the proposed BiTAM models into current state-of-the-art SMT systems for further improvement.",
                    "sid": 218,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The boosted alignments are denoted as BUDA and BBDA in Table.",
                    "sid": 219,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5, corresponding to the uni-direction and bi-direction alignments, respectively.",
                    "sid": 220,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see an improvement in alignment quality.",
                    "sid": 221,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.6 Evaluating Translations.",
                    "sid": 222,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To further evaluate our BiTAM models, word alignments are used in a phrase-based decoder for evaluating translation qualities.",
                    "sid": 223,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar to the Pharoah package (Koehn, 2004), we extract phrase-pairs directly from word alignment together with coherence constraints (Fox, 2002) to remove noisy ones.",
                    "sid": 224,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use TIDES Eval’02 CE test set as development data to tune the decoder parameters; the Eval’03 data (919 sentences) is the unseen data.",
                    "sid": 225,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A trigram language model is built using 180 million English words.",
                    "sid": 226,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Across all the reported comparative settings, the key difference is the bilingual ngram-identity of the phrase-pair, which is collected directly from the underlying word alignment.",
                    "sid": 227,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Shown in Table 4 are results for the small- data track; the large-data track results are in Table 5.",
                    "sid": 228,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the small-data track, the baseline Bleu scores for IBM1, HMM and IBM4 are 15.70, 17.70 and 18.25, respectively.",
                    "sid": 229,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The UDA alignment of BiTAM1 gives an improvement over the baseline IBM1 from 15.70 to 17.93, and it is close to HMM’s performance, even though BiTAM doesn’t exploit any sequential structures of words.",
                    "sid": 230,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed BiTAM2 and BiTAM 3 are slightly better than BiTAM1.",
                    "sid": 231,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar improvements are observed for the large-data track (see Table 5).",
                    "sid": 232,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that, the boosted BiTAM3 us SE T TI N G IBM 1 H M M IBM 4 B I T A M 3 U D A BDA BUDA B BDA C E ( % ) E C ( % ) 46 .7 3 44 .3 3 49 .1 2 54 .5 6 54 .1 7 55 .0 8 50 .55 56.27 55.80 57.02 51 .59 55.18 54.76 58.76 R E FI N E D ( % ) U N I O N ( % ) I N T E R ( % ) 54 .6 4 42 .4 7 52 .2 4 56 .3 9 51 .5 9 54 .6 9 58 .4 7 52 .6 7 57 .7 4 56 .45 54.57 58.26 56.23 50 .23 57.81 56.19 58.66 52 .44 52.71 54.70 55.35 N I S T B L E U 7.",
                    "sid": 233,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 9 19 .1 9 7.",
                    "sid": 234,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 7 21 .9 9 7.",
                    "sid": 235,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 3 23 .1 8 7.",
                    "sid": 236,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "64 7.68 8.10 8.23 21 .20 21.43 22.97 24.07 Table 5: Evaluating Word Alignment Accuracies and Machine Translation Qualities for BiTAM Models, IBM Models, HMMs, and boosted BiTAMs using all the training data listed in Table.",
                    "sid": 237,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 238,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other experimental conditions are similar to Table.",
                    "sid": 239,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 240,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ing IBM4 as the seed lexicon, outperform the Refined IBM4: from 23.18 to 24.07 on Bleu score, and from 7.83 to 8.23 on NIST.",
                    "sid": 241,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result suggests a straightforward way to leverage BiTAMs to improve statistical machine translations.",
                    "sid": 242,
                    "ssid": 115,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "6",
            "sents": [
                {
                    "text": "In this paper, we proposed novel formalism for statistical word alignment based on bilingual admixture (BiTAM) models.",
                    "sid": 243,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Three BiTAM models were proposed and evaluated on word alignment and translation qualities against state-of- the-art translation models.",
                    "sid": 244,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed models significantly improve the alignment accuracy and lead to better translation qualities.",
                    "sid": 245,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Incorporation of within-sentence dependencies such as the alignment-jumps and distortions, and a better treatment of the source monolingual model worth further investigations.",
                    "sid": 246,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}