{
    "ID": "P06-1005",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We present an approach to pronoun resolution based on syntactic paths.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Through a simple bootstrapping procedure, we learn the likelihood of coreference between a pronoun and a candidate noun based on the path in the parse tree between the two entities.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This path information enables us to handle previously challenging resolution instances, and also robustly addresses traditional syntactic coreference constraints.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Highly coreferent paths also allow mining of precise probabilistic gender/number information.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We combine statistical knowledge with well known features in a Support Vector Machine pronoun resolution classifier.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Significant gains in performance are observed on several datasets.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Pronoun resolution is a difficult but vital part of the overall coreference resolution task.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In each of the following sentences, a pronoun resolution system must determine what the pronoun his refers to: (1) John needs his friend.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) John needs his support.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (1), John and his corefer.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (2), his refers to some other, perhaps previously evoked entity.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Traditional pronoun resolution systems are not designed to distinguish between these cases.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They lack the specific world knowledge required in the second instance – the knowledge that a person does not usually explicitly need his own support.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We collect statistical path-coreference information from a large, automatically-parsed corpus to address this limitation.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A dependency path is defined as the sequence of dependency links between two potentially coreferent entities in a parse tree.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A path does not include the terminal entities; for example, “John needs his support” and “He needs their support” have the same syntactic path.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our algorithm determines that the dependency path linking the Noun and pronoun is very likely to connect coreferent entities for the path “Noun needs pronoun’s friend,” while it is rarely coreferent for the path “Noun needs pronoun’s support.” This likelihood can be learned by simply counting how often we see a given path in text with an initial Noun and a final pronoun that are from the same/different gender/number classes.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cases such as “John needs her support” or “They need his support” are much more frequent in text than cases where the subject noun and pronoun terminals agree in gender/number.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When there is agreement, the terminal nouns are likely to be coreferent.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When they disagree, they refer to different entities.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After a sufficient number of occurrences of agreement or disagreement, there is a strong statistical indication of whether the path is coreferent (terminal nouns tend to refer to the same entity) or non-coreferent (nouns refer to different entities).",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that including path coreference information enables significant performance gains on three third-person pronoun resolution experiments.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also show that coreferent paths can provide the seed information for bootstrapping other, even more important information, such as the gender/number of noun phrases.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Coreference resolution is generally conducted as a pairwise classification task, using various constraints and preferences to determine whether two 33 Proceedings of the 21st International Conference on Computational Linguistics and 44th Annual Meeting of the ACL, pages 33–40, Sydney, July 2006.",
                    "sid": 24,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2006 Association for Computational Linguistics expressions corefer.",
                    "sid": 25,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Coreference is typically only allowed between nouns matching in gender and number, and not violating any intrasentential syntactic principles.",
                    "sid": 26,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Constraints can be applied as a preprocessing step to scoring candidates based on distance, grammatical role, etc., with scores developed either manually (Lappin and Leass, 1994), or through a machine-learning algorithm (Kehler et al., 2004).",
                    "sid": 27,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Constraints and preferences have also been applied together as decision nodes on a decision tree (Aone and Bennett, 1995).",
                    "sid": 28,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When previous resolution systems handle cases like (1) and (2), where no disagreement or syntactic violation occurs, coreference is therefore determined by the weighting of features or learned decisions of the resolution classifier.",
                    "sid": 29,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Without path coreference knowledge, a resolution process would resolve the pronouns in (1) and (2) the same way.",
                    "sid": 30,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, coreference resolution research has focused on the importance of the strategy for combining well known constraints and preferences (Mitkov, 1997; Ng and Cardie, 2002), devoting little attention to the development of new features for these difficult cases.",
                    "sid": 31,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The application of world knowledge to pronoun resolution has been limited to the semantic compatibility between a candidate noun and the pronoun’s context (Yang et al., 2005).",
                    "sid": 32,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show semantic compatibility can be effectively combined with path coreference information in our experiments below.",
                    "sid": 33,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our method for determining path coreference obj subj gen John needs his support Figure 1: Example dependency tree.",
                    "sid": 34,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "write the dependency path in this case as “Noun needs pronoun’s support.” The path itself does not include the terminal nouns “John” and “his.” Our algorithm finds the likelihood of coreference along dependency paths by counting the number of times they occur with terminals that are either likely coreferent or non-coreferent.",
                    "sid": 35,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the simplest version, we count paths with terminals that are both pronouns.",
                    "sid": 36,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We partition pronouns into seven groups of matching gender, number, and person; for example, the first person singular group contains I, me, my, mine, and myself.",
                    "sid": 37,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the two terminal pronouns are from the same group, coreference along the path is likely.",
                    "sid": 38,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If they are from different groups, like I and his, then they are non-coreferent.",
                    "sid": 39,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let NS (p) be the number of times the two terminal pronouns of a path, p, are from the same pronoun group, and let ND (p) be the number of times they are from different groups.",
                    "sid": 40,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We define the coreference of p as: NS (p) is similar to an algorithm for discovering paraphrases in text (Lin and Pantel, 2001).",
                    "sid": 41,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In that C(p) = NS (p) + ND (p) work, the beginning and end nodes in the paths are collected, and two paths are said to be similar (and thus likely paraphrases of each other) if they have similar terminals (i.e. the paths occur with a similar distribution).",
                    "sid": 42,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work does not need to store the terminals themselves, only whether they are from the same pronoun group.",
                    "sid": 43,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different paths are not compared in any way; each path is individually assigned a coreference likelihood.",
                    "sid": 44,
                    "ssid": 21,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "path coreference. ",
            "number": "3",
            "sents": [
                {
                    "text": "We define a dependency path as the sequence of nodes and dependency labels between two potentially coreferent entities in a dependency parse tree.",
                    "sid": 45,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the structure induced by the minimalist parser Minipar (Lin, 1998) on sentences from the news corpus described in Section 4.",
                    "sid": 46,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 gives the parse tree of (2).",
                    "sid": 47,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a short-form, we Our statistics indicate the example path, “Noun needs pronoun’s support,” has a low C (p) value.",
                    "sid": 48,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We could use this fact to prevent us from resolving “his” to “John” when “John needs his support” is presented to a pronoun resolution system.",
                    "sid": 49,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To mitigate data sparsity, we represent the path with the root form of the verbs and nouns.",
                    "sid": 50,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, we use Minipar’s named-entity recognition to replace named-entity nouns by the semantic category of their named-entity, when available.",
                    "sid": 51,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All modifiers not on the direct path, such as adjectives, determiners and adverbs, are not considered.",
                    "sid": 52,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We limit the maximum path length to eight nodes.",
                    "sid": 53,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tables 1 and 2 give examples of coreferent and non-coreferent paths learned by our algorithm and identified in our test sets.",
                    "sid": 54,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Coreferent paths are defined as paths with a C (p) value (and overall number of occurrences) above a certain threshold, indicating the terminal entities are highly likely Table 1: Example coreferent paths: Italicized entities generally corefer.",
                    "sid": 55,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P a t t e r n Ex a m pl e 1.",
                    "sid": 56,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun left ... to pronoun’s wife.",
                    "sid": 57,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bu ffe tt wi ll lea ve th e sto ck to his wi fe.",
                    "sid": 58,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 59,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun says pronoun intends....",
                    "sid": 60,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Th e ne ws pa pe r sa ys it int en ds to fil e a la ws uit . 3.",
                    "sid": 61,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun was punished for pronoun’s crime..",
                    "sid": 62,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Th e cri mi na l wa s pu nis he d for his cri m e. 4.",
                    "sid": 63,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "... left Noun to fend for pronoun-self Th ey lef t Ja ne to fe nd for he rse lf.",
                    "sid": 64,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.",
                    "sid": 65,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun lost pronoun’s job..",
                    "sid": 66,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Di ck los t his jo b. 6.",
                    "sid": 67,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "... created Noun and populated pronoun.",
                    "sid": 68,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nz a m e cre ate d th e ea rth an d po pu lat ed it 7.",
                    "sid": 69,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun consolidated pronoun’s power..",
                    "sid": 70,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Th e re vo lut io na rie s co ns oli da te d th eir po we r. 8.",
                    "sid": 71,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun suffered ... in pronoun’s knee ligament..",
                    "sid": 72,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Th e leo pa rd suf fer ed pai n in its kn ee lig am ent . to corefer.",
                    "sid": 73,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Non-coreferent paths have a C (p) below a certain cutoff; the terminals are highly unlikely to corefer.",
                    "sid": 74,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Especially note the challenge of resolving most of the examples in Table 2 without path coreference information.",
                    "sid": 75,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although these paths encompass some cases previously covered by Binding Theory (e.g. “Mary suspended her,” her cannot refer to Mary by Principle B (Haege- man, 1994)), most have no syntactic justification for non-coreference per se.",
                    "sid": 76,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Likewise, although Binding Theory (Principle A) could identify the reflexive pronominal relationship of Example 4 in Table 1, most cases cannot be resolved through syntax alone.",
                    "sid": 77,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our analysis shows that successfully handling cases that may have been handled with Binding Theory constitutes only a small portion of the total performance gain using path coreference.",
                    "sid": 78,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In any case, Binding Theory remains a challenge with a noisy parser.",
                    "sid": 79,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider: “Alex gave her money.” Minipar parses her as a possessive, when it is more likely an object, “Alex gave money to her.” Without a correct parse, we cannot rule out the link between her and Alex through Binding Theory.",
                    "sid": 80,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our algorithm, however, learns that the path “Noun gave pronoun’s money,” is non- coreferent.",
                    "sid": 81,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a sense, it corrects for parser errors by learning when coreference should be blocked, given any consistent parse of the sentence.",
                    "sid": 82,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We obtain path coreference for millions of paths from our parsed news corpus (Section 4).",
                    "sid": 83,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While Tables 1 and 2 give test set examples, many other interesting paths are obtained.",
                    "sid": 84,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We learn coreference is unlikely between the nouns in “Bob married his mother,” or “Sue wrote her obituary.” The ceptions to the coreference or non-coreference of some of these paths can be found; our patterns represent general trends only.",
                    "sid": 85,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And, as mentioned above, reliable path coreference is somewhat dependent on consistent parsing.",
                    "sid": 86,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paths connecting pronouns to pronouns are different than paths connecting both nouns and pronouns to pronouns – the case we are ultimately interested in resolving.",
                    "sid": 87,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider “Company A gave its data on its website.” The pronoun-pronoun path coreference algorithm described above would learn the terminals in “Noun’s data on pronoun’s website” are often coreferent.",
                    "sid": 88,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But if we see the phrase “Company A gave Company B’s data on its website,” then “its” is not likely to refer to “Company B,” even though we identified this as a coreferent path!",
                    "sid": 89,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We address this problem with a two-stage extraction procedure.",
                    "sid": 90,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first bootstrap gender/number information using the pronoun- pronoun paths as described in Section 4.1.",
                    "sid": 91,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then use this gender/number information to count paths where an initial noun (with probabilistically- assigned gender/number) and following pronoun are connected by the dependency path, recording the agreement or disagreement of their gender/number category.1 These superior paths are then used to re-bootstrap our final gender/number information used in the evaluation (Section 6).",
                    "sid": 92,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also bootstrap paths where the nodes in the path are replaced by their grammatical category.",
                    "sid": 93,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This allows us to learn general syntactic constraints not dependent on the surface forms of the words (including, but not limited to, the Binding Theory principles).",
                    "sid": 94,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A separate set of these noncoreferent paths is also used as a feature in our sys fact you don’t marry your own mother or write 1 As desired, this modification allows the first example to.",
                    "sid": 95,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "your own obituary is perhaps obvious, but this is the first time this kind of knowledge has been made available computationally.",
                    "sid": 96,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Naturally, ex provide two instances of noun-pronoun paths with terminals from the same gender/number group, linking each “its” to the subject noun “Company A”, rather than to each other.",
                    "sid": 97,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2: Example non-coreferent paths: Italicized entities do not generally corefer P a t t e r n Ex a m pl e 1.",
                    "sid": 98,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun thanked ... for pronoun’s assistance.",
                    "sid": 99,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Jo hn th an ke d hi m for his as sis ta nc e. 2.",
                    "sid": 100,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun wanted pronoun to lie..",
                    "sid": 101,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Th e pr esi de nt wa nt ed he r to lie . 3.",
                    "sid": 102,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun into pronoun’s pool M ax pu t th e flo ati es int o th eir po ol.",
                    "sid": 103,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 104,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "... use Noun to pronoun’s advantage Th e co m pa ny us ed th e de la y to its ad va nt ag e. 5.",
                    "sid": 105,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun suspended pronoun.",
                    "sid": 106,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "M ar y su sp en de d he r. 6.",
                    "sid": 107,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun was pronoun’s relative..",
                    "sid": 108,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Th e S mi ths we re th eir rel ati ve s. 7.",
                    "sid": 109,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun met pronoun’s demands.",
                    "sid": 110,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Th e pl ay ers ’ as so ci ati on m et its de m an ds.",
                    "sid": 111,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8.",
                    "sid": 112,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "... put Noun at the top of pronoun’s list.",
                    "sid": 113,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Th e go ve rn m en t pu t saf ety at th e to p of its lis t. tem.",
                    "sid": 114,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also tried expanding our coverage by using paths similar to paths with known path coreference (based on distributionally similar words), but this did not generally increase performance.",
                    "sid": 115,
                    "ssid": 71,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "bootstrapping in pronoun resolution. ",
            "number": "4",
            "sents": [
                {
                    "text": "Our determination of path coreference can be considered a bootstrapping procedure.",
                    "sid": 116,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the coreferent paths themselves can serve as the seed for bootstrapping additional coreference information.",
                    "sid": 117,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we sketch previous approaches to bootstrapping in coreference resolution and explain our new ideas.",
                    "sid": 118,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Coreference bootstrapping works by assuming resolutions in unlabelled text, acquiring information from the putative resolutions, and then making inferences from the aggregate statistical data.",
                    "sid": 119,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, we assumed two pronouns from the same pronoun group were coreferent, and deduced path coreference from the accumulated counts.",
                    "sid": 120,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The potential of the bootstrapping approach can best be appreciated by imagining millions of documents with coreference annotations.",
                    "sid": 121,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With such a set, we could extract fine-grained features, perhaps tied to individual words or paths.",
                    "sid": 122,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, we could estimate the likelihood each noun belongs to a particular gender/number class by the proportion of times this noun was labelled as the antecedent for a pronoun of this particular gender/number.",
                    "sid": 123,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since no such corpus exists, researchers have used coarser features learned from smaller sets through supervised learning (Soon et al., 2001; Ng and Cardie, 2002), manually-defined coreference patterns to mine specific kinds of data (Bean and Riloff, 2004; Bergsma, 2005), or accepted the noise inherent in unsupervised schemes (Ge et al., 1998; Cherry and Bergsma, 2005).",
                    "sid": 124,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We address the drawbacks of these approaches Table 3: Gender classification performance (%) Cl as sif ierF Sc or e Be rg sm a (2 00 5) Co rp us ba se d 8 5 . 4 Be rg sm a (2 00 5) W eb ba se d 9 0 . 4 Be rg sm a (2 00 5) Co m bi ne d 9 2 . 2 D up lic ate d Co rp us ba se d 8 8 . 0 Co ref er en t Path ba se d 9 0 . 3 by using coreferent paths as the assumed resolutions in the bootstrapping.",
                    "sid": 125,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because we can vary the threshold for defining a coreferent path, we can trade-off coverage for precision.",
                    "sid": 126,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now outline two potential uses of bootstrapping with coreferent paths: learning gender/number information (Section 4.1) and augmenting a semantic compatibility model (Section 4.2).",
                    "sid": 127,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We bootstrap this data on our automatically-parsed news corpus.",
                    "sid": 128,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus comprises 85 GB of news articles taken from the world wide web over a 1-year period.",
                    "sid": 129,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Probabilistic Gender/Number.",
                    "sid": 130,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bergsma (2005) learns noun gender (and number) from two principal sources: 1) mining it from manually-defined lexico-syntactic patterns in parsed corpora, and 2) acquiring it on the fly by counting the number of pages returned for various gender-indicating patterns by the Google search engine.",
                    "sid": 131,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The web-based approach outperformed the corpus-based approach, while a system that combined the two sets of information resulted in the highest performance (Table 3).",
                    "sid": 132,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The combined gender-classifying system is a machine-learned classifier with 20 features.",
                    "sid": 133,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The time delay of using an Internet search engine within a large-scale anaphora resolution effort is currently impractical.",
                    "sid": 134,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus we attempted Table 4: Example gender/number probability (%) W or d m as c fe m ne ut pl ur co m pa ny 0 . 6 0 . 1 98 .1 1.",
                    "sid": 135,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 co nd ol ee za ric e 4 . 0 92 .7 0 . 0 3.",
                    "sid": 136,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 pa t 5 8.",
                    "sid": 137,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 30 .6 6 . 2 4.",
                    "sid": 138,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 pr esi de nt 9 4.",
                    "sid": 139,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 3 . 0 1 . 5 1.",
                    "sid": 140,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 wi fe 9 . 9 83 .3 0 . 8 6.",
                    "sid": 141,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 to duplicate Bergsma’s corpus-based extraction of gender and number, where the information can be stored in advance in a table, but using a much larger data set.",
                    "sid": 142,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bergsma ran his extraction on roughly 6 GB of text; we used roughly 85 GB.",
                    "sid": 143,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using the test set from Bergsma (2005), we were only able to boost performance from an F- Score of 85.4% to one of 88.0% (Table 3).",
                    "sid": 144,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result led us to reexamine the high performance of Bergsma’s web-based approach.",
                    "sid": 145,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We realized that the corpus-based and web-based approaches are not exactly symmetric.",
                    "sid": 146,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus-based approaches, for example, would not pick out gender from a pattern such as “John and his friends...” because “Noun and pronoun’s NP” is not one of the manually-defined gender extraction patterns.",
                    "sid": 147,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The web-based approach, however, would catch this instance with the “John * his/her/its/their” template, where “*” is the Google wild-card operator.",
                    "sid": 148,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clearly, there are patterns useful for capturing gender and number information beyond the predefined set used in the corpus-based extraction.",
                    "sid": 149,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thus decided to capture gender/number information from coreferent paths.",
                    "sid": 150,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a noun is connected to a pronoun of a particular gender along a coreferent path, we count this as an instance of that noun being that gender.",
                    "sid": 151,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the end, the probability that the noun is a particular gender is the proportion of times it was connected to a pronoun of that gender along a coreferent path.",
                    "sid": 152,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gender information becomes a single intuitive, accessible feature (i.e. the probability of the noun being that gender) rather than Bergsma’s 20-dimensional feature vector requiring search-engine queries to instantiate.",
                    "sid": 153,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We acquire gender and number data for over 3 million nouns.",
                    "sid": 154,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use add-one smoothing for data sparsity.",
                    "sid": 155,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some example gender/number probabilities are given in Table 4 (cf.",
                    "sid": 156,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Ge et al., 1998; Cherry and Bergsma, 2005)).",
                    "sid": 157,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We get a performance of 90.3% (Table 3), again meeting our requirements of high performance and allowing for a fast, practical implementation.",
                    "sid": 158,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is lower than Bergsma’s top score of 92.2% (Figure 3), but again, Bergsma’s top system relies on Google search queries for each new word, while ours are all pre-stored in a table for fast access.",
                    "sid": 159,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are pleased to be able to share our gender and number data with the NLP community.2 In Section 6, we show the benefit of this data as a probabilistic feature in our pronoun resolution system.",
                    "sid": 160,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Probabilistic data is useful because it allows us to rapidly prototype resolution systems without incurring the overhead of large-scale lexical databases such as WordNet (Miller et al., 1990).",
                    "sid": 161,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Semantic Compatibility.",
                    "sid": 162,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Researchers since Dagan and Itai (1990) have variously argued for and against the utility of collocation statistics between nouns and parents for improving the performance of pronoun resolution.",
                    "sid": 163,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, can the verb parent of a pronoun be used to select antecedents that satisfy the verb’s selectional restrictions?",
                    "sid": 164,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the verb phrase was shatter it, we would expect it to refer to some kind of brittle entity.",
                    "sid": 165,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Like path coreference, semantic compatibility can be considered a form of world knowledge needed for more challenging pronoun resolution instances.",
                    "sid": 166,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We encode the semantic compatibility between a noun and its parse tree parent (and grammatical relationship with the parent) using mutual information (MI) (Church and Hanks, 1989).",
                    "sid": 167,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suppose we are determining whether ham is a suitable antecedent for the pronoun it in eat it.",
                    "sid": 168,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We calculate the MI as: Pr(eat:obj:ham) MI(eat:obj, ham) = log Pr(eat:obj)Pr(ham) Although semantic compatibility is usually only computed for possessive-noun, subject-verb, and verb-object relationships, we include 121 different kinds of syntactic relationships as parsed in our news corpus.3 We collected 4.88 billion parent:rel:node triples, including over 327 million possessive-noun values, 1.29 billion subject-verb and 877 million verb-direct object.",
                    "sid": 169,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use small probability values for unseen Pr(parent:rel:node), Pr(parent:rel), and Pr(node) cases, as well as a default MI when no relationship is parsed, roughly optimized for performance on the training set.",
                    "sid": 170,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We 2 Available at http://www.cs.ualberta.ca/˜bergsma/Gender/.",
                    "sid": 171,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 We convert prepositions to relationships to enhance our model’s semantics, e.g. Joan:of:Arc rather than Joan:prep:of include both the MI between the noun and the pronoun’s parent as well as the MI between the pronoun and the noun’s parent as features in our pronoun resolution classifier.",
                    "sid": 172,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Kehler et al.",
                    "sid": 173,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) saw no apparent gain from using semantic compatibility information, while Yang et al.",
                    "sid": 174,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2005) saw about a 3% improvement with compatibility data acquired by searching on the world wide web.",
                    "sid": 175,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 6 analyzes the contribution of MI to our system.",
                    "sid": 176,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bean and Riloff (2004) used bootstrapping to extend their semantic compatibility model, which they called contextual-role knowledge, by identifying certain cases of easily-resolved anaphors and antecedents.",
                    "sid": 177,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They give the example “Mr.",
                    "sid": 178,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bush disclosed the policy by reading it.” Once we identify that it and policy are coreferent, we include read:obj:policy as part of the compatibility model.",
                    "sid": 179,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rather than using manually-defined heuristics to bootstrap additional semantic compatibility information, we wanted to enhance our MI statistics automatically with coreferent paths.",
                    "sid": 180,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the phrase, “Saddam’s wife got a Jordanian lawyer for her husband.” It is unlikely we would see “wife’s husband” in text; in other words, we would not know that husband:gen:wife is, in fact, semantically compatible and thereby we would discourage selection of “wife” as the antecedent at resolution time.",
                    "sid": 181,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, because “Noun gets ... for pronoun’s husband” is a coreferent path, we could capture the above relationship by adding a parent:rel:node for every pronoun connected to a noun phrase along a coreferent path in text.",
                    "sid": 182,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We developed context models with and without these path enhancements, but ultimately we could find no subset of coreferent paths that improve the semantic compatibility’s contribution to training set accuracy.",
                    "sid": 183,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A mutual information model trained on 85 GB of text is fairly robust on its own, and any kind of bootstrapped extension seems to cause more damage by increased noise than can be compensated by increased coverage.",
                    "sid": 184,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although we like knowing audiences have noses, e.g. “the audience turned up its nose at the performance,” such phrases are apparently quite rare in actual test sets.",
                    "sid": 185,
                    "ssid": 70,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental design. ",
            "number": "5",
            "sents": [
                {
                    "text": "The noun-pronoun path coreference can be used directly as a feature in a pronoun resolution system.",
                    "sid": 186,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, path coreference is undefined for cases where there is no path between the pro noun and the candidate noun – for example, when the candidate is in the previous sentence.",
                    "sid": 187,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, rather than using path coreference directly, we have features that are true if C (p) is above or below certain thresholds.",
                    "sid": 188,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features are thus set when coreference between the pronoun and candidate noun is likely (a coreferent path) or unlikely (a non-coreferent path).",
                    "sid": 189,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now evaluate the utility of path coreference within a state-of-the-art machine-learned resolution system for third-person pronouns with nominal antecedents.",
                    "sid": 190,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A standard set of features is used along with the bootstrapped gender/number, semantic compatibility, and path coreference information.",
                    "sid": 191,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We refer to these features as our “probabilistic features” (Prob.",
                    "sid": 192,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Features) and run experiments using the full system trained and tested with each absent, in turn (Table 5).",
                    "sid": 193,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have 29 features in total, including measures of candidate distance, frequency, grammatical role, and different kinds of parallelism between the pronoun and the candidate noun.",
                    "sid": 194,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several reliable features are used as hard constraints, removing candidates before consideration by the scoring algorithm.",
                    "sid": 195,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All of the parsing, noun-phrase identification, and named-entity recognition are done automatically with Minipar.",
                    "sid": 196,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Candidate antecedents are considered in the current and previous sentence only.",
                    "sid": 197,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use SVMlight (Joachims, 1999) to learn a linear-kernel classifier on pairwise examples in the training set.",
                    "sid": 198,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When resolving pronouns, we select the candidate with the farthest positive distance from the SVM classification hyperplane.",
                    "sid": 199,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our training set is the anaphora-annotated portion of the American National Corpus (ANC) used in Bergsma (2005), containing 1270 anaphoric pronouns4 . We test on the ANC Test set (1291 instances) also used in Bergsma (2005) (highest resolution accuracy reported: 73.3%), the anaphora- labelled portion of AQUAINT used in Cherry and Bergsma (2005) (1078 instances, highest accuracy: 71.4%), and the anaphoric pronoun subset of the MUC7 (1997) coreference evaluation formal test set (169 instances, highest precision of 62.1 reported on all pronouns in (Ng and Cardie, 2002)).",
                    "sid": 200,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These particular corpora were chosen so we could test our approach using the same data as comparable machine-learned systems exploiting probabilistic information sources.",
                    "sid": 201,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parameters 4 See http://www.cs.ualberta.ca/˜bergsma/CorefTags/ for instructions on acquiring annotations Table 5: Resolution accuracy (%) 1 0 . 9 5 0.9 0.85 0.8 0.75 0.7 Top-3 Top-2 Top-1 0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1 Recall were set using cross-validation on the training set; test sets were used only once to obtain the final performance values.",
                    "sid": 202,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation Metric: We report results in terms of accuracy: Of all the anaphoric pronouns in the test set, the proportion we resolve correctly.",
                    "sid": 203,
                    "ssid": 18,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results and discussion. ",
            "number": "6",
            "sents": [
                {
                    "text": "We compare the accuracy of various configurations of our system on the ANC, AQT and MUC datasets (Table 5).",
                    "sid": 204,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We include the score from picking the noun immediately preceding the pronoun (after our hard filters are applied).",
                    "sid": 205,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the hard filters and limited search window, it is not possible for our system to resolve every noun to a correct antecedent.",
                    "sid": 206,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thus provide the performance upper bound (i.e. the proportion of cases with a correct answer in the filtered candidate list).",
                    "sid": 207,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On ANC and AQT, each of the probabilistic features results in a statistically significant gain in performance over a model trained and tested with that feature absent.5 On the smaller MUC set, none of the differences in 36 are statistically significant, however, the relative contribution of the various features remains reassuringly constant.",
                    "sid": 208,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Aside from missing antecedents due to the hard filters, the main sources of error include inaccurate statistical data and a classifier bias toward preceding pronouns of the same gender/number.",
                    "sid": 209,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It would be interesting to see whether performance could be improved by adding WordNet and web-mined features.",
                    "sid": 210,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Path coreference itself could conceivably be determined with a search engine.",
                    "sid": 211,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gender is our most powerful probabilistic feature.",
                    "sid": 212,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, inspecting our system’s decisions, gender often rules out coreference regardless of path coreference.",
                    "sid": 213,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not surprising, since we based the acquisition of C (p) on gender.",
                    "sid": 214,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, 5 We calculate significance with McNemar’s test, p=0.05..",
                    "sid": 215,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2: ANC pronoun resolution accuracy for varying SVM-thresholds.",
                    "sid": 216,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "our bootstrapping assumption was that the majority of times these paths occur, gender indicates coreference or lack thereof.",
                    "sid": 217,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus when they occur in our test sets, gender should often sufficiently indicate coreference.",
                    "sid": 218,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Improving the orthogonality of our features remains a future challenge.",
                    "sid": 219,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, note the decrease in performance on each of the datasets when C (p) is excluded (#5).",
                    "sid": 220,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is compelling evidence that path coreference is valuable in its own right, beyond its ability to bootstrap extensive and reliable gender data.",
                    "sid": 221,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we can add ourselves to the camp of people claiming semantic compatibility is useful for pronoun resolution.",
                    "sid": 222,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both the MI from the pronoun in the antecedent’s context and vice-versa result in improvement.",
                    "sid": 223,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Building a model from enough text may be the key.",
                    "sid": 224,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The primary goal of our evaluation was to assess the benefit of path coreference within a competitive pronoun resolution system.",
                    "sid": 225,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our system does, however, outperform previously published results on these datasets.",
                    "sid": 226,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Direct comparison of our scoring system to other current top approaches is made difficult by differences in preprocessing.",
                    "sid": 227,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ideally we would assess the benefit of our probabilistic features using the same state-of-the-art preprocessing modules employed by others such as (Yang et al., 2005) (who additionally use a search engine for compatibility scoring).",
                    "sid": 228,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clearly, promoting competitive evaluation of pronoun resolution scoring systems by giving competitors equivalent real-world preprocessing output along the lines of (Barbu and Mitkov, 2001) remains the best way to isolate areas for system improvement.",
                    "sid": 229,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our pronoun resolution system is part of a larger information retrieval project where resolution ac curacy is not necessarily the most pertinent measure of classifier performance.",
                    "sid": 230,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More than one candidate can be useful in ambiguous cases, and not every resolution need be used.",
                    "sid": 231,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the SVM ranks antecedent candidates, we can test this ranking by selecting more than the top candidate (Top- n) and evaluating coverage of the true antecedents.",
                    "sid": 232,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can also resolve only those instances where the most likely candidate is above a certain distance from the SVM threshold.",
                    "sid": 233,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Varying this distance varies the precision-recall (PR) of the overall resolution.",
                    "sid": 234,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A representative PR curve for the Top-n classifiers is provided (Figure 2).",
                    "sid": 235,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corresponding information retrieval performance can now be evaluated along the Top-n / PR configurations.",
                    "sid": 236,
                    "ssid": 33,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "7",
            "sents": [
                {
                    "text": "We have introduced a novel feature for pronoun resolution called path coreference, and demonstrated its significant contribution to a state-of-the- art pronoun resolution system.",
                    "sid": 237,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This feature aids coreference decisions in many situations not handled by traditional coreference systems.",
                    "sid": 238,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, by bootstrapping with the coreferent paths, we are able to build the most complete and accurate table of probabilistic gender information yet available.",
                    "sid": 239,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preliminary experiments show path coreference bootstrapping can also provide a means of identifying pleonastic pronouns, where pleonastic neutral pronouns are often followed in a dependency path by a terminal noun of different gender, and cataphoric constructions, where the pronouns are often followed by nouns of matching gender.",
                    "sid": 240,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}