{
    "ID": "P06-2094",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "At present, adapting an Information Extraction system to new topics is an expensive and slow process, requiring some knowledge engineering for each new topic.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose a new paradigm of Information Extraction which operates 'on demand' in response to a user's query.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On-demand Information Extraction (ODIE) aims to completely eliminate the customization effort.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a user’s query, the system will automatically create patterns to extract salient relations in the text of the topic, and build tables from the extracted information using paraphrase discovery technology.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It relies on recent advances in pattern discovery, paraphrase discovery, and extended named entity tagging.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We report on experimental results in which the system created useful tables for many topics, demonstrating the feasibility of this approach.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Most of the world’s information is recorded, passed down, and transmitted between people in text form.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Implicit in most types of text are regularities of information structure - events which are reported many times, about different individuals, in different forms, such as layoffs or mergers and acquisitions in news articles.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The goal of information extraction (IE) is to extract such information: to make these regular structures explicit, in forms such as tabular databases.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once the information structures are explicit, they can be processed in many ways: to mine information, to search for specific information, to generate graphical displays and other summaries.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, at present, a great deal of knowledge for automatic Information Extraction must be coded by hand to move a system to a new topic.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, at the later MUC evaluations, system developers spent one month for the knowledge engineering to customize the system to the given test topic.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Research over the last decade has shown how some of this knowledge can be obtained from annotated corpora, but this still requires a large amount of annotation in preparation for a new task.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Improving portability - being able to adapt to a new topic with minimal effort – is necessary to make Information Extraction technology useful for real users and, we be lieve, lead to a breakthrough for the application of the technology.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose ‘On-demand information extraction (ODIE)’: a system which automatically identifies the most salient structures and extracts the information on the topic the user demands.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This new IE paradigm becomes feasible due to recent developments in machine learning for NLP, in particular unsupervised learning methods, and it is created on top of a range of basic language analysis tools, including POS taggers, dependency analyzers, and extended Named Entity taggers.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "overview. ",
            "number": "2",
            "sents": [
                {
                    "text": "The basic functionality of the system is the following.",
                    "sid": 17,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The user types a query / topic description in keywords (for example, “merge” or “merger”).",
                    "sid": 18,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then tables will be created automatically in several minutes, rather than in a month of human labor.",
                    "sid": 19,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These tables are expected to show information about the salient relations for the topic.",
                    "sid": 20,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 describes the components and how this system works.",
                    "sid": 21,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are six major compo nents in the system.",
                    "sid": 22,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will briefly describe each component and how the data is processed; then, in the next section, four important components will be described in more detail.",
                    "sid": 23,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "731 Proceedings of the COLING/ACL 2006 Main Conference Poster Sessions, pages 731–738, Sydney, July 2006.",
                    "sid": 24,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2006 Association for Computational Linguistics Description of task (query) 1) Relevant documents IR system 6) Extended NE tagger 5) Language Analyzer Patterns 2) Pattern discovery 3) Paraphrase discovery Pattern sets 4) Table construction P a r a p h r a s e Know ledge base Table Figure 1.",
                    "sid": 25,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "System overview 1) IR system: Based on the query given by the user, it retrieves relevant documents from the document database.",
                    "sid": 26,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used a simple TF/IDF IR system we developed.",
                    "sid": 27,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2) Pattern discovery: First, the texts in the retrieved documents are analyzed using a POS tagger, a dependency analyzer and an Extended NE (Named Entity) tagger, which will be described later.",
                    "sid": 28,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then this component extracts sub-trees of dependency trees which are relatively frequent in the retrieved documents compared to the entire corpus.",
                    "sid": 29,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It counts the frequencies in the retrieved texts of all sub- trees with more than a certain number of nodes and uses TF/IDF methods to score them.",
                    "sid": 30,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The top-ranking sub-trees which contain NEs will be called patterns, which are expected to indicate salient relationships of the topic and will be used in the later components.",
                    "sid": 31,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3) Paraphrase discovery: In order to find semantic relationships between patterns, i.e. to find patterns which should be used to build the same table, we use paraphrase discovery techniques.",
                    "sid": 32,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The paraphrase discovery was conducted off- line and created a paraphrase knowledge base.",
                    "sid": 33,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4) Table construction: In this component, the patterns created in (2) are linked based on the paraphrase knowledge base created by (3), producing sets of patterns which are semantically equivalent.",
                    "sid": 34,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once the sets of patterns are created, these patterns are applied to the documents retrieved by the IR system (1).",
                    "sid": 35,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The matched patterns pull out the entity instances and these entities are aligned to build the final tables.",
                    "sid": 36,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5) Language analyzers: We use a POS tagger and a dependency analyzer to analyze the text.",
                    "sid": 37,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The analyzed texts are used in pattern discovery and paraphrase discovery.",
                    "sid": 38,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6) Extended NE tagger: Most of the participants in events are likely to be Named Entities.",
                    "sid": 39,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the traditional NE categories are not sufficient to cover most participants of various events.",
                    "sid": 40,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the standard MUC’s 7 NE categories (i.e. person, location, organization, percent, money, time and date) miss product names (e.g. Windows XP, Boeing 747),event names (Olympics, World War II), nu merical expressions other than monetary expressions, etc. We used the Extended NE categories with 140 categories and a tagger based on the categories.",
                    "sid": 41,
                    "ssid": 25,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "details of components. ",
            "number": "3",
            "sents": [
                {
                    "text": "In this section, four important components will be described in detail.",
                    "sid": 42,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prior work related to each component is explained and the techniques used in our system are presented.",
                    "sid": 43,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Pattern Discovery.",
                    "sid": 44,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pattern discovery component is responsible for discovering salient patterns for the topic.",
                    "sid": 45,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The patterns will be extracted from the documents relevant to the topic which are gathered by an IR system.",
                    "sid": 46,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several unsupervised pattern discovery techniques have been proposed, e.g.",
                    "sid": 47,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Riloff 96), (Agichtein and Gravano 00) and (Yangarber et al. 00).",
                    "sid": 48,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most recently we (Sudo et al. 03) proposed a method which is triggered by a user query to discover important patterns fully automatically.",
                    "sid": 49,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, three different representation models for IE patterns were compared, and the sub-tree model was found more effective compared to the predicate-argument model and the chain model.",
                    "sid": 50,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the sub-tree model, any connected part of a dependency tree for a sentence can be considered as a pattern.",
                    "sid": 51,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As it counts all possible sub-trees from all sentences in the retrieved documents, the computation is very expensive.",
                    "sid": 52,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This problem was solved by requiring that the sub-trees contain a predicate (verb) and restricting the number of nodes.",
                    "sid": 53,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It was implemented using the sub-tree counting algorithm proposed by (Abe et al. 02).",
                    "sid": 54,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The patterns are scored based on the relative frequency of the pattern in the retrieved documents (fr) and in the entire corpus (fall).",
                    "sid": 55,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The formula uses the TF/IDF idea (Formula 1).",
                    "sid": 56,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system ignores very frequent patterns, as those patterns are so common that they are not likely to be important to any particular topic, and also very rare patterns, as most of those patterns are noise.",
                    "sid": 57,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "case words.",
                    "sid": 58,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(COM means “company” and MNY means “money”) <COM1> <agree to buy> <COM2> <for MNY> <COM1> <will acquire> <COM2> <for MNY> <a MNY merger> <of COM1> <and COM2> Figure 2.",
                    "sid": 59,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pattern examples 3.2 Paraphrase Discovery.",
                    "sid": 60,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The role of the paraphrase discovery component is to link the patterns which mean the same thing for the task.",
                    "sid": 61,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently there has been a growing amount of research on automatic paraphrase discovery.",
                    "sid": 62,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, (Barzilay 01) proposed a method to extract paraphrases from parallel translations derived from one original document.",
                    "sid": 63,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We proposed to find paraphrases from multiple newspapers reporting the same event, using shared Named Entities to align the phrases (Shinyama et al. 02).",
                    "sid": 64,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also proposed a method to find paraphrases in the context of two Named Entity instances in a large un-annotated corpus (Sekine 05).",
                    "sid": 65,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The phrases connecting two NEs are grouped based on two types of evidence.",
                    "sid": 66,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One is the identity of the NE instance pairs, as multiple instances of the same NE pair (e.g. Yahoo!",
                    "sid": 67,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and Overture) are likely to refer to the same relationship (e.g. acquisition).",
                    "sid": 68,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other type of evidence is the keywords in the phrase.",
                    "sid": 69,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we gather a lot of phrases connecting NE's of the same two NE types (e.g. company and company), we can cluster score(t : subtree) = f r (t) log( f all (t) + c) (1) these phrases and find some typical expressions (e.g. merge, acquisition, buy).",
                    "sid": 70,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The phrases are clustered based on these two types of evidence The scoring function sorts all patterns which contain at least one extended NE and the top 100 patterns are selected for later processing.",
                    "sid": 71,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows examples of the discovered patterns for the “merger and acquisition” topic.",
                    "sid": 72,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chunks are shown in brackets and extended NEs are shown in upper and sets of paraphrases are created.",
                    "sid": 73,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basically, we used the paraphrases found by the approach mentioned above.",
                    "sid": 74,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the expressions in Figure 2 are identified as paraphrases by this method; so these three patterns will be placed in the same pattern set.",
                    "sid": 75,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that there is an alternative method of paraphrase discovery, using a hand crafted synonym dictionary like WordNet (WordNet Home page).",
                    "sid": 76,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we found that the coverage of WordNet for a particular topic is not sufficient.",
                    "sid": 77,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, no synset covers any combinations of the main words in Figure 2, namely “buy”, “acquire” and “merger”.",
                    "sid": 78,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, even if these words are found as synonyms, there is the additional task of linking expressions.",
                    "sid": 79,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if one of the expressions is “reject the merger”, it shouldn’t be a paraphrase of “acquire”.",
                    "sid": 80,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Extended NE tagging.",
                    "sid": 81,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Named Entities (NE) were first introduced by the MUC evaluations (Grishman and Sundheim 96).",
                    "sid": 82,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the MUCs concentrated on business and mili set using discovered paraphrase knowledge.",
                    "sid": 83,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once the pattern sets are built, a table is created for each pattern set.",
                    "sid": 84,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We gather all NE instances matched by one of the patterns in the set.",
                    "sid": 85,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These instances are put in the same column of the table for the pattern set.",
                    "sid": 86,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When creating tables, we impose some restrictions in order to reduce the number of meaningless tables and to gather the same relations in one table.",
                    "sid": 87,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We require columns to have at least three filled instances and delete tables with fewer than three rows.",
                    "sid": 88,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These thresholds are empirically determined using training data.",
                    "sid": 89,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Newspaper Pattern Set ANrtiecwle1s Paper * COM1 agree to buy tary topics, the important entity types were limited to a few classes of names and numerical expressions.",
                    "sid": 90,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, along with the development of Information Extraction and Question Answering technologies, people realized that there should be more and finer categories for NE.",
                    "sid": 91,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We proposed one of those extended NE sets (Sekine 02).",
                    "sid": 92,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It includes 140 hierarchical categories.",
                    "sid": 93,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, ABC agreed to buy CDE for $1M ….……………… Article 2 a $20M merger of FGH and IJK Constructed table COM2 for MNY * COM1 will acquire COM2 for MNY * a MNY merger of COM1 and COM2 the categories include Company, Company group, Military, Government, Political party, and International Organization as subcategories of Organization.",
                    "sid": 94,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, new categories are introduced such as Vehicle, Food, Award, Religion, Language, Offense, Art and so on as subcategories of Product, as well as Event, Natural Object, Vocation, Unit, Weight, Temperature, Number of people and so on.",
                    "sid": 95,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used a rule-based tagger developed to tag the 140 categories for this experiment.",
                    "sid": 96,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that, in the proposed method, the slots of the final table will be filled in only with instances of these extended Named Entities.",
                    "sid": 97,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most common nouns, verbs or sentences can’t be entries in the table.",
                    "sid": 98,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is obviously a limitation of the proposed method; however, as the categories are designed to provide good coverage for a factoid type QA system, most interesting types of entities are covered by the categories.",
                    "sid": 99,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Table Construction.",
                    "sid": 100,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basically the table construction is done by applying the discovered patterns to the original corpus.",
                    "sid": 101,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The discovered patterns are grouped into pattern Article Company Money 1 ABC, CDE $1M.",
                    "sid": 102,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 FGH, IJK $20M.",
                    "sid": 103,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3.",
                    "sid": 104,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table Construction",
                    "sid": 105,
                    "ssid": 64,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "4",
            "sents": [
                {
                    "text": "4.1 Data and Processing.",
                    "sid": 106,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We conducted the experiments using the 1995 New York Times as the corpus.",
                    "sid": 107,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The queries used for system development and threshold tuning were created by the authors, while queries based on the set of event types in the ACE extraction evaluations were used for testing.",
                    "sid": 108,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A total of 31 test queries were used; we discarded several queries which were ambiguous or uncertain.",
                    "sid": 109,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The test queries were derived from the example sentences for each event type in the ACE guidelines.",
                    "sid": 110,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples of queries are shown in the Appendix.",
                    "sid": 111,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the moment, the whole process takes about 15 minutes on average for each query on a Pentium 2.80GHz processor running Linux.",
                    "sid": 112,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus was analyzed in advance by a POS tagger, NE tagger and dependency analyzer.",
                    "sid": 113,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The processing and counting of sub-trees takes the majority (more than 90%) of the time.",
                    "sid": 114,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe we can easily make it faster by programming techniques, for example, using distributed computing.",
                    "sid": 115,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Result and Evaluation.",
                    "sid": 116,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Out of 31 queries, the system is unable to build any tables for 11 queries.",
                    "sid": 117,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The major reason is that the IR component can’t find enough newspaper articles on the topic.",
                    "sid": 118,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It retrieved only a few articles for topics like “born”, “divorce” or “injure” from The New York Times.",
                    "sid": 119,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the moment, we will focus on the 20 queries for which tables were built.",
                    "sid": 120,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Appendix shows some examples of queries and the generated tables.",
                    "sid": 121,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In total, 127 tables are created for the 20 topics, with one to thirteen tables for each topic.",
                    "sid": 122,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of columns in a table ranges from 2 to 10, including the document ID column, and the average number of columns is 3.0.",
                    "sid": 123,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of rows in a table range from 3 to 125, and the average number of rows is 16.9.",
                    "sid": 124,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The created tables are usually not fully filled; the average rate is 20.0%.",
                    "sid": 125,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to measure the potential and the usefulness of the proposed method, we evaluate the result based on three measures: usefulness, argument role coverage, and correctness.",
                    "sid": 126,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the usefulness evaluation, we manually reviewed the tables to determine whether a useful table is included or not.",
                    "sid": 127,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is inevitably subjective, as the user does not specify in advance what table rows and columns are expected.",
                    "sid": 128,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We asked a subject to judge usefulness in three grades; A) very useful – for the query, many people might want to use this table for the further investigation of the topic, B) useful – at least, for some purpose, some people might want to use this table for further investigation and C) not useful – no one will be interested in using this table for further investigation.",
                    "sid": 129,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The argument role coverage measures the percentage of the roles specified for each ACE event type which appeared as a column in one or more of the created tables for that event type.",
                    "sid": 130,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The correctness was measured based on whether a row of a table reflects the correct information.",
                    "sid": 131,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As it is impossible to evaluate all the data, the evaluation data are selected randomly.",
                    "sid": 132,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 shows the usefulness evaluation result.",
                    "sid": 133,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Out of 20 topics, two topics are judged very useful and twelve are judged useful.",
                    "sid": 134,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The very useful top ics are “fine” (Q4 in the appendix) and “acquit” (not shown in the appendix).",
                    "sid": 135,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared to the results in the ‘useful’ category, the tables for these two topics have more slots filled and the NE types of the fillers have fewer mistakes.",
                    "sid": 136,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The topics in the “not useful” category are “appeal”, “execute”, “fired”, “pardon”, “release” and “trial”.",
                    "sid": 137,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are again topics with very few relevant articles.",
                    "sid": 138,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By increasing the corpus size or improving the IR component, we may be able to improve the performance for these topics.",
                    "sid": 139,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The majority category, “useful”, has 12 topics.",
                    "sid": 140,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Five of them can be found in the appendix (all those besides Q4).",
                    "sid": 141,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For these topics, the number of relevant articles in the corpus is relatively high and interesting relations are found.",
                    "sid": 142,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The examples in the appendix are selected from larger tables with many columns.",
                    "sid": 143,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although there are columns that cannot be filled for every event instance, we found that the more columns that are filled in, the more useful and interesting the information is. Table 1.",
                    "sid": 144,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Usefulness evaluation result Ev al ua tio n N u m b e r o f t o p i c s Ve ry us ef ul 2 Us ef ul 1 2 N ot us ef ul 6 For the 14 “very useful” and “useful” topics, the role coverage was measured.",
                    "sid": 145,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of the roles in the ACE task can be filled by different types of Named Entities, for example, the “defendant” of a “sentence” event can be a Person, Organization or GPE.",
                    "sid": 146,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the system creates tables based on NE types; e.g. for the “sentence” event, a Person column is created, in which most of the fillers are defendants.",
                    "sid": 147,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In such cases, we regard the column as covering the role.",
                    "sid": 148,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Out of 63 roles for the 14 event types, 38 are found in the created tables, for a role coverage of 60.3%.",
                    "sid": 149,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that, by lowering the thresholds, the coverage can be increased to as much as 90% (some roles can’t be found because of Extended NE limitations or the rare appearance of roles) but with some sacrifice of precision.",
                    "sid": 150,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows the correctness evaluation results.",
                    "sid": 151,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We randomly select 100 table rows among the topics which were judged “very useful” or “useful”, and determine the correctness of the information by reading the newspaper articles the information was extracted from.",
                    "sid": 152,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Out of 100 rows, 84 rows have correct information in all slots.",
                    "sid": 153,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 rows have some incorrect information in some of the columns, and 12 contain wrong information.",
                    "sid": 154,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most errors are due to NE tagging errors (11 NE errors out of 16 errors).",
                    "sid": 155,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These errors include instances of people which are tagged as other categories, and so on.",
                    "sid": 156,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, by looking at the actual articles, we found that co-reference resolution could help to fill in more information.",
                    "sid": 157,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because the important information is repeatedly mentioned in newspaper articles, referential expressions are often used.",
                    "sid": 158,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in a sentence “In 1968 he was elected mayor of Indianapolis.”, we could not extract “he” at the moment.",
                    "sid": 159,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We plan to add coreference resolution in the near future.",
                    "sid": 160,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other sources of error include: • The role of the entity is confused, i.e. victim and murderer • Different kinds of events are found in one table, e.g., the victory of Jack Nicklaus was found in first proposed by (Aone and RamosSantacruz 00) and the ACE evaluations of event detection follow this line (ACE Home Page).",
                    "sid": 161,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An unsupervised learning method has been applied to a more restricted IE task, Relation Discovery.",
                    "sid": 162,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Hasegawa et al. 2004) used large corpora and an Extended Named Entity tagger to find novel relations and their participants.",
                    "sid": 163,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the results are limited to a pair of participants and because of the nature of the procedure, the discovered relations are static relations like a country and its presidents rather than events.",
                    "sid": 164,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Topic-oriented summarization, currently pursued by the DUC evaluations (DUC Home Page), is also closely related.",
                    "sid": 165,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The systems are trying to create summaries based on the specified topic for a manually prepared set of documents.",
                    "sid": 166,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, if the result is suitable to present in table format, it can be handled by ODIE.",
                    "sid": 167,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our previous study (Se the political election use terms like “win”) query (as both of them kine and Nobata 03) found that about one third of randomly constructed similar newspaper article • An unrelated but often collocate entity was included.",
                    "sid": 168,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Year period expressions are found in “fine” events, as there are many expressions like “He was sentenced 3 years and fined $1,000”.",
                    "sid": 169,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2.",
                    "sid": 170,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Correctness evaluation result Ev al ua tio n N u m b e r o f r o w s Co rre ct 8 4 Pa rti all y co rre ct 4 In co rre ct 1 2",
                    "sid": 171,
                    "ssid": 66,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "5",
            "sents": [
                {
                    "text": "As far as the authors know, there is no system similar to ODIE.",
                    "sid": 172,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several methods have been proposed to produce IE patterns automatically to facilitate IE knowledge creation, as is described in Section 3.1.",
                    "sid": 173,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But those are not targeting the fully automatic creation of a complete IE system for a new topic.",
                    "sid": 174,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There exists another strategy to extend the range of IE systems.",
                    "sid": 175,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It involves trying to cover a wide variety of topics with a large inventory of relations and events.",
                    "sid": 176,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not certain if there are only a limited number of topics in the world, but there are a limited number of high-interest topics, so this may be a reasonable solution from an engineering point of view.",
                    "sid": 177,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This line of research was clusters are well-suited to be presented in table format, and another one third of the clusters can be acceptably expressed in table format.",
                    "sid": 178,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests there is a big potential where an ODIE-type system can be beneficial.",
                    "sid": 179,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "future work. ",
            "number": "6",
            "sents": [
                {
                    "text": "We demonstrated a new paradigm of Information Extraction technology and showed the potential of this method.",
                    "sid": 180,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, there are problems to be solved to advance the technology.",
                    "sid": 181,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of them is the coverage of the extracted information.",
                    "sid": 182,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although we have created useful tables for some topics, there are event instances which are not found.",
                    "sid": 183,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This problem is mostly due to the inadequate performance of the language analyzers (information retrieval component, dependency analyzer or Extended NE tagger) and the lack of a coreference analyzer.",
                    "sid": 184,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even though there are possible applications with limited coverage, it will be essential to enhance these components and add coreference in order to increase coverage.",
                    "sid": 185,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, there are basic domain limitations.",
                    "sid": 186,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We made the system “on-demand” for any topic, but currently only within regular news domains.",
                    "sid": 187,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As configured, the system would not work on other domains such as a medical, legal, or patent domain, mainly due to the design of the extended NE hierarchy.",
                    "sid": 188,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While specific hierarchies could be incorporated for new domains, it will also be desirable to integrate bootstrapping techniques for rapid incremental additions to the hierarchy.",
                    "sid": 189,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also at the moment, table column labels are simply Extended NE categories, and do not indicate the role.",
                    "sid": 190,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would like to investigate this problem in the future.",
                    "sid": 191,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "7",
            "sents": [
                {
                    "text": "In this paper, we proposed “On-demand Information Extraction (ODIE)”.",
                    "sid": 192,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is a system which automatically identifies the most salient structures and extracts the information on whatever topic the user demands.",
                    "sid": 193,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It relies on recent advances in NLP technologies; unsupervised learning and several advanced NLP analyzers.",
                    "sid": 194,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although it is at a preliminary stage, we developed a prototype system which has created useful tables for many topics and demonstrates the feasibility of this approach.",
                    "sid": 195,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements. ",
            "number": "8",
            "sents": [
                {
                    "text": "This research was supported in part by the Defense Advanced Research Projects Agency under Contract HR001106-C-0023 and by the National Science Foundation under Grant IIS0325657.",
                    "sid": 196,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper does not necessarily reflect the position of the U.S. Government.",
                    "sid": 197,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would like to thank Prof. Ralph Grishman, Dr. Kiyoshi Sudo, Dr. Chikashi Nobata, Mr. Takaaki Hasegawa, Mr. Koji Murakami and Mr. Yusuke Shinyama for useful comments, discussion.",
                    "sid": 198,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}