{
    "ID": "P07-1067",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Semantic relatedness is a very important factor for the coreference resolution task.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To obtain this semantic information, corpus- based approaches commonly leverage patterns that can express a specific semantic relation.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The patterns, however, are designed manually and thus are not necessarily the most effective ones in terms of accuracy and breadth.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To deal with this problem, in this paper we propose an approach that can automatically find the effective patterns for coreference resolution.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We explore how to automatically discover and evaluate patterns, and how to exploit the patterns to obtain the semantic relatedness information.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evaluation on ACE data set shows that the pattern based semantic information is helpful for coreference resolution.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Semantic relatedness is a very important factor for coreference resolution, as noun phrases used to refer to the same entity should have a certain semantic relation.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To obtain this semantic information, previous work on reference resolution usually leverages a semantic lexicon like WordNet (Vieira and Poesio, 2000; Harabagiu et al., 2001; Soon et al., 2001; Ng and Cardie, 2002).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the drawback of WordNet is that many expressions (especially for proper names), word senses and semantic relations are not available from the database (Vieira and Poesio, 2000).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In recent years, increasing interest has 528 been seen in mining semantic relations from large text corpora.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One common solution is to utilize a pattern that can represent a specific semantic relation (e.g., “X such as Y ” for is-a relation, and “X and other Y ” for other-relation).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instantiated with two given noun phrases, the pattern is searched in a large corpus and the occurrence number is used as a measure of their semantic relatedness (Markert et al., 2003; Modjeska et al., 2003; Poesio et al., 2004).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, in the previous pattern based approaches, the selection of the patterns to represent a specific semantic relation is done in an ad hoc way, usually by linguistic intuition.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The manually selected patterns, nevertheless, are not necessarily the most effective ones for coreference resolution from the following two concerns: • Accuracy.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Can the patterns (e.g., “X such as Y ”) find as many NP pairs of the specific semantic relation (e.g. is-a) as possible, with a high precision?",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Breadth.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Can the patterns cover a wide variety of semantic relations, not just is-a, by which coreference relationship is realized?",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in some annotation schemes like ACE, “Beijing:China” are coreferential as the capital and the country could be used to represent the government.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pattern for the common “is- a” relation will fail to identify the NP pairs of such a “capital-country” relation.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To deal with this problem, in this paper we propose an approach which can automatically discover effective patterns to represent the semantic relations Proceedings of the 45th Annual Meeting of the Association of Computational Linguistics, pages 528–535, Prague, Czech Republic, June 2007.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2007 Association for Computational Linguistics for coreference resolution.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We explore two issues in our study: (1) How to automatically acquire and evaluate the patterns?",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We utilize a set of coreferential NP pairs as seeds.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each seed pair, we search a large corpus for the texts where the two noun phrases co- occur, and collect the surrounding words as the surface patterns.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluate a pattern based on its commonality or association with the positive seed pairs.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) How to mine the patterns to obtain the semantic relatedness information for coreference resolution?",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present two strategies to exploit the patterns: choosing the top best patterns as a set of pattern features, or computing the reliability of semantic relatedness as a single feature.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In either strategy, the obtained features are applied to do coreference resolution in a supervised-learning way.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To our knowledge, our work is the first effort that systematically explores these issues in the coreference resolution task.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluate our approach on ACE data set.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experimental results show that the pattern based semantic relatedness information is helpful for the coreference resolution.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remainder of the paper is organized as follows.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2 gives some related work.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 introduces the framework for coreference resolution.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 presents the model to obtain the pattern- based semantic relatedness information.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 5 discusses the experimental results.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, Section 6 summarizes the conclusions.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Earlier work on coreference resolution commonly relies on semantic lexicons for semantic relatedness knowledge.",
                    "sid": 38,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the system by Vieira and Poesio (2000), for example, WordNet is consulted to obtain the synonymy, hypernymy and meronymy relations for resolving the definite anaphora.",
                    "sid": 39,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (Harabagiu et al., 2001), the path patterns in WordNet are utilized to compute the semantic consistency between NPs.",
                    "sid": 40,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently, Ponzetto and Strube (2006) suggest to mine semantic relatedness from Wikipedia, which can deal with the data sparseness problem suffered by using WordNet.",
                    "sid": 41,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of leveraging existing lexicons, many researchers have investigated corpus-based ap proaches to mine semantic relations.",
                    "sid": 42,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Garera and Yarowsky (2006) propose an unsupervised model which extracts hypernym relation for resloving definite NPs.",
                    "sid": 43,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their model assumes that a definite NP and its hypernym words usually co-occur in texts.",
                    "sid": 44,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, for a definite-NP anaphor, a preceding NP that has a high co-occurrence statistics in a large corpus is preferred for the antecedent.",
                    "sid": 45,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bean and Riloff (2004) present a system called BABAR that uses contextual role knowledge to do coreference resolution.",
                    "sid": 46,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They apply an IE component to unannotated texts to generate a set of extraction caseframes.",
                    "sid": 47,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each caseframe represents a linguistic expression and a syntactic position, e.g. “murder of <NP>”, “killed <patient>”.",
                    "sid": 48,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the case- frames, they derive different types of contextual role knowledge for resolution, for example, whether an anaphor and an antecedent candidate can be filled into co-occurring caseframes, or whether they are substitutable for each other in their caseframes.",
                    "sid": 49,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different from their system, our approach aims to find surface patterns that can directly indicate the coreference relation between two NPs.",
                    "sid": 50,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hearst (1998) presents a method to automate the discovery of WordNet relations, by searching for the corresponding patterns in large text corpora.",
                    "sid": 51,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "She explores several patterns for the hyponymy relation, including “X such as Y ” “X and/or other Y ”, “X including / especially Y ” and so on.",
                    "sid": 52,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of Hearst’s style patterns can be seen for the reference resolution task.",
                    "sid": 53,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Modjeska et al.",
                    "sid": 54,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2003) explore the use of the Web to do the other-anaphora resolution.",
                    "sid": 55,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In their approach, a pattern “X and other Y ” is used.",
                    "sid": 56,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given an anaphor and a candidate antecedent, the pattern is instantiated with the two NPs and forms a query.",
                    "sid": 57,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The query is submitted to the Google searching engine, and the returned hit number is utilized to compute the semantic relatedness between the two NPs.",
                    "sid": 58,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In their work, the semantic information is used as a feature for the learner.",
                    "sid": 59,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Markert et al.",
                    "sid": 60,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2003) and Poesio et al.",
                    "sid": 61,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) adopt a similar strategy for the bridging anaphora resolution.",
                    "sid": 62,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (Hearst, 1998), the author also proposes to discover new patterns instead of using the manually designed ones.",
                    "sid": 63,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "She employs a bootstrapping algorithm to learn new patterns from the word pairs with a known relation.",
                    "sid": 64,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on Hearst’s work, Pan- tel and Pennacchiotti (2006) further give a method which measures the reliability of the patterns based on the strength of association between patterns and instances, employing the pointwise mutual information (PMI).",
                    "sid": 65,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "framework of coreference resolution. ",
            "number": "3",
            "sents": [
                {
                    "text": "Our coreference resolution system adopts the common learning-based framework as employed by Soon et al.",
                    "sid": 66,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2001) and Ng and Cardie (2002).",
                    "sid": 67,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the learning framework, a training or testing instance has the form of i{N Pi, N Pj }, in which N Pj is a possible anaphor and N Pi is one of its antecedent candidates.",
                    "sid": 68,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An instance is associated with a vector of features, which is used to describe the properties of the two noun phrases as well as their relationships.",
                    "sid": 69,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our baseline system, we adopt the common features for coreference resolution such as lexical property, distance, string-matching, name- alias, apposition, grammatical role, number/gender agreement and so on.",
                    "sid": 70,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same feature set is described in (Ng and Cardie, 2002) for reference.",
                    "sid": 71,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During training, for each encountered anaphor N Pj , one single positive training instance is created for its closest antecedent.",
                    "sid": 72,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And a group of negative training instances is created for every intervening noun phrases between N Pj and the antecedent.",
                    "sid": 73,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on the training instances, a binary classifier can be generated using any discriminative learning algorithm, like C5 in our study.",
                    "sid": 74,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For resolution, an input document is processed from the first NP to the last.",
                    "sid": 75,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each encountered N Pj , a test instance is formed for each antecedent candidate, N Pi1.",
                    "sid": 76,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This instance is presented to the classifier to determine the coreference relationship.",
                    "sid": 77,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "N Pj will be resolved to the candidate that is classified as positive (if any) and has the highest confidence value.",
                    "sid": 78,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our study, we augment the common framework by incorporating non-anaphors into training.",
                    "sid": 79,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We focus on the non-anaphors that the original classifier fails to identify.",
                    "sid": 80,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, we apply the learned classifier to all the non-anaphors in the training documents.",
                    "sid": 81,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each non-anaphor that is classified as positive, a negative instance is created by pairing the non-anaphor and its false antecedent.",
                    "sid": 82,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These neg 1 For resolution of pronouns, only the preceding NPs in current and previous two sentences are considered as antecedent candidates.",
                    "sid": 83,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For resolution of non-pronouns, all the preceding non-pronouns are considered.",
                    "sid": 84,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ative instances are added into the original training instance set for learning, which will generate a classifier with the capability of not only antecedent identification, but also non-anaphorically identification.",
                    "sid": 85,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The new classier is applied to the testing document to do coreference resolution as usual.",
                    "sid": 86,
                    "ssid": 21,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "patterned based semantic relatedness. ",
            "number": "4",
            "sents": [
                {
                    "text": "4.1 Acquiring the Patterns.",
                    "sid": 87,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To derive patterns to indicate a specific semantic relation, a set of seed NP pairs that have the relation of interest is needed.",
                    "sid": 88,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As described in the previous section, we have a set of training instances formed by NP pairs with known coreference relationships.",
                    "sid": 89,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can just use this set of NP pairs as the seeds.",
                    "sid": 90,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, an instance i{N Pi, N Pj } will become a seed pair (Ei:Ej ) in which N Pi corresponds to Ei and N Pj corresponds to Ej . In creating the seed, for a common noun, only the head word is retained while for a proper name, the whole string is kept.",
                    "sid": 91,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, instance i{“Bill Clinton”, “the former president”} will be converted to a NP pair (“Bill Clinton”:“president”).",
                    "sid": 92,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We create the seed pair for every training instance i{N Pi, N Pj }, except when (1) N Pi or N Pj is a pronoun; or (2) N Pi and N Pj have the same head word.",
                    "sid": 93,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We denote S+ and S- the set of seed pairs derived from the positive and the negative training instances, respectively.",
                    "sid": 94,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that a seed pair may possibly belong to S+ can Sat the same time.",
                    "sid": 95,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each of the seed NP pairs (Ei:Ej ), we search in a large corpus for the strings that match the regular expression “Ei * * * Ej ” or “Ej * * * Ei”, where * is a wildcard for any word or symbol.",
                    "sid": 96,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The regular expression is defined as such that all the co- occurrences of Ei and Ej with at most three words (or symbols) in between are retrieved.",
                    "sid": 97,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each retrieved string, we extract a surface pattern by replacing expression Ei with a mark <#t1#> and Ej with <#t2#>.",
                    "sid": 98,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the string is followed by a symbol, the symbol will be also included in the pattern.",
                    "sid": 99,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is to create patterns like “X * * * Y [, . ?]” where Y, with a high possibility, is the head word, but not a modifier of another noun phrase.",
                    "sid": 100,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an example, consider the pair (“Bill Clinton”:“president”).",
                    "sid": 101,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suppose that two sentences in a corpus can be matched by the regular expressions: (S1) “ Bill Clinton is elected President of the United States.” (S2) “The US President, Mr Bill Clinton, today advised India to move towards nuclear non Thus the association between a pattern p and a positive seed pair s:(Ei:Ej ) is: |(Ei ,p,Ej )| (∗,∗,∗)| proliferation and begin a dialogue with Pakistan to pmi(p, (Ei : Ej )) = log | |(Ei ,∗,Ej )| |(∗,p,∗)| (3) ... ”.",
                    "sid": 102,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "|(∗,∗,∗) | |(∗,∗,∗ )| The patterns to be extracted for (S1) and (S2), respectively, are P1: <#t1#> is elected <#t2#> P2: <#t2#> , Mr <#t1#> , where |(Ei,p,Ej )| is the count of strings matched by pattern p instantiated with Ei and Ej . Asterisk * represents a wildcard, that is: We record the number of strings matched by a pattern p instantiated with (Ei:Ej ), noted |(Ei, p, Ej )|, |(Ei , ∗, Ej )| = p∈P List(Ei :Ej ) |(Ei , p, Ej )| (4) for later use.",
                    "sid": 103,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each seed pair, we generate a list of surface patterns in the above way.",
                    "sid": 104,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We collect all the patterns derived from the positive seed pairs as a set |(∗, p, ∗)| = (Ei :Ej )∈S+∪S− |(∗, ∗, ∗)| = |(Ei , p, Ej )| (5) |(Ei , p, Ej )| (6) of reference patterns, which will be scored and used to evaluate the semantic relatedness for any new NP pair.",
                    "sid": 105,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Ei :Ej )∈S+∪S−;p∈P list(Ei :Ej ) The reliability of pattern is the average strength of association across each positive seed pair: 4.2 Scoring the Patterns.",
                    "sid": 106,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "r(p) = pmi(p,s) s∈S+ max pmi |S + | (7) 4.2.1 Frequency One possible scoring scheme is to evaluate a pattern based on its commonality to positive seed pairs.",
                    "sid": 107,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The intuition here is that the more often a pattern is seen for the positive seed pairs, the more indicative the pattern is to find positive coreferential NP pairs.",
                    "sid": 108,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on this idea, we score a pattern by calculating the number of positive seed pairs whose pattern list contains the pattern.",
                    "sid": 109,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Formally, supposing the pattern list associated with a seed pair s is PList(s), the frequency score of a pattern p is defined as F reqency(p) = |{s|s ∈ S+, p ∈ P List(s)}| (1) 4.2.2 Reliability Another possible way to evaluate a pattern is based on its reliability, i.e., the degree that the pattern is associated with the positive coreferential NPs.",
                    "sid": 110,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our study, we use pointwise mutual information (Cover and Thomas, 1991) to measure association strength, which has been proved effective in Here max pmi is used for the normalization purpose, which is the maximum PMI between all patterns and all positive seed pairs.",
                    "sid": 111,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Exploiting the Patterns.",
                    "sid": 112,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3.1 Patterns Features One strategy is to directly use the reference patterns as a set of features for classifier learning and testing.",
                    "sid": 113,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To select the most effective patterns for the learner, we rank the patterns according to their scores and then choose the top patterns (first 100 in our study) as the features.",
                    "sid": 114,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As mentioned, the frequency score is based on the commonality of a pattern to the positive seed pairs.",
                    "sid": 115,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, if a pattern also occurs frequently for the negative seed pairs, it should be not deemed a good feature as it may lead to many false positive pairs during real resolution.",
                    "sid": 116,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To take this factor into account, we filter the patterns based on their accuracy, which is defined as follows: the task of semantic relation identification (Pantel and Pennacchiotti, 2006).",
                    "sid": 117,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Under pointwise mutual Accuracy(p) = |{s|s ∈ S+, p ∈ P List(s)}| |{s|s ∈ S + ∪ S−, p ∈ P List(s)}| (8) information (PMI), the strength of association between two events x and y is defined as follows: A pattern with an accuracy below threshold 0.5 is eliminated from the reference pattern set.",
                    "sid": 118,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining patterns are sorted as normal, from which pmi(x, y) = log P (x, y) P (x)P (y) (2) the top 100 patterns are selected as features.",
                    "sid": 119,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NWire NPaper BNews R P F R P F R P F + single reliability feature proper names 57.4 80.8 67.1 56.6 76.2 65.0 54.0 74.7 62.7 all types 57.7 76.4 65.7 56.7 75.9 64.9 55.1 69.5 61.5 Table 1: The results of different systems for coreference resolution Each selected pattern p is used as a single feature, PFp.",
                    "sid": 120,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For an instance i{NPi, NPj }, a list of patterns is generated for (Ei:Ej ) in the same way as described in Section 4.1.",
                    "sid": 121,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The value of PFp for the instance is simply |(Ei, p, Ej )|.",
                    "sid": 122,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The set of pattern features is used together with the other normal features to do the learning and testing.",
                    "sid": 123,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the actual importance of a pattern in coreference resolution is automatically determined in a supervised learning way.",
                    "sid": 124,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3.2 Semantic Relatedness Feature Another strategy is to use only one semantic feature which is able to reflect the reliability that a NP pair is related in semantics.",
                    "sid": 125,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intuitively, a NP pair with strong semantic relatedness should be highly associated with as many reliable patterns as possible.",
                    "sid": 126,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on this idea, we define the semantic re- latedness feature (SRel) as follows: SRel(i{N Pi , N Pj }) =",
                    "sid": 127,
                    "ssid": 41,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments and discussion. ",
            "number": "5",
            "sents": [
                {
                    "text": "5.1 Experimental setup.",
                    "sid": 128,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our study we did evaluation on the ACE-2 V1.0 corpus (NIST, 2003), which contains two data set, training and devtest, used for training and testing respectively.",
                    "sid": 129,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each of these sets is further divided by three domains: newswire (NWire), newspaper (NPa- per), and broadcast news (BNews).",
                    "sid": 130,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An input raw text was preprocessed automatically by a pipeline of NLP components, including sentence boundary detection, POS-tagging, Text Chunking and Named-Entity Recognition.",
                    "sid": 131,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two different classifiers were learned respectively for resolving pronouns and non-pronouns.",
                    "sid": 132,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As mentioned, the pattern based semantic information was only applied to the non-pronoun resolution.",
                    "sid": 133,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For evaluation, Vilain et al.",
                    "sid": 134,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1995)’s scoring algorithm was adopted to compute the recall and precision of the whole coreference resolution.",
                    "sid": 135,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For pattern extraction and feature computing, we used Wikipedia, a web-based free-content encyclopedia, as the text corpus.",
                    "sid": 136,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We collected the English 1000 ∗ p∈P List(Ei :Ej ) pmi(p, (Ei : Ej )) ∗ r(p) (9) Wikipedia database dump in November 2006 (re fer to http://down load.wikim edia.org/).",
                    "sid": 137,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After all the hyperlinks and other html tags were removed, the where pmi(p, (Ei:Ej )) is the pointwise mutual information between pattern p and a NP pair (Ei:Ej ), as defined in Eq. 3.",
                    "sid": 138,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "r(p) is the reliability score of p (Eq. 7).",
                    "sid": 139,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a relatedness value is always below 1, we multiple it by 1000 so that the feature value will be of integer type with a range from 0 to 1000.",
                    "sid": 140,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that among PList(Ei:Ej ), only the reference patterns are involved in the feature computing.",
                    "sid": 141,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "whole pure text contains about 220 Million words.",
                    "sid": 142,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Results and Discussion.",
                    "sid": 143,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 lists the performance of different coreference resolution systems.",
                    "sid": 144,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first line of the table shows the baseline system that uses only the common features proposed in (Ng and Cardie, 2002).",
                    "sid": 145,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the table, our baseline system can NO 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 . . .",
                    "sid": 146,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F r e q u e n c y < # t 1 > < # t 2 > < # t 2 > < # t 1 > < # t 1 > , < # t 2 > < # t 2 > , < # t 1 > < # t 1 > . < # t 2 > < # t 1 > a n d < # t 2 > < # t 2 > . < # t 1 > < # t 1 > . t h e < # t 2 > < # t 2 > a n d < # t 1 > < # t 1 > , t h e < # t 2 > < # t 2 > . t h e < # t 1 > < # t 2 > , t h e < # t 1 > < # t 2 > < # t 1 > , < # t 1 > < # t 2 > , < # t 1 > : < # t 2 > < # t 1 > < # t 2 > . < # t 2 > < # t 1 > . < # t 1 > ( < # t 2 > ) <# t1 > and the <# t2 > < # t 2 > ( < # t 1 > ) . . .",
                    "sid": 147,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F r e q u e n c y ( F i l t e r e d ) < # t 2 > | | < # t 1 > | < # t 1 > ) i s a < # t 2 > < # t 1 > ) i s a n < # t 2 > < # t 2 > ) i s a n < # t 1 > < # t 2 > ) i s a < # t 1 > < # t 1 > o r t h e < # t 2 > < # t 1 > ( t h e < # t 2 > <# t1 > . dur ing the <# t2 > < # t 1 > | < # t 2 > < # t 1 > , a n < # t 2 > < # t 1 > ) w a s a < # t 2 > < # t 1 > i n t h e < # t 2 > < # t 1 > < # t 2 > < # t 1 > ) w a s a n < # t 2 > < # t 1 > , m a n y < # t 2 > < # t 2 > ) w a s a < # t 1 > < # t 1 > ( < # t 2 > . < # t 2 > | < # t 1 > < # t 1 > , n o t t h e < # t 2 > < # t 2 > , m a n y < # t 1 > . . .",
                    "sid": 148,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P M I R e l i a b i l t y < # t 1 > : < # t 2 > < # t 2 > : < # t 1 > < # t 1 > . t h e < # t 2 > < # t 2 > ( < # t 1 > ) < # t 1 > ( < # t 2 > < # t 1 > ( < # t 2 > ) < # t 1 > | | < # t 2 > | < # t 2 > | | < # t 1 > | < # t 2 > , t h e < # t 1 > < # t 1 > , t h e < # t 2 > < # t 2 > ( < # t 1 > < # t 1 > , < # t 2 > < # t 1 > a n d t h e < # t 2 > < # t 1 > . < # t 2 > < # t 1 > ) i s a < # t 2 > <# t1 > dur ing the <# t2 > < # t 1 > < # t 2 > . < # t 1 > ) i s a n < # t 2 > < # t 2 > i n < # t 1 > . < # t 2 > , < # t 1 > . . .",
                    "sid": 149,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2: Top patterns chosen under different scoring schemes achieve a good precision (above 75%-80%) with a recall around 50%-60%.",
                    "sid": 150,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall F-measure for NWire, NPaper and BNews is 64.9%, 64.9% and 62.0% respectively.",
                    "sid": 151,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are comparable to those reported in (Ng, 2005) which uses similar features and gets an F-measure of about 62% for the same data set.",
                    "sid": 152,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest lines of Table 1 are for the systems using the pattern based information.",
                    "sid": 153,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all the systems, we examine the utility of the semantic information in resolving different types of NP Pairs: (1) NP Pairs containing proper names (i.e., Name:Name or Name:Definites), and (2) NP Pairs of all types.",
                    "sid": 154,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Table 1 (Line 25), we also list the results of incorporating two commonly used patterns, “X(s) such as Y” and “X and other Y(s)”.",
                    "sid": 155,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can find that neither of the manually designed patterns has significant impact on the resolution performance.",
                    "sid": 156,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For all the domains, the manual patterns just achieve slight improvement in recall (below 0.6%), indicating that coverage of the patterns is not broad enough.",
                    "sid": 157,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2.1 Pattern Features In Section 4.3.1 we propose a strategy that directly uses the patterns as features.",
                    "sid": 158,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 lists the top patterns that are sorted based on frequency, filtered frequency (by accuracy), and PMI reliability, on the NWire domain for illustration.",
                    "sid": 159,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the table, evaluated only based on frequency, the top patterns are those that indicate the appositive structure like “X, an/a/the Y ”.",
                    "sid": 160,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, if filtered by accuracy, patterns of such a kind will be removed.",
                    "sid": 161,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, the top patterns with both high frequency and high accuracy are those for the copula structure, like “X is/was/are Y ”.",
                    "sid": 162,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sorted by PMI reli ability, patterns for the above two structures can be seen in the top of the list.",
                    "sid": 163,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results are consistent with the findings in (Cimiano and Staab, 2004) that the appositive and copula structures are indicative to find the is-a relation.",
                    "sid": 164,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, the two commonly used patterns “X(s) such as Y” and “X and other Y(s)” were found in the feature lists (not shown in the table).",
                    "sid": 165,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their importance for coreference resolution will be determined automatically by the learning algorithm.",
                    "sid": 166,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An interesting pattern seen in the lists is “X || Y |”, which represents the cases when Y and X appear in the same of line of a table in Wikipedia.",
                    "sid": 167,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the following text “American || United States | Washington D.C. | . . .",
                    "sid": 168,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "” is found in the table “list of empires”.",
                    "sid": 169,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the pair “American:United States”, which is deemed coreferential in ACE, can be identified by the pattern.",
                    "sid": 170,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sixth till the eleventh lines of Table 1 list the results of the system with pattern features.",
                    "sid": 171,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the table, adding the pattern features brings the improvement of the recall against the baseline.",
                    "sid": 172,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Take the system based on filtered frequency as an example.",
                    "sid": 173,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can observe that the recall increases by up to 3.3% (for NWire).",
                    "sid": 174,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we see the precision drops (up to 1.2% for NWire) at the same time.",
                    "sid": 175,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall the system achieves an F-measure better than the baseline in NWire (1.9%), while equal (±0.2%) in NPaper and BNews.",
                    "sid": 176,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among the three ranking schemes, simply using frequency leads to the lowest precision.",
                    "sid": 177,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By contrast, using filtered frequency yields the highest precision with nevertheless the lowest recall.",
                    "sid": 178,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is reasonable since the low accuracy features prone to false posi NameAlias = 0: :..Appositive = 1: ...",
                    "sid": 179,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Appositive = 0: :..P014 > 0: :...P003 <= 4: 0 (3) : P003 > 4: 1 (25) P014 <= 0: :..P004 > 0:...",
                    "sid": 180,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P004 <= 0: :..P027 > 0: 1 (25/7) P027 <= 0: :..P002 > 0: ...",
                    "sid": 181,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P002 <= 0: :..P005 > 0: 1 (49/22) P005 <= 0: :..String_Match = 1: . String_Match = 0: . // p002: <t1> ) is a <t2> // P003: <t1> ) is an <t2> // P004: <t2> ) is an <t1> // p005: <t2> ) is a <t1> // P014: <t1> ) was an <t2> // p027: <t1> , ( <t2> , Figure 1: The decision tree (NWire domain) for the system using pattern features (filtered frequency) (feature String Match records whether the string of anaphor NP j matches that of a candidate antecedent NP i) tive NP pairs are eliminated, at the price of recall.",
                    "sid": 182,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using PMI Reliability can achieve the highest recall with a medium level of precision.",
                    "sid": 183,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we do not find significant difference in the overall F- measure for all these three schemes.",
                    "sid": 184,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This should be due to the fact that the pattern features need to be further chosen by the learning algorithm, and only those patterns deemed effective by the learner will really matter in the real resolution.",
                    "sid": 185,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the table, the pattern features only work well for NP pairs containing proper names.",
                    "sid": 186,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Applied on all types of NP pairs, the pattern features further boost the recall of the systems, but in the meanwhile degrade the precision significantly.",
                    "sid": 187,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The F-measure of the systems is even worse than that of the baseline.",
                    "sid": 188,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our error analysis shows that a non-anaphor is often wrongly resolved to a false antecedent once the two NPs happen to satisfy a pattern feature, which affects precision largely (as an evidence, the decrease of precision is less significant when using filtered frequency than using frequency).",
                    "sid": 189,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Still, these results suggest that we just apply the pattern based semantic information in resolving proper names which, in fact, is more compelling as the semantic information of common nouns could be more easily retrieved from WordNet.",
                    "sid": 190,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also notice that the patterned based semantic information seems more effective in the NWire domain than the other two.",
                    "sid": 191,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Especially for NPaper, the improvement in F-measure is less than 0.1% for all the systems tested.",
                    "sid": 192,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The error analysis indicates it may be because (1) there are less NP pairs in NPaper than in NWire that require the external seman tic knowledge for resolution; and (2) For many NP pairs that require the semantic knowledge, no co- occurrence can be found in the Wikipedia corpus.",
                    "sid": 193,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To address this problem, we could resort to the Web which contains a larger volume of texts and thus could lead to more informative patterns.",
                    "sid": 194,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would like to explore this issue in our future work.",
                    "sid": 195,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Figure 1, we plot the decision tree learned with the pattern features for non-pronoun resolution (NWire domain, filtered frequency), which visually illustrates which features are useful in the reference determination.",
                    "sid": 196,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can find the pattern features occur in the top of the decision tree, among the features for name alias, apposition and string-matching that are crucial for coreference resolution as reported in previous work (Soon et al., 2001).",
                    "sid": 197,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of the pattern features deemed important by the learner are for the copula structure.",
                    "sid": 198,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2.2 Single Semantic Relatedness Feature Section 4.3.2 presents another strategy to exploit the patterns, which uses a single feature to reflect the semantic relatedness between NP pairs.",
                    "sid": 199,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last two lines of Table 1 list the results of such a system.",
                    "sid": 200,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Observed from the table, the system with the single semantic relatedness feature beats those with other solutions.",
                    "sid": 201,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared with the baseline, the system can get improvement in recall (up to 2.9% as in NWire), with a similar or even higher precision.",
                    "sid": 202,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall F-measure it produces is 67.1%, 65.0% and 62.7%, better than the baseline in all the domains.",
                    "sid": 203,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Especially in the NWire domain, we can see the significant (t-test, p ≤ 0.05) improvement of 2.1% in F-measure.",
                    "sid": 204,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When applied on All-Type NP pairs, the degrade of performance is less significant as using pattern features.",
                    "sid": 205,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting performance is better than the baseline or equal.",
                    "sid": 206,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared with the systems using the pattern features, it can still achieve a higher precision and F-measure (with a little loss in recall) . There are several reasons why the single semantic relatedness feature (SRel) can perform better than the set of pattern features.",
                    "sid": 207,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Firstly, the feature value of SRel takes into consideration the information of all the patterns, instead of only the selected patterns.",
                    "sid": 208,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondly, since the SRel feature is computed based on all the patterns, it reduces the risk of false posi NameAlias = 0: :..Appositive = 1: ...",
                    "sid": 209,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Appositive = 0: :..SRel > 28: :..SRel > 47: ...",
                    "sid": 210,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": ": SRel <= 47: ...",
                    "sid": 211,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SRel <= 28: :..String_Match = 1: ...",
                    "sid": 212,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "String_Match = 0: ...",
                    "sid": 213,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2: The decision tree (Nwire) for the system using the single semantic relatedness feature tive when a NP pair happens to satisfy one or several pattern features.",
                    "sid": 214,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lastly, from the point of view of machine learning, using only one semantic feature, instead of hundreds of pattern features, can avoid overfitting and thus benefit the classifier learning.",
                    "sid": 215,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Figure 2, we also show the decision tree learned with the semantic relatedness feature.",
                    "sid": 216,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We observe that the decision tree is simpler than that with pattern features as depicted in Figure 1.",
                    "sid": 217,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After feature name-alias and apposite, the classifier checks different ranges of the SRel value and make different resolution decision accordingly.",
                    "sid": 218,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This figure further illustrates the importance of the semantic feature.",
                    "sid": 219,
                    "ssid": 92,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "6",
            "sents": [
                {
                    "text": "In this paper we present a pattern based approach to coreference resolution.",
                    "sid": 220,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different from the previous work which utilizes manually designed patterns, our approach can automatically discover the patterns effective for the coreference resolution task.",
                    "sid": 221,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our study, we explore how to acquire and evaluate patterns, and investigate how to exploit the patterns to mine semantic relatedness information for coreference resolution.",
                    "sid": 222,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evaluation on ACE data set shows that the patterned based features, when applied on NP pairs containing proper names, can effectively help the performance of coreference resolution in the recall (up to 4.3%) and the overall F-measure (up to 2.1%).",
                    "sid": 223,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results also indicate that using the single semantic relatedness feature has more advantages than using a set of pattern features.",
                    "sid": 224,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For future work, we intend to investigate our approach in more difficult tasks like the bridging anaphora resolution, in which the semantic relations involved are more complicated.",
                    "sid": 225,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, we would like to explore the approach in technical (e.g., biomedical) domains, where jargons are frequently seen and the need for external knowledge is more compelling.",
                    "sid": 226,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Acknowledgements This research is supported by a Specific Targeted Research Project (STREP) of the European Union’s 6th Framework Programme within IST call 4, Boot- strapping Of Ontologies and Terminologies STrategic REsearch Project (BOOTStrep).",
                    "sid": 227,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}