{
    "ID": "P07-1016",
    "sections": [
        {
            "text": "introduction. ",
            "number": "1",
            "sents": [
                {
                    "text": "The study of Chinese transliteration dates back to the seventh century when Buddhist scriptures were translated into Chinese.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The earliest bit of Chinese translation theory related to transliteration may be the principle of “Names should follow their bearers, while things should follow Chinese.” In other words, names should be transliterated, while things should be translated according to their meanings.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same theory still holds today.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Transliteration has been practiced in several ways, including phonetic transliteration and phonetic-semantic transliteration.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By phonetic 120 geo- in geometry into Chinese as 几何 /Ji-He/, which carries the pronunciation of geo- and expresses the meaning of “a science concerned with measuring the earth”.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many of the loanwords exist in today’s Chinese through semantic transliteration, which has been well received (Hu and Xu, 2003; Hu, 2004) by the people because of many advantages.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here we just name a few.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) It brings in not only the sound, but also the meaning that fills in the semantic blank left by phonetic transliteration.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This also reminds people that it is a loanword and avoids misleading; (2) It provides etymological clues that make it easy to trace back to the root of the words.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, a transliterated Japanese name will maintain its Japanese identity in its Chinese appearance; (3) It evokes desirable associations, for example, an English girl’s name is transliterated with Chinese characters that have clear feminine association, thus maintaining the gender identity.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 Hereafter, Chinese characters are also denoted in Pinyin ro-.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "manization system, for ease of reference.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "xu quangqi (1562–1633) translated the original manu-. ",
            "number": "2",
            "sents": [
                {
                    "text": "script of Geometry to Chinese jointly with Matteo Ricci.",
                    "sid": 13,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Proceedings of the 45th Annual Meeting of the Association of Computational Linguistics, pages 120–127, Prague, Czech Republic, June 2007.",
                    "sid": 14,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2007 Association for Computational Linguistics Unfortunately, most of the reported work in the area of machine transliteration has not ventured into semantic transliteration yet.",
                    "sid": 15,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Latin-scripted personal names are always assumed to homogeneously follow the English phonic rules in automatic transliteration (Li et al., 2004).",
                    "sid": 16,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the same transliteration model is applied to all the names indiscriminatively.",
                    "sid": 17,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This assumption degrades the performance of transliteration because each language has its own phonic rule and the Chinese characters to be adopted depend on the following semantic attributes of a foreign name.",
                    "sid": 18,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) Language of origin: An English word is not necessarily of pure English origin.",
                    "sid": 19,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In English news reports about Asian happenings, an English personal name may have been originated from Chinese, Japanese or Korean.",
                    "sid": 20,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The language origin affects the phonic rules and the characters to be used in transliteration3 . For example, a Japanese name Matsumoto should be transliterated as 松本 /Song-Ben/, instead of 马茨莫托 /Ma-Ci-MoTuo/ as if it were an English name.",
                    "sid": 21,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Gender association: A given name typically implies a clear gender association in both the source and target languages.",
                    "sid": 22,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the Chinese transliterations of Alice and Alexandraare 爱丽丝 /AiLi-Si/ and 亚历山大 /YaLi-Shan Da/ respectively, showing clear feminine and masculine characteristics.",
                    "sid": 23,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Transliterating Alice as 埃里 斯 /AiLi-Si/ is phonetically correct, but semantically inadequate due to an improper gender association.",
                    "sid": 24,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) Surname and given name: The Chinese name system is the original pattern of names in Eastern Asia such as China, Korea and Vietnam, in which a limited number of characters 4 are used for surnames while those for given names are less restrictive.",
                    "sid": 25,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even for English names, the character set for given name transliterations are different from that for surnames.",
                    "sid": 26,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here are two examples of semantic transliteration for personal names.",
                    "sid": 27,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "George Bush",
                    "sid": 28,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "in the literature (knight and graehl,1998; qu et al., 2003),. ",
            "number": "3",
            "sents": [
                {
                    "text": "translating romanized Japanese or Chinese names to Chinese characters is also known as back-transliteration.",
                    "sid": 29,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For simplicity, we consider all conversions from Latin-scripted words to Chinese as transliteration in this paper.",
                    "sid": 30,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chinese population (Ning and Ning 1995).",
                    "sid": 31,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and Yamamoto Akiko are transliterated into 乔治 布什 and 山本 亚喜子 that arouse to the following associations: 乔治 /QiaoZhi/ - male given name, English origin; 布什 /BuShi/ - surname, English origin; 山本 /ShanBen/ - surname, Japanese origin; 亚喜子 /YaXi-Zi/ female given name, Japanese origin.",
                    "sid": 32,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 2, we summarize the related work.",
                    "sid": 33,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 3, we discuss the linguistic feasibility of semantic transliteration for personal names.",
                    "sid": 34,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 formulates a probabilistic model for semantic transliteration.",
                    "sid": 35,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 5 reports the experiments.",
                    "sid": 36,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we conclude in Section 6.",
                    "sid": 37,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Related Work.",
                    "sid": 38,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, computational studies of transliteration fall into two categories: transliteration modeling and extraction of transliteration pairs.",
                    "sid": 39,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In transliteration modeling, transliteration rules are trained from a large, bilingual transliteration lexicon (Lin and Chen, 2002; Oh and Choi, 2005), with the objective of translating unknown words on the fly in an open, general domain.",
                    "sid": 40,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the extraction of transliterations, data-driven methods are adopted to extract actual transliteration pairs from a corpus, in an effort to construct a large, up- to-date transliteration lexicon (Kuo et al., 2006; Sproat et al., 2006).",
                    "sid": 41,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Phonetic transliteration can be considered as an extension to the traditional grapheme-to-phoneme (G2P) conversion (Galescu and Allen, 2001), which has been a much-researched topic in the field of speech processing.",
                    "sid": 42,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we view the grapheme and phoneme as two symbolic representations of the same word in two different languages, then G2P is a transliteration task by itself.",
                    "sid": 43,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although G2P and phonetic transliteration are common in many ways, transliteration has its unique challenges, especially as far as E-C transliteration is concerned.",
                    "sid": 44,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "E-C transliteration is the conversion between English graphemes, phonetically associated English letters, and Chinese graphemes, characters which represent ideas or meanings.",
                    "sid": 45,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a Chinese transliteration can arouse to certain connotations, the choice of Chinese characters becomes a topic of interest (Xu et al., 2006).",
                    "sid": 46,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantic transliteration can be seen as a subtask of statistical machine translation (SMT) with monotonic word ordering.",
                    "sid": 47,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By treating a letter/character as a word and a group of letters/characters as a phrase or token unit in SMT, one can easily apply the traditional SMT models, such as the IBM generative model (Brown et al., 1993) or the phrase-based translation model (Crego et al., 2005) to transliteration.",
                    "sid": 48,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In transliteration, we face similar issues as in SMT, such as lexical mapping and alignment.",
                    "sid": 49,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, transliteration is also different from general SMT in many ways.",
                    "sid": 50,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike SMT where we aim at optimizing the semantic transfer, semantic transliteration needs to maintain the phonetic equivalence as well.",
                    "sid": 51,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In computational linguistic literature, much effort has been devoted to phonetic transliteration, such as EnglishArabic, EnglishChinese (Li et al., 2004), EnglishJapanese (Knight and Graehl, 1998) and EnglishKorean.",
                    "sid": 52,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In G2P studies, Font Llitjos and Black (2001) showed how knowledge of language of origin may improve conversion accuracy.",
                    "sid": 53,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately semantic transliteration, which is considered as a good tradition in translation practice (Hu and Xu, 2003; Hu, 2004), has not been adequately addressed computationally in the literature.",
                    "sid": 54,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some recent work (Li et al., 2006; Xu et al., 2006) has attempted to introduce preference into a probabilistic framework for selection of Chinese characters in phonetic transliteration.",
                    "sid": 55,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, there is neither analytical result nor semantic-motivated transliteration solution being reported.",
                    "sid": 56,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 Feasibility of Semantic Transliteration.",
                    "sid": 57,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Latin-scripted personal name is written in letters, which represent the pronunciations closely, whereas each Chinese character represents not only the syllables, but also the semantic associations.",
                    "sid": 58,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, character rendering is a vital issue in transliteration.",
                    "sid": 59,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Good transliteration adequately projects semantic association while an inappropriate one may lead to undesirable interpretation.",
                    "sid": 60,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Is semantic transliteration possible?",
                    "sid": 61,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let’s first conduct an inquiry into the feasibility of semantic transliteration on 3 bilingual name corpora, which are summarizied in Table 1 and will be used in experiments.",
                    "sid": 62,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "E-C corpus is an augmented version of Xinhua English to Chinese dictionary for English names (Xinhua, 1992).",
                    "sid": 63,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "J-C corpus is a romanized Japanese to Chinese dictionary for Japanese names.",
                    "sid": 64,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The C-C corpus is a Chinese Pinyin to character dictionary for Chinese names.",
                    "sid": 65,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The entries are classified into surname, male and female given name categories.",
                    "sid": 66,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The E-C corpus also contains some entries without gender/surname labels, referred to as unclassified.E C 5J C 6C C Su rn am e (S) 12, 49 0 36, 35 2 56 9,4 03 Gi ve n na me (M ) 3,2 01 35, 76 7 34 5,0 44 Gi ve n na me (F) 4,2 75 11, 81 7 12 2,7 72 Un cla ssi fie d 22, 56 2 Al l 42, 52 8 83, 93 6 1,9 72, 85 1 Table 1: Number of entries in 3 corpora Phonetic transliteration has not been a problem as Chinese has over 400 unique syllables that are enough to approximately transcribe all syllables in other languages.",
                    "sid": 67,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different Chinese characters may render into the same syllable and form a range of homonyms.",
                    "sid": 68,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among the homonyms, those arousing positive meanings can be used for personal names.",
                    "sid": 69,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As discussed elsewhere (Sproat et al., 1996), out of several thousand common Chinese characters, a subset of a few hundred characters tends to be used overwhelmingly for transliterating English names to Chinese, e.g. only 731 Chinese characters are adopted in the E-C corpus.",
                    "sid": 70,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the character sets are shared across languages and genders, the statistics in Table 2 show that each semantic attribute is associated with some unique characters.",
                    "sid": 71,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the C-C corpus, out of the total of 4,507 characters, only 776 of them are for surnames.",
                    "sid": 72,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is interesting to find that female given names are represented by a smaller set of characters than that for male across 3 corpora.",
                    "sid": 73,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "E C J C C C A l l S 3 2 7 2, 1 2 9 7 7 6 2,6 12 (1 9.2 %) M 5 0 4 1, 3 9 9 4, 3 4 0 4,9 95 (2 0.0 %) F 4 7 9 1, 1 7 8 1, 3 1 8 2,1 92 (2 6.3 %) Al l 7 3 1 (4 4.",
                    "sid": 74,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 % ) 2 ,5 3 3 (4 6.",
                    "sid": 75,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 % ) 4 ,5 0 7 (3 0.",
                    "sid": 76,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 % ) 5,7 79 (5 3.6 %) Table 2: Chinese character usage in 3 corpora.",
                    "sid": 77,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The numbers in brackets indicate the percentage of characters that are shared by at least 2 corpora.",
                    "sid": 78,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the overlap of Chinese characters usage across genders is higher than that across languages.",
                    "sid": 79,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, there is a 44.2% overlap 5 http://www.cjk.org 6 http://technology.chtsai.org/namelist across gender for the transcribed English names; P(L, G | S ) is the probability of the language and but only 19.2% overlap across languages for the surnames.",
                    "sid": 80,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In summary, the semantic attributes of personal names are characterized by the choice of characters, and therefore their n-gram statistics as well.",
                    "sid": 81,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the the gender given the source, S. Given the alignment between S and T, the transliteration probability given L and G may be written as I ∏ i 1 1 (4) attributes are known in advance, then the semantic transliteration is absolutely feasible.",
                    "sid": 82,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We may obtain the semantic attributes from the context P(T | S , L, G) = i =1 I P(t | T i −1 , S i ) through trigger words.",
                    "sid": 83,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, from “Mr Tony Blair”, we realize “Tony” is a male given ≈ ∏ P(ti | ti −1 , si −1 , si ) i =1 (5) name while “Blair” is a surname; from “Japanesewhere s and t are the ith token of S and T respec Prime Minister Koizumi”, we resolve that i i “Koizumi” is a Japanese surname.",
                    "sid": 84,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case tively and I is the total number of tokens in both S where contextual trigger words are not available, and T. S k and T k represent the sequence of tokens we study detecting the semantic attributes from the personal names themselves in the next section.",
                    "sid": 85,
                    "ssid": 57,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "formulation of transliteration model. ",
            "number": "4",
            "sents": [
                {
                    "text": "Let S and T denote the name written in the source and target writing systems respectively.",
                    "sid": 86,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Within a probabilistic framework, a transliteration system (s j , s j +1 ,K, sk ) and (t j , t j +1 ,K, tk ) respectively.",
                    "sid": 87,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Eq.",
                    "sid": 88,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4) is in fact the n-gram likelihood of the token pair 〈ti , si 〉 sequence and Eq.",
                    "sid": 89,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5) approximates this probability using a bigram language model.",
                    "sid": 90,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This model is conceptually similar to the joint source- channel model (Li et al., 2004) where the target to ken t depends on not only its source token s but produces the optimum target name, T*, which i i yields the highest posterior probability given the source name, S, i.e. also the history ti −1 and si −1 . Each character in the target name forms a token.",
                    "sid": 91,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To obtain the source T * = arg max P(T | S ) T∈T S (1) tokens, the source and target names in the training data are aligned using the EM algorithm.",
                    "sid": 92,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This yields a set of possible source tokens and a map where T S is the set of all possible transliterati ons ping between the source and target tokens.",
                    "sid": 93,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During for the source name, S. The alignment between S and T is assumed implicit in the above formulation.",
                    "sid": 94,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a standard phonetic transliteration system, P(T | S ) , the posterior probability of the hypothe sized transliteration, T, given the source name, S, is directly modeled without considering any form of semantic information.",
                    "sid": 95,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, semantic testing, each source name is first segmented into all possible token sequences given the token set.",
                    "sid": 96,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These source token sequences are mapped to the target sequences to yield an N-best list of transliteration candidates.",
                    "sid": 97,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each candidate is scored using an n-gram language model given by Eqs.",
                    "sid": 98,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4) or (5).",
                    "sid": 99,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in Eq.",
                    "sid": 100,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3), the transliteration also greatly transliteration described in this paper incorporates depends on the prior knowledge, P(L, G | S ) .language of origin and gender information to cap ture the semantic structure.",
                    "sid": 101,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To do so, P(T | S ) is When no prior knowledge is available, a uniform probability distribution is assumed.",
                    "sid": 102,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By expressing rewritten as P(L, G | S ) in the following form, P(T | S ) = ∑ P(T , L, G | S ) L∈L ,G∈G (2) P(L, G | S ) = P(G | L, S )P(L | S ) (6) = ∑ P(T | S , L, G)P(L, G | S ) L∈L ,G∈G (3) prior knowledge about language and gender may be incorporated.",
                    "sid": 103,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if the language of S where P(T | S , L, G) is the transliteration probabil is known as Ls , we have ity from source S to target T, given the language of origin (L) and gender (G) labels.",
                    "sid": 104,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "L and G denote ⎧1 P(L | S ) = ⎨ ⎩ L = Ls L ≠ Ls (7) the sets of languages and genders respectively.",
                    "sid": 105,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, if the gender information for S is known as Gs , then, ⎧1 P(G | L, S ) = ⎨ ⎩0 G = Gs G ≠ Gs (8) language origins (Japanese, Chinese and English) and gender information (surname 7 , male and female).",
                    "sid": 106,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the experiments of determining the lan Note that personal names have clear semantic associations.",
                    "sid": 107,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case where the semantic attribute information is not available, we propose learning semantic information from the names themselves.",
                    "sid": 108,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using Bayes’ theorem, we haveguage origin, we used the full data set for the 3 lan guages as in shown in Table 1.",
                    "sid": 109,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training and test data for semantic transliteration are the subset of Table 1 comprising those with surnames, male and female given names labels.",
                    "sid": 110,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, J, C and P(L, G | S ) = P(S | L, G)P(L, G) P(S ) (9) E stand for Japanese, Chinese and English; S, M and F represent Surname, Male and Female given names, respectively.P(S | L, G) can be modeled using an n-gram lan guage model for the letter sequence of all the Latin-scripted names in the training set.",
                    "sid": 111,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The prior probability, P(L, G) , is typically uniform.",
                    "sid": 112,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P(S ) does not depend on L and G, thus can be omitted.",
                    "sid": 113,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Incorporating P(L, G | S ) into Eq.",
                    "sid": 114,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) can be viewed as performing a soft decision of the language and gender semantic attributes.",
                    "sid": 115,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By contrast, hard decision may also be performed based on maximum likelihood approach: Table 3: Number of unique entries in training and test sets, categorized by semantic attributes Ls = arg max P(S | L) L∈L G s = arg max P(S | L, G) G∈G (10) (11) Table 3 summarizes the number of unique8 name entries used in training and testing.",
                    "sid": 116,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The test sets were randomly chosen such that the amount of test data is approximately 1020% of the whole corpus.",
                    "sid": 117,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "where Ls and G s are the detected language and There were no overlappin g entries between thegender of S respectively.",
                    "sid": 118,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, for hard decitraining and test data.",
                    "sid": 119,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the Chinese sur sion, P(L, G | S ) is obtained by replacing Ls and names are typically single characters in a small set; we assume there is no unseen surname in the test Gs in Eq.",
                    "sid": 120,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(7) and (8) with Ls andG s respec set.",
                    "sid": 121,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the Chinese surname entries are used for tively.",
                    "sid": 122,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although hard decision eliminates the need to compute the likelihood scores for all possible pairs of L and G, the decision errors made in the early stage will propagate to the transliteration stage.",
                    "sid": 123,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is potentially bad if a poor detector is used (see Table 9 in Section 5.3).",
                    "sid": 124,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we are unable to model the prior knowledge of semantic attributes P(L, G | S ) , then a more both training and testing.",
                    "sid": 125,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each language of origin, a 4-gram language model was trained for the letter sequence of the source names, with a 1-letter shift.",
                    "sid": 126,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "general model will be used for P(T | S , L, G) by dropping the dependency on the information that is not available.",
                    "sid": 127,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Eq.",
                    "sid": 128,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) is reduced Table 4: Language detection accuracies (%) using a 4-gram language model for the letter sequence of to ∑L∈L P(T | S , L)P(L | S ) if the gender informati on the source name in Latin script.",
                    "sid": 129,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is missing.",
                    "sid": 130,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that when both language and gender are unknown, the system simplifies to the baseline phonetic transliteration system.",
                    "sid": 131,
                    "ssid": 46,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "5",
            "sents": [
                {
                    "text": "This section presents experiments on database of 3 7 In this paper, surnames are treated as a special class of gen-.",
                    "sid": 132,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "der.",
                    "sid": 133,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike given names, they do not have any gender association.",
                    "sid": 134,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, they fall into a third category which is neither male nor female.",
                    "sid": 135,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 By contrast, Table 1 shows the total number of name exam-.",
                    "sid": 136,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ples available.",
                    "sid": 137,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each unique entry, there may be multiple examples.",
                    "sid": 138,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 shows the language detection accuracies for all the 3 languages using Eq.",
                    "sid": 139,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(10).",
                    "sid": 140,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall detection accuracy is 94.81%.",
                    "sid": 141,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corresponding Equal Error Rate (EER)9 is 4.52%.",
                    "sid": 142,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The detection results may be used directly to infer the semantic information for transliteration.",
                    "sid": 143,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alternatively, the language model likelihood scores may be incorporated into the Bayesian framework to improve the transliteration performance, as described in Section 4.",
                    "sid": 144,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Gender Association.",
                    "sid": 145,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, gender detection 10 was performed by training a 4-gram language model for the letter sequence of the source names for each language and gender pair.",
                    "sid": 146,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "La ng ua ge M a l e F e m al e A l l Ja pa ne se 9 0 . 5 4 8 0 . 4 3 8 7 . 0 3 C hi n e s e 6 4 . 3 4 7 1 . 6 6 6 6 . 5 2 E n g li s h 7 5 . 2 0 7 2 . 2 6 7 3 . 6 2 Table 5: Gender detection accuracies (%) using a 4-gram language model for the letter sequence of the source name in Latin script.",
                    "sid": 147,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 summarizes the gender detection accuracies using Eq.",
                    "sid": 148,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(11) assuming language of origin is word when computing MRR.",
                    "sid": 149,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word and character accuracies of the top best hypotheses are also reported.",
                    "sid": 150,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the phonetic transliteration system as the baseline to study the effects of semantic transliteration.",
                    "sid": 151,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The phonetic transliteration system was trained by pooling all the available training data from all the languages and genders to estimate a language model for the source-target token pairs.",
                    "sid": 152,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6 compares the MRR performance of the baseline system using unigram and bigram language models for the source-target token pairs.",
                    "sid": 153,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "J C E A l l U ni gr a m 0.",
                    "sid": 154,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "51 09 0.",
                    "sid": 155,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "48 69 0.",
                    "sid": 156,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "25 98 0.",
                    "sid": 157,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "44 43 B ig ra m 0.",
                    "sid": 158,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "54 12 0.",
                    "sid": 159,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "52 61 0.",
                    "sid": 160,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "33 95 0.",
                    "sid": 161,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "48 95 Table 6: MRR performance of phonetic transliteration for 3 corpora using unigram and bigram language models.",
                    "sid": 162,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The MRR performance for Japanese and Chinese is in the range of 0.480.55.",
                    "sid": 163,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, due to the small amount of training and test data, the MRR performance of the English name transliteration is slightly poor (approximately 0.260.34).",
                    "sid": 164,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, a bigram language model gave an overall relative improvement of 10.2% over a unigram model.",
                    "sid": 165,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "known, G s = arg max P(S | L = Ls , G) . The overall G ∈ G detection accuracies are 87.03%, 66.52% and 73.62% for Japanese, Chinese and English respectively.",
                    "sid": 166,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corresponding EER are 13.1%, 21.8% and 19.3% respectively.",
                    "sid": 167,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that gender detection is generally harder than language detection.",
                    "sid": 168,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because the tokens (syllables) are shared very much across gender categories, while they are quite different from one language to another.",
                    "sid": 169,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.3 Semantic Transliteration.",
                    "sid": 170,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance was measured using the Mean Reciprocal Rank (MRR) metric (Kantor and Voorhees, 2000), a measure that is commonly used in information retrieval, assuming there is precisely one correct answer.",
                    "sid": 171,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each transliteration system generated at most 50-best hypotheses for each 9 EER is defined as the error of false acceptance and false re-.",
                    "sid": 172,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "jection when they are equal.",
                    "sid": 173,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10 In most writing systems, the ordering of surname and.",
                    "sid": 174,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "given name is known.",
                    "sid": 175,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, gender detection is only performed for male and female classes.",
                    "sid": 176,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 7: The effect of language and gender information on the overall MRR performance of transliteration (L=Language, G=Gender, 2=unknown, 3=known, c=soft decision).",
                    "sid": 177,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, the scenarios with perfect language and/or gender information were considered.",
                    "sid": 178,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This com parison is summarized in Table 7.",
                    "sid": 179,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the MRR results are based on transliteration systems using bi- gram language models.",
                    "sid": 180,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The table clearly shows that having perfect knowledge, denoted by “3”, of language and gender helps improve the MRR performance; detecting semantic attributes using soft decision, denoted by “c”, has a clear win over thebaseline, denoted by “2”, where semantic informa tion is not used.",
                    "sid": 181,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results strongly recommend the use of semantic transliteration for personal names in practice.",
                    "sid": 182,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next let’s look into the effects of automatic language and gender detection on the performance.",
                    "sid": 183,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "names (see Table 5), hard decision of gender had led to deterioration in MRR performance of the male names compared to the case where no prior information was assumed.",
                    "sid": 184,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Soft decision of gender yielded further gains of 17.1% and 13.9% relative improvements for male and female given names respectively, over the hard decision method.",
                    "sid": 185,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 8: The effect of language detection schemes on MRR using bigram language models and unknown gender information (hereafter, 2=unknown, 3=known, \u0091=hard decision, c=soft decision).",
                    "sid": 186,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 8 compares the MRR performance of the semantic transliteration systems with different prior information, using bigram language models.",
                    "sid": 187,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Soft decision refers to the incorporation of the language model scores into the transliteration process to improve the prior knowledge in Bayesian inference.",
                    "sid": 188,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall, both hard and soft decision methods gave similar MRR performance of approximately 0.5750, which was about 17.5% relatively improvement compared to the phonetic transliteration system with 0.4895 MRR.",
                    "sid": 189,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hard decision scheme owes its surprisingly good performance to the high detection accuracies (see Table 4).",
                    "sid": 190,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "S M F A l l 2 0.",
                    "sid": 191,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "68 25 0.",
                    "sid": 192,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "54 22 0.",
                    "sid": 193,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "50 62 0.",
                    "sid": 194,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "59 52 \u0091 0.",
                    "sid": 195,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "72 16 0.",
                    "sid": 196,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "46 74 0.",
                    "sid": 197,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "51 62 0.",
                    "sid": 198,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "58 55 c 0.",
                    "sid": 199,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "72 16 0.",
                    "sid": 200,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "54 73 0.",
                    "sid": 201,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "58 78 0.",
                    "sid": 202,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "62 67 3 0.",
                    "sid": 203,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "72 16 0.",
                    "sid": 204,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "63 68 0.",
                    "sid": 205,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "67 86 0.",
                    "sid": 206,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "68 12 Table 9: The effect of gender detection schemes on MRR using bigram language models with perfect language information.",
                    "sid": 207,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, the effect of various gender detection methods used to obtain the prior information is shown in Table 9.",
                    "sid": 208,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The language information was assumed known a-priori.",
                    "sid": 209,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the poorer detection accuracy for the Chinese male given Table 10: Overall transliteration performance using bigram language model with various lan guage and gender information.",
                    "sid": 210,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, Table 10 compares the performance of various semantic transliteration systems using bi- gram language models.",
                    "sid": 211,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline phonetic transliteration system yielded 36.87% and 58.39% accuracies at word and character levels respectively; and 0.4895 MRR.",
                    "sid": 212,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be conjectured from the results that semantic transliteration is substantially superior to phonetic transliteration.",
                    "sid": 213,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, knowing the language information improved the overall MRR performance to 0.5952; and with additional gender information, the best performance of 0.6812 was obtained.",
                    "sid": 214,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, both hard and soft decision of semantic information improved the performance, with the latter being substantially better.",
                    "sid": 215,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both the word and character accuracies improvements were consistent and have similar trend to that observed for MRR.",
                    "sid": 216,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of the semantic transliteration using soft decisions (last row of Table 10) achieved 25.1%, 33.9%, 18.5% relative improvement in MRR, word and character accuracies respectively over that of the phonetic transliteration (first row of Table 10).",
                    "sid": 217,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, soft decision also presented 5.1%, 4.9% and 3.5% relative improvement over hard decision in MRR, word and character accuracies respectively.",
                    "sid": 218,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.4 Discussions.",
                    "sid": 219,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It was found that the performance of the baseline phonetic transliteration may be greatly improved by incorporating semantic information such as the language of origin and gender.",
                    "sid": 220,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, it was found that the soft decision of language and gender outperforms the hard decision approach.",
                    "sid": 221,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The soft decision method incorporates the semantic scores P(L, G | S ) with transliteration scores P(T | S , L, G) , involving all possible semantic specific models in the decoding process.",
                    "sid": 222,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, there are 9 such models (3 languages × 3 genders).",
                    "sid": 223,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hard decision relies on Eqs.",
                    "sid": 224,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(10) and (11) to decide language and gender, which only involves one semantic specific model in the decoding.",
                    "sid": 225,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Neither soft nor hard decision requires any prior information about the names.",
                    "sid": 226,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It provides substantial performance improvement over phonetic transliteration at a reasonable computational cost.",
                    "sid": 227,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the prior semantic information is known, e.g. via trigger words, then semantic transliteration attains its best performance.",
                    "sid": 228,
                    "ssid": 97,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "6",
            "sents": [
                {
                    "text": "Transliteration is a difficult, artistic human endeavor, as rich as any other creative pursuit.",
                    "sid": 229,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Research on automatic transliteration has reported promising results for regular transliteration, where transliterations follow certain rules.",
                    "sid": 230,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The generative of proper names.",
                    "sid": 231,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Proc.",
                    "sid": 232,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of Eurospeech, Denmark, pp 19191922.",
                    "sid": 233,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lucian Galescu and James F. Allen.",
                    "sid": 234,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2001, Bidirectional Conversion between Graphemes and Phonemes using a Joint N-gram Model, In Proc.",
                    "sid": 235,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4th ISCA Tutorial and Research Workshop on Speech Synthesis, Scotland, pp.",
                    "sid": 236,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "103108.",
                    "sid": 237,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Peter Hu, 2004, Adapting English to Chinese, English Today, 20(2), pp.",
                    "sid": 238,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3439.",
                    "sid": 239,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qingping Hu and Jun Xu, 2003, Semantic Transliteration: A Good Tradition in Translating Foreign Words into Chinese Babel: International Journal of Translation, Babel, 49(4), pp.",
                    "sid": 240,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "310326.",
                    "sid": 241,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paul B. Kantor and Ellen M. Voorhees, 2000, The TREC5 Confusion Track: Comparing Retrieval Methods for Scanned Text.",
                    "sid": 242,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Informational Retrieval, 2, pp.",
                    "sid": 243,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "165176.",
                    "sid": 244,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "K. Knight and J. Graehl.",
                    "sid": 245,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1998.",
                    "sid": 246,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Machine Transliteration, Computational Linguistics 24(4), pp.",
                    "sid": 247,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "599612.",
                    "sid": 248,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "J.-S.",
                    "sid": 249,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Kuo, H. Li and Y.-K.",
                    "sid": 250,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yang.",
                    "sid": 251,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2006.",
                    "sid": 252,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Learning Transliteration Lexicons from the Web, In Proc.",
                    "sid": 253,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of 44th ACL, pp.",
                    "sid": 254,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "11291136.",
                    "sid": 255,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Haizhou Li, Min Zhang and Jian Su.",
                    "sid": 256,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2004.",
                    "sid": 257,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Joint Source Channel Model for Machine Transliteration, In ndmodel works well as it is designed to capture regu Proc.",
                    "sid": 258,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of 42 ACL, pp.",
                    "sid": 259,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "159166.",
                    "sid": 260,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "larities in terms of rules or patterns.",
                    "sid": 261,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper extends the research by showing that semantic transliteration of personal names is feasible and provides substantial performance gains over phonetic transliteration.",
                    "sid": 262,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper has presented a successful attempt towards semantic transliteration using personal name transliteration as a case study.",
                    "sid": 263,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It formulates a mathematical framework that incorporates explicit semantic information (prior knowledge), or implicit one (through soft or hard decision) into the transliteration model.",
                    "sid": 264,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extending the framework to machine transliteration of named entities in general is a topic for further research.",
                    "sid": 265,
                    "ssid": 37,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}