{
    "ID": "P10-1020",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "One goal of natural language generation is to produce coherent text that presents information in a logical order.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we show that topological fields, which model high-level clausal structure, are an important component of local coherence in German.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we show in a sentence ordering experiment that topological field information improves the entity grid model of Barzilay and Lapata (2008) more than grammatical role and simple clausal order information do, particularly when manual annotations of this information are not available.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we incorporate the model enhanced with topological fields into a natural language generation system that generates constituent orders for German text, and show that the added coherence component improves performance slightly, though not statistically significantly.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "One type of coherence modelling that has captured recent research interest is local coherence modelling, which measures the coherence of a document by examining the similarity between neigh- bouring text spans.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The entity-based approach, in particular, considers the occurrences of noun phrase entities in a document (Barzilay and Lap- ata, 2008).",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Local coherence modelling has been shown to be useful for tasks like natural language generation and summarization, (Barzilay and Lee, 2004) and genre classification (Barzilay and Lap- ata, 2008).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous work on English, a language with relatively fixed word order, has identified factors that contribute to local coherence, such as the grammatical roles associated with the entities.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is good reason to believe that the importance of these factors vary across languages.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, freer- word-order languages exhibit word order patterns which are dependent on discourse factors relating to information structure, in addition to the grammatical roles of nominal arguments of the main verb.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thus expect word order information to be particularly important in these languages in discourse analysis, which includes coherence modelling.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Strube and Hahn (1999) introduce Functional Centering, a variant of Centering Theory which utilizes information status distinctions between hearer-old and hearer-new entities.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They apply their model to pronominal anaphora resolution, identifying potential antecedents of subsequent anaphora by considering syntactic and word order information, classifying constituents by their familiarity to the reader.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They find that their approach correctly resolves more pronominal anaphora than a grammatical role-based approach which ignores word order, and the difference between the two approaches is larger in German corpora than in English ones.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, their criteria for ranking potential antecedents require complex syntactic information in order to classify whether proper names are known to the hearer, which makes their algorithm hard to automate.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, all evaluation is done manually.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We instead use topological fields, a model of clausal structure which is indicative of information structure in German, but shallow enough to be automatically parsed at high accuracy.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We test the hypothesis that they would provide a good complement or alternative to grammatical roles in local coherence modelling.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that they are superior to grammatical roles in a sentence ordering experiment, and in fact outperforms simple word-order information as well.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We further show that these differences are particularly large when manual syntactic and grammatical role an 186 Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics, pages 186–195, Uppsala, Sweden, 1116 July 2010.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2010 Association for Computational Linguistics S VF LK MF NF S LK MF VC Millionen von Mark verschwendet der Senat jeden Monat, weil er sparen will.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“The senate wastes millions of marks each month, because it wants to save.” Figure 1: The clausal and topological field structure of a German sentence.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice that the subordinate clause receives its own topology.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "notations are not available.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then embed these topological field annotations into a natural language generation system to show the utility of local coherence information in an applied setting.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We add contextual features using topological field transitions to the model of Filippova and Strube (2007b) and achieve a slight improvement over their model in a constituent ordering task, though not statistically significantly.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We conclude by discussing possible reasons for the utility of topological fields in local coherence modelling.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "background and related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 German Topological Field Parsing.",
                    "sid": 28,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Topological fields are sequences of one or more contiguous phrases found in an enclosing syntactic region, which is the clause in the case of the German topological field model (Ho¨ hle, 1983).",
                    "sid": 29,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These fields may have constraints on the number of words or phrases they contain, and do not necessarily form a semantically coherent constituent.",
                    "sid": 30,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In German, the topology serves to identify all of the components of the verbal head of a clause, as well as clause-level structure such as complementizers and subordinating conjunctions.",
                    "sid": 31,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Topological fields are a useful abstraction of word order, because while Germanic word order is relatively free with respect to grammatical functions, the order of the topological fields is strict and unvarying.",
                    "sid": 32,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A German clause can be considered to be anchored by two “brackets” which contain modals, verbs and complementizers.",
                    "sid": 33,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The left bracket (linke Klammer, LK) may contain a complementizer, subordinating conjunction, or a finite verb, depending on the clause type, and the right bracket contains the verbal complex (VC).",
                    "sid": 34,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other topological fields are defined in relation to these two brackets, and contain all other parts of the clause such as verbal arguments, adjuncts, and discourse cues.",
                    "sid": 35,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The VF (Vorfeld or “pre-field”) is so-named because it occurs before the left bracket.",
                    "sid": 36,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the first constituent of most matrix clauses in declarative sentences, it has special significance for the coherence of a passage, which we will further discuss below.",
                    "sid": 37,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The MF (Mittelfeld or “middle field”) is the field bounded by the two brackets.",
                    "sid": 38,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most verb arguments, adverbs, and prepositional phrases are found here, unless they have been fronted and put in the VF, or are prosodically heavy and postposed to the NF field.",
                    "sid": 39,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NF (Nachfeld or “post-field”) contains prosodically heavy elements such as post- posed prepositional phrases or relative clauses, and occasionally postposed noun phrases.",
                    "sid": 40,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 The Role of the Vorfeld.",
                    "sid": 41,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the reasons that we use topological fields for local coherence modelling is the role that the VF plays in signalling the information structure of German clauses, as it often contains the topic of the sentence.",
                    "sid": 42,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, its role is much more complex than being simply the topic position.",
                    "sid": 43,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dipper and Zinsmeister (2009) distinguish multiple uses of the VF depending on whether it contains an element related to the surrounding discourse.",
                    "sid": 44,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They find that 45.1% of VFs are clearly related to the previous context by a reference or discourse relation, and a further 21.9% are deictic and refer to the situation described in the passage in a corpus study.",
                    "sid": 45,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They also run a sentence insertion experiment where subjects are asked to place an extracted sentence in its original location in a passage.",
                    "sid": 46,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The authors remark that extracted sentences with VFs that are referentially related to previous context (e.g., they contain a coreferential noun phrase or a discourse relation like “therefore”) are reinserted at higher accuracies.",
                    "sid": 47,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a) # O ri gi na l Se nt en ce an d Tr an sla tio n 1 Ei ne n Zu flu ch tso rt fu¨ r Fr au en , di e vo n ihr en Ma ¨ nn er n mi ßh an de lt we rd en , gi bt es nu n me hr au ch in Tr ep to w. “T he re is no w a sa nc tu ar y for w o m en w ho ar e mi str eat ed by th eir hu sb an ds in Tr ep to w as we ll.",
                    "sid": 48,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "” 2 D as Be zir ks a mt bi ete t Fr au en (a uc h mi t Ki nd er n) in de ra rti ge n No tsi tu ati on en vo ru¨ be rg eh en d ei ne U nt er ku nft . “T he dis tri ct off ice off ers w o m en (e ve n wi th ch ild re n) in thi s ty pe of e m er ge nc y te m po rar y ac co m m od ati on .” 3 Zu gl eic h we rd en di e Be tro ffe ne n de r Re ge lu ng de s U nt er ha lts , be i Be ho¨ rd en ga¨ ng en un d au ch be i de r W oh nu ng ss uc he un ter stu¨ tzt . “A t th e sa m e ti m e, th e aff ect ed ar e su pp ort ed wi th pr ov isi on s of ne ce ssi tie s, in de ali ng wi th au th ori tie s, an d als o in th e se ar ch for ne w ac co m m od ati on s.” b) D E E N Zu flu ch ts or t sa nc tu ar y Fr au en w o m en Ma ¨ nn er n hu sb an ds Tr ep to w Tr ep to w Ki nd er n ch ild re n 1 2 3 ac c − − ot h o t h n o m ot h − − ot h − − − ot h − c) − − − no m − ac c − ot h no m − no m no m no m ac c no m ot h 0.",
                    "sid": 49,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 0.",
                    "sid": 50,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0.",
                    "sid": 51,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0.",
                    "sid": 52,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 0.",
                    "sid": 53,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0.",
                    "sid": 54,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0.",
                    "sid": 55,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0.",
                    "sid": 56,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 ac c − ac c no m ac c ac c ac c ot h ot h − ot h no m ot h ac c ot h ot h 0.",
                    "sid": 57,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 0.",
                    "sid": 58,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0.",
                    "sid": 59,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0.",
                    "sid": 60,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0.",
                    "sid": 61,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 0.",
                    "sid": 62,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 0.",
                    "sid": 63,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 0.",
                    "sid": 64,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 Table 1: a) An example of a document from Tu¨ BaD/Z, b) an abbreviated entity grid representation of it, and c) the feature vector representation of the abbreviated entity grid for transitions of length two.",
                    "sid": 65,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mentions of the entity Frauen are underlined.",
                    "sid": 66,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "nom: nominative, acc: accusative, oth: dative, oblique, and other arguments Filippova and Strube (2007c) also examine the role of the VF in local coherence and natural language generation, focusing on the correlation between VFs and sentential topics.",
                    "sid": 67,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They follow Jacobs (2001) in distinguishing the topic of addressation, which is the constituent for which the proposition holds, and frame-setting topics, which is the domain in which the proposition holds, such as a temporal expression.",
                    "sid": 68,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They show in a user study that frame-setting topics are preferred to topics of addressation in the VF, except when a constituent needs to be established as the topic of ad- dressation.",
                    "sid": 69,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Using Entity Grids to Model Local.",
                    "sid": 70,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Coherence Barzilay and Lapata (2008) introduce the entity grid as a method of representing the coherence of a document.",
                    "sid": 71,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Entity grids indicate the location of the occurrences of an entity in a document, which is important for coherence modelling because mentions of an entity tend to appear in clusters of neighbouring or nearby sentences in coherent documents.",
                    "sid": 72,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This last assumption is adapted from Centering Theory approaches to discourse modelling.",
                    "sid": 73,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Barzilay and Lapata (2008), an entity grid is constructed for each document, and is represented as a matrix in which each row represents a sentence, and each column represents an entity.",
                    "sid": 74,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, a cell in the matrix contains information about an entity in a sentence.",
                    "sid": 75,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cell is marked by the presence or absence of the entity, and can also be augmented with other information about the entity in this sentence, such as the grammatical role of the noun phrase representing that entity in that sentence, or the topological field in which the noun phrase appears.",
                    "sid": 76,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the document in Table 1.",
                    "sid": 77,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An entity grid representation which incorporates the syntactic role of the noun phrase in which the entity ap pears is also shown (not all entities are listed for brevity).",
                    "sid": 78,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We tabulate the transitions of entities between different syntactic positions (or their non- occurrence) in sentences, and convert the frequencies of transitions into a feature vector representation of transition probabilities in the document.",
                    "sid": 79,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To calculate transition probabilities, we divide the frequency of a particular transition by the total number of transitions of that length.",
                    "sid": 80,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This model of local coherence was investigated for German by Filippova and Strube (2007a).",
                    "sid": 81,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main focus of that work, however, was to adapt the model for use in a low-resource situation when perfect coreference information is not available.",
                    "sid": 82,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is particularly useful in natural language understanding tasks.",
                    "sid": 83,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They employ a semantic clustering model to relate entities.",
                    "sid": 84,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, our work focuses on improving performance by annotating entities with additional linguistic information, such as topological fields, and is geared towards natural language generation systems where perfect information is available.",
                    "sid": 85,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar models of local coherence include various Centering Theory accounts of local coherence ((Kibble and Power, 2004; Poesio et al., 2004) inter alia).",
                    "sid": 86,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The model of Elsner and Charniak (2007) uses syntactic cues to model the discourse- newness of noun phrases.",
                    "sid": 87,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are also more global content models of topic shifts between sentences like Barzilay and Lee (2004).",
                    "sid": 88,
                    "ssid": 61,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "sentence ordering experiments. ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 Method.",
                    "sid": 89,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We test a version of the entity grid representation augmented with topological fields in a sentence ordering experiment corresponding to Experiment 1 of Barzilay and Lapata (2008).",
                    "sid": 90,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The task is a binary classification task to identify the original version of a document from another version which contains the sentences in a randomly permuted order, which is taken to be incoherent.",
                    "sid": 91,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We solve this problem in a supervised machine learning setting, where the input is the feature vector representations of the two versions of the document, and the output is a binary value indicating the document with the original sentence ordering.",
                    "sid": 92,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use SVMlight’s ranking module for classification (Joachims, 2002).",
                    "sid": 93,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus in our experiments consists of the last 480 documents of Tu¨ BaD/Z version 4 (Telljohann et al., 2004), which contains manual corefer ence, grammatical role and topological field information.",
                    "sid": 94,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This set is larger than the set that was used in Experiment 1 of Barzilay and Lapata (2008), which consists of 400 documents in two English subcorpora on earthquakes and accidents respectively.",
                    "sid": 95,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The average document length in the Tu¨ BaD/Z subcorpus is also greater, at 19.2 sentences compared to about 11 for the two subcorpora.",
                    "sid": 96,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Up to 20 random permutations of sentences were generated from each document, with duplicates removed.",
                    "sid": 97,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are 216 documents and 4126 original- permutation pairs in the training set, and 24 documents and 465 pairs in the development set.",
                    "sid": 98,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining 240 documents are in the final test set (4243 pairs).",
                    "sid": 99,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The entity-based model is parameterized as follows.",
                    "sid": 100,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Transition length – the maximum length of the transitions used in the feature vector representation of a document.",
                    "sid": 101,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Representation – when marking the presence of an entity in a sentence, what information about the entity is marked (topological field, grammatical role, or none).",
                    "sid": 102,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will describe the representations that we try in section 3.2.",
                    "sid": 103,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Salience – whether to set a threshold for the frequency of occurrence of entities.",
                    "sid": 104,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If this is set, all entities below a certain frequency are treated separately from those reaching this frequency threshold when calculating transition probabilities.",
                    "sid": 105,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the example in Table 1, with a salience threshold of 2, Frauen would be treated separately from Ma¨ nnern or Kindern.",
                    "sid": 106,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Transition length, salience, and a regularization parameter are tuned on the development set.",
                    "sid": 107,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We only report results using the setting of transition length ≤ 4, and no salience threshold, because they give the best performance on the development set.",
                    "sid": 108,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is in contrast to the findings of Barzi- lay and Lapata (2008), who report that transition length ≤ 3 and a salience threshold of 2 perform best on their data.",
                    "sid": 109,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Entity Representations.",
                    "sid": 110,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main goal of this study is to compare word order, grammatical role and topological field information, which is encoded into the entity grid at each occurrence of an entity.",
                    "sid": 111,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we describe the variants of the entity representations that we compare.",
                    "sid": 112,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Baseline Representations We implement several baseline representations against which we test our topological field-enhanced model.",
                    "sid": 113,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The simplest baseline representation marks the mere appearance of an entity without any additional information, which we refer to as default.",
                    "sid": 114,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another class of baseline representations mark the order in which entities appear in the clause.",
                    "sid": 115,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The correlation between word order and information structure is well known, and has formed the basis of some theories of syntax such as the Prague School’s (Sgall et al., 1986).",
                    "sid": 116,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two versions of clausal order we tried are order 1/2/3+, which marks a noun phrase as the first, the second, or the third or later to appear in a clause, and order 1/2+, which marks a noun phrase as the first, or the second or later to appear in a clause.",
                    "sid": 117,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since noun phrases can be embedded in other noun phrases, overlaps can occur.",
                    "sid": 118,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, the dominating noun phrase takes the smallest order number among its dominated noun phrases.",
                    "sid": 119,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third class of baseline representations we employ mark an entity by its grammatical role in the clause.",
                    "sid": 120,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Barzilay and Lapata (2008) found that grammatical role improves performance in this task for an English corpus.",
                    "sid": 121,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because German distinguishes more grammatical roles morphologically than English, we experiment with various granularities of role labelling.",
                    "sid": 122,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, subj/obj distinguishes the subject position, the object position, and another category for all other positions.",
                    "sid": 123,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "cases distinguishes five types of entities corresponding to the four morphological cases of German in addition to another category for noun phrases which are not complements of the main verb.",
                    "sid": 124,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Topological Field-Based These representations mark the topological field in which an entity appears.",
                    "sid": 125,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some versions mark entities which are prepositional objects separately.",
                    "sid": 126,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We try versions which distinguish VF from non-VF, as well as more general versions that make use of a greater set of topological fields.",
                    "sid": 127,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "vf marks the noun phrase as belonging to a VF (and not in a PP) or not.",
                    "sid": 128,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "vfpp is the same as above, but allows prepositional objects inside the VF to be marked as VF.",
                    "sid": 129,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "topf/pp distinguishes entities in the topological fields VF, MF, and NF, contains a separate category for PP, and a category for all other noun phrases.",
                    "sid": 130,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "topf distinguishes between VF, MF, and NF, on the one hand, and everything else on the other.",
                    "sid": 131,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prepositional objects are treated the same as other noun phrases here.",
                    "sid": 132,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Combined We tried a representation which combines grammatical role and topological field into a single representation, subj/obj×vf, which takes the Cartesian product of subj/obj and vf above.Topological fields do not map directly to topic focus distinctions.",
                    "sid": 133,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, besides the topic of the sentence, the Vorfeld may contain discourse cues, expletive pronouns, or the informational or contrastive focus.",
                    "sid": 134,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, there are additional constraints on constituent order related to pronominalization.",
                    "sid": 135,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we devised additional entity representations to account for these aspects of German.",
                    "sid": 136,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "topic attempts to identify the sentential topic of a clause.",
                    "sid": 137,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A noun phrase is marked as TOPIC if it is in VF as in vfpp, or if it is the first noun phrase in MF and also the first NP in the clause.",
                    "sid": 138,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other noun phrases in MF are marked as NONTOPIC.",
                    "sid": 139,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Categories for NF and miscellaneous noun phrases also exist.",
                    "sid": 140,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While this representation may appear to be very similar to simply distinguishing the first entity in a clause as for order 1/2+ in that TOPIC would correspond to the first entity in the clause, they are in fact distinct.",
                    "sid": 141,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to issues related to coordination, appositive constructions, and fragments which do not receive a topology of fields, the first entity in a clause is labelled the TOPIC only 80.8% of the time in the corpus.",
                    "sid": 142,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This representation also distinguishes NFs, which clausal order does not.",
                    "sid": 143,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "topic+pron refines the above by taking into account a word order restriction in German that pronouns appear before full noun phrases in the MF field.",
                    "sid": 144,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following set of decisions represents how a noun phrase is marked: If the first NP in the clause is a pronoun in an MF field and is the subject, we mark it as TOPIC.",
                    "sid": 145,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If it is not the subject, we mark it as NONTOPIC.",
                    "sid": 146,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For other NPs, we follow the topic representation.",
                    "sid": 147,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Automatic annotations.",
                    "sid": 148,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While it is reasonable to assume perfect annotations of topological fields and grammatical roles in many NLG contexts, this assumption may be less appropriate in other applications involving text-to- text generation where the input to the system is text such as paraphrasing or machine translation.",
                    "sid": 149,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we test the robustness of the entity repre An no tat io n Ac cu ra cy (% ) Gr a m m ati cal rol e 8 3 . 6 To po lo gi cal fie ld (+ PP ) 9 3 . 8 To po lo gi cal fie ld (− PP ) 9 5 . 7 Cl au sal or de r 9 0 . 8 Table 2: Accuracy (%) of the permutation detection experiment with various entity representations using manual and automatic annotations of topological fields and grammatical roles.",
                    "sid": 150,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline without any additional annotation is underlined.",
                    "sid": 151,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two-tailed sign tests were calculated for each result against the best performing model in each column (1: p = 0.101; 2: p = 0.053; +: statistically significant, p < 0.05; ++: very statistically significant, p < 0.01 ).",
                    "sid": 152,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sentations to automatic extraction in the absence of manual annotations.",
                    "sid": 153,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We employ the following two systems for extracting topological fields and grammatical roles.",
                    "sid": 154,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To parse topological fields, we use the Berkeley parser of Petrov and Klein (2007), which has been shown to perform well at this task (Cheung and Penn, 2009).",
                    "sid": 155,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parser is trained on sections of Tu¨ BaD/Z which do not overlap with the section from which the documents for this experiment were drawn, and obtains an overall parsing performance of 93.35% F1 on topological fields and clausal nodes without gold POS tags on the section of Tu¨ BaD/Z it was tested on.",
                    "sid": 156,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We tried two methods to obtain grammatical roles.",
                    "sid": 157,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we tried extracting grammatical roles from the parse trees which we obtained from the Berkeley parser, as this information is present in the edge labels that can be recovered from the parse.",
                    "sid": 158,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we found that we achieved better accuracy by using RFTagger (Schmid and Laws, 2008), which tags nouns with their morphological case.",
                    "sid": 159,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Morphological case is distinct from grammatical role, as noun phrases can function as adjuncts in possessive constructions and preposi Table 3: Accuracy of automatic annotations of noun phrases with coreferents.",
                    "sid": 160,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "+PP means that prepositional objects are treated as a separate category from topological fields.",
                    "sid": 161,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "−PP means they are treated as other noun phrases.",
                    "sid": 162,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tional phrases.",
                    "sid": 163,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we can approximate the grammatical role of an entity using the morphological case.",
                    "sid": 164,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We follow the annotation conventions of Tu¨ BaD/Z in not assigning a grammatical role when the noun phrase is a prepositional object.",
                    "sid": 165,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also do not assign a grammatical role when the noun phrase is in the genitive case, as genitive objects are very rare in German and are far outnumbered by the possessive genitive construction.",
                    "sid": 166,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Results.",
                    "sid": 167,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows the results of the sentence ordering permutation detection experiment.",
                    "sid": 168,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The top four performing entity representations are all topological field-based, and they outperform grammatical role-based and simple clausal order-based models.",
                    "sid": 169,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results indicate that the information that topological fields provide about clause structure, appositives, right dislocation, etc. which is not captured by simple clausal order is important for coherence modelling.",
                    "sid": 170,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The representations incorporating linguistics-based heuristics do not outperform purely topological field-based models.",
                    "sid": 171,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Surprisingly, the VF-based models fare quite poorly, performing worse than not adding any annotations, despite the fact that topological field- based models in general perform well.",
                    "sid": 172,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result may be a result of the heterogeneous uses of the VF.",
                    "sid": 173,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The automatic topological field annotations are more accurate than the automatic grammatical role annotations (Table 3), which may partly explain why grammatical role-based models suffer more when using automatic annotations.",
                    "sid": 174,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note, however, that the models based on automatic topological field annotations outperform even the grammatical role-based models using manual annotation (at marginal significance, p < 0.1).",
                    "sid": 175,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The topo logical field annotations are accurate enough that automatic annotations produce no decrease in performance.",
                    "sid": 176,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results show the upper bound of entity- based local coherence modelling with perfect coreference information.",
                    "sid": 177,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results we obtain are higher than the results for the English corpora of Barzilay and Lapata (2008) (87.2% on the Earthquakes corpus and 90.4% on the Accidents corpus), but this is probably due to corpus differences as well as the availability of perfect coreference information in our experiments1.",
                    "sid": 178,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the high performance we obtained, we calculated Kendall tau coefficients (Lapata, 2006) over the sentence orderings of the cases in which our best performing model is incorrect, to determine whether the remaining errors are instances where the permuted ordering is nearly identical to the original ordering.",
                    "sid": 179,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We obtained a τ of 0.0456 in these cases, compared to a τ of −0.0084 for all the pairs, indicating that this is not the case.",
                    "sid": 180,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To facilitate comparison to the results of Filippova and Strube (2007a), we rerun this experiment on the same subsections of the corpus as in that work for training and testing.",
                    "sid": 181,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first 100 articles of Tu¨ BaD/Z are used for testing, while the next 200 are used for training and development.",
                    "sid": 182,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike the previous experiments, we do not do parameter tuning on this set of data.",
                    "sid": 183,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, we follow Filippova and Strube (2007a) in using transition lengths of up to three.",
                    "sid": 184,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do not put in a salience threshold.",
                    "sid": 185,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see that our results are much better than the ones reported in that work, even for the default representation.",
                    "sid": 186,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main reason for this discrepancy is probably the way that entities are created from the corpus.",
                    "sid": 187,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, we create an entity for every single noun phrase node that we encounter, then merge the entities that are linked by coreference.",
                    "sid": 188,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Filippova and Strube (2007a) convert the annotations of Tu¨ BaD/Z into a dependency format, then extract entities from the noun phrases found there.",
                    "sid": 189,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They may thus annotate fewer entities, as there 1 Barzilay and Lapata (2008) use the coreference system of Ng and Cardie (2002) to obtain coreference annotations.",
                    "sid": 190,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are not aware of similarly well-tested, publicly available coreference resolution systems that handle all types of anaphora for German.",
                    "sid": 191,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We considered adapting the BART coreference resolution toolkit (Versley et al., 2008) to German, but a number of language-dependent decisions regarding preprocessing, feature engineering, and the learning paradigm would need to be made in order to achieve reasonable performance comparable to state-of-the-art English coreference resolution systems.",
                    "sid": 192,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Re pr es en tat io n Ac cu ra cy (% ) t o p f / p p 9 3 . 8 3 t o p i c 9 3 . 3 1 t o p i c + p r o n 9 3 . 3 1 t o p f 9 2 . 4 9 s u b j / o b j 8 8 . 9 9 o r d e r 1 / 2 + 8 8 . 8 9 o r d e r 1 / 2 / 3 + 8 8 . 8 4 c a s e s 8 8 . 6 3 v f 8 7 . 6 0 v f p p 8 8 . 1 7 d e f a u l t 8 7 . 5 5 s u b j / o b j × v f 8 7 . 7 1 (Fi lip po va an d Str ub e, 20 07 ) 7 5 Table 4: Accuracy (%) of permutation detection experiment with various entity representations using manual and automatic annotations of topological fields and grammatical roles on subset of corpus used by Filippova and Strube (2007a).",
                    "sid": 193,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "may be nested NP nodes in the original corpus.",
                    "sid": 194,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There may also be noise in the dependency conversion process.",
                    "sid": 195,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relative rankings of different entity representations in this experiment are similar to the rankings of the previous experiment, with topological field-based models outperforming grammatical role and clausal order models.",
                    "sid": 196,
                    "ssid": 108,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "local coherence for natural language. ",
            "number": "4",
            "sents": [
                {
                    "text": "Generation One of the motivations of the entity grid-based model is to improve surface realization decisions in NLG systems.",
                    "sid": 197,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A typical experimental design would pass the contents of the test section of a corpus as input to the NLG system with the ordering information stripped away.",
                    "sid": 198,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The task is then to regenerate the ordering of the information found in the original corpus.",
                    "sid": 199,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Various coherence models have been tested in corpus-based NLG settings.",
                    "sid": 200,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Karamanis et al.",
                    "sid": 201,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009) compare several versions of Centering Theory-based metrics of coherence on corpora by examining how highly the original ordering found in the corpus is ranked compared to other possible orderings of propositions.",
                    "sid": 202,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A metric performs well if it ranks the original ordering better than the alternative orderings.In our next experiment, we incorporate local co herence information into the system of Filippova and Strube (2007b).",
                    "sid": 203,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We embed entity topological field transitions into their probabilistic model, and show that the added coherence component slightly improves the performance of the baseline NLG system in generating constituent orderings in a German corpus, though not to a statistically significant degree.",
                    "sid": 204,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Method.",
                    "sid": 205,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the WikiBiography corpus2 for our experiments.",
                    "sid": 206,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus consists of more than 1100 biographies taken from the German Wikipedia, and contains automatic annotations of morphological, syntactic, and semantic information.",
                    "sid": 207,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each article also contains the coreference chain of the subject of the biography (the biographee).",
                    "sid": 208,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first 100 articles are used for testing, the next 200 for development, and the rest for training.",
                    "sid": 209,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline generation system already incorporates topological field information into the constituent ordering process.",
                    "sid": 210,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system operates in two steps.",
                    "sid": 211,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, in main clauses, one constituent is selected as the Vorfeld (VF).",
                    "sid": 212,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is done using a maximum entropy model (call it MAXENT).",
                    "sid": 213,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, the remaining constituents are ordered using a second maximum entropy model (MAXENT2).",
                    "sid": 214,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Significantly, Filippova and Strube (2007b) found that selecting the VF first, and then ordering the remaining constituents results in a 9% absolute improvement over the corresponding model where the selection is performed in one step by the sorting algorithm alone.",
                    "sid": 215,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The maximum entropy model for both steps rely on the following features: • features on the voice, valency, and identity of the main verb of the clause • features on the morphological and syntactic status of the constituent to be ordered • whether the constituent occurs in the preceding sentence • features for whether the constituent contains a determiner, an anaphoric pronoun, or a relative clause • the size of the constituent in number of modifiers, in depth, and in number of words 2 http://www.eml-research.de/english/ research/nlp/download/wikibiography.php • the semantic class of the constituent (person, temporal, location, etc.) The biographee, in particular, is marked by its own semantic class.",
                    "sid": 216,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first VF selection step, MAXENT simply produces a probability of each constituent being a VF, and the constituent with the highest probability is selected.",
                    "sid": 217,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second step, MAXENT2 takes the featural representation of two constituents, and produces an output probability of the first constituent preceding the second constituent.",
                    "sid": 218,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final ordering is achieved by first randomizing the order of the constituents in a clause (besides the first one, which is selected to be the VF), then sorting them according to the precedence probabilities.",
                    "sid": 219,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, a constituent A is put before a constituent B if MAXENT2(A,B) > 0.5.",
                    "sid": 220,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because this precedence relation is not antisymmetric (i.e., MAXENT2(A,B) > 0.5 and MAXENT2(B,A) > 0.5 may be simultaneously true or simultaneously false), different initializations of the order produce different sorted results.",
                    "sid": 221,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, we correct this by defining the precedence relation to be A precedes B iff MAXENT2(A,B) > MAXENT2(B,A).",
                    "sid": 222,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This change does not greatly impact the performance, and removes the randomized element of the algorithm.",
                    "sid": 223,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline system does not directly model the context when ordering constituents.",
                    "sid": 224,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All of the features but one in the original maximum entropy models rely on local properties of the clause.",
                    "sid": 225,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We incorporate local coherence information into the model by adding entity transition features which we found to be useful in the sentence ordering experiment in Section 3 above.",
                    "sid": 226,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, we add features indicating the topological fields in which entities occur in the previous sentences.",
                    "sid": 227,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found that looking back up to two sentences produces the best results (by tuning on the development set).",
                    "sid": 228,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because this corpus does not come with general coreference information except for the coreference chain of the biographee, we use the semantic classes instead.",
                    "sid": 229,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, all constituents in the same semantic class are treated as one coreference chain.",
                    "sid": 230,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of a feature may be bioglast2, which takes on a value such as ‘v−’, meaning that this constituent refers to the biographee, and the biographee occurs in the VF two clauses ago (v), but does not appear in the previous clause (−).",
                    "sid": 231,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a constituent which is not the biographee, this feature would be marked M et ho d V F Ac c (% ) Acc (%) Tau Ba sel in e 6 8 . 7 6 0 . 9 0 . 7 2 + Co he re nc e 6 9 . 2 6 1 . 5 0 . 7 2 Table 5: Results of adding coherence features into a natural language generation system.",
                    "sid": 232,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VF Acc% is the accuracy of selecting the first constituent in main clauses.",
                    "sid": 233,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Acc % is the percentage of perfectly ordered clauses, tau is Kendall’s τ on the constituent ordering.",
                    "sid": 234,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The test set contains 2246 clauses, of which 1662 are main clauses.",
                    "sid": 235,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‘na’ (not applicable).",
                    "sid": 236,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Results.",
                    "sid": 237,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 shows the results of adding these contextual features into the maximum entropy models.",
                    "sid": 238,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see that we obtain a small improvement in the accuracy of VF selection, and in the accuracy of correctly ordering the entire clause.",
                    "sid": 239,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These improvements are not statistically significant by McNemar’s test.",
                    "sid": 240,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We suggest that the lack of coreference information for all entities in the article may have reduced the benefit of the coherence component.",
                    "sid": 241,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, the topline of performance is substantially lower than 100%, as multiple orderings are possible and equally valid.",
                    "sid": 242,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Human judgements on information structuring for both inter- and intrasentential units are known to have low agreement (Barzilay et al., 2002; Filippova and Strube, 2007c; Lapata, 2003; Chen et al., 2007).",
                    "sid": 243,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the relative error reduction is higher than the absolute reduction might suggest.",
                    "sid": 244,
                    "ssid": 48,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "5",
            "sents": [
                {
                    "text": "We have shown that topological fields are a useful source of information for local coherence modelling.",
                    "sid": 245,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a sentence-order permutation detection task, models which use topological field information outperform both grammatical role-based models and models based on simple clausal order, with the best performing model achieving a relative error reduction of 40.4% over the original baseline without any additional annotation.",
                    "sid": 246,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Applying our local coherence model in another setting, we have embedded topological field transitions of entities into an NLG system which orders constituents in German clauses.",
                    "sid": 247,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We find that the coherence-enhanced model slightly outperforms the baseline system, but this was not statistically significant.",
                    "sid": 248,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We suggest that the utility of topological fields in local coherence modelling comes from the interaction between word order and information structure in freer-word-order languages.",
                    "sid": 249,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Crucially, topological fields take into account issues such as coordination, appositives, sentential fragments and differences in clause types, which word order alone does not.",
                    "sid": 250,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are also shallow enough to be accurately parsed automatically for use in resource-poor applications.",
                    "sid": 251,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further refinement of the topological field annotations to take advantage of the fact that they do not correspond neatly to any single information status such as topic or focus could provide additional performance gains.",
                    "sid": 252,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The model also shows promise for other discourse-related tasks such as coreference resolution and discourse parsing.",
                    "sid": 253,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "We are grateful to Katja Filippova for providing us with source code for the experiments in Section 4 and for answering related questions, and to Timothy Fowler for useful discussions and comments on a draft of the paper.",
                    "sid": 254,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work is supported in part by the Natural Sciences and Engineering Research Council of Canada.",
                    "sid": 255,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}