{
    "ID": "P101167",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Automatically identifying the sentiment polarity of words is a very important task that has been used as the essential building block of many natural language processing systems such as text classification, text filtering, product review analysis, survey response analysis, and online discussion mining.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose a method for identifying the sentiment polarity of words that applies a Markov random walk model to a large word relatedness graph, and produces a polarity estimate for any given word.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The model can accurately and quickly assign a polarity sign and magnitude to any word.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be used both in a semi-supervised setting where a training set of labeled words is used, and in a weakly supervised setting where only a handful of seed words is used to define the two polarity classes.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The method is experimentally tested using a gold standard set of positive and negative words from the General Inquirer lexicon.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also show how our method can be used for three-way classification which identifies neutral words in addition to positive and negative words.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our experiments show that the proposed method outperforms the state-of-the-art methods in the semi-supervised setting and is comparable to the best reported values in the weakly supervised setting.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, the proposed method is faster and does not need a large corpus.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also present extensions of our methods for identifying the polarity of foreign words and out-of-vocabulary words.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Microsoft Research, Redmond, WA, USA.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email: hassanam@microsoft.com.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This research was performed while at the University of Michigan.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Department of Electrical Engineering & Computer Science, University of Michigan, Ann Arbor, MI, USA.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email: amjbara@umich.edu.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "† Department of Electrical Engineering & Computer Science, University of Michigan, Ann Arbor, MI, USA.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email: wanchlu@umich.edu.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "‡ Department of Electrical Engineering & Computer Science and School of Information, University of Michigan, Ann Arbor, MI, USA.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email: radev@umich.edu.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Submission received: 15 November 2011; revised submission received: 10 May 2013; accepted for publication: 14 July 2013.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "doi:10.1162/COLI a 00192 © 2014 Association for Computational Linguistics",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Identifying emotions and attitudes from unstructured text has a variety of possible applications.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, there has been a large body of work for mining product reputation on the Web (Morinaga et al. 2002; Turney 2002).",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Morinaga et al.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2002) have shown how product reputation mining helps with marketing and customer relation management.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Google products catalog and many online shopping sites like Amazon.com provide customers not only with comprehensive information and reviews about a product, but also with faceted sentiment summaries.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such systems are all supported by a sentiment lexicon, some even in multiple languages.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another interesting application is mining online discussions.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An enormous number of discussion groups exist on the Web.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Millions of users post content to these groups covering pretty much every possible topic.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tracking a participant attitude toward different topics and toward other participants is a very important task that makes use of sentiment lexicons.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Tong (2001) presented the concept of sentiment timelines.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "His system classifies discussion posts about movies as either positive or negative.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is used to produce a plot of the number of positive and negative sentiment messages over time.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All these applications would benefit from an automatic way of identifying semantic orientation of words.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this article, we study the task of automatically identifying the semantic orientation of any word by analyzing its relations to other words, Automatically classifying words as positive, negative, or neutral enables us to automatically identify the polarity of larger pieces of text.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This could be a very useful building block for systems that mine surveys, product reviews, and online discussions.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We apply a Markov random walk model to a large semantic relatedness graph, producing a polarity estimate for any given word.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous work on identifying the semantic orientation of words has addressed the problem as both a semi-supervised (Takamura, Inui, and Okumura 2005) and a weakly supervised (Turney and Littman 2003) learning problem.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the semi- supervised setting, a training set of labeled words is used to train the model.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the weakly supervised setting, only a handful of seeds are used to define the two polarity classes.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our proposed method can be used both in a semi-supervised and in a weakly supervised setting.",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Empirical experiments on a labeled set of positive and negative words show that the proposed method outperforms the state-of-the-art methods in the semi-supervised setting.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results in the weakly supervised setting are comparable to the best reported values.",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed method has the advantages that it is faster and does not need a large training corpus.",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of the article is structured as follows.",
                    "sid": 45,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 2, we review related work on word polarity and subjectivity classification and note applications of the random walk and hitting times framework.",
                    "sid": 46,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 presents our method for identifying word polarity.",
                    "sid": 47,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describe how the proposed method can be extended to cover foreign languages in Section 4, and out-of-vocabulary words in Section 5.",
                    "sid": 48,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 6 describes our experimental setup.",
                    "sid": 49,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present our conclusions in Section 7.",
                    "sid": 50,
                    "ssid": 50,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Identifying Word Polarity.",
                    "sid": 51,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hatzivassiloglou and McKeown (1997) proposed a method for identifying the word polarity of adjectives.",
                    "sid": 52,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They extract all conjunctions of adjectives from a given corpus 540 and then they classify each conjunctive expression as either the same orientation such as “simple and well-received” or different orientation such as “simplistic but well- received.” The result is a graph that they cluster into two subsets of adjectives.",
                    "sid": 53,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They classify the cluster with the higher average frequency as positive.",
                    "sid": 54,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They created and labeled their own data set for experiments.",
                    "sid": 55,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their approach works only with adjectives because there is nothing wrong with conjunctions of nouns or verbs with opposite polarities (“war and peace”, “rise and fall”, etc.).",
                    "sid": 56,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Turney and Littman (2003) identify word polarity by looking at its statistical association with a set of positive/negative seed words.",
                    "sid": 57,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They use two statistical measures for estimating association: Pointwise Mutual Information (PMI) and Latent Semantic Analysis (LSA).",
                    "sid": 58,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To get co-occurrence statistics, they submit several queries to a search engine.",
                    "sid": 59,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each query consists of the given word and one of the seed words.",
                    "sid": 60,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They use the search engine NEAR operator to look for instances where the given word is physically close to the seed word in the returned document.",
                    "sid": 61,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They present their method as an unsupervised method where a very small number of seed words are used to define semantic orientation rather than train the model.",
                    "sid": 62,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the limitations of their method is that it requires a large corpus of text to achieve good performance.",
                    "sid": 63,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They use several corpora; the size of the best performing data set is roughly one hundred billion words (Turney and Littman 2003).",
                    "sid": 64,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Takamura et al.",
                    "sid": 65,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2005) propose using spin models for extracting semantic orientation of words.",
                    "sid": 66,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They construct a network of words using gloss definitions, thesaurus, and co-occurrence statistics.",
                    "sid": 67,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They regard each word as an electron.",
                    "sid": 68,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each electron has a spin and each spin has a direction taking one of two values: up or down.",
                    "sid": 69,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two neighboring spins tend to have the same orientation from an energy point of view.",
                    "sid": 70,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their hypothesis is that as neighboring electrons tend to have the same spin direction, neighboring words tend to have similar polarity.",
                    "sid": 71,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They pose the problem as an optimization problem and use the mean field method to find the best solution.",
                    "sid": 72,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The analogy with electrons leads them to assume that each word should be either positive or negative.",
                    "sid": 73,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This assumption is not accurate because most of the words in the language do not have any semantic orientation.",
                    "sid": 74,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They report that their method could get misled by noise in the gloss definition and their computations sometimes get trapped in a local optimum because of its greedy optimization flavor.",
                    "sid": 75,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Kamps et al.",
                    "sid": 76,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) construct a network based on WordNet (Miller 1995) synonyms and then use the shortest paths between any given word and the words “good” and “bad” to determine word polarity.",
                    "sid": 77,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They report that using shortest paths could be very noisy.",
                    "sid": 78,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “good” and “bad” themselves are closely related in WordNet with a 5-long sequence “good, sound, heavy, big, bad.” A given word w may be more connected to one set of words (e.g., positive words); yet have a shorter path connecting it to one word in the other set.",
                    "sid": 79,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Restricting seed words to only two words affects their accuracy.",
                    "sid": 80,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adding more seed words could help but it will make their method extremely costly from the computation point of view.",
                    "sid": 81,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They evaluate their method using only adjectives.",
                    "sid": 82,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hu and Liu (2004) propose another method that uses WordNet.",
                    "sid": 83,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They use WordNet synonyms and antonyms to predict the polarity of words.",
                    "sid": 84,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For any word whose polarity is unknown, they search WordNet and a list of seed labeled words to predict its polarity.",
                    "sid": 85,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They check if any of the synonyms of the given word has known polarity.",
                    "sid": 86,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If so, they label it with the label of its synonym.",
                    "sid": 87,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise, they check if any of the antonyms of the given word has known polarity.",
                    "sid": 88,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If so, they label it with the opposite label of the antonym.",
                    "sid": 89,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They continue in a bootstrapping manner until they label all possible words.",
                    "sid": 90,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "541 2.2 Building Sentiment Lexicons.",
                    "sid": 91,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A number of other methods try to build lexicons of polarized words.",
                    "sid": 92,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Esuli and Sebastiani (2005, 2006) use a textual representation of words by collating all the glosses of the word as found in some dictionary.",
                    "sid": 93,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, a binary text classifier is trained using the textual representation and applied to new words.",
                    "sid": 94,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Kim and Hovy (2004) start with two lists of positive and negative seed words.",
                    "sid": 95,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word- Net is used to expand these lists.",
                    "sid": 96,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Synonyms of positive words and antonyms of negative words are considered positive, and synonyms of negative words and antonyms of positive words are considered negative.",
                    "sid": 97,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A similar method is presented in Andreevskaia and Bergler (2006), where WordNet synonyms, antonyms, and glosses are used to iteratively expand a list of seeds.",
                    "sid": 98,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sentiment classes are treated as fuzzy categories where some words are very central to one category, whereas others may be interpreted differently.",
                    "sid": 99,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mohammad, Dunne, and Dorr (2009) utilize the marking theory, which states that overtly marked words such as dishonest, unhappy, and impure tend to have negative semantic orientations whereas their unmarked counterparts (honest, happy, and pure) tend to have positive semantic orientation.",
                    "sid": 100,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They use a set of 11 antonym-generating affix patterns to generate overtly marked words and their counterparts from the Macquarie Thesaurus.",
                    "sid": 101,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After obtaining a set of 2,600 seeds by the affix patterns, they expand the sentiment lexicon using a Roget-like thesaurus.",
                    "sid": 102,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their method does not require seed sentiment words or WordNet, but still needs a comprehensive thesaurus.",
                    "sid": 103,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idea of the marking theory is language-dependent and cannot be applied from one language to another.",
                    "sid": 104,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Contrasting the dictionary based approaches that rely on resources such as Word- Net, Velikovich et al.",
                    "sid": 105,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) investigated the viability of learning sentiment lexicons semi-automatically from the Web.",
                    "sid": 106,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Kanayama and Nasukawa (2006) use syntactic features and context coherency (i.e., the tendency for same polarities to appear successively) to detect polar clauses.",
                    "sid": 107,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Random Walk–Based Methods.",
                    "sid": 108,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Closest to our work in its methodology is probably the line of research on semi- supervised graphical methods for sentiment classification.",
                    "sid": 109,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rao and Ravichandran (2009) build a lexical graph similar to ours.",
                    "sid": 110,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The graph is constructed of both unlabeled and labeled nodes, each node representing a word that can be either positive or negative, and each edge representing some semantic relatedness that can be constructed using resources like WordNet or other thesaurus.",
                    "sid": 111,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They evaluate two semi-supervised methods: Mincut (including its variant, Randomized Mincut) and label propagation.",
                    "sid": 112,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The general idea of label propagation is defining a probability distribution over the positive and negative classes for each node in the graph.",
                    "sid": 113,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Markov random walk is performed on the graph to recover this distribution for the unlabeled nodes.",
                    "sid": 114,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, Rao and Ravichandra (2009) and BlairGoldensohn et al.",
                    "sid": 115,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) use a similar label propagation method on a lexical graph built from WordNet, where a small set of words with known polarities are used as seeds.",
                    "sid": 116,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Brody and Elhadad (2010) use label propagation over a graph constructed of adjectives only.",
                    "sid": 117,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Velikovich et al.",
                    "sid": 118,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) compare label propagation with a Web-based method and conclude that label propagation is not suitable when the whole Web is used as a background corpus, because the constructed graph is very noisy and contains many dense subgraphs, unlike the lexical graph constructed from WordNet.",
                    "sid": 119,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "542 Random walk–based methods have been studied in the context of many other NLP tasks.",
                    "sid": 120,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Kok and Brockett (2010) construct a graph from bilingual parallel corpora, where each node represents a phrase and two nodes are connected by an edge if they are aligned in a phrase table.",
                    "sid": 121,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then they compute hitting time of random walks to learn paraphrases.",
                    "sid": 122,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work is different from previous random walk methods in that it uses the mean hitting time as the criterion for assigning polarity labels.",
                    "sid": 123,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our experiments showed that this achieves better results than methods that use label propagation.",
                    "sid": 124,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4 Subjectivity Analysis.",
                    "sid": 125,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subjectivity analysis is another research line that is closely related to our work.",
                    "sid": 126,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main task in subjectivity analysis is to identify text that presents opinion as opposed to objective text that present factual information (Wiebe 2000).",
                    "sid": 127,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Text could be either words, phrases, sentences, or other chunks.",
                    "sid": 128,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Wiebe et al.",
                    "sid": 129,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2001) list a number of applications of subjectivity analysis such as classifying emails and mining reviews.",
                    "sid": 130,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, to analyze movie reviews, Pang and Lee (2004) apply Mincut to a graph constructed from individual sentences as nodes to determine whether a sentence is subjective or objective.",
                    "sid": 131,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each node (sentence) has an individual subjectivity score obtained from a first-pass classifier using sentence features and linguistic knowledge.",
                    "sid": 132,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Edges are weighted by a similarity metric of how likely it is that the two sentences will be in the same subjectivity class.",
                    "sid": 133,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All sentences to be classified are represented as unlabeled nodes and the only two labeled nodes represent the subjective and objective classes.",
                    "sid": 134,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Mincut algorithm is then performed on the constructed graph to obtain the subjectivity classes for individual sentences.",
                    "sid": 135,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The authors also integrate the subjectivity classification of isolated sentences to document level sentiment analysis.",
                    "sid": 136,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are two main categories of work on subjectivity analysis.",
                    "sid": 137,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first category, subjective words and phrases are identified without considering their context (Hatzivassiloglou and Wiebe 2000; Wiebe 2000; Banea, Mihalcea, and Wiebe 2008).",
                    "sid": 138,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second category, the context of subjective text is used (Nasukawa and Yi 2003; Riloff and Wiebe 2003; Yu and Hatzivassiloglou 2003; Popescu and Etzioni 2005).",
                    "sid": 139,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Wiebe and Mihalcea (2006a) studied the association of word subjectivity and word sense.",
                    "sid": 140,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They showed that different subjectivity labels can be assigned to different senses of the same word.",
                    "sid": 141,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Wiebe, Wilson, and Cardie (2005) described MPQA, a corpus of news articles from a wide variety of news sources manually annotated for opinions and other private states (i.e., beliefs, emotions, sentiments, speculations) directed for studying opinions and emotions in language.",
                    "sid": 142,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, there has been a large body of work on labeling subjectivity of WordNet words.",
                    "sid": 143,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Wiebe and Mihalcea (2006b) label word senses in WordNet as subjective or objective, utilizing the MPQA corpus.",
                    "sid": 144,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They show that subjectivity information for Word- Net senses can improve word sense disambiguation tasks for subjectivity ambiguous words.",
                    "sid": 145,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Su and Markert (2009) propose a semi-supervised minimum cut framework to label word sense entries in WordNet with subjectivity information.",
                    "sid": 146,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their method requires less training data other than the sense definitions and relational structure of WordNet.",
                    "sid": 147,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.5 Word Polarity Classification for Foreign Languages.",
                    "sid": 148,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word sentiment and subjectivity has also been studied for languages other than English.",
                    "sid": 149,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Jijkoun and Hofmann (2009) describe a method for creating a non-English subjectivity 543 lexicon based on an English lexicon, an online translation service, and Wordnet.",
                    "sid": 150,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mihalcea and Banea (2007) use bilingual resources such as a bilingual dictionary or a parallel corpus to generate subjectivity analysis resources for foreign languages.",
                    "sid": 151,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rao and Ravichandran (2009) adapt their label propagation model to Hindi using Hindi WordNet and French using a French thesaurus.",
                    "sid": 152,
                    "ssid": 102,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "approach. ",
            "number": "3",
            "sents": [
                {
                    "text": "We use a Markov random walk model to identify the polarity of words.",
                    "sid": 153,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Assume that we have a network of words, some of which are labeled as either positive or negative.",
                    "sid": 154,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this network, two words are connected if they are related.",
                    "sid": 155,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different sources of information are used to decide whether two words are related.",
                    "sid": 156,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the synonyms of a word are all semantically related to it.",
                    "sid": 157,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The intuition behind connecting semantically related words is that those words tend to have similar polarities.",
                    "sid": 158,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now imagine a random surfer walking along the network starting from an unlabeled word w. The random walk continues until the surfer hits a labeled word.",
                    "sid": 159,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the word w is positive then the probability that the random walk hits a positive word is higher, and if w is negative then the probability that the random walk hits a negative word is higher.",
                    "sid": 160,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, if the word w is positive then the average time it takes a random walk starting at w to hit a positive node should be much less than the average time it takes a random walk starting at w to hit a negative node.",
                    "sid": 161,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If w doesn’t have a clear polarity and we would like to say that it is neutral, we expect that the positive hitting time and negative hitting time to not have a significant difference.",
                    "sid": 162,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describe how we construct a word relatedness graph in Section 3.1.",
                    "sid": 163,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The random walk model is described in Section 3.2.",
                    "sid": 164,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hitting time is defined in Section 3.3.",
                    "sid": 165,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, an algorithm for computing a sign and magnitude for the polarity of any given word is described in Section 3.4.",
                    "sid": 166,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Network Construction.",
                    "sid": 167,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We construct a network where two nodes are linked if they are semantically related.",
                    "sid": 168,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several sources of information are used as indicators of the relatedness of words.",
                    "sid": 169,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One such source is WordNet (Miller 1995).",
                    "sid": 170,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WordNet is a large lexical database of English.",
                    "sid": 171,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nouns, verbs, adjectives, and adverbs are grouped into sets of cognitive synonyms (synsets), each expressing a distinct concept (Miller 1995).",
                    "sid": 172,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Synsets are interlinked by means of conceptual-semantic and lexical relations.",
                    "sid": 173,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The simplest approach is to connect words that occur in the same WordNet synset.",
                    "sid": 174,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can collect all words in WordNet, and add links between any two words that occur in the same synset.",
                    "sid": 175,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting graph is a graph G(W, E) where W is a set of word/part-of-speech (POS) pairs for all the words in WordNet.",
                    "sid": 176,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "E is the set of edges connecting each pair of synonymous words.",
                    "sid": 177,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nodes represent word/POS pairs rather than words because the part of speech tags are helpful in disambiguating the different senses for a given word.",
                    "sid": 178,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the word “fine” has two different meanings, with two opposite polarities when used as an adjective and as a noun.",
                    "sid": 179,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several other methods can be used to link words.",
                    "sid": 180,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, we can use other WordNet relations: hypernyms, similar to, and so forth.",
                    "sid": 181,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another source of links between words is co-occurrence statistics from a corpus.",
                    "sid": 182,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following the method presented 544 in Hatzivassiloglou and McKeown (1997), we can connect words if they appear together in a conjunction in the corpus.",
                    "sid": 183,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method is only applicable to adjectives.",
                    "sid": 184,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If two adjectives are connected by “and,” it is highly likely that they have the same semantic orientation.",
                    "sid": 185,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all our experiments, we restricted the network to only WordNet relations.",
                    "sid": 186,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We study the effect of using co-occurrence statistics to connect words later at the end of our experiments.",
                    "sid": 187,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If more than one relation exists between any two words, the strength of the corresponding edge is adjusted accordingly.",
                    "sid": 188,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Random Walk Model.",
                    "sid": 189,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Imagine a random surfer walking along the word relatedness graph G. Starting from a word with unknown polarity i, it moves to a node j with probability Pij after the first step.",
                    "sid": 190,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The walk continues until the surfer hits a word with known polarity.",
                    "sid": 191,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Seed words with known polarity act as an absorbing boundary for the random walk.",
                    "sid": 192,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we repeat the number of random walks N times, the percentage of times in which the walk ends at a positive/negative word could be used as an indicator of its positive/negative polarity.",
                    "sid": 193,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The average time a random walk starting at w takes to hit the set of positive/negative nodes is also an indicator of its polarity.",
                    "sid": 194,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This view is closely related to the partially labeled classification with random walks approach in Szummer and Jaakkola (2002) and the semi-supervised learning using harmonic functions approach in Zhu, Ghahramani, and Lafferty (2003).",
                    "sid": 195,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let W be the set of words in our lexicon.",
                    "sid": 196,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We construct a graph whose nodes V are all words in W. Edges E correspond to the relatedness between words.",
                    "sid": 197,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We define the transition probability Pt+1|t ( j|i) from i to j by normalizing the weights of the edges out of node i, so: Pt+1|t ( j|i) = Wij/ Wik (1) k where k represents all nodes in the neighborhood of i. Pt+1|t ( j|i) denotes the transition probability from node i at step t to node j at time step t + 1.",
                    "sid": 198,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We note that the matrix of weights Wij is symmetric whereas the matrix of transition probabilities Pt+1|t ( j|i) is not necessarily symmetric because of the node outdegree normalization.",
                    "sid": 199,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 First-Passage Time.",
                    "sid": 200,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The mean first-passage (hitting) time h(i|k) is defined as the average number of steps a random walker, starting in state i /= k, will take to enter state k for the first time (Norris 1997).",
                    "sid": 201,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let G = (V, E) be a graph with a set of vertices V and a set of edges E. Consider a subset of vertices S ⊂ V. Consider a random walk on G starting at node i /∈ S. Let Nt denote the position of the random surfer at time t. Let h(i|S) be the average number of steps a random walker, starting in state i /∈ S, will take to enter a state k ∈ S for the first time.",
                    "sid": 202,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let TS be the first-passage for any vertex in S. P(TS = t|N0 = i) = pij × P(TS = t − 1|N0 = j) (2) j∈V 545 h(i|S) is the expectation of TS . Hence: h(i|S) = E(TS |N0 = i) ∞ = t=1 ∞ t × P(TS = t|N0 = i) = t=1 t j∈V pij P(TS = t − 1|N0 = j) ∞ = j∈V t=1 ∞ + j∈V t=1 = pij (t − 1)pij P(TS = t − 1|N0 = j) pij P(TS = t − 1|N0 = j) ∞ tP(TS = t|N0 = j) + 1 j∈V = j∈V t=1 pij × h( j|S) + 1 (3) Hence the first-passage (hitting) time can be formally defined as: 0 i ∈ S h(i|S) = 1:j∈V pij × h( j|S) + 1 otherwise (4) 3.4 Word Polarity Calculation.",
                    "sid": 203,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on the description of the random walk model and the first-passage (hitting) time above, we now propose our word polarity identification algorithm.",
                    "sid": 204,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We begin by constructing a word relatedness graph and defining a random walk on that graph as described above.",
                    "sid": 205,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let S+ and S− be two sets of vertices representing seed words that are already labeled as either positive or negative, respectively.",
                    "sid": 206,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For any given word w, we compute the hitting time h(w|S+ ) and h(w|S− ) for the two sets iteratively as described earlier.",
                    "sid": 207,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ratio between the two hitting times is then used as an indication of how positive/negative the given word is. This is useful in case we need to provide a confidence measure for the prediction.",
                    "sid": 208,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This could be used to allow the model to abstain from classifying words when the confidence level is low.",
                    "sid": 209,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also means that our method can be easily extended from two-way classification (i.e., positive or negative) to three-way classification (positive, negative, or neutral).",
                    "sid": 210,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be done by setting a threshold γ on the ratio of positive and negative hitting time, and classifying a word to positive or negative only when the two hitting times have a significant difference; otherwise we classify it to neutral.",
                    "sid": 211,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When the relatedness graph is very large, computing hitting time as described earlier may be very time consuming.",
                    "sid": 212,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The graph constructed from the English WordNet 546 Algorithm 1 3-class word polarity using random walks (parameter γ : 0 < γ < 1) Require: A word relatedness graph G 1: Given a word w in V 2: Define a random walk on the graph.",
                    "sid": 213,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The transition probability between any two nodes i, and j is defined as: Pt+1|t ( j|i) = Wij/ 1:k Wik 3: Start k independent random walks from w with a maximum number of steps m 4: Stop when a positive word is reached 5: Let h∗ (w|S+ ) be the estimated value for h(w|S+ ) 6: Repeat for negative words computing h∗ (w|S− ) 7: if h∗ (w|S+ ) ≤ γh∗ (w|S− ) then 8: Classify w as positive 9: else if h∗ (w|S− ) ≤ γh∗ (w|S+ ) then 10: Classify w as negative 11: else 12: Classify w as neutral 13: end if and synsets contains 155,000 nodes and 117,000 edges.",
                    "sid": 214,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To overcome this problem, we propose a Monte Carlo–based algorithm (Algorithm 1) for estimating it.",
                    "sid": 215,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of binary classification, where each word must be either positive or negative, if h(w|S+ ) is greater than h(w|S− ), the word is classified as negative and positive otherwise.",
                    "sid": 216,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be achieved by setting parameter γ = 1 in Algorithm 1.",
                    "sid": 217,
                    "ssid": 65,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "foreign word polarity. ",
            "number": "4",
            "sents": [
                {
                    "text": "As we mentioned earlier, a large body of research has focused on identifying the semantic orientation of words.",
                    "sid": 218,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work has almost exclusively dealt with English and uses several language-dependent resources.",
                    "sid": 219,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When we try to apply these methods to other languages, we run into the problem of the lack of resources in other languages when compared with English.",
                    "sid": 220,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the General Inquirer lexicon (Stone et al. 1966) has thousands of English words labeled with semantic orientation.",
                    "sid": 221,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of the literature has used it as a source of labeled seeds or for evaluation.",
                    "sid": 222,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such lexicons are not readily available in other languages.",
                    "sid": 223,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we showed earlier, WordNet (Miller 1995) has been used for this task.",
                    "sid": 224,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, even though W have been built for other languages, their coverage is relatively limited when compared to the English WordNet.",
                    "sid": 225,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The current release of English Word- Net (WordNet 3.0) includes over 155K words and over 117K synsets.",
                    "sid": 226,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Looking at the resources for other languages, the Arabic WordNet (Black et al. 2006; Elkateb et al. 2006a, 2006b) contains only 11K synsets; the Hindi WordNet (Jha et al. 2001; Narayan et al. 2002) contains 32K synsets; Euro WordNet (Vossen 1997) contains 23K synsets in Spanish, 15K in German, and 22K in French, among other European languages.",
                    "sid": 227,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In some cases, accuracy was traded for coverage.",
                    "sid": 228,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the current release of the Japanese WordNet has 57K synsets but contains errors in as many as 5% of the entries.1 In this section, we show how we can extend the methods presented earlier to predict the semantic orientation of foreign words.",
                    "sid": 229,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed method is based on creating 1 http://nlpwww.nict.go.jp/wnja/index.en.html.",
                    "sid": 230,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "547 a multilingual network of words that represents both English and foreign words.",
                    "sid": 231,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The network has English–English connections, as well as Foreign–Foreign connections and English–Foreign connections.",
                    "sid": 232,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This allows us to benefit from the richness of the resources built for the English language and at the same time utilize resources specific to foreign languages.",
                    "sid": 233,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We define a random walk model over the multilingual network and predict the semantic orientation of any given word by comparing the mean hitting time of a random walk starting from it to a positive and a negative set of seed English words.",
                    "sid": 234,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use Arabic and Hindi in our experiments.",
                    "sid": 235,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compare the performance of several methods using the foreign language resources only, and the multilingual network that has both English and foreign words.",
                    "sid": 236,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that bootstrapping from languages with dense resources such as English is useful for improving the performance on other languages with limited resources.",
                    "sid": 237,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Multilingual Word Network.",
                    "sid": 238,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We build a network G(V, E) where V = Ven ∪ Vfr is the union of the sets of English and Foreign words.",
                    "sid": 239,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "E is a set of edges connecting nodes in V. There are three types of connections: English–English connections, Foreign–Foreign connections, and English–Foreign connections.",
                    "sid": 240,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the English–English connections, we use the same methodology as in Section 3.",
                    "sid": 241,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Foreign–Foreign connections are created in a similar way to the English connections.",
                    "sid": 242,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some foreign languages have lexical resources based on the design of the Princeton English WordNet.",
                    "sid": 243,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example: Euro WordNet (Vossen 1997), Arabic Word- Net (Black et al. 2006; Elkateb et al. 2006a, 2006b), and the Hindi WordNet (Jha et al. 2001; Narayan et al. 2002).",
                    "sid": 244,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also use co-occurrence statistics similar to the work of Hatzivassiloglou and McKeown (1997).",
                    "sid": 245,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, to connect foreign words to English words, we use a Foreign to English dictionary.",
                    "sid": 246,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For every word in a list of foreign words, we look up its meaning in a dictionary and add an edge between the foreign word and every other English word that appeared as a possible meaning for it.",
                    "sid": 247,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If there is no comprehensive enough dictionary available, constructing a multilingual word network like a translation graph (Etzioni et al. 2007) may be a resolution.",
                    "sid": 248,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Foreign Word Semantic Orientation Prediction.",
                    "sid": 249,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the multilingual network described previously to predict the semantic orientation of words based on the mean hitting time to two sets of positive and negative seeds.",
                    "sid": 250,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given two lists of seed English words with known polarity, we define two sets of nodes S+ and S− representing those seeds.",
                    "sid": 251,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For any given word w, we calculate the mean hitting time between w and the two seed sets h(w|S+ ) and h(w|S− ).",
                    "sid": 252,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If h(w|S+ ) is greater than h(w|S− ), the word is classified as negative; otherwise it is classified as positive.",
                    "sid": 253,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the list of labeled seeds from Hatzivassiloglou and McKeown (1997) and Stone et al.",
                    "sid": 254,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1966).",
                    "sid": 255,
                    "ssid": 38,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "out-of-vocabulary words. ",
            "number": "5",
            "sents": [
                {
                    "text": "We observed that a significant portion of the text used online in discussions, comments, product reviews, and so on, contains words that are not defined in WordNet or in 548 standard dictionaries.",
                    "sid": 256,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We call these words Out-of-Vocabulary (OOV) words.",
                    "sid": 257,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6 later in this article shows some OOV word examples.",
                    "sid": 258,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To show the importance of OOV word polarity identification, we calculated the proportion of OOV words in three corpora used for sentiment studies: a set of movie reviews, a set of online discussions from a political forum, and a set of randomly sampled tweets.",
                    "sid": 259,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each word in the data, we look it up in two standard English dictionaries, together containing 160K unique words.",
                    "sid": 260,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 shows the statistics.",
                    "sid": 261,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "OOV words have a high chance of being polarized because people tend to use informal language or special acronyms to emphasize their attitudes or impress the audience.",
                    "sid": 262,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, being able to automatically identify the polarity of OOV words will essentially benefit real-world applications.",
                    "sid": 263,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the graph G(W, E) described in Section 3.1.",
                    "sid": 264,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So far, the only resource we use to construct the graph is WordNet synsets.",
                    "sid": 265,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first step in our approach to OOV word polarity identification is to find the words in WordNet that are related to an OOV word.",
                    "sid": 266,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, we add the OOV words to our graph by creating a new node for each OOV word and adding an edge between each OOV word and each of its related words.",
                    "sid": 267,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once we have constructed the extended network, we use the random walk model described in Section 3.2 to predict the polarity of each OOV word.",
                    "sid": 268,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Mining OOV Word Relatedness from the Web.",
                    "sid": 269,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are several alternative methods of linking words in the graph.",
                    "sid": 270,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Agirre et al.",
                    "sid": 271,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009) studied the strengths and weaknesses of different approaches to term similarity and relatedness.",
                    "sid": 272,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They noticed that lexicographical methods such as the WordNet suffer from the limitation of lexicon coverage, which is the case here with OOV words.",
                    "sid": 273,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To overcome this limitation, we use a Web-based distributional approach to find the set of related words to each OOV word.",
                    "sid": 274,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We perform a Web search using the OOV word as a search query and retrieve the top S search results.",
                    "sid": 275,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We extract the textual content of the retrieved results and tokenize it.",
                    "sid": 276,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After removing all the stop words, we compute the number of times each word co-occurs with the OOV word in the same document.",
                    "sid": 277,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We rank the words based on their co-occurrence frequency and return the top R words as the set of related words to the given OOV word.",
                    "sid": 278,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We experimented with three different variants of this approach.",
                    "sid": 279,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first variant, the frequency values of the co-occurring words are normalized by the lengths of the Table 1 Proportion of OOV words in some corpora used for real world applications.",
                    "sid": 280,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Numbers in parentheses exclude words whose first letters are capitalized because they are likely to refer to named entities.)",
                    "sid": 281,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "corpus source # of words Percentage of OOV Movie reviews Political forum tweets 3,411 customer reviews from IMDb for the movie The Dark Knight(2008) 23 K sentences from www.politicalforum.com on various topics 0.6M random English tweets from twitter.com.",
                    "sid": 282,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(We count a tweet as in English if at least half of the words are English dictionary words.",
                    "sid": 283,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tags and symbols were removed.)",
                    "sid": 284,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10.7 M (9.5M) 381 K (348 K) 7.1 M (5.9 M) 5.3 (2.7) 8(6) 30 (27) 549 documents that contributed to the count of each word.",
                    "sid": 285,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The intuition here is that longer documents contain more words and hence the probability that a word in the that document is related to the search query (i.e., the OOV word) is lower than when the document is shorter.",
                    "sid": 286,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second variant, we only consider the words that appear in the proximity of the OOV word (i.e., within d words around the OOV word) when we compute the co- occurrence frequency.",
                    "sid": 287,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The intuition here is that words that appear near the OOV word are more likely to be semantically related than the words that appear far away.",
                    "sid": 288,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the third variant, instead of searching the entire Web, we limit the search to social text.",
                    "sid": 289,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the experiments described subsequently, we search for the OOV words in tweets posted on Twitter.2 The intuition here is that searching the entire Web is likely to return results that do not necessarily contain opinionated text—particularly because many words have different senses.",
                    "sid": 290,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, the text written in a social context is more likely to carry sentiment and express emotions.",
                    "sid": 291,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This helps us find better related words that suit our task.",
                    "sid": 292,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Word Network Extension with OOV Words.",
                    "sid": 293,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To extend the graph to include OOV words, we start with the graph G(W, E) constructed from WordNet synsets.",
                    "sid": 294,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each OOV word that does not exist in G, we create a new node w. We set the part of speech of w to unspecified.",
                    "sid": 295,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we use the Web-based method described in the previous section to find a set of words that are most related to w. Finally, we create a link between each OOV word and each of its related words.",
                    "sid": 296,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To predict the polarity of an OOV word, we use the same random walk model described earlier.",
                    "sid": 297,
                    "ssid": 42,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "6",
            "sents": [
                {
                    "text": "We performed experiments on the gold-standard data set for positive/negative words from the General Inquirer lexicon (Stone et al. 1966).",
                    "sid": 298,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The data set contains 4, 206 words, 1, 915 of which are positive and 2, 291 of which are negative.",
                    "sid": 299,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of the ambiguous words were removed, as in Turney (2002) and Takamura, Inui, and Okumura (2005).",
                    "sid": 300,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some examples of positive/negative words are listed in Table 2.",
                    "sid": 301,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use WordNet (Miller 1995) as a source of synonyms and hypernyms for the word relatedness graph.",
                    "sid": 302,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the Reuters Corpus, Volume 1 (Lewis et al. 2004) to generate co-occurrence statistics in the experiments that used them.",
                    "sid": 303,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used 10-fold cross-validation for all tests.",
                    "sid": 304,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluate our results in terms of accuracy.",
                    "sid": 305,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Statistical significance was tested using a two-tailed paired t-test.",
                    "sid": 306,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All reported results are statistically significant at the 0.05 level.",
                    "sid": 307,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We perform experiments varying the parameters and the network.",
                    "sid": 308,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also look at the performance of the proposed method for different parts of speech, and for different confidence levels.",
                    "sid": 309,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compare our method to the Semantic Orientation from PMI (SO-PMI) method described in Turney (2002), the Spin model described in Takamura, Inui, and Okumura (2005), the shortest path method described in Kamps et al.",
                    "sid": 310,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004), a re-implementation of the label propagation and Mincut methods described in Rao and Ravichandran (2009), and the bootstrapping method described in Hu and Liu (2004).",
                    "sid": 311,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 http://www.twitter.com.",
                    "sid": 312,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "550 Table 2 Examples of positive and negative words.",
                    "sid": 313,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Positive Negative abl e adj ect ive ab an do n ver b acc ept abl e adj ect ive ab us e ver b ad mir e ver b bu rgl ar no un am azin g adj ect ive ch ao s no un car eful adj ect ive co nta gio us adj ect ive eas e no un cor ru pti on no un gui de ver b lie ver b ins pire ver b rel uct ant adj ect ive trut hful adj ect ive wr on g adj ect ive 6.1 Comparison with Other Methods.",
                    "sid": 314,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method could be used in a semi-supervised setting where a set of labeled words are used and the system learns from these labeled nodes and from other unlabeled nodes.",
                    "sid": 315,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Under this setting, we compare our method to the spin model described in Takamura, Inui, and Okumura (2005).",
                    "sid": 316,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 compares the performance using 10-fold cross validation.",
                    "sid": 317,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The table shows that the proposed method outperforms the spin model.",
                    "sid": 318,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The spin model approach uses word glosses, WordNet synonym, hypernym, and antonym relations, in addition to co-occurrence statistics extracted from corpus.",
                    "sid": 319,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed method achieves better performance by only using WordNet synonym, hypernym, and similar to relations.",
                    "sid": 320,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adding co-occurrence statistics slightly improved performance, and using glosses did not help at all.",
                    "sid": 321,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also compare our method to a re-implementation of the label propagation (LP) method.",
                    "sid": 322,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our method outperforms the LP method in both the 10-fold cross-validation setup and when only 14 seeds are used.",
                    "sid": 323,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also compare our method to the SO-PMI method.",
                    "sid": 324,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Turney and Littman (2002) propose two methods for predicting the semantic orientation of words.",
                    "sid": 325,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They use Latent Semantic Analysis (SO-LSA) and Pointwise Mutual Information (SO-PMI) for measuring the statistical association between any given word and a set of 14 seed words.",
                    "sid": 326,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They describe this method as unsupervised because they only use 14 seeds as paradigm words that define the semantic orientation rather than train the model (Turney 2002).",
                    "sid": 327,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 Accuracy for SO-PMI with different data set sizes, the spin model, the label propagation model, and the random walks model for 10-fold cross-validation and 14 seeds.",
                    "sid": 328,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "– C V 14 se ed sSO PMI (1 × 107 ) – 6 1 . 3SO PMI (2 × 109 ) – 7 6 . 1SO PMI (1 × 1011 ) – 8 2 . 8 Spi n Mo del 91.",
                    "sid": 329,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 8 1 . 9 Lab el Pro pag atio n 88.",
                    "sid": 330,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "40 7 4 . 8 3 Ran do m Wal ks 93.",
                    "sid": 331,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 8 2 . 1 551 The SO-PMI value can be calculated as follows: hitsw,pos × hitsneg SO-PMI(w) = log w,neg × hitspos (5) where w is a word with unknown polarity, hitsw,pos is the number of hits returned by a commercial search engine when the search query is the given word and the disjunction of all positive seed words.",
                    "sid": 332,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "hitspos is the number of hits when we search for the disjunction of all positive seed words.",
                    "sid": 333,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "hitsw,neg , and hitsneg are defined similarly.",
                    "sid": 334,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After Turney (2002), we use our method to predict semantic orientation of words in the General Inquirer lexicon (Stone et al. 1966) using only 14 seed words.",
                    "sid": 335,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The network we used contains only WordNet relations.",
                    "sid": 336,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No glosses or co-occurrence statistics are used.",
                    "sid": 337,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results comparing the SO-PMI method with different data set sizes, the spin model, and the proposed method using only 14 seeds is shown in Table 3.",
                    "sid": 338,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We observe that the random walk method outperforms SO-PMI when SO-PMI uses data sets of sizes 1 × 107 and 2 × 109 words.",
                    "sid": 339,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of SO-PMI and the random walk methods are comparable when SO-PMI uses a very large data set (1 × 1011 words).",
                    "sid": 340,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of the spin model approach is also comparable to the other two methods.",
                    "sid": 341,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The advantages of the random walk method over SO-PMI is that it is faster and it does not need a very large corpus.",
                    "sid": 342,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another advantage is that the random walk method can be used along with the labeled data from the General Inquirer lexicon (Stone et al. 1966) to get much better performance.",
                    "sid": 343,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is costly for the SO-PMI method because that will require the submission of almost 4,000 queries to a commercial search engine.",
                    "sid": 344,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also compare our method with the bootstrapping method described in Hu and Liu (2004), and the shortest path method described in Kamps et al.",
                    "sid": 345,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004).",
                    "sid": 346,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We build a network using only WordNet synonyms and hypernyms.",
                    "sid": 347,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We restrict the test set to the set of adjectives in the General Inquirer lexicon because our method is mainly interested in classifying adjectives.",
                    "sid": 348,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of the spin model, the bootstrapping method, the shortest path method, the LP method, the Mincut method, and the random walk method for only adjectives is shown in Table 4.",
                    "sid": 349,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We notice from the table that the random walk method outperforms the spin model, the bootstrapping method, the shortest path method, the LP method, and the Mincut method for adjectives.",
                    "sid": 350,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reported accuracy for the shortest path method only considers the words it could assign a nonzero orientation value.",
                    "sid": 351,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we consider all words, its accuracy will drop to around 61%.",
                    "sid": 352,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1.1 Varying Parameters.",
                    "sid": 353,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we mentioned in Section 3.4, we use a parameter m to put an upper bound on the length of random walks.",
                    "sid": 354,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we explore the impact of this parameter on our method’s performance.",
                    "sid": 355,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 shows the accuracy of the random walk method as a function of the maximum number of steps m as it varies from 5 to 50.",
                    "sid": 356,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use a network built from WordNet synonyms and hypernyms only.",
                    "sid": 357,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of samples k was set to 1, 000.",
                    "sid": 358,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 Accuracy for adjectives only for the spin model, the bootstrap method, and the random walk model.",
                    "sid": 359,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Method Spin Model Bootstrap Shortest Path LP Mincut Random Walks Accuracy 83.6 72.8 68.8 84.8 73.8 88.8 552 Figure 1 The effect of varying the maximum number of steps (m) on accuracy (k = 1,000).",
                    "sid": 360,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We perform 10-fold cross-validation using the General Inquirer lexicon.",
                    "sid": 361,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We observe that the maximum number of steps m has very little impact on performance until it rises above 30.",
                    "sid": 362,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At that point, the performance drops by no more than 1%, and then it no longer changes as m increases.",
                    "sid": 363,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An interesting observation is that the proposed method performs quite well with a very small number of steps (around 10).",
                    "sid": 364,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We looked at the data set to understand why increasing the number of steps beyond 30 negatively affects performance.",
                    "sid": 365,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found out that when the number of steps is very large compared with the diameter of the graph, the random walk that starts at ambiguous words (which are hard to classify) have the chance of moving until it hits a node in the opposite class.",
                    "sid": 366,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That does not happen when the limit on the number of steps is smaller because those walks are then terminated without hitting any labeled nodes and are hence ignored.",
                    "sid": 367,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, we study the effect of the number of samples k on our method’s performance.",
                    "sid": 368,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As explained in Section 3.4, k is the number of samples used by the Monte Carlo algorithm to find an estimate for the hitting time.",
                    "sid": 369,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows the accuracy of the random walks method as a function of the number of samples k. We use the same Figure 2 The effect of varying the number of samples (k) on accuracy.",
                    "sid": 370,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "553 settings as in the previous experiment.",
                    "sid": 371,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The only difference is that we fix m at 15 and vary k from 10 to 20, 000 (note the logarithmic scale).",
                    "sid": 372,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We notice that the performance is badly affected when the value of k is very small (less than 100).",
                    "sid": 373,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also notice that after 1, 000, varying k has very little, if any, effect on performance.",
                    "sid": 374,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This shows that the Monte Carlo algorithm for computing the random walks hitting time performs quite well with values of the number of samples as small as 1, 000.",
                    "sid": 375,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The preceding experiments suggest that the parameter m has very little impact on the performance.",
                    "sid": 376,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that the approach is fairly robust (i.e., it is quite insensitive to different parameter settings).",
                    "sid": 377,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1.2 Other Experiments.",
                    "sid": 378,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now measure the performance of the random walk method when the system is allowed to abstain from classifying the words for which it has low confidence.",
                    "sid": 379,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We regard the ratio between the hitting time to positive words and hitting time to negative words as a confidence measure and evaluate the top words with the highest confidence level at different values of threshold.",
                    "sid": 380,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 shows the accuracy for 10-fold cross validation and for using only 14 seeds at different thresholds.",
                    "sid": 381,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We notice that the accuracy improves by abstaining from classifying the difficult words.",
                    "sid": 382,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The figure shows that the top 60% words are classified with accuracy greater than 99% for 10-fold cross validation and 92% with 14 seed words.",
                    "sid": 383,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This may be compared with the work described in Takamura, Inui, and Okumura (2005), where they achieve the 92% level when they only consider the top 1,000 words (28%).",
                    "sid": 384,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 4 shows a learning curve displaying how the performance of both the proposed method and the LP method is affected with varying the labeled set size (i.e., the number of seeds).",
                    "sid": 385,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We notice that the accuracy exceeds 90% when the training set size rises above 20%.",
                    "sid": 386,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The accuracy steadily increases as the size of labeled data increases.",
                    "sid": 387,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also looked at the classification accuracy for different parts of speech in Figure 5.",
                    "sid": 388,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We notice that, in the case of 10-fold cross-validation, the performance is consistent across parts of speech.",
                    "sid": 389,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, when we only use 14 seeds—all of which are adjectives, similar to Turney and Littman (2003)—we notice that the performance on adjectives is much better than other parts of speech.",
                    "sid": 390,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When we use 14 seeds but replace some of the adjectives with verbs and nouns such as love, harm, friend, enemy, the performance for nouns and verbs improves considerably at the cost of a small drop in the Figure 3 Accuracy for words with high confidence measure.",
                    "sid": 391,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "554 Figure 4 The effect of varying the number of seeds on accuracy.",
                    "sid": 392,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "100 95 90 85 80 75 70 65 60 55 50 Figure 5 C V 1 4 A d j S e e d s 1 4 S e e d s A d j A d v N o u n V e r b Accuracy for different parts of speech.",
                    "sid": 393,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "performance on adjectives.",
                    "sid": 394,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we tried adding edges to the network from glosses and co-occurrence statistics but we did not get any statistically significant improvement.",
                    "sid": 395,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of the words that were very weakly linked benefited from adding new types of links and they were correctly predicted.",
                    "sid": 396,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Others were misled by the noise and were incorrectly classified.",
                    "sid": 397,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We had a closer look at the results to find out what are the reasons behind incorrect predictions.",
                    "sid": 398,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found two main reasons.",
                    "sid": 399,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, some words have more than one sense, possibly with different semantic orientations.",
                    "sid": 400,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Disambiguating the sense of words given their context before trying to predict their polarity should solve this problem.",
                    "sid": 401,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second reason is that some words have very few connections in the thesaurus.",
                    "sid": 402,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A possible solution to this might be to identify those words and add more links to them from glosses of co-occurrence statistics in the corpus.",
                    "sid": 403,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1.3 General Purpose Three-Way Classification.",
                    "sid": 404,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments described so far all use the General Inquirer lexicon, which contains a well-established gold standard data set of positive and negative words.",
                    "sid": 405,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, in realistic applications, a general purpose 555 Table 5 Accuracy for three classes on a general purpose list of 2,000 words.",
                    "sid": 406,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Class Positive Negative Neutral Overall Accuracy 68.0 82.1 80.6 77.9 list of words will frequently have neutral words that don’t express sentiment polarity.",
                    "sid": 407,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To evaluate the effectiveness of the random walk method in distinguishing polarized words from neutral words, we constructed a data set of 2, 000 words randomly picked from a standard English dictionary3 and hand labeled them with three classes: positive, negative, and neutral.",
                    "sid": 408,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among the 2, 000 words, 494 were labeled positive, 491 negative, and 1, 015 neutral.",
                    "sid": 409,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distribution among different parts of speech is 532 adjectives, 335 verbs, 1, 051 nouns, and 82 others.",
                    "sid": 410,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the semi-supervised setting with the General Inquirer lexicon polarized word list as the training set.",
                    "sid": 411,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because the 2, 000 test set has some portion of polarized words overlapping with the training set, we excluded the words that appear in the test set from the training set.",
                    "sid": 412,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We performed Algorithm 2 in Section 3.4 with parameters γ = 0.8, m = 15, k = 1, 000.",
                    "sid": 413,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall accuracy as well as the precision for each class is shown in Table 5.",
                    "sid": 414,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can see that the accuracy of the positive class is much lower than the negative class, due to the many positive words classified as neutral.",
                    "sid": 415,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that the average confidence of negative words is higher than positive words.",
                    "sid": 416,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One factor that could have caused this is the bias originating from the training set.",
                    "sid": 417,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because there are more negative seeds than positive ones, the constructed graph has an overall bias towards the negative class.",
                    "sid": 418,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.2 Foreign Words.",
                    "sid": 419,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the English data we described earlier, we constructed a labeled set of 300 Arabic and 300 Hindi words for evaluation.",
                    "sid": 420,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For every language, we asked two native speakers to examine a large amount of text and identify a set of positive and negative words.",
                    "sid": 421,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also used an Arabic–English and a Hindi–English dictionary to generate Foreign–English links.",
                    "sid": 422,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compare our results with two baselines.",
                    "sid": 423,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first is the SO-PMI method described in Turney and Littman (2003).",
                    "sid": 424,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the same seven positive and seven negative seeds as Turney and Littman (2003).",
                    "sid": 425,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second baseline constructs a network of only foreign words as described earlier.",
                    "sid": 426,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It uses mean hitting time to find the semantic association of any given word.",
                    "sid": 427,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used 10-fold cross-validation for this experiment.",
                    "sid": 428,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will refer to this system as HTFR.",
                    "sid": 429,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we build a multilingual network and use the hitting time as before to predict semantic orientation.",
                    "sid": 430,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the English words from Stone et al.",
                    "sid": 431,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1966) as seeds and the labeled foreign words for evaluation.",
                    "sid": 432,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will refer to this system as HTFR-EN.",
                    "sid": 433,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 6 compares the accuracy of the three methods for Arabic and Hindi.",
                    "sid": 434,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We notice that the SO-PMI and the hitting time–based methods perform poorly on both Arabic and Hindi.",
                    "sid": 435,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is clearly evident when we consider that the accuracy of the two systems on English was 83%, and 93%, respectively (Turney and Littman 2003; Hassan 3 Very infrequent words were filtered out by setting a threshold on the inverse document frequency of the.",
                    "sid": 436,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "words in a corpus.",
                    "sid": 437,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "556 100 90 80 70 60 50 40 30 20 10 0 Figure 6 S O P M I H T F R H T F R + E N A r a b i c H i n d i Accuracy of foreign word polarity identification.",
                    "sid": 438,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and Radev 2010).",
                    "sid": 439,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This supports our hypothesis that state-of-the-art methods, designed for English, perform poorly on foreign languages due to the limited amount of resources in them.",
                    "sid": 440,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The figure also shows that the proposed method, which combines resources from both English and foreign languages, performs significantly better.",
                    "sid": 441,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we studied how much improvement is achieved by including links between foreign words from global WordNets.",
                    "sid": 442,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found out that it improves the performance by 2.5% and 4% for Arabic and Hindi, respectively.",
                    "sid": 443,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.3 OOV Words.",
                    "sid": 444,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We created a labeled set of 300 positive and negative OOV words.",
                    "sid": 445,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We asked a native English speaker to examine a large number of threads posted on several online forums and identify OOV words and label them with their polarities.",
                    "sid": 446,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some examples of positive/negative OOV words are listed in Table 6.",
                    "sid": 447,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline we use for OOV words is the SO-PMI method with the same 14 seeds as in Turney and Littman (2003).",
                    "sid": 448,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The calculation of SO-PMI is given in Equation (5).",
                    "sid": 449,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the approach described in Section 5 to automatically label the words.",
                    "sid": 450,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the words of the General Inquirer lexicon as labeled seeds.",
                    "sid": 451,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We set the maximum number of steps m to 15 and the number of samples k to 1, 000.",
                    "sid": 452,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We experimented with Table 6 Examples of positive and negative OOV words.",
                    "sid": 453,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P o s i t i v e N e g a t i v e Wor d Meaning Wo rd Meaning be aut im ou s beautiful and fabulous gr8 great bufft ing attractive d i s a s t r o p h y a c a t a s t r o p h y a n d a d i s a s t e r b a n j a x e d r u i n e d ijit idiot 557 Figure 7 Accuracy of different methods in predicting OOV words polarity.",
                    "sid": 454,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the three variants we proposed for extracting the related words as described in Section 5.",
                    "sid": 455,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We give the experimental setup for each variant here: 1.",
                    "sid": 456,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Search the entire Web (WS): We used Yahoo search4 to execute the search.",
                    "sid": 457,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "queries.",
                    "sid": 458,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each OOV word, we retrieve the top 500 results and use them to extract the related words.",
                    "sid": 459,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 460,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Search the entire Web and limit the extraction of related words to the.",
                    "sid": 461,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "proximity of the OOV word (WSP): We fix the proximity of a given OOV word to 15 words before and 15 words after the OOV word (we experimented with different ranges but no significant changes were observed).",
                    "sid": 462,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 463,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Limit the search to social content (SOC): We limit the search for OOV.",
                    "sid": 464,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "words to tweets posted on Twitter.",
                    "sid": 465,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the Twitter search API to submit the search queries.",
                    "sid": 466,
                    "ssid": 169,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each OOV word, we retrieve 10,000 tweets.",
                    "sid": 467,
                    "ssid": 170,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each tweet is maximum of 140 characters long.",
                    "sid": 468,
                    "ssid": 171,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 7 shows the results of the three methods compared with the baseline SO-PMI.",
                    "sid": 469,
                    "ssid": 172,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results show that extracting related words from tweets gives the best accuracy.",
                    "sid": 470,
                    "ssid": 173,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This corroborated our intuition that using social content is more likely to provide sentiment- related words.",
                    "sid": 471,
                    "ssid": 174,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline SO-PMI and WS obtain very similar accuracy.",
                    "sid": 472,
                    "ssid": 175,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This agrees with the comparable performance of the two methods in the earlier experiment on the General Inquirer lexicon.",
                    "sid": 473,
                    "ssid": 176,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The three variant methods for obtaining related words have a tunable parameter R, the number of related words extracted for each OOV word.",
                    "sid": 474,
                    "ssid": 177,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We observe that R has a non-negligible effect on the prediction accuracy.",
                    "sid": 475,
                    "ssid": 178,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results shown in Figure 8 correspond to R = 90.",
                    "sid": 476,
                    "ssid": 179,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To better understand the impact of varying this parameter, we ran the experiment that uses Twitter to extract related words several times using different values for R. Figure 8 shows how the accuracy of polarity prediction changes as R changes.",
                    "sid": 477,
                    "ssid": 180,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 http://www.yahoo.com.",
                    "sid": 478,
                    "ssid": 181,
                    "kind_of_tag": "s"
                },
                {
                    "text": "558 70% 65% 60% 55% 50% 45% 40% 0 2 0 4 0 6 0 8 0 1 0 0 1 2 0 1 4 0 1 6 0 1 8 0 N u m b e r o f r e l a t e d w o r d s Figure 8 The effect of varying the number of extracted related words on accuracy.",
                    "sid": 479,
                    "ssid": 182,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "7",
            "sents": [
                {
                    "text": "Predicting the semantic orientation of words is a very interesting task in natural language processing and it has a wide variety of applications.",
                    "sid": 480,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We proposed a method for automatically predicting the semantic orientation of words using random walks and hitting time.",
                    "sid": 481,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed method is based on the observation that a random walk starting at a given word is more likely to hit another word with the same semantic orientation before hitting a word with a different semantic orientation.",
                    "sid": 482,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed method can be used in a semi-supervised setting, where a training set of labeled words is used, and in a weakly supervised setting, where only a handful of seeds is used to define the two polarity classes.",
                    "sid": 483,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We predict semantic orientation with high accuracy.",
                    "sid": 484,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed method is fast, simple to implement, and does not need any corpus.",
                    "sid": 485,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also extended the proposed method to cover the problem of predicting the semantic orientation of foreign words.",
                    "sid": 486,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All previous work on this task has almost exclusively focused on English.",
                    "sid": 487,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Applying off-the-shelf methods developed for English to other languages does not work well because of the limited amount of resources available in foreign languages compared with English.",
                    "sid": 488,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that the proposed method can predict the semantic orientation of foreign words with high accuracy and outperforms state-of-the-art methods limited to using language specific resources.",
                    "sid": 489,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we further extended the method to cover out-of-vocabulary words.",
                    "sid": 490,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These words do not exist in WordNet and are not defined in the standard dictionaries of the language.",
                    "sid": 491,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We proposed using a Web-based approach to add the OOV words to our words network based on co-occurrence statistics, then use the same random walk model to predict the polarity.",
                    "sid": 492,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We showed that this method can predict the polarity of OOV words with good accuracy.",
                    "sid": 493,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This research was funded by the Office of the Director of National Intelligence (ODNI), Intelligence Advanced Research Projects Activity (IARPA), through the U.S. Army Research Lab.",
                    "sid": 494,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All statements of fact, opinion, or conclusions contained herein are those of the authors and should not be construed as representing the official views or policies of IARPA, the ODNI, or the U.S. Government.",
                    "sid": 495,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "559",
                    "sid": 496,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}