{
    "ID": "P11-2122",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This work introduces a new approach to checking treebank consistency.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Derivation trees based on a variant of Tree Adjoining Grammar are used to compare the annotation of word sequences based on their structural similarity.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This overcomes the problems of earlier approaches based on using strings of words rather than tree structure to identify the appropriate contexts for comparison.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We report on the result of applying this approach to the Penn Arabic Treebank and how this approach leads to high precision of error detection.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The internal consistency of the annotation in a tree- bank is crucial in order to provide reliable training and testing data for parsers and linguistic research.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Treebank annotation, consisting of syntactic structure with words as the terminals, is by its nature more complex and thus more prone to error than other annotation tasks, such as part-of-speech tagging.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recent work has therefore focused on the importance of detecting errors in the treebank (Green and Manning, 2010), and methods for finding such errors automatically, e.g.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Dickinson and Meurers, 2003b; Boyd et al., 2007; Kato and Matsubara, 2010).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present here a new approach to this problem that builds upon Dickinson and Meurers (2003b), by integrating the perspective on treebank consistency checking and search in Kulick and Bies (2010).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach in Dickinson and Meurers (2003b) has certain limitations and complications that are inherent in examining only strings of words.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To over come these problems, we recast the search as one of searching for inconsistently-used elementary trees in a Tree Adjoining Grammar-based form of the tree- bank.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This allows consistency checking to be based on structural locality instead of n-grams, resulting in improved precision of finding inconsistent treebank annotation, allowing for the correction of such inconsistencies in future work.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "background and motivation. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Previous Work - DECCA.",
                    "sid": 13,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic idea behind the work in (Dickinson and Meurers, 2003a; Dickinson and Meurers, 2003b) is that strings occurring more than once in a corpus may occur with different “labels” (taken to be constituent node labels), and such differences in labels might be the manifestation of an annotation error.",
                    "sid": 14,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adopting their terminology, a “variation nucleus” is the string of words with a difference in the annotation (label), while a “variation n-gram” is a larger string containing the variation nucleus.",
                    "sid": 15,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) a.",
                    "sid": 16,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(NP the (ADJP most important) points) b.",
                    "sid": 17,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(NP the most important points) For example, suppose the pair of phrases in (1) are taken from two different sentences in a corpus.",
                    "sid": 18,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The “variation nucleus” is the string most important, and the larger surrounding n-gram is the string the most important points.",
                    "sid": 19,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is an example of error in the corpus, since the second annotation is incorrect, and this difference manifests itself by the nucleus having in (a) the label ADJP but in (b) the default label NIL (meaning for their system that the nucleus has no covering node).Dickinson and Meurers (2003b) propose a “non 693 Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics:shortpapers, pages 693–698, Portland, Oregon, June 1924, 2011.",
                    "sid": 20,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2011 Association for Computational Linguistics fringe heuristic”, which considers two variation nuclei to have a comparable context if they are properly contained within the same variation n-gram - i.e., there is at least one word of the n-gram on both sides of the nucleus.",
                    "sid": 21,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the the pair in (1), the two instances of the variation nucleus satisfy the non- fringe heuristic because they are properly contained within the identical variation n-gram (with the and points on either side).",
                    "sid": 22,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "See Dickinson and Meurers (2003b) for details.",
                    "sid": 23,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work forms the basis for the DECCA system.1 2.2 Motivation for Our Approach.",
                    "sid": 24,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "inconsistent structures for the identical word sequences as in (2ab), the DECCA approach would instead focus on the single word Al$yx, which has a NP label in (2a), while it has the default label NIL in (2b).",
                    "sid": 25,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, whether it is reported as a variation depends on the irrelevant fact of whether the word to the right of Al$yx is the same in both instances, thus allowing it to pass the non-fringe heuristic (since it already has the same word, $rm, on the left).",
                    "sid": 26,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider now the two trees (2bc).",
                    "sid": 27,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is an additional NP level in (2c) because of the adjunct ( mSr ), causing qmp $rm Al$yx to have no (2) a. NP qmp NP summit $rm b. NP qmp summit NP $rm NP Al$yx covering node, and so have the default label NIL, and therefore categorized as a variation compared to (2b).",
                    "sid": 28,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, this is a spurious difference, since the label difference is caused only by the irrelevant presence of an adjunct, and it is clear, without look qmp summit Sharm c. NP Al$yx the Sheikh NP Sharm the Sheikh ing at any further structure, that the annotation of qmp $rm Al$yx is identical in (2bc).",
                    "sid": 29,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case the “non fringe heuristic” serves to avoid reporting such spurious difference s, since if qmp $rm Al$yx did not have an open parenthesi s on the right in (b), and qmp did not have the same word to its immediate left in both (b) and (c), the two instances $rm Sharm NP Al$yx the Sheikh NP ( mSr ) Egypt would not be surrounded by the same larger variation n-gram, and so would not pass the non-fringe heuristic.",
                    "sid": 30,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This reliance on irrelevant material arises from us We motivate our approach by illustrating the limitations of the DECCA approach.",
                    "sid": 31,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the trees (2a) and (2b), taken from two instances of the three- word sequence qmp $rm Al$yx in the Arabic Treebank.2 There is no need to look at any surrounding annotation to conclude that there is an inconsistency in the annotation of this sequence.3 However, based on (2ab), the DECCA system would not even identify the three-word sequence qmp $rm Al$yx as a nucleus to compare, because both instances have a NP covering node, and so are considered to have the same label.",
                    "sid": 32,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(The same is true for the two-word subsequence $rm Al$yx.)",
                    "sid": 33,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of doing the natural comparison of the 1 http://www.decca.osu.edu/.",
                    "sid": 34,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 In Section 4 we give the details of the corpus.",
                    "sid": 35,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the.",
                    "sid": 36,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Buckwalter Arabic transliteration scheme (Buckwalter, 2004).",
                    "sid": 37,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 While the nature of the inconsistency is not the issue here, (b) is the correct annotation.",
                    "sid": 38,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ing on a single node label to characterize a structural annotation and the surrounding word context to overcome the resulting complications.",
                    "sid": 39,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach instead directly compares the annotations of interest.",
                    "sid": 40,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "using derivation tree fragments. ",
            "number": "3",
            "sents": [
                {
                    "text": "We utilize ideas from the long line of Tree Adjoining Grammar-based research (Joshi and Schabes, 1997), based on working with small “elementary trees” (abbreviated “etrees” in the rest of this paper) that are the “building blocks” of the full trees of a treebank.",
                    "sid": 41,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This decomposition of the full tree into etrees also results in a “derivation tree” that records how the elementary trees relate to each other.",
                    "sid": 42,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We illustrate the basics of TAG-based derivation we are using with examples based on the trees in (2).",
                    "sid": 43,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our grammar is a TAG variant with For (2a) For (2b) For (2c) This tree decomposition and resulting derivation #a1 qmp NP NP^ #b1 qmp NP NP^ #c1 qmp NP NP^ tree prov ide us with the tool for com parin g nucl ei with out the inter ferin g effec ts from word s not in the nucl eus.",
                    "sid": 44,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are inter ested not in the deriv ation tree summit #a2 S:1.2 NP $rm Sharm NP^ summit S:1.",
                    "sid": 45,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 #b2 N P Al$ yx The Sheikh summit S:1.",
                    "sid": 46,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 #c2 N P Al$y x The Sheikh for an entire sentence , but rather only that slice of it having etrees with words that are in the nucleus being examine d, which we call the derivatio n tree fragment . That.",
                    "sid": 47,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is, for a given nucleus being examined, we partition its instance s based on the covering node in the full tree, and within each set of instance s #a3 S:1.2 #b3 A:1.1,l eft A:1.1,l eft M:1,rig ht we com pare the deri vati on tree frag men ts for each NP Al$yx The Sheikh $rm Sharm #c3 $rm Sharm #c4 NP mSr Egypt instance.",
                    "sid": 48,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These derivation tree fragments are the relevant structures to compare for inconsistent annotation, and are computed separately for each instance of each nucleus from the full derivation tree that each instance is part of.5 Figure 1: Etrees and Derivation Trees for (2abc).",
                    "sid": 49,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tree-substitution, sister-adjunction, and Chomskyadjunction (Chiang, 2003).",
                    "sid": 50,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sister adjunction at- taches a tree (or single node) as a sister to another node, and Chomskyadjunction forms a recursive structure as well, duplicating a node.",
                    "sid": 51,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As typically done, we use head rules to decompose a full tree and extract the etrees.",
                    "sid": 52,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The three derivation trees, corresponding to (2abc), are shown in Figure 1.",
                    "sid": 53,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider first the derivation tree for (2a).",
                    "sid": 54,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has three etrees, numbered a1, a2, a3, which are the nodes in the derivation tree which show how the three etrees connect to each other.",
                    "sid": 55,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This derivation tree consists of just tree substitutions.",
                    "sid": 56,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ˆ symbol at node NPˆ in a1 indicates that it is a substitution node, and the S:1.2 above a2 indicates that it substitutes into node at Gorn address 1.2 in tree a1 (i.e., the substitution node), and likewise for a3 substituting into a2.",
                    "sid": 57,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The derivation tree for (2b) also has three etrees, although the structure is different.",
                    "sid": 58,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because the lower NP is flat in (2b), the rightmost noun, Al$yx, is taken as the head of the etree b2, with the degenerate tree for $rm sister-adjoining to the left of Al$yx, as indicated by the A:1.1,left.",
                    "sid": 59,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The derivation tree for (2c) is identical to that of (2b), except that it has the additional tree c4 for the adjunct mSr, which right Chomsky-adjoins to the root of c2, as indicated by the M:1,right.4 For example, for comparing our three instances of qmp $rm Al$yx, the three derivation tree fragments would be the structures consisting of (a1, a2, a3), (b1, b2, b3) and (c1, c2, c3), along with their connecting Gorn addresses and attachment types.",
                    "sid": 60,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This indicates that the instances (2ab) have different internal structures (without the need to look at a surrounding context), while the instances (2bc) have identical internal structures (allowing us to abstract away from the interfering effects of adjunction).",
                    "sid": 61,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Space prevents full discussion here, but the etrees and derivation trees as just described require refinement to be truly appropriate for comparing nuclei.",
                    "sid": 62,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason is that etrees might encode more information than is relevant for many comparisons of nuclei.",
                    "sid": 63,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, a verb might appear in a corpus with different labels for its objects, such as NP or SBAR, etc., and this would lead to its having different etrees, differing in their node label for the substitution node.",
                    "sid": 64,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the nucleus under comparison includes the verb but not any words from the complement, the inclusion of the different substitution nodes would cause irrelevant differences for that particular nucleus comparison.",
                    "sid": 65,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We solve these problems by mapping down the in the derivation tree.",
                    "sid": 66,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 A related approach is taken by Kato and Matsubara (2010), who compare partial parse trees for different instances of the same sequence of words in a corpus, resulting in rules based on a synchronous Tree Substitution Grammar (Eisner, 2003).",
                    "sid": 67,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We suspect that there are some major differences between our approaches regarding such issues as the representation of adjuncts, but we leave such a comparison for future work.",
                    "sid": 68,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sy st e m nu cl ei n g r a m s in st an ce s D EC C A 24, 31 9 1,1 58, 34 2 2,9 66, 27 4 U s 54, 49 6 n o t u s e d 6 0 5 , 9 0 6 Table 1: Data examined by the two systems for the ATB S y s t e m nu cle i fo un d non du pli cat e n u cl ei fo u n d t y p e s o f inc on sis ten cy D E C C A 4, 14 0 u n k n o w n u n k n o w n Us int ern al 9, 98 4 4 , 2 7 2 1 , 9 1 1 Table 2: Annotation inconsistencies reported for the ATB representation of the etrees in a derivation tree fragment to form a “reduced” derivation tree fragment.",
                    "sid": 69,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These reductions are (automatically) done for each nucleus comparison in a way that is appropriate for that particular nucleus comparison.",
                    "sid": 70,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A particular etree may be reduced in one way for one nucleus, and then a different way for a different nucleus.",
                    "sid": 71,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is done for each etree in a derivation tree fragment.",
                    "sid": 72,
                    "ssid": 32,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results on test corpus. ",
            "number": "4",
            "sents": [
                {
                    "text": "Green and Manning (2010) discuss annotation consistency in the Penn Arabic Treebank (ATB), and for our test corpus we follow their discussion and use the same data set, the training section of three parts of the ATB (Maamouri et al., 2008a; Maamouri et al., 2009; Maamouri et al., 2008b).",
                    "sid": 73,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their work is ideal for us, since they used the DECCA algorithm for the consistency evaluation.",
                    "sid": 74,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They did not use the “non-fringe” heuristic, but instead manually examined a sample of 100 nuclei to determine whether they were annotation errors.",
                    "sid": 75,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Inconsistencies Reported.",
                    "sid": 76,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus consists of 598,000 tokens.",
                    "sid": 77,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 compares token manipulation by the two systems.",
                    "sid": 78,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The DECCA system6 identified 24,319 distinct variation nuclei, while our system had 54,496.",
                    "sid": 79,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DECCA examined 1,158,342 n-grams, consisting of 2,966,274 6 We worked at first with version 0.2 of the software.",
                    "sid": 80,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However this software does not implement the non-fringe heuristic and does not make available the actual instances of the nuclei that were found.",
                    "sid": 81,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We therefore re-implemented the algorithm to make these features available, being careful to exactly match our output against the released DECCA system as far as the nuclei and n-grams found.",
                    "sid": 82,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "instances (i.e., different corpus positions of the n- grams), while our system examined 605,906 instances of the 54,496 nuclei.",
                    "sid": 83,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For our system, the number of nuclei increases and the variation n- grams are eliminated.",
                    "sid": 84,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because all nuclei with more than one instance are evaluated, in order to search for constituents that have the same root but different internal structure.",
                    "sid": 85,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of reported inconsistencies is shown in Table 2.",
                    "sid": 86,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DECCA identified 4,140 nuclei as likely errors - i.e., contained in larger n-grams, satisfying the non-fringe heuristic.",
                    "sid": 87,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our system identified 9,984 nuclei as having inconsistent annotation - i.e., with at least two instances with different derivation tree fragments.",
                    "sid": 88,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Eliminating Duplicate Nuclei.",
                    "sid": 89,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of these 9,984 nuclei are however redundant, due to nuclei contained within larger nuclei, such as $rm Al$yx inside qmp $rm Al$yx in (2abc).",
                    "sid": 90,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Eliminating such duplicates is not just a simple matter of string inclusion, since the larger nucleus can sometimes reveal different annotation inconsistencies than just those in the smaller substring nucleus, and also a single nucleus string can be included in different larger nuclei.",
                    "sid": 91,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We cannot discuss here the full details of our solution, but it basically consists of two steps.",
                    "sid": 92,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, as a result of the analysis described so far, for each nucleus we have a mapping of each instance of that nucleus to a derivation tree fragment.",
                    "sid": 93,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, we test for each possible redundancy (meaning string inclusion) whether there is a true structural redundancy by testing for an isomorphism between the mappings for two nuclei.",
                    "sid": 94,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this test corpus, eliminating such duplicates leaves 4,272 nuclei as having inconsistent annotation.",
                    "sid": 95,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is unknown how many of the DECCA nuclei are duplicates, although many certainly are.",
                    "sid": 96,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, qmp $rm Al$yx and $rm Al$yx are reported as separate results.",
                    "sid": 97,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Grouping Inconsistencies by Structure.",
                    "sid": 98,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Across all variation nuclei, there are only a finite number of derivation tree fragments and thus ways in which such fragments indicate an annotation inconsistency.",
                    "sid": 99,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We categorize each annotation inconsistency by the inconsistency type, which is simply a set of numbers representing the different derivation tree fragments.",
                    "sid": 100,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can then present the results not by listing each nucleus string, but instead by the inconsistency types, with each type having some number of nuclei associated with it.",
                    "sid": 101,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, instances of $rm Al$yx might have just the derivation tree fragments (a2, a3) and (b2, b3) in Figure 1, and the numbers representing this pair is the “inconsistency type” for this (nucleus, internal context) inconsistency.",
                    "sid": 102,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are nine other nuclei reported as having an inconsistency based on the exact same derivation tree fragments (abstracting only away from the particular lexical items), and so all these nuclei are grouped together as having the same “inconsistency type”.",
                    "sid": 103,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This grouping results in the 4,272 non-duplicate nuclei found being grouped into 1,911 inconsistency types.",
                    "sid": 104,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.4 Precision and Recall.",
                    "sid": 105,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The grouping of internal checking results by inconsistency types is a qualitative improvement in consistency reporting, with a high precision.7 By viewing inconsistencies by structural annotation types, we can examine large numbers of nuclei at a time.",
                    "sid": 106,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of the first 10 different types of derivation tree inconsistencies, which include 266 different nuclei, all 10 appear to real cases of annotation inconsistency, and the same seems to hold for each of the nuclei in those 10 types, although we have not checked every single nucleus.",
                    "sid": 107,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For comparison, we chose a sample of 100 nuclei output by DECCA on this same data, and by our judgment the DECCA precision is about 74%, including 15 duplicates.",
                    "sid": 108,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Measuring recall is tricky, even using the errors identified in Green and Manning (2010) as “gold” errors.",
                    "sid": 109,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One factor is that a system might report a variation nucleus, but still not report all the relevant instances of that nucleus.",
                    "sid": 110,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, while both systems report $rm Al$yx as a sequence with inconsistent annotation, DECCA only reports the two instances that pass the “non-fringe heuristic”, while our system lists 132 instances of $rm Al$yx, partitioning them into the two derivation tree fragments.",
                    "sid": 111,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will be carrying out a careful accounting of the recall evaluation in future work.",
                    "sid": 112,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 “Precision” here means the percentage of reported variations that are actually annotation errors.",
                    "sid": 113,
                    "ssid": 41,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "future work. ",
            "number": "5",
            "sents": [
                {
                    "text": "While we continue the evaluation work, our primary concern now is to use the reported inconsistent derivation tree fragments to correct the annotation inconsistencies in the actual data, and then evaluate the effect of the corpus corrections on parsing.",
                    "sid": 114,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our system groups all instances of a nucleus into different derivation tree fragments, and it would be easy enough for an annotator to specify which is correct (or perhaps instead derive this automatically based on frequencies).",
                    "sid": 115,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, because the derivation trees and etrees are somewhat abstracted from the actual trees in the treebank, it can be challenging to automatically correct the structure in every location to reflect the correct derivation tree fragment.",
                    "sid": 116,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because of details concerning the surrounding structure and the interaction with annotation style guidelines such as having only one level of recursive modification or differences in constituent bracketing depending on whether a constituent is a “single-word” or not.",
                    "sid": 117,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are focusing on accounting for these issues in current work to allow such automatic correction.",
                    "sid": 118,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "We thank the computational linguistics group at the University of Pennsylvania for helpful feedback on a presentation of an earlier version of this work.",
                    "sid": 119,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also thank Spence Green and Chris Manning for supplying the data used in their analysis of the Penn Arabic Treebank.",
                    "sid": 120,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work was supported in part by the Defense Advanced Research Projects Agency, GALE Program Grant No.",
                    "sid": 121,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "HR001106 10003 (all authors) and by the GALE program, DARPA/CMO Contract No.",
                    "sid": 122,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "HR001106-C-0022 (first author).",
                    "sid": 123,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The content of this paper does not necessarily reflect the position or the policy of the Government, and no official endorsement should be inferred.",
                    "sid": 124,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}