{
    "ID": "P11-1109",
    "sections": [
        {
            "text": "introduction. ",
            "number": "1",
            "sents": [
                {
                    "text": "Natural language allows us to express the same information in many ways, which makes natural language processing (NLP) a challenging area.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accordingly, many researchers have recognized that automatic paraphrasing is an indispensable component of intelligent NLP systems (Iordanskaja et al., 1991; McKeown et al., 2002; Lin and Pantel, 2001; Ravichandran and Hovy, 2002; Kauchak and Barzi- lay, 2006; CallisonBurch et al., 2006) and have tried to acquire a large amount of paraphrase knowledge, which is a key to achieving robust automatic paraphrasing, from corpora (Lin and Pantel, 2001; Barzi- lay and McKeown, 2001; Shinyama et al., 2002; Barzilay and Lee, 2003).",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose a method to extract phrasal paraphrases from pairs of sentences that define the same 1087 mass and 02 increases the risk of bone fracture.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We define paraphrase as a pair of expressions between which entailment relations of both directions hold.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Androutsopoulos and Malakasiotis, 2010).",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our objective is to extract phrasal paraphrases from pairs of sentences that define the same concept.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose a supervised method that exploits various kinds of lexical similarity features and contextual features.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentences defining certain concepts are acquired automatically on a large scale from the Web by applying a quite simple supervised method.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous methods most relevant to our work used parallel corpora such as multiple translations of the same source text (Barzilay and McKeown, 2001) or automatically acquired parallel news texts (Shinyama et al., 2002; Barzilay and Lee, 2003; Dolan et al., 2004).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The former requires a large amount of manual labor to translate the same texts Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics, pages 1087–1097, Portland, Oregon, June 1924, 2011.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2011 Association for Computational Linguistics in several ways.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The latter would suffer from the fact that it is not easy to automatically retrieve large bodies of parallel news text with high accuracy.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the contrary, recognizing definition sentences for the same concept is quite an easy task at least for Japanese, as we will show, and we were able to find a huge amount of definition sentence pairs from normal Web texts.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, about 30 million definition sentence pairs were extracted from 6×108Web documents, and the estimated number of para phrases recognized in the definition sentences using our method was about 300,000, for a precision rate of about 94%.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, our experimental results show that our method is superior to well-known competing methods (Barzilay and McKeown, 2001; Koehn et al., 2007) for extracting paraphrases from definition sentence pairs.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our evaluation is based on bidirectional checking of entailment relations between paraphrases that considers the context dependence of a paraphrase.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that using definition sentences is only the beginning of our research on paraphrase extraction.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have a more general hypothesis that sentences fulfilling the same pragmatic function (e.g. definition) for the same topic (e.g. osteoporosis) convey mostly the same information using different expressions.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such functions other than definition may include the usage of the same Linux command, the recipe for the same cuisine, or the description of related work on the same research issue.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2 describes related works.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 presents our proposed method.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 reports on evaluation results.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 5 concludes the paper.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "The existing work for paraphrase extraction is categorized into two groups.",
                    "sid": 24,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first involves a dis- tributional similarity approach pioneered by Lin and Pantel (2001).",
                    "sid": 25,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basically, this approach assumes that two expressions that have a large distributional similarity are paraphrases.",
                    "sid": 26,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are also variants of this approach that address entailment acquisition (Geffet and Dagan, 2005; Bhagat et al., 2007; Szpektor and Dagan, 2008; Hashimoto et al., 2009).",
                    "sid": 27,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These methods can be applied to a normal monolingual corpus, and it has been shown that a large number of paraphrases or entailment rules could be extracted.",
                    "sid": 28,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How ever, the precision of these methods has been relatively low.",
                    "sid": 29,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is due to the fact that the evidence, i.e., distributional similarity, is just indirect evidence of paraphrase/entailment.",
                    "sid": 30,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accordingly, these methods occasionally mistake antonymous pairs for paraphrases/entailment pairs, since an expression and its antonymous counterpart are also likely to have a large distributional similarity.",
                    "sid": 31,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another limitation of these methods is that they can find only paraphrases consisting of frequently observed expressions since they must have reliable distributional similarity values for expressions that constitute paraphrases.",
                    "sid": 32,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second category is a parallel corpus approach (Barzilay and McKeown, 2001; Shinyama et al., 2002; Barzilay and Lee, 2003; Dolan et al., 2004).",
                    "sid": 33,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our method belongs to this category.",
                    "sid": 34,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach aligns expressions between two sentences in parallel corpora, based on, for example, the overlap of words/contexts.",
                    "sid": 35,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The aligned expressions are assumed to be paraphrases.",
                    "sid": 36,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this approach, the expressions do not need to appear frequently in the corpora.",
                    "sid": 37,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the approach rarely mistakes antonymous pairs for paraphrases/entailment pairs.",
                    "sid": 38,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, its limitation is the difficulty in preparing a large amount of parallel corpora, as noted before.",
                    "sid": 39,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We avoid this by using definition sentences, which can be easily acquired on a large scale from the Web, as parallel corpora.",
                    "sid": 40,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Murata et al.",
                    "sid": 41,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) used definition sentences in two manually compiled dictionaries, which are considerably fewer in the number of definition sentences than those on the Web.",
                    "sid": 42,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the coverage of their method should be quite limited.",
                    "sid": 43,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the precision of their method is much poorer than ours as we report in Section 4.",
                    "sid": 44,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a more extensive survey on paraphrasing methods, see Androutsopoulos and Malakasiotis (2010) and Madnani and Dorr (2010).",
                    "sid": 45,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "proposed method. ",
            "number": "3",
            "sents": [
                {
                    "text": "Our method, targeting the Japanese language, consists of two steps: definition sentence acquisition and paraphrase extraction.",
                    "sid": 46,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describe them below.",
                    "sid": 47,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Definition sentence acquisition.",
                    "sid": 48,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We acquire sentences that define a concept (definition sentences) as in Example (2), which defines “骨 粗鬆症” (osteoporosis), from the 6 × 108 Web pages (Akamine et al., 2010) and the Japanese Wikipedia.",
                    "sid": 49,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) 骨粗鬆症とは、骨がもろくなってしまう病気だ。 (Osteoporosis is a disease that makes bones fragile.)",
                    "sid": 50,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fujii and Ishikawa (2002) developed an unsupervised method to find definition sentences from the Web using 18 sentential templates and a language model constructed from an encyclopedia.",
                    "sid": 51,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, we developed a supervised method to achieve a higher precision.",
                    "sid": 52,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use one sentential template and an SVM classifier.",
                    "sid": 53,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, we first collect definition sentence candidates by a template “ˆNP とは.*”, where ˆ is the beginning of sentence and NP is the noun phrase expressing the concept to be defined followed by a particle sequence, “と” (comitative) and “は” (topic) (and optionally followed by comma), as exemplified in (2).",
                    "sid": 54,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, we collected 3,027,101 sentences.",
                    "sid": 55,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the particle sequence tends to mark the topic of the definition sentence, it can also appear in interrogative sentences and normal assertive sentences in which a topic is strongly emphasized.",
                    "sid": 56,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To remove such non-definition sentences, we classify the candidate sentences using an SVM classifier with a polynominal kernel (d = 2).1 Since Japanese is a head-final language and we can judge whether a sentence is interrogative or not from the last words in the sentence, we included morpheme N -grams and bag-of-words (with the window size of N ) at the end of sentences in the feature set.",
                    "sid": 57,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 92.2, and 91.4, respectively.",
                    "sid": 58,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using the classifier, we acquired 1,925,052 positive sentences from all of the collected sentences.",
                    "sid": 59,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After adding definition sentences from Wikipedia articles, which are typically the first sentence of the body of each article (Kazama and Torisawa, 2007), we obtained a total of 2,141,878 definition sentence candidates, which covered 867,321 concepts ranging from weapons to rules of baseball.",
                    "sid": 60,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we coupled two definition sentences whose defined concepts were the same and obtained 29,661,812 definition sentence pairs.",
                    "sid": 61,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obviously, our method is tailored to Japanese.",
                    "sid": 62,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a language-independent method of definition acquisition, see Navigli and Velardi (2010) as an example.",
                    "sid": 63,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Paraphrase extraction.",
                    "sid": 64,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paraphrase extraction proceeds as follows.",
                    "sid": 65,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, each sentence in a pair is parsed by the dependency parser KNP2 and dependency tree fragments that constitute linguistically well-formed constituents are extracted.",
                    "sid": 66,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extracted dependency tree fragments are called candidate phrases hereafter.",
                    "sid": 67,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We restricted candidate phrases to predicate phrases that consist of at least one dependency relation, do not contain demonstratives, and in which all the leaf nodes are nominal and all of the constituents are consecutive in the sentence.",
                    "sid": 68,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "KNP indicates whether each candidate phrase is a predicate based on the POS of the head morpheme.",
                    "sid": 69,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we check all the pairs of candidate phrases between two definition sentences to find paraphrase pairs.3 In (1), repeated in (3), candidate phrase pairs to be features are also useful for confirming that the head checked include (01 decreases the quantity of bone,verb is in the present tense, which definition sen 01 reduces bone mass), (01 decreases the quantity tences should be.",
                    "sid": 70,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, we added the morpheme of bone, 02 increases the risk of bone fracture), (02 N -grams and bag-of-words right after the particle sequence in the feature set since we observe that non-definition sentences tend to have interrogative related words like “何” (what) or “一体” ((what) on makes bones fragile, 01 makes bones fragile, 02 fracture).",
                    "sid": 71,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "reduces bone mass), and (02 increases the risk of bone earth) right after the particle sequence.",
                    "sid": 72,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose 5 (3) a. Osteoporosis is a disease that 01 decreases the quantity of bone and 02 makes bones fragile.",
                    "sid": 73,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "as N from our preliminary experiments.",
                    "sid": 74,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "b. Osteoporosis is a disease that 01 reduces boneOur training data was constructed from 2,911 sen tences randomly sampled from all of the collected sentences.",
                    "sid": 75,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "61.1% of them were labeled as positive.",
                    "sid": 76,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the 10-fold cross validation, the classifier’s accuracy, precision, recall, and F1 were 89.4, 90.7, 1 We use SVMlight available at http://svmlight.",
                    "sid": 77,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "joachims.org/.",
                    "sid": 78,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "mass and 02 increases the risk of bone fracture.",
                    "sid": 79,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 http://nlp.kuee.kyoto-u.ac.jp/ nl-resource/knp.html.",
                    "sid": 80,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 Our method discards candidate phrase pairs in which one subsumes the other in terms of their character string, or the difference is only one proper noun like “toner cartridges that Apple Inc. made” and “toner cartridges that Xerox made.” Proper nouns are recognized by KNP.",
                    "sid": 81,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f1 The ratio of the num ber of mor phe mes shar ed betw een two cand idate phra ses to the num ber of all of the mor phe mes in the two phra ses.",
                    "sid": 82,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f2 The ratio of the num ber of a cand idate phra se’s mor phe mes, for whic h ther e is a mor phe me with smal l edit dista nce (1 in our expe rime nt) in ano ther can did ate phr ase, to the nu mb er of all of the mo rph em es in the two phr ase s. Not e that Jap ane se has ma ny ort hog rap hic al vari atio ns and edit dist anc e is use ful for ide ntif yin g the m. f3 The ratio of the num ber of a cand idate phra se’s mor phe mes, for whic h ther e is a mor phe me with the sam e pron unci atio n in anot her cand idate phr ase, to the nu mb er of all of the mo rph em es in the two phr ase s. Pro nun ciat ion is als o use ful for ide ntif yin g ort hog rap hic vari atio ns.",
                    "sid": 83,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pro nun ciat ion is giv en by KN P. f4 The ratio of the num ber of mor phe mes of a shor ter cand idate phra se to that of a long er one.",
                    "sid": 84,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f5 The iden tity of the infle cted form of the head mor phe me betw een two cand idate phra ses: 1 if they are iden tical, 0 othe rwis e. f6 The iden tity of the POS of the head mor phe me betw een two cand idate phra ses: 1 or 0.",
                    "sid": 85,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f7 The iden tity of the infle ctio n (con juga tion) of the head mor phe me betw een two cand idate phra ses: 1 or 0.",
                    "sid": 86,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f8 The ratio of the num ber of mor phe mes that appe ar in a cand idate phra se seg men t of a defi nitio n sent ence s1 and in a seg men t that is NO T a part of the can did ate phr ase of ano ther defi niti on sen ten ce s2 to the nu mb er of all of the mo rph em es of s1 ’s can did ate phr ase, i.e. ho w ma ny extr a mo rph em es are inc orp orat ed into s1 ’s can did ate phr ase.",
                    "sid": 87,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f9 The reve rsed (s1 ↔ s2 ) versi on of f8.",
                    "sid": 88,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f10 The ratio of the num ber of pare nt depe nden cy tree frag men ts that are shar ed by two cand idate phra ses to the num ber of all of the pare nt de pend ency tree frag men ts of the two phra ses.",
                    "sid": 89,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dep ende ncy tree frag men ts are repr esen ted by the pron unci atio n of their com pone nt mor phe mes.",
                    "sid": 90,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f11 A varia tion of f10; tree frag men ts are repr esen ted by the base form of their com pone nt mor phe mes.",
                    "sid": 91,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f12 A varia tion of f10; tree frag men ts are repr esen ted by the POS of their com pone nt mor phe mes.",
                    "sid": 92,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f13 The ratio of the num ber of unig rams (mor phe mes) that appe ar in the chil d cont ext of both cand idate phra ses to the num ber of all of the chil d cont ext mor phe mes of both cand idate phra ses.",
                    "sid": 93,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Uni gra ms are repr esen ted by the pron unci atio n of the mor phe me. f14 A varia tion of f13; unig rams are repr esen ted by the base form of the mor phe me. f15 A varia tion of f14; the num erat or is the num ber of chil d cont ext unig rams that are adja cent to both cand idate phra ses.",
                    "sid": 94,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f16 The ratio of the num ber of trigr ams that appe ar in the chil d cont ext of both cand idate phra ses to the num ber of all of the chil d cont ext mor phe mes of both cand idate phra ses.",
                    "sid": 95,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Trig rams are repr esen ted by the pron unci atio n of the mor phe me. f17 Cosi ne simi larit y betw een two defi nitio n sent ence s from whic h a cand idate phra se pair is extr acte d. Table 1: Features used by paraphrase classifier.",
                    "sid": 96,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The paraphrase checking of candidate phrase pairs is performed by an SVM classifier with a linear kernel that classifies each pair of candidate phrases into a paraphrase or a non-paraphrase.4 Candidate phrase pairs are ranked by their distance from the SVM’s hyperplane.",
                    "sid": 97,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Features for the classifier are based on our observation that two candidate phrases tend to be paraphrases if the candidate phrases themselves are sufficiently similar and/or their surrounding contexts are sufficiently similar.",
                    "sid": 98,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 lists the features used by the classifier.5 Basically, they represent either the similarity of candidate phrases (f1 9) or that of their contexts (f1017).",
                    "sid": 99,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We think that they have various degrees of discriminative power, and thus we use the SVM to adjust their weights.",
                    "sid": 100,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 illustrates features f812, for which you may need supplemental remarks.",
                    "sid": 101,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "English is used for ease of explanation.",
                    "sid": 102,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the figure, f8 has a positive value since the candidate phrase of s1 contains morphemes “of bone”, which do not appear in the can 4 We use SVMperf available at http://svmlight.",
                    "sid": 103,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "joachims.org/svm perf.html.",
                    "sid": 104,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1: Illustration of features f812.",
                    "sid": 105,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "didate phrase of s2 but do appear in the other part of s2 , i.e. they are extra morphemes for s1’s candidate phrase.",
                    "sid": 106,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, f9 is zero since there is no such extra morpheme in s2’s candidate phrase.",
                    "sid": 107,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, features f1012 have positive values since the two candidate phrases share two parent dependency tree fragments, (that increases) and (of fracture).",
                    "sid": 108,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have also tried the following features, which we do not detail due to space limitation: the similarity of candidate phrases based on semantically similar nouns (Kazama and Torisawa, 2008), entailing/entailed verbs (Hashimoto et al., 2009), and the identity of the pronunciation and base form of the 5 In the table, the parent context of a candidate phrase con-.",
                    "sid": 109,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sists of expressions that appear in ancestor nodes of the candi head morpheme; N -grams (N =1,2,3) of child and date phrase in terms of the dependency structure of the sentence.",
                    "sid": 110,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Child contexts are defined similarly.",
                    "sid": 111,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "parent contexts represented by either the inflectedform, base form, pronunciation, or POS of mor Original definition sentence pair (s1 , s2 ) Paraphrased definition sentence pair (sf , sf ) s1 : Osteoporosis is a disease that reduces bone mass and makes bones fragile.",
                    "sid": 112,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "s2 : Osteoporosis is a disease that decreases the quantity of bone and increases the risk of bone fracture.",
                    "sid": 113,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sf : Osteoporosis is a disease that decreases the quantity of bone and makes bones fragile.",
                    "sid": 114,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sf : Osteoporosis is a disease that reduces bone mass and increases the risk of bone fracture.",
                    "sid": 115,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2: Bidirectional checking of entailment relation (→) of p1 → p2 and p2 → p1 . p1 is “reduces bone mass” in s1 and p2 is “decreases the quantity of bone” in s2 . p1 and p2 are exchanged between s1 and s2 to generate corresponding paraphrased sentences sf and sf . p1 → p2 (p2 → p1 ) is verified if s1 → sf (s2 → sf ) holds.",
                    "sid": 116,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this 1 2 1 2 case, both of them hold.",
                    "sid": 117,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "English is used for ease of explanation.",
                    "sid": 118,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "pheme; parent/child dependency tree fragments represented by either the inflected form, base form, pronunciation, or POS; adjacent versions (cf.",
                    "sid": 119,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f15) of N -gram features and parent/child dependency tree texts.",
                    "sid": 120,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The labeling process is as follows.",
                    "sid": 121,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, from each candidate phrase pair (p1, p2) and its source definition sentence pair (s1, s2), we create two para phrase sentence pairs (sf , sf ) by exchanging p1 and 1 2features.",
                    "sid": 122,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These amount to 78 features, but we even p2 between s1 and s2.",
                    "sid": 123,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, annotators check if s1 tually settled on the 17 features in Table 1 through entails sf and s2 entails sfso that entailment rela ablation tests to evaluate the discriminative power of each feature.",
                    "sid": 124,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ablation tests were conducted using training data that we prepared.",
                    "sid": 125,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In preparing the training data, we faced the problem that the completely random sampling of candidate paraphrase pairs provided us with only a small number of positive examples.",
                    "sid": 126,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we automatically collected candidate paraphrase pairs that were expected to have a high likelihood of being positive as examples to be labeled.",
                    "sid": 127,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The likelihood was calculated by simply summing all of the 78 feature values that we have tried, since they indicate the likelihood of a given candidate paraphrase pair’s being a paraphrase.",
                    "sid": 128,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that val ues of the features f8 and f9 are weighted with −1, since they indicate the unlikelihood.",
                    "sid": 129,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, we first randomly sampled 30,000 definition sentence pairs from the 29,661,812 pairs, and collected 3,000 candidate phrase pairs that had the highest likelihood from them.",
                    "sid": 130,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The manual labeling of each candidate phrase pair (p1 , p2) was based on bidirec tional checking of entailment relation, p1 → p2 and p2 → p1, with p1 and p2 embedded in contexts.",
                    "sid": 131,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tions of both directions p1 → p2 and p2 → p1 are checked.",
                    "sid": 132,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows an example of bidirectional checking.",
                    "sid": 133,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this example, both entailment relations, s1 → s1 and s2 → s2, hold, and thus the candidate f f ( , p ) is judged as positive.",
                    "sid": 134,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used phrase pair p1 2(p1, p2), for which entailment relations of both di rections held, as positive examples (1,092 pairs) and the others as negative ones (1,872 pairs).6 We built the paraphrase classifier from the training data.",
                    "sid": 135,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As mentioned, candidate phrase pairs were ranked by the distance from the SVM’s hyperplane.",
                    "sid": 136,
                    "ssid": 91,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiment. ",
            "number": "4",
            "sents": [
                {
                    "text": "In this paper, our claims are twofold.",
                    "sid": 137,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I. Definition sentences on the Web are a treasure trove of paraphrase knowledge (Section 4.2).",
                    "sid": 138,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "II.",
                    "sid": 139,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our method of paraphrase acquisition from definition sentences is more accurate than well- known competing methods (Section 4.1).",
                    "sid": 140,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first verify claim II by comparing our method with that of Barzilay and McKeown (2001) (BM 7 This scheme is similar to the one proposed by method), Moses (Koehn et al., 2007) (SMT Szpektor et al.",
                    "sid": 141,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007).",
                    "sid": 142,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopt this scheme since paraphrase judgment might be unstable between an- notators unless they are given a particular context method), and that of Murata et al.",
                    "sid": 143,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) (Mrt method).",
                    "sid": 144,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first two methods are well known for accurately extracting semantically equivalent phrase 8based on which they make a judgment.",
                    "sid": 145,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As de pairs from parallel corpora.",
                    "sid": 146,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we verify claim scribed below, we use definition sentences as contexts.",
                    "sid": 147,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We admit that annotators might be biased by this in some unexpected way, but we believe that this is a more stable method than that without con 6 The remaining 36 pairs were discarded as they contained.",
                    "sid": 148,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "garbled characters of Japanese.",
                    "sid": 149,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 http://www.statmt.org/moses/ 8 As anonymous reviewers pointed out, they are unsupervised methods and thus unable to be adapted to definition sen I by comparing definition sentence pairs with sentence pairs that are acquired from the Web using Yahoo!JAPAN API9 as a paraphrase knowledge source.",
                    "sid": 150,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the latter data set, two sentences of each pair are expected to be semantically similar regardless of whether they are definition sentences.",
                    "sid": 151,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both sets contain 100,000 pairs.",
                    "sid": 152,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Three annotators (not the authors) checked evaluation samples.",
                    "sid": 153,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fleiss’ kappa (Fleiss, 1971) was 0.69 (substantial agreement (Landis and Koch, 1977)).",
                    "sid": 154,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Our method vs. competing methods.",
                    "sid": 155,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this experiment, paraphrase pairs are extracted from 100,000 definition sentence pairs that are randomly sampled from the 29,661,812 pairs.",
                    "sid": 156,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Before reporting the experimental results, we briefly describe the BM, SMT, and Mrt methods.",
                    "sid": 157,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BM method Given parallel sentences like multiple translations of the same source text, the BM method works iteratively as follows.",
                    "sid": 158,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, it collects from the parallel sentences identical word pairs and their contexts (POS N -grams with indices indicating corresponding words between paired contexts) as positive examples and those of different word pairs as negative ones.",
                    "sid": 159,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, each context is ranked based on the frequency with which it appears in positive (negative) examples.",
                    "sid": 160,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most likely K positive (negative) contexts are used to extract positive (negative) paraphrases from the parallel sentences.",
                    "sid": 161,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extracted positive (negative) paraphrases and their morpho-syntactic patterns are used to collect additional positive (negative) contexts.",
                    "sid": 162,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the positive (negative) contexts are ranked, and additional paraphrases and their morpho-syntactic patterns are extracted again.",
                    "sid": 163,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This iterative process finishes if no further paraphrase is extracted or the number of iterations reaches a predefined threshold T . In this experiment, following Barzilay and McKeown (2001), K is 10 and N is 1 to 3.",
                    "sid": 164,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The value of T is not given in their paper.",
                    "sid": 165,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose 3 as its value based on our preliminary experiments.",
                    "sid": 166,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that paraphrases extracted by this method are not ranked.",
                    "sid": 167,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tences.",
                    "sid": 168,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, we believe that comparing these methods with ours is very informative, since they are known to be accurate and have been influential.",
                    "sid": 169,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 http://developer.yahoo.co.jp/webapi/ SMT method Our SMT method uses Moses (Koehn et al., 2007) and extracts a phrase table, a set of two phrases that are translations of each other, given a set of two sentences that are translations of each other.",
                    "sid": 170,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If you give Moses monolingual parallel sentence pairs, it should extract a set of two phrases that are paraphrases of each other.",
                    "sid": 171,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this experiment, default values were used for all parameters.",
                    "sid": 172,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To rank extracted phrase pairs, we assigned each of them the product of two phrase translation probabilities of both directions that were given by Moses.",
                    "sid": 173,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For other SMT methods, see Quirk et al.",
                    "sid": 174,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) and Bannard and CallisonBurch (2005) among others.",
                    "sid": 175,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mrt method Murata et al.",
                    "sid": 176,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) proposed a method to extract paraphrases from two manually compiled dictionaries.",
                    "sid": 177,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It simply regards a difference between two definition sentences of the same word as a paraphrase candidate.",
                    "sid": 178,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paraphrase candidates are ranked according to an unsupervised scoring scheme that implements their assumption.",
                    "sid": 179,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They assume that a paraphrase candidate tends to be a valid paraphrase if it is surrounded by infrequent strings and/or if it appears multiple times in the data.",
                    "sid": 180,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this experiment, we evaluated the unsupervised version of our method in addition to the supervised one described in Section 3.2, in order to compare it fairly with the other methods.",
                    "sid": 181,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The unsupervised method works in the same way as the supervised one, except that it ranks candidate phrase pairs by the sum of all 17 feature values, instead of the distance from the SVM’s hyperplane.",
                    "sid": 182,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, no supervised learning is used.",
                    "sid": 183,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the feature values are weighted with 1, except for f8 and f9, whichare weighted with −1 since they indicate the unlike lihood of a candidate phrase pair being paraphrases.",
                    "sid": 184,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BM, SMT, Mrt, and the two versions of our method were used to extract paraphrase pairs from the same 100,000 definition sentence pairs.",
                    "sid": 185,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation scheme Evaluation of each paraphrase pair (p1, p2) was based on bidirectional checking of entailment relations p1 → p2 and p2 → p1 in a way similar to the labeling of the training data.",
                    "sid": 186,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The difference is that contexts for evaluation are two sentences that are retrieved from the Web and contain p1 and p2 , instead of definition sentences from which p1 and p2 are extracted.",
                    "sid": 187,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is intended to check whether extracted paraphrases are also valid for contexts other than those from which they are extracted.",
                    "sid": 188,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evaluation proceeds as follows.",
                    "sid": 189,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the top m paraphrase pairs of each method (in the case of the BM method, randomly sampled m pairs were used, since the method does not rank paraphrase pairs), we retrieved a sentence pair (s1, s2 ) for each paraphrase pair (p1, p2) from the Web, such that s1 contains p1 and s2 contains p2.",
                    "sid": 190,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In doing so, we make sure that neither s1 nor s2 are the definition sentences from which p1 and p2 are extracted.",
                    "sid": 191,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each method, we randomly sample n samples from all of the paraphrase pairs (p1, p2) for which both s1 and s2 are retrieved.",
                    "sid": 192,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, from each (p1, p2) and (s1, s2), we create two paraphrasesentence pairs (sf , sf ) by exchanging p1 and p2 be Defi nitio n sent ence pair s Sup Uns B M SM T Mr t with trivi al 1,381,42 4 24,0 49 9,56 2 18,1 84 with out trivi al 1,377,57 3 23,4 90 7,25 6 18,1 39 Web sent ence pair s Sup Uns B M SM T Mr t with trivi al 277,17 2 5,1 01 4,58 6 4,9 78 with out trivi al 274,72 0 4,3 99 2,34 2 4,9 58 Table 2: Number of extracted paraphrases.",
                    "sid": 193,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(p1, p2) is regarded as trivial if the pronunciation is the same between p1 and p2 ,10 or all of the content words contained in p1 are the same as those of p2.",
                    "sid": 194,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Graph (b) gives a precision curve for each method.",
                    "sid": 195,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Again, Sup outperforms the others too, and maintains a precision rate of about 90% until the top 1,000.",
                    "sid": 196,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results support our claim II.",
                    "sid": 197,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The upper half of Table 2 shows the number of 1 2 tween s1 and s2.",
                    "sid": 198,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All samples, each consisting of (p1, p2), (s1 , s2), and (sf , sf ), are checked by three extracted paraphrases with/without trivial pairs for each method.11 Sup and Uns extracted many more 1 2 human annotators to determine whether s1 entails s1 and s2 entails s2 so that entailment relations of f f both directions are verified.",
                    "sid": 199,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In advance of evaluation annotation, all the evaluation samples are shuffled so that the annotators cannot find out which sample is given by which method for fairness.",
                    "sid": 200,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We regard each paraphrase pair as correct if at least two annota- tors judge that entailment relations of both directions hold for it.",
                    "sid": 201,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "You may wonder whether only one pair of sentences (s1, s2 ) is enough for evaluation since a correct (wrong) paraphrase pair might be judged as wrong (correct) accidentally.",
                    "sid": 202,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, we suppose that the final evaluation results are reliable if the number of evaluation samples is sufficient.",
                    "sid": 203,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this experiment, m is 5,000 and n is 200.",
                    "sid": 204,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use Yahoo!JAPAN API to retrieve sentences.",
                    "sid": 205,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Graph (a) in Figure 3 shows a precision curve for each method.",
                    "sid": 206,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sup and Uns respectively indicate the supervised and unsupervised versions of our method.",
                    "sid": 207,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The figure indicates that Sup outperforms all the others and shows a high precision rate of about 94% at the top 1,000.",
                    "sid": 208,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Remember that this is the result of using 100,000 definition sentence pairs.",
                    "sid": 209,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we estimate that Sup can extract about 300,000 paraphrase pairs with a precision rate of about 94%, if we use all 29,661,812 definition sentence pairs that we acquired.",
                    "sid": 210,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we measured precision after trivial paraphrase pairs were discarded from the evaluation samples of each method.",
                    "sid": 211,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A candidate phrase pair paraphrases.",
                    "sid": 212,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is noteworthy that Sup performed the best in terms of both precision rate and the number of extracted paraphrases.",
                    "sid": 213,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows examples of correct and incorrect outputs of Sup.",
                    "sid": 214,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the examples indicate, many of the extracted paraphrases are not specific to definition sentences and seem very reusable.",
                    "sid": 215,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, there are few paraphrases involving metaphors or idioms in the outputs due to the nature of definition sentences.",
                    "sid": 216,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this regard, we do not claim that our method is almighty.",
                    "sid": 217,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We agree with Sekine (2005) who claims that several different methods are required to discover a wider variety of paraphrases.",
                    "sid": 218,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In graphs (a) and (b), the precision of the SMT method goes up as rank goes down.",
                    "sid": 219,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This strange behavior is due to the scoring by Moses that worked poorly for the data; it gave 1.0 to 82.5% of all the samples, 38.8% of which were incorrect.",
                    "sid": 220,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We suspect SMT methods are poor at monolingual alignment for paraphrasing or entailment tasks since, in the tasks, data is much noisier than that used for SMT.",
                    "sid": 221,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "See MacCartney et al.",
                    "sid": 222,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) for similar discussion.",
                    "sid": 223,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Definition pairs vs. Web sentence pairs.",
                    "sid": 224,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To collect Web sentence pairs, first, we randomly sampled 1.8 million sentences from the Web corpus.",
                    "sid": 225,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10 There are many kinds of orthographic variants in Japanese, which can be identified by their pronunciation.",
                    "sid": 226,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "11 We set no threshold for candidate phrase pairs of each.",
                    "sid": 227,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "method, and counted all the candidate phrase pairs in Table 2.",
                    "sid": 228,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 0.8 ’Sup_def’ ’Uns_def’ ’SMT_def’ ’BM_def’ ’Mrt_def’ 1 0.8 ’Sup_def_n’ ’Uns_def_n’ ’SMT_def_n’ ’BM_def_n’ ’Mrt_def_n’ 0.6 0.6 0.4 0.4 0.2 0.2 0 0 1000 2000 3000 4000 5000 Top-N 0 0 1000 2000 3000 4000 5000 Top-N (a) Definition sentence pairs with trivial paraphrases (b) Definition sentence pairs without trivial paraphrases 1 0.8 ’Sup_www’ ’Uns_www’ ’SMT_www’ ’BM_www’ ’Mrt_www’ 1 0.8 ’Sup_www_n’ ’Uns_www_n’ ’SMT_www_n’ ’BM_www_n’ ’Mrt_www_n’ 0.6 0.6 0.4 0.4 0.2 0.2 0 0 1000 2000 3000 4000 5000 Top-N 0 0 1000 2000 3000 4000 5000 Top-N (c) Web sentence pairs with trivial paraphrases (d) Web sentence pairs without trivial paraphrases Figure 3: Precision curves of paraphrase extraction.",
                    "sid": 229,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ra nk P a r a p h r a s e p a i r Corr ect 1 3 1 9 7 0 1 1 2 6 5 6 8 4 1 9 2 9 1, 5 5 3 2, 2 4 3 2, 8 5 5 2, 9 3 1 3, 6 6 7 4, 8 7 0 5, 5 0 1 10, 67 5 112, 819 193, 553 メー ルア ドレ スに メー ルを 送る (sen d a mes sage to the e mail addr ess) ⇔ メー ルア ドレ スに 電子 メー ルを 送る (sen d an e mail mes sage to the e mail addr ess) お 客 様 の 依 頼 に よ る (req uest ed by a cust ome r) ⇔ お 客 様 の 委 託 に よ る (co mmi ssio ned by a cust ome r) 企 業 の 財 政 状 況 を 表 す (des crib e the fisca l cond ition of com pany ) ⇔ 企 業 の 財 政 状 態 を 示 す (indi cate the fisca l state of com pan y) イン フォ メー ショ ンを 得る (get infor mati on) ⇔ ニ ュ ー ス を 得 る (get new s) き ま り の こ と で す (it is a conv enti on) ⇔ ル ー ル の こ と で す (it is a rule) 地震 のエ ネル ギー 規模 をあ らわ す (repr esen t the ener gy scal e of eart hqua ke) ⇔ 地震 の規 模を 表す (repr esen t the scal e of eart hqu ake) 細 胞 を 酸 化 さ せ る (cau se the oxid atio n of cells ) ⇔ 細 胞 を 老 化 さ せ る (cau se cellu lar agin g) 角 質 を 取 り 除 く (rem ove dead skin cells ) ⇔ 角 質 を は が す (pee l off dead skin cells ) 胎児 の発 育に 必要 だ (req uire d for the deve lop men t of fetus ) ⇔ 胎児 の発 育成 長に 必要 不可 欠だ (indi spen sabl e for the gro wth and deve lop men t of fetu s) 視 力 を 矯 正 す る (corr ect eyes ight) ⇔ 視 力 矯 正 を 行 う (perf orm eyes ight corr ecti on) チ ャ ラ に し て も ら う (call it even ) ⇔ 帳 消 し に し て も ら う (call it quit s) ハー ドデ ィス ク上 に蓄 積さ れる (acc umu lated on a hard disk ) ⇔ ハー ドデ ィス クド ライ ブに 保存 され る (stor ed on a hard disk driv e) 有 害 物 質 を 排 泄 す る (exc rete har mful subs tanc e) ⇔ 有 害 毒 素 を 排 出 す る (disc harg e har mful toxi n) １つ のＣ ＰＵ の内 部に ２つ のプ ロセ ッサ コア を搭 載す る (mo unt two proc esso r core s on one CPU ) ⇔ １つ のパ ッケ ー ジに ２つ のプ ロセ ッサ コア を集 積す る (buil d two proc esso r core s into one pack age) 外 貨 を 売 買 す る (trad e forei gn curr enci es) ⇔ 通 貨 を 交 換 す る (exc hang e one curr ency for anot her) 派 遣 先 企 業 の 社 員 に な る (bec ome a regu lar staff me mbe r of the com pany whe re (s)h e has wor ked as a tem p) ⇔ 派 遣 先 に 直 接 雇 用 さ れ る (em ploy ed by the com pany whe re (s)h e has wor ked as a tem p) Ｗｅ ｂサ イト にア クセ スす る (acc ess Web sites ) ⇔ ＷＷ Ｗサ イト を訪 れる (visi t WW W sites ) Inco rrect 9 0 3 2, 5 3 0 3, 0 0 8 ブラ ウザ に送 信さ れる (sen d to a Web bro wser ) ⇔ パソ コン に送 信さ れる (sen d to a PC) 調 和 を は か る (inte nd to bala nce) ⇔ リ フ レ ッ シ ュ を 図 る (inte nd to refre sh) 消化 酵素 では 消化 でき ない (una ble to dige st with dige stive enzy mes) ⇔ 消化 酵素 で消 化さ れ難 い (har d to dige st with dige stive enzy mes ) Table 3: Examples of correct and incorrect paraphrases extracted by our supervised method with their rank.",
                    "sid": 230,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We call them sampled sentences.",
                    "sid": 231,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, using Yahoo!JAPAN API, we retrieved up to 20 snippets relevant to each sampled sentence using all of the nouns in each sentence as a query.",
                    "sid": 232,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After that, each snippet was split into sentences, which we call snippet sentences.",
                    "sid": 233,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We paired a sampled sentence and a snippet sentence that was the most similar to the sampled sentence.",
                    "sid": 234,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarity is the number of nouns shared by the two sentences.",
                    "sid": 235,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we randomly sampled 100,000 pairs from all the pairs.",
                    "sid": 236,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paraphrase pairs were extracted from the Web sentence pairs by using BM, SMT, Mrt and the supervised and unsupervised versions of our method.",
                    "sid": 237,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features used with our methods were selected from all of the 78 features mentioned in Section 3.2 so that they performed well for Web sentence pairs.",
                    "sid": 238,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, the features were selected by ablation tests using training data that was tailored to Web sentence pairs.",
                    "sid": 239,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training data consisted of 2,741 sentence pairs that were collected in the same way as the Web sentence pairs and was labeled in the same way as described in Section 3.2.",
                    "sid": 240,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Graph (c) of Figure 3 shows precision curves.",
                    "sid": 241,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also measured precision without trivial pairs in the same way as the previous experiment.",
                    "sid": 242,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Graph (d) shows the results.",
                    "sid": 243,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lower half of Table 2 shows the number of extracted paraphrases with/without trivial pairs for each method.",
                    "sid": 244,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that precision figures of our methods in graphs (c) and (d) are lower than those of our methods in graphs (a) and (b).",
                    "sid": 245,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, none of the methods achieved a precision rate of 90% using Web sentence pairs.12 We think that a precision rate of at least 90% would be necessary if you apply automatically extracted paraphrases to NLP tasks without manual annotation.",
                    "sid": 246,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only the combination of Sup and definition sentence pairs achieved that precision.",
                    "sid": 247,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also note that, for all of the methods, the numbers of extracted paraphrases from Web sentence pairs are fewer than those from definition sentence pairs.",
                    "sid": 248,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From all of these results, we conclude that our claim I is verified.",
                    "sid": 249,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "12 Precision of SMT is unexpectedly good.",
                    "sid": 250,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found some.",
                    "sid": 251,
                    "ssid": 115,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "5",
            "sents": [
                {
                    "text": "We proposed a method of extracting paraphrases from definition sentences on the Web.",
                    "sid": 252,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the experimental results, we conclude that the following two claims of this paper are verified.",
                    "sid": 253,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 254,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Definition sentences on the Web are a treasure.",
                    "sid": 255,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "trove of paraphrase knowledge.",
                    "sid": 256,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 257,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our method extracts many paraphrases from.",
                    "sid": 258,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the definition sentences on the Web accurately; it can extract about 300,000 paraphrases from 6 × 108 Web documents with a precision rate of about 94%.",
                    "sid": 259,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our future work is threefold.",
                    "sid": 260,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we will release extracted paraphrases from all of the 29,661,812 definition sentence pairs that we acquired, after human annotators check their validity.",
                    "sid": 261,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result will be available through the ALAGIN forum.13 Second, we plan to induce paraphrase rules from paraphrase instances.",
                    "sid": 262,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Though our method can extract a variety of paraphrase instances on a large scale, their coverage might be insufficient for real NLP applications since some paraphrase phenomena are highly productive.",
                    "sid": 263,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we need paraphrase rules in addition to paraphrase instances.",
                    "sid": 264,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Barzilay and McKeown (2001) induced simple POS-based paraphrase rules from paraphrase instances, which can be a good starting point.",
                    "sid": 265,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, as mentioned in Section 1, the work in this paper is only the beginning of our research on paraphrase extraction.",
                    "sid": 266,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are trying to extract far more paraphrases from a set of sentences fulfilling the same pragmatic function (e.g. definition) for the same topic (e.g. osteoporosis) on the Web.",
                    "sid": 267,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such functions other than definition may include the usage of the same Linux command, the recipe for the same cuisine, or the description of related work on the same research issue.",
                    "sid": 268,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "We would like to thank Atsushi Fujita, Francis Bond, and all of the members of the Information Analysis Laboratory, Universal Communication Research Institute at NICT.",
                    "sid": 269,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Web sentence pairs consisting of two mostly identical sentences on rare occasions.",
                    "sid": 270,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The method worked relatively well for them.",
                    "sid": 271,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "13 http://alagin.jp/",
                    "sid": 272,
                    "ssid": 21,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}