{
    "ID": "P11-1087",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "In this work we address the problem of unsupervised part-of-speech induction by bringing together several strands of research into a single model.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We develop a novel hidden Markov model incorporating sophisticated smoothing using a hierarchical PitmanYor processes prior, providing an elegant and principled means of incorporating lexical characteristics.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Central to our approach is a new type-based sampling algorithm for hierarchical PitmanYor models in which we track fractional table counts.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In an empirical evaluation we show that our model consistently outperforms the current state-of-the-art across 10 languages.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Unsupervised part-of-speech (PoS) induction has long been a central challenge in computational linguistics, with applications in human language learning and for developing portable language processing systems.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Despite considerable research effort, progress in fully unsupervised PoS induction has been slow and modern systems barely improve over the early Brown et al.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1992) approach (Christodoulopoulos et al., 2010).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One popular means of improving tagging performance is to include supervision in the form of a tag dictionary or similar, however this limits portability and also comprimises any cognitive conclusions.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we present a novel approach to fully unsupervised PoS induction which uniformly outperforms the existing state-of-the-art across all our corpora in 10 different languages.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, the performance of our unsupervised model approaches 865 that of many existing semi-supervised systems, despite our method not receiving any human input.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we present a Bayesian hidden Markov model (HMM) which uses a non-parametric prior to infer a latent tagging for a sequence of words.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "HMMs have been popular for unsupervised PoS induction from its very beginnings (Brown et al., 1992), and justifiably so, as the most discriminating feature for deciding a word’s PoS is its local syntactic context.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work brings together several strands of research including Bayesian non-parametric HMMs (Goldwater and Griffiths, 2007), PitmanYor language models (Teh, 2006b; Goldwater et al., 2006b), tagging constraints over word types (Brown et al., 1992) and the incorporation of morphological features (Clark, 2003).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result is a non-parametric Bayesian HMM which avoids overfitting, contains no free parameters, and exhibits good scaling properties.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our model uses a hierarchical PitmanYor process (PYP) prior to affect sophisicated smoothing over the transition and emission distributions.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This allows the modelling of sub-word structure, thereby capturing tag-specific morphological variation.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike many existing approaches, our model is a principled generative model and does not include any hand tuned language specific features.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inspired by previous successful approaches (Brown et al., 1992), we develop a new type- level inference procedure in the form of an MCMC sampler with an approximate method for incorporating the complex dependencies that arise between jointly sampled events.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our experimental evaluation demonstrates that our model, particularly when restricted to a single tag per type, produces Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics, pages 865–874, Portland, Oregon, June 1924, 2011.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2011 Association for Computational Linguistics state-of-the-art results across a range of corpora and languages.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "background. ",
            "number": "2",
            "sents": [
                {
                    "text": "Past research in unsupervised PoS induction has largely been driven by two different motivations: a task based perspective which has focussed on inducing word classes to improve various applications, and a linguistic perspective where the aim is to induce classes which correspond closely to annotated part-of-speech corpora.",
                    "sid": 21,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Early work was firmly situtated in the task-based setting of improving generalisation in language models.",
                    "sid": 22,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Brown et al.",
                    "sid": 23,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1992) presented a simple first-order HMM which restricted word types to always be generated from the same class.",
                    "sid": 24,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Though PoS induction was not their aim, this restriction is largely validated by empirical analysis of treebanked data, and moreover conveys the significant advantage that all the tags for a given word type can be updated at the same time, allowing very efficient inference using the exchange algorithm.",
                    "sid": 25,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This model has been popular for language modelling and bilingual word alignment, and an implementation with improved inference called mkcls (Och, 1999)1 has become a standard part of statistical machine translation systems.",
                    "sid": 26,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The HMM ignores orthographic information, which is often highly indicative of a word’s part- of-speech, particularly so in morphologically rich languages.",
                    "sid": 27,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this reason Clark (2003) extended Brown et al.",
                    "sid": 28,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1992)’s HMM by incorporating a character language model, allowing the modelling of limited morphology.",
                    "sid": 29,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work draws from these models, in that we develop a HMM with a one class per tag restriction and include a character level language model.",
                    "sid": 30,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast to these previous works which use the maximum likelihood estimate, we develop a Bayesian model with a rich prior for smoothing the parameter estimates, allowing us to move to a trigram model.",
                    "sid": 31,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A number of researchers have investigated a semi- supervised PoS induction task in which a tag dictionary or similar data is supplied a priori (Smith and Eisner, 2005; Haghighi and Klein, 2006; Goldwater and Griffiths, 2007; Toutanova and Johnson, 2008; Ravi and Knight, 2009).",
                    "sid": 32,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These systems achieve 1 Available from http://fjoch.com/mkcls.html..",
                    "sid": 33,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "much higher accuracy than fully unsupervised systems, though it is unclear whether the tag dictionary assumption has real world application.",
                    "sid": 34,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We focus solely on the fully unsupervised scenario, which we believe is more practical for text processing in new languages and domains.",
                    "sid": 35,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recent work on unsupervised PoS induction has focussed on encouraging sparsity in the emission distributions in order to match empirical distributions derived from treebank data (Goldwater and Griffiths, 2007; Johnson, 2007; Gao and Johnson, 2008).",
                    "sid": 36,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These authors took a Bayesian approach using a Dirichlet prior to encourage sparse distributions over the word types emitted from each tag.",
                    "sid": 37,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conversely, Ganchev et al.",
                    "sid": 38,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) developed a technique to optimize the more desirable reverse property of the word types having a sparse posterior distribution over tags.",
                    "sid": 39,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently Lee et al.",
                    "sid": 40,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) combined the one class per word type constraint (Brown et al., 1992) in a HMM with a Dirichlet prior to achieve both forms of sparsity.",
                    "sid": 41,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However this work approximated the derivation of the Gibbs sampler (omitting the interdependence between events when sampling from a collapsed model), resulting in a model which underperformed Brown et al.",
                    "sid": 42,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1992)’s one-class HMM.",
                    "sid": 43,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work also seeks to enforce both forms of sparsity, by developing an algorithm for type-level inference under the one class constraint.",
                    "sid": 44,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work differs from previous Bayesian models in that we explicitly model a complex backoff path using a hierachical prior, such that our model jointly infers distributions over tag trigrams, bigrams and uni- grams and whole words and their character level representation.",
                    "sid": 45,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This smoothing is critical to ensure adequate generalisation from small data samples.",
                    "sid": 46,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Research in language modelling (Teh, 2006b; Goldwater et al., 2006a) and parsing (Cohn et al., 2010) has shown that models employing PitmanYor priors can significantly outperform the more frequently used Dirichlet priors, especially where complex hierarchical relationships exist between latent variables.",
                    "sid": 47,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work we apply these advances to unsupervised PoS tagging, developing a HMM smoothed using a PitmanYor process prior.",
                    "sid": 48,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the pyp-hmm. ",
            "number": "3",
            "sents": [
                {
                    "text": "We develop a trigram hidden Markov model w models the joint probability of a sequence of l tags, t, and words, w, as Dj Cjk U Bj Tij L+1 Pθ (t, w) = TI Pθ (tl |tl−1, tl−2)Pθ (wl |tl ) , l=1 t1 t2 Ej w1 w2 t3 ... w3 where L = |w| = |t| and t0 = t−1 = tL+1 = $ assigned a sentinel value to denote the start or e the sentence.",
                    "sid": 49,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A key decision in formulating s model is the smoothing of the tag trigram and e sion distributions, which would otherwise be too ficult to estimate from small datasets.",
                    "sid": 50,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prior in unsupervised PoS induction has employed si smoothing techniques, such as additive smoo or Dirichlet priors (Goldwater and Griffiths, 2 Johnson, 2007), however this body of work has o looked recent advances in smoothing methods u Figure 1: Plate diagram representation of the trigram HMM.",
                    "sid": 51,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The indexes i and j range over the set of tags and k ranges over the set of characters.",
                    "sid": 52,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hyper-parameters have been omitted from the figure for clarity.",
                    "sid": 53,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The trigram transition distribution, Tij , is drawn from a hierarchical PYP prior which backs off to a bigram Bj and then a unigram U distribution, Tij | aT , bT , Bj ∼ PYP(aT , bT , Bj ) Bj | aB , bB , U ∼ PYP(aB , bB , U ) for language modelling (Teh, 2006b; Goldwat al., 2006b).",
                    "sid": 54,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here we build upon previous wor U | aU , bU ∼ PYP(aU , bU , Uniform) , developing a PoS induction model smoothed a sophisticated non-parametric prior.",
                    "sid": 55,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our m uses a hierarchical PitmanYor process prior for the transition and emission distributions, enc a backoff path from complex distributions to cesssively simpler ones.",
                    "sid": 56,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of complex tributions (e.g., over tag trigrams) allows for expressivity when sufficient evidence is avail while the hierarchy affords a means of backing to simpler and more easily estimated distribu otherwise.",
                    "sid": 57,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The PYP has been shown to generate distributions particularly well suited to modelling language (Teh, 2006a; Goldwater et al., 2006b), and has been shown to be a generalisation of KneserNey smoothing, widely recognised as the best smoothing method for language modelling (Chen and Goodman, 1996).",
                    "sid": 58,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The model is depicted in the plate diagram in Figure 1.",
                    "sid": 59,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At its centre is a standard trigram HMM, which generates a sequence of tags and words, tl | tl−1, tl−2, T ∼ Ttl−1 ,tl−2 wl | tl , E ∼ Etl . where the prior over U has as its base distribition a uniform distribution over the set of tags, while the priors for Bj and Tij back off by discarding an item of context.",
                    "sid": 60,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This allows the modelling of trigram tag sequences, while smoothing these estimates with their corresponding bigram and unigram distributions.",
                    "sid": 61,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The degree of smoothing is regulated by the hyper-parameters a and b which are tied across each length of n-gram; these hyper-parameters are inferred during training, as described in 3.1.",
                    "sid": 62,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tag-specific emission distributions, Ej , are also drawn from a PYP prior, Ej | aE , bE , C ∼ PYP(aE , bE , Cj ) . We consider two different settings for the base distribution Cj : 1) a simple uniform distribution over the vocabulary (denoted HMM for the experiments in section 4); and 2) a character-level language model (denoted HMM+LM).",
                    "sid": 63,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In many languages morphological regularities correlate strongly with a word’s part-of-speech (e.g., suffixes in English), which we hope to capture using a basic character language model.",
                    "sid": 64,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This model was inspired by Clark (2003) 5 23 23 7 The big dog b r o w n Figure 2: The conditioning structure of the hierarchical PYP with an embedded character language models.",
                    "sid": 65,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "who applied a character level distribution to the single class HMM (Brown et al., 1992).",
                    "sid": 66,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We formulate the character-level language model as a bigram one-tag-per-word-type constraint.",
                    "sid": 67,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to extract a single tag sequence to test our model against the gold standard we find the tag at each site with maximum marginal probability in the sample set.",
                    "sid": 68,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following standard practice, we perform inference using a collapsed sampler whereby the model parameters U, B, T , E and C are marginalised out.",
                    "sid": 69,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After marginalisation the posterior distribution under a PYP prior is described by a variant of the Chinese Restaurant Process (CRP).",
                    "sid": 70,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CRP is based around the analogy of a restaurant with an infinite number of tables, with customers entering one at a time and seating themselves at a table.",
                    "sid": 71,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The choice of table is governed by  n− −a model over the character sequence comprising word  P (zl = k| z−l ) = k l−1+ b 1 ≤ k ≤ K − (1) wl , K − a + b − + 1 l − 1 + b z−l wlk | wlk−1, tl , C ∼ Ctl wlk−1 where zl is the table chosen by the lth customer,1 previous cus Cjk | aC , bC , Dj ∼ PYP(aC , bC , Dj ) is the seating arrangement of the l − tomers, n− is the number of customers in z−l who Dj | aD , bD ∼ PYP(aD , bD , Uniform) , are seated at table k, K − = K (z−l) is the total num where k indexes the characters in the word and, in a slight abuse of notation, the character itself, w0 and is set to a special sentinel value denoting the start of the sentence (ditto for a final end of sentence marker) and the uniform base distribution ranges over the set of characters.",
                    "sid": 72,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We expect that the HMM+LM model will outperform the uniform HMM as it can capture many consistent morphological affixes and thereby better distinguish between different parts-of-speech.",
                    "sid": 73,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The HMM+LM is shown in Figure 2, illustrating the decomposition of the tag ber of tables in z−l , and z1 = 1 by definition.",
                    "sid": 74,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thearrangement of customers at tables defines a cluster ing which exhibits a power-law behavior controlled by the hyperparameters a and b. To complete the restaurant analogy, a dish is then served to each table which is shared by all the customers seated there.",
                    "sid": 75,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This corresponds to a draw from the base distribution, which in our case ranges over tags for the transition distribution, and words for the observation distribution.",
                    "sid": 76,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall the PYP leads to a distribution of the form 1sequence into n-grams and a word into its compo nent character bigrams.",
                    "sid": 77,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P T (tl = i| z , t−l ) = nh + bT × (2) n− − T − T T B \\ 3.1 Training.",
                    "sid": 78,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "hi − Khi a + (Kh a + b P (i| z−l , t−l ) , In order to induce a tagging under this model we use Gibbs sampling, a Markov chain Monte Carlo (MCMC) technique for drawing samples from the posterior distribution over the tag sequences given illustrating the trigram transition distribution, where t−l are all previous tags, h = (tl−2, tl−1) is the conditioning bigram, n− is the count of the trigram hi in t−l , n− the total count over all trigrams beginning observed word sequences.",
                    "sid": 79,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present two different with , K − the number of tables served dish i and h hi sampling strategies: First, a simple Gibbs sampler which randomly samples an update to a single tag given all other tags; and second, a type-level sampler which updates all tags for a given word under a P B (·) is the base distribution, in this case the bigram distribution.",
                    "sid": 80,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A hierarchy of PYPs can be formed by making the base distribution of a PYP another PYP, following a semantics whereby whenever a customer sits at an empty table in a restaurant, a new customer is also said to enter the restaurant for its base distribution.",
                    "sid": 81,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, each table at one level is equivalent to a customer at the next deeper level, creating the invari 2010), though one must be careful to manage the dependencies between multiple draws from the posterior.",
                    "sid": 82,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The dependency on table counts in the conditional distributions complicates the process of drawing ants: K − = n− and K − = n−, where u = tl−1 samples for both our models.",
                    "sid": 83,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the non hierarchic al hi ui ui i indicates the unigram backoff context of h. The model (Goldwater and Griffiths, 2007) these recursion terminates at the lowest level where the base distribution is static.",
                    "sid": 84,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hierarchical setting allows for the modelling of elaborate backoff paths from rich and complex structure to successively simpler structures.",
                    "sid": 85,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gibbs samplers Both our Gibbs samplers perform the same calculation of conditional tag distributions, dependencies can easily be accounted for by incrementing customer counts when such a dependence occurs.",
                    "sid": 86,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our model we would need to sum over all possible table assignments that result in the same tagging, at all levels in the hierarchy: tag trigrams, bigrams and unigrams; and also words, character bigrams and character unigrams.",
                    "sid": 87,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To avoid 2and involve first decrementing all trigrams and emis this rather onerous marginalisation we instead use sions affected by a sampling action, and then rein- troducing the trigrams one at a time, conditioning their probabilities on the updated counts and table configurations as we progress.",
                    "sid": 88,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first local Gibbs sampler (PYPHMM) updates a single tag assignment at a time, in a similar fashion to Goldwater and Griffiths (2007).",
                    "sid": 89,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Changing one tag affects three trigrams, with expected table counts to calculate the conditional distributions for sampling.",
                    "sid": 90,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately we know of no efficient algorithm for calculating the expected table counts, so instead develop a novel approximation En+1 [Ki] ≈ En [Ki] + (aU En [K ] + bU )P0(i) posterior (n − En [Ki] bU ) + (aU En [K ] + bU )P0(i) , (3) P (tl | z−l , t−l , w) ∝ P (tl±2, wl |z−l±2, t−l±2) , where l ±2 denotes the range l −2, l −1, l, l +1, l +2.",
                    "sid": 91,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The joint distribution over the three trigrams con where Ki is the number of tables for the tag uni- gram i of which there are n + 1 occurrences, En [·] denotes an expectation after observing n items and En [K ] = tained in tl±2 can be calculated using the PYP formulation.",
                    "sid": 92,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This calculation is complicated by the fact that these events are not independent; the counts of one trigram can affect the probability of later ones, and moreover, the table assignment for the trigram may also affect the bigram and unigram counts, of particular import when the same tag occurs twice in a row such as in Figure 2.",
                    "sid": 93,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many HMMs used for inducing word classes for language modelling include the restriction that all occurrences of a word type always appear with the same class throughout the corpus (Brown et al., 1992; Och, 1999; Clark, 2003).",
                    "sid": 94,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our second sampler (PYP1HMM) restricts inference to taggings which adhere to this one tag per type restriction.",
                    "sid": 95,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This restriction permits efficient inference techniques in which all tags of all occurrences of a word type are updated in parallel.",
                    "sid": 96,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar techniques have been used for models with Dirichlet priors (Liang et al., j En [Kj ].",
                    "sid": 97,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This formulation defines a simple recurrence starting with the first customer seated at a table, E1 [Ki] = 1, and as each subsequent customer arrives we fractionally assign them to a new table based on their conditional probability of sitting alone.",
                    "sid": 98,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These fractional counts are then carried forward for subsequent customers.",
                    "sid": 99,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approximation is tight for small n, and therefore it should be effective in the case of the local Gibbs sampler where only three trigrams are being resampled.",
                    "sid": 100,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the type based resampling where large numbers of n are involved (consider resampling the), this approximation can deviate from the actual value due to errors accumulated in the recursion.",
                    "sid": 101,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 illustrates a simulation demonstrating that the approximation is a close match for small a and n but underestimates the true value for high a 2 Marginalisation is intractable in general, i.e. for the 1HMM.",
                    "sid": 102,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "where many sites are sampled jointly.",
                    "sid": 103,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a=0.9 a=0.8 a=0.5 a=0.1 0 20 40 60 80 100 number of customers Figure 3: Simulation comparing the expected table count (solid lines) versus the approximation under Eq. 3 (dashed lines) for various values of a. This data was generated from a single PYP with b = 1, P0 (i) = 1 and n = 100 customers which all share the same tag.",
                    "sid": 104,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and n. The approximation was much less sensitive to the choice of b (not shown).",
                    "sid": 105,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To resample a sequence of trigrams we start by removing their counts from the current restaurant configuration (resulting in z−).",
                    "sid": 106,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each tag we simulate adding back the trigrams one at a time, calculating their probability under the given z− plus the fractional table counts accumulated by Equation 3.",
                    "sid": 107,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then calculate the expected table count con-.",
                    "sid": 108,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tribution from this trigram and add it to the accumulated counts.",
                    "sid": 109,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fractional table count from the trigram then results in a fractional customer entering the bigram restaurant, and so on down to unigrams.",
                    "sid": 110,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At each level we must update the expected counts before moving on to the next trigram.",
                    "sid": 111,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After performing this process for all trigrams under consideration and for all tags, we then normalise the resulting tag probabilities and sample an outcome.",
                    "sid": 112,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once a tag has been sampled, we then add all the trigrams to the restaurants sampling their tables assignments explicitly (which are no longer fractional), recorded in z. Because we do not marginalise out the table counts and our expectations are only approximate, this sampler will be biased.",
                    "sid": 113,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We leave to future work properly accounting for this bias, e.g., by devising a Metropolis Hastings acceptance test.",
                    "sid": 114,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sampling hyperparameters We treat the hyper-parameters {(ax, bx) , x ∈ (U, B, T , E, C )} as random variables in our model and infer their values.",
                    "sid": 115,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We place prior distributions on the PYP discount ax and concentration bx hyperparamters and sample their values using a slice sampler.",
                    "sid": 116,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the discount parameters we employ a uniform Beta distribution (ax ∼ Beta(1, 1)), and for the concentration parameters we use a vague gamma prior (bx ∼ Gamma(10, 0.1)).",
                    "sid": 117,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the hyper-parameters are resampled after every 5th sample of the corpus.",
                    "sid": 118,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result of this hyperparameter inference is that there are no user tunable parameters in the model, an important feature that we believe helps explain its consistently high performance across test settings.",
                    "sid": 119,
                    "ssid": 71,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "4",
            "sents": [
                {
                    "text": "We perform experiments with a range of corpora to both investigate the properties of our proposed models and inference algorithms, as well as to establish their robustness across languages and domains.",
                    "sid": 120,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For our core English experiments we report results on the entire Penn. Treebank (Marcus et al., 1993), while for other languages we use the corpora made available for the CoNLL-X Shared Task (Buchholz and Marsi, 2006).",
                    "sid": 121,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We report results using the many- to-one (M-1) and v-measure (VM) metrics considered best by the evaluation of Christodoulopoulos et al.",
                    "sid": 122,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010).",
                    "sid": 123,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "M-1 measures the accuracy of the model after mapping each predicted class to its most frequent corresponding tag, while VM is a variant of the F-measure which uses conditional entropy analogies of precision and recall.",
                    "sid": 124,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The log-posterior for the HMM sampler levels off after a few hundred samples, so we report results after five hundred.",
                    "sid": 125,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 1HMM sampler converges more quickly so we use two hundred samples for these models.",
                    "sid": 126,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All reported results are the mean of three sampling runs.",
                    "sid": 127,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An important detail for any unsupervised learning algorithm is its initialisation.",
                    "sid": 128,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used slightly different initialisation for each of our inference strategies.",
                    "sid": 129,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the unrestricted HMM we randomly assigned each word token to a class.",
                    "sid": 130,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the restricted 1HMM we use a similar initialiser to Model M-1 VM Prototype meta-model (CGS10) 76.1 68.8 x 104 18 16 Gold tag distribution 1HMM 1HMM−LM MKCLS Trigram PYPHMM 69.8 62.6 Trigram PYP1HMM 76.0 68.0 Trigram PYP1HMMLM 77.5 69.7 Bigram PYPHMM 66.9 59.2 Bigram PYP1HMM 72.9 65.9 Trigram DPHMM 68.1 60.0 Trigram DP1HMM 76.0 68.0 Trigram DP1HMMLM 76.8 69.8 Table 1: WSJ performance comparing previous work to our own model.",
                    "sid": 131,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The columns display the many-to-1 accuracy and the V measure, both averaged over 5 independent runs.",
                    "sid": 132,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our model was run with the local sampler (HMM), the type-level sampler (1HMM) and also with the character LM (1HMMLM).",
                    "sid": 133,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also shown are results using Dirichlet Process (DP) priors by fixing a = 0.",
                    "sid": 134,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system abbreviations are CGS10 (Christodoulopoulos et al., 2010), BBDK10 (Berg-Kirkpatrick et al., 2010) and GG07 (Goldwater and Griffiths, 2007).",
                    "sid": 135,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Starred entries denote results reported in CGS10.",
                    "sid": 136,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clark (2003), assigning each of the k most frequent word types to its own class, and then randomly dividing the rest of the types between the classes.",
                    "sid": 137,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a baseline we report the performance of mkcls (Och, 1999) on all test corpora.",
                    "sid": 138,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This model seems not to have been evaluated in prior work on unsupervised PoS tagging, which is surprising given its consistently good performance.",
                    "sid": 139,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First we present our results on the most frequently reported evaluation, the WSJ sections of the Penn. Treebank, along with a number of state-of-the-art results previously reported (Table 1).",
                    "sid": 140,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All of these models are allowed 45 tags, the same number of tags as in the gold-standard.",
                    "sid": 141,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of our models is strong, particularly the 1HMM.",
                    "sid": 142,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also see that incorporating a character language model (1HMMLM) leads to further gains in performance, improving over the best reported scores under both M-1 and VM.",
                    "sid": 143,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have omitted the results for the HMMLM as experimentation showed that the local Gibbs sampler became hopelessly stuck, failing to 6 4 2 0 0 10 20 30 40 50 Tags sorted by frequency Figure 4: Sorted frequency of tags for WSJ.",
                    "sid": 144,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The gold standard distribution follows a steep exponential curve while the induced model distributions are more uniform.",
                    "sid": 145,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "mix due to the model’s deep structure (its peak performance was ≈ 55%).",
                    "sid": 146,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To evaluate the effectiveness of the PYP prior we include results using a Dirichlet Process prior (DP).",
                    "sid": 147,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see that for all models the use of the PYP provides some gain for the HMM, but diminishes for the 1HMM.",
                    "sid": 148,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is perhaps a consequence of the expected table count approximation for the type- sampled PYP1HMM: the DP relies less on the table counts than the PYP.",
                    "sid": 149,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we restrict the model to bigrams we see a considerable drop in performance.",
                    "sid": 150,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the bigram PYPHMM outperforms the closely related BHMM (the main difference being that we smooth tag bigrams with unigrams).",
                    "sid": 151,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also interesting to compare the bigram PYP1HMM to the closely related model of Lee et al.",
                    "sid": 152,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010).",
                    "sid": 153,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That model incorrectly assumed independence of the conditional sampling distributions, resulting in a accuracy of 66.4%, well below that of our model.",
                    "sid": 154,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figures 4 and 5 provide insight into the behavior of the sampling algorithms.",
                    "sid": 155,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The former shows that both our models and mkcls induce a more uniform distribution over tags than specified by the treebank.",
                    "sid": 156,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is unclear whether it is desirable for models to exhibit behavior closer to the treebank, which dedicates separate tags to very infrequent phenomena while lumping the large range of noun types into a single category.",
                    "sid": 157,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The graph in Figure 5 shows that the type-based 1HMM sampler finds a good tagging extremely quickly and then sticks with it, 80 70 60 50 40 30 SYM UH # W2P0$ FW PDT RBS EX −LR10B0− −RRB− RBR JJS WRB P Y P − 1 H M M P Y P − 1 H M M − L M P Y P − H M M P Y P − H M M − L M 50 100 150 Numb er of sampl es In the first colu mn for mk cls and the thir d colu mn for our mod el we can see simi lar class es with signific ant coun ts for DTs and PRP s, indic ating a clas s that the mod els may be usin g to repr esen t the star t of sent ence s (info rme d by start tran sitio ns or capitalis atio n).",
                    "sid": 158,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This colu mn exe mplif ies the spar sity of the PYP mod el’s post erio r. W e cont inue our eval uati on on the Co NLL multi lingu al corp ora (Tab le 2).",
                    "sid": 159,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thes e resul ts sho w a high ly cons isten t stor y of perf orm ance for our mod els acro ss diver se cor por a. In all case s the PYP 1H MM outp erfor ms the PYP HM M, whi ch NNPS Figure 5: M-1 accuracy vs. number of samples.",
                    "sid": 160,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "JJR WDT : ’’ ‘‘ $ PRP$ POS MD VBP VBG PRP VYBMN VUBHZ TO# WCPC$ FW VBD RBS EX −LRB− −RRB− RBR JJS WRB WP NNPS RP JNJNR WDT : ’’ ‘‘ $ PRP$ POS MD VBP VBG PRP VBN VBZ TO CC VB VBD RB CD . , NNS JJ DT NNP IN NN Figure 6: Cooccurence between frequent gold (y-axis) and predicted (x-axis) tags, comparing mkcls (top) and PYP1HMMLM (bottom).",
                    "sid": 161,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both axes are sorted in terms of frequency.",
                    "sid": 162,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Darker shades indicate more frequent cooccurence and columns represent the induced tags.",
                    "sid": 163,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "save for the occasional step change demonstrated by the 1HMMLM line.",
                    "sid": 164,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The locally sampled model is far slower to converge, rising slowly and plateauing well below the other models.",
                    "sid": 165,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Figure 6 we compare the distributions over WSJ tags for mkcls and the PYP1HMMLM.",
                    "sid": 166,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the macro scale we can see that our model induces a sparser distribution.",
                    "sid": 167,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With closer inspection we can identify particular improvements our model makes.",
                    "sid": 168,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "are both outperformed by the PYP1HMMLM.",
                    "sid": 169,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The character language model provides large gains in performance on a number of corpora, in particular those with rich morphology (Arabic +5%, Portuguese +5%, Spanish +4%).",
                    "sid": 170,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We again note the strong performance of the mkcls model, significantly beating recently published state-of-the- art results for both Dutch and Swedish.",
                    "sid": 171,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall our best model (PYP1HMMLM) outperforms both the state-of-the-art, where previous work exists, as well as mkcls consistently across all languages.",
                    "sid": 172,
                    "ssid": 53,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discussion. ",
            "number": "5",
            "sents": [
                {
                    "text": "The hidden Markov model, originally developed by Brown et al.",
                    "sid": 173,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1992), continues to be an effective modelling structure for PoS induction.",
                    "sid": 174,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have combined hierarchical Bayesian priors with a tri- gram HMM and character language model to produce a model with consistently state-of-the-art performance across corpora in ten languages.",
                    "sid": 175,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However our analysis indicates that there is still room for improvement, particularly in model formulation and developing effective inference algorithms.",
                    "sid": 176,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Induced tags have already proven their usefulness in applications such as Machine Translation, thus it will prove interesting as to whether the improvements seen from our models can lead to gains in downstream tasks.",
                    "sid": 177,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The continued successes of models combining hierarchical PitmanYor priors with expressive graphical models attests to this framework’s enduring attraction, we foresee continued interest in applying this technique to other NLP tasks.",
                    "sid": 178,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "La n g ua ge m kc ls H M M 1 H M M 1H MM LM Be st p ub . T o k e n s Ta g ty pe s Ar ab ic 5 8 . 5 5 7 . 1 6 2 . 7 6 7 . 5 5 4 , 3 7 9 2 0 B ul ga ria n 6 6 . 8 6 7 . 8 6 9 . 7 7 3 . 2 1 9 0 , 2 1 7 5 4 C ze ch 5 9 . 6 6 2 . 0 6 6 . 3 7 0 . 1 1, 24 9, 40 8 1 2 c D an is h 6 2 . 7 6 9 . 9 7 3 . 9 7 6 . 2 6 6 . 7 9 4 , 3 8 6 2 5 D ut ch 6 4 . 3 6 6 . 6 6 8 . 7 7 0 . 4 6 7 . 3 † 1 9 5 , 0 6 9 1 3 c H un ga ria n 5 4 . 3 6 5 . 9 6 9 . 0 7 3 . 0 1 3 1 , 7 9 9 4 3 Po rtu gu es e 6 8 . 5 7 2 . 1 7 3 . 5 7 8 . 5 7 5 . 3 2 0 6 , 6 7 8 2 2 S pa ni sh 6 3 . 8 7 1 . 6 7 4 . 7 7 8 . 8 7 3 . 2 8 9 , 3 3 4 4 7 S w ed is h 6 4 . 3 6 6 . 6 6 7 . 0 6 8 . 6 6 0 . 6 † 1 9 1 , 4 6 7 4 1 Table 2: Many-to-1 accuracy across a range of languages, comparing our model with mkcls and the best published result (* Berg-Kirkpatrick et al.",
                    "sid": 179,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) and †Lee et al.",
                    "sid": 180,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010)).",
                    "sid": 181,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This data was taken from the CoNLL-X shared task training sets, resulting in listed corpus sizes.",
                    "sid": 182,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fine PoS tags were used for evaluation except for items marked with c , which used the coarse tags.",
                    "sid": 183,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each language the systems were trained to produce the same number of tags as the gold standard.",
                    "sid": 184,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}