{
    "ID": "P12-1111",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We show for both English POS tagging and Chinese word segmentation that with proper representation, large number of deterministic constraints can be learned from training examples, and these are useful in constraining probabilistic inference.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For tagging, learned constraints are directly used to constrain Viterbi decoding.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For segmentation, character-based tagging constraints can be learned with the same templates.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, they are better applied to a word-based model, thus an integer linear programming (ILP) formulation is proposed.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For both problems, the corresponding constrained solutions have advantages in both efficiency and accuracy.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "In recent work, interesting results are reported for applications of integer linear programming (ILP) such as semantic role labeling (SRL) (Roth and Yih, 2005), dependency parsing (Martins et al., 2009) and so on.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In an ILP formulation, ’non-local’ deterministic constraints on output structures can be naturally incorporated, such as ”a verb cannot take two subject arguments” for SRL, and the projectivity constraint for dependency parsing.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast to probabilistic constraints that are estimated from training examples, this type of constraint is usually handwritten reflecting one’s linguistic knowledge.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dynamic programming techniques based on Markov assumptions, such as Viterbi decoding, cannot handle those ’non-local’ constraints as discussed above.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it is possible to constrain Viterbi decoding by ’local’ constraints, e.g. ”assign label t to word w” for POS tagging.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This type of constraint may come from human input solicited in interactive inference procedure (Kristjansson et al., 2004).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, we explore deterministic constraints for two fundamental NLP problems, English POS tagging and Chinese word segmentation.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show by experiments that, with proper representation, large number of deterministic constraints can be learned automatically from training data, which can then be used to constrain probabilistic inference.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For POS tagging, the learned constraints are directly used to constrain Viterbi decoding.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corresponding constrained tagger is 10 times faster than searching in a raw space pruned with beam-width 5.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tagging accuracy is moderately improved as well.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Chinese word segmentation (CWS), which can be formulated as character tagging, analogous constraints can be learned with the same templates as English POS tagging.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "High-quality constraints can be learned with respect to a special tagset, however, with this tagset, the best segmentation accuracy is hard to achieve.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, these character-based constraints are not directly used for determining predictions as in English POS tagging.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose an ILP formulation of the CWS problem.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By adopting this ILP formulation, segmentation F-measure is increased from 0.968 to 0.974, as compared to Viterbi decoding with the same feature set.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, the learned constraints can be applied to reduce the number of possible words over a character sequence, i.e. to reduce the number of variables to set.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This reduction of problem size immediately speeds up an ILP solver by more than 100 times.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1054 Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics, pages 1054–1062, Jeju, Republic of Korea, 814 July 2012.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2012 Association for Computational Linguistics",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "english pos tagging. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Explore deterministic constraints.",
                    "sid": 26,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suppose that, following (Chomsky, 1970), we distinguish major lexical categories (Noun, Verb, Adjective and Preposition) by two binary features: +|− N and +|− V. Let (+N, −V)=Noun, (−N, +V)=Verb, (+N, +V)=Adjective, and (−N, −V)=preposition.",
                    "sid": 27,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A word occurring in between a preceding word the and a following word of always bears the feature +N. On the other hand, consider the annotation guideline of English Treebank (Marcus et al., 1993) instead.",
                    "sid": 28,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Part-of-speech (POS) tags are used to categorize words, for example, the POS tag VBG tags verbal gerunds, NNS tags nominal plurals, DT tags determiners and so on.",
                    "sid": 29,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following this POS representation, there are as many as 10 possible POS tags that may occur in between the–of, as estimated from the WSJ corpus of Penn Treebank.",
                    "sid": 30,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.1 Templates of deterministic constraints To explore determinacy in the distribution of POS tags in Penn Treebank, we need to consider that a POS tag marks the basic syntactic category of a word as well as its morphological inflection.",
                    "sid": 31,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A constraint that may determine the POS category should reflect both the context and the morphological feature of the corresponding word.",
                    "sid": 32,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The practical difficulty in representing such deterministic constraints is that we do not have a perfect mechanism to analyze morphological features of a word.",
                    "sid": 33,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Endings or prefixes of English words do not deterministically mark their morphological inflections.",
                    "sid": 34,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose to compute the morph feature of a word as the set of all of its possible tags, i.e. all tag types that are assigned to the word in training data.",
                    "sid": 35,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we approximate unknown words in testing data by rare words in training data.",
                    "sid": 36,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a word that occurs less than 5 times in the training corpus, we compute its morph feature as its last two characters, which is also conjoined with binary features indicating whether the rare word contains digits, hyphens or uppercase characters respectively.",
                    "sid": 37,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "See examples of morph features in Table 1.",
                    "sid": 38,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We consider bigram and trigram templates for generating potentially deterministic constraints.",
                    "sid": 39,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let wi denote the ith word relative to the current word w0; and mi denote the morph feature of wi.",
                    "sid": 40,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Table 1: Morph features of frequent words and rare words as computed from the WSJ Corpus of Penn Treebank.bi -gram w−1 w0 , w0 w1 , m−1 w0 , w0 m1 w−1 m0 , m0 w1 , m−1 m0 , m0 m1tri -gram w−1 w0 w1 , m−1 w0 w1 , w−1 m0 w1 , m−1 m0 w1 w−1 w0 m1 , m−1 w0 m1 , w−1 m0 m1 , m−1 m0 m1 Table 2: The templates for generating potentially deterministic constraints of English POS tagging.",
                    "sid": 41,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "bigram constraint includes one contextual word (w−1|w1) or the corresponding morph feature; and a trigram constraint includes both contextual words or their morph features.",
                    "sid": 42,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each constraint is also conjoined with w0 or m0, as described in Table 2.",
                    "sid": 43,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.2 Learning of deterministic constraints In the above section, we explore templates for potentially deterministic constraints that may determine POS category.",
                    "sid": 44,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With respect to a training corpus, if a constraint C relative to w0 ’always’ assigns a certain POS category t∗ to w0 in its context, i.e. count(C ) > thr, and this constraint occurs more than a cutoff number, we consider it as a deterministic constraint.",
                    "sid": 45,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The threshold thr is a real number just under 1.0 and the cutoff number is empirically set to 5 in our experiments.",
                    "sid": 46,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.3 Decoding of deterministic constraints By the above definition, the constraint of w−1 =the, m0 = {NNS, VBZ} and w1 = of is determinis tic.",
                    "sid": 47,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It determines the POS category of w0 to be NNS.",
                    "sid": 48,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are at least two ways of decoding these constraints during POS tagging.",
                    "sid": 49,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Take the word trades for example, whose morph feature is {NNS, VBZ}.One alternative is that as long as trades occurs be tween the-of, it is tagged with NNS.",
                    "sid": 50,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second alternative is that the tag decision is made only if all deterministic constraints relative to this occurrence of trades agree on the same tag.",
                    "sid": 51,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both ways of decoding are purely rule-based and involve no probabilistic inference.",
                    "sid": 52,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In favor of a higher precision, we adopt the latter one in our experiments.",
                    "sid": 53,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "raw input O(nT 2 ) n = 23 The complex financing plan in the S&L bailout law includes... to the current word w0.",
                    "sid": 54,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As discussed in (Shen et al., 2007), categorical information of neighbouring constrained input O(m1 T + m2 T 2 ) m1 = 2, m2 = 1 words on both sides of w0help resolve POS ambi The/DT complex/– financing/– plan/NN in/IN the/DT S&L/– bailout/NN law/NN includes/VBZ ...",
                    "sid": 55,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3: Comparison of raw input and constrained input.",
                    "sid": 56,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Search in a constrained space.",
                    "sid": 57,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following most previous work, we consider POS tagging as a sequence classification problem and decompose the overall sequence score over the linear n guity of w0.",
                    "sid": 58,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (Shen et al., 2007), lookahead features may be available for use during decoding since searching is bidirectional instead of left-to-right as in Viterbi decoding.",
                    "sid": 59,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, deterministic constraints are decoded before the application of probabilistic models, therefore lookahead features are made available during Viterbi decoding.",
                    "sid": 60,
                    "ssid": 35,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "chinese word segmentation (cws). ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 Word segmentation as character tagging.",
                    "sid": 61,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "structure, i.e. ˆt = arg max ) score(ti) where t∈tagGEN(w) i=1 function tagGEN maps input sentence w = w1...wn to the set of all tag sequences that are of length n. If a POS tagger takes raw input only, i.e. for every word, the number of possible tags is a constant T , the space of tagGEN is as large as T n. On the other hand, if we decode deterministic constraints first before a probabilistic search, i.e. for some words, the number of possible tags is reduced to 1, the search Considering the ambiguity problem that a Chinese character may appear in any relative position in a word and the out-of-vocabulary (OOV) problem that it is impossible to observe all words in training data, CWS is widely formulated as a character tagging problem (Xue, 2003).",
                    "sid": 62,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A character-based CWS decoder is to find the highest scoring tag sequence ˆt over the input character sequence c, i.e. n space is reduced to T m, where m is the number of ˆt = arg max ) score(ti) .(unconstrained) words that are not subject to any de terministic constraints.",
                    "sid": 63,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Viterbi algorithm is widely used for tagging, and runs in O(nT 2) when searching in an unconstrained space.",
                    "sid": 64,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, consider searching in a constrained space.",
                    "sid": 65,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suppose that among the m un- constrained words, m1 of them follow a word that has been tagged by deterministic constraints and m2 (=m-m1) of them follow another unconstrained word.",
                    "sid": 66,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Viterbi decoder runs in O(m1T + m2T 2) while searching in such a constrained space.",
                    "sid": 67,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The example in Table 3 shows raw and constrained input with respect to a typical input sentence.",
                    "sid": 68,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lookahead features The score of tag predictions are usually computed in a high-dimensional feature space.",
                    "sid": 69,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopt the basic feature set used in (Ratnaparkhi, 1996) and (Collins, 2002).",
                    "sid": 70,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, when deterministic constraints have applied to contextual words of w0, it is also possible to include some lookahead feature templates, such as: t0&t1, t0&t1&t2, and t−1&t0&t1 where ti represents the tag of the ith word relative t∈tagGEN(c) i=1 This is the same formulation as POS tagging.",
                    "sid": 71,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Viterbi algorithm is also widely used for decoding.",
                    "sid": 72,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tag of each character represents its relative position in a word.",
                    "sid": 73,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two popular tagsets include 1) IB: where B tags the beginning of a word and I all other positions; and 2) BMES: where B, M and E represent the beginning, middle and end of a multi- character word respectively, and S tags a single- character word.",
                    "sid": 74,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, after decoding with BMES, 4 consecutive characters associated with the tag sequence BMME compose a word.",
                    "sid": 75,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, after decoding with IB, characters associated with BIII may compose a word if the following tag is B or only form part of a word if the following tag is I. Even though character tagging accuracy is higher with tagset IB, tagset BMES is more popular in use since better performance of the original problem CWS can be achieved by this tagset.",
                    "sid": 76,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Character-based feature templates We adopt the ’non-lexical-target’ feature templates in (Jiang et al., 2008a).",
                    "sid": 77,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let ci denote the ith character relative to the current character c0 and t0 denote the tag assigned to c0.",
                    "sid": 78,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following templates are used: ci&t0 (i=-2...2), cici+1&t0 (i=-2...1) and c−1c1&t0.",
                    "sid": 79,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Character-based deterministic constraints We can use the same templates as described in Table 2 to generate potentially deterministic constraints for CWS character tagging, except that there are no morph features computed for Chinese characters.",
                    "sid": 80,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we will show with experimental results in Section 5.2, useful deterministic constraints for CWS can be learned with tagset IB but not with Table 4: Comparison of raw input and constrained input.",
                    "sid": 81,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "an optimal solution x = x1...xs that maximizes s ) score(wi) · xi, subject to i=1 tagset BMES.",
                    "sid": 82,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is interesting but not surprising to notice, again, that the determinacy of a problem is sen (1) ) i:c∈wi xi = 1, ∀c ∈ c; sitive to its representation.",
                    "sid": 83,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since it is hard to achieve the best segmentations with tagset IB, we propose an indirect way to use these constraints in the following section, instead of applying these constraints as straightforwardly as in English POS tagging.",
                    "sid": 84,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Word-based word segmentation.",
                    "sid": 85,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A word-based CWS decoder finds the highest scor (2) xi ∈ {0, 1}, 1 ≤ i ≤ s The boolean value of xi, as guaranteed by constraint (2), indicates whether wi is selected in the segmentation solution or not.",
                    "sid": 86,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Constraint (1) requires every character to be included in exactly one selected word, thus guarantees a proper segmentation of the whole sequence.",
                    "sid": 87,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This resembles the ILP formula ing segmentation sequence wˆ that is composed by tion of the set cover problem, though the first con the input character sequence c, i.e. |w| straint is different.",
                    "sid": 88,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Take n = 2 for example, i.e. c = c1c2, the set of possible words is {c1, c2, c1c2}, i.e. s = |x| = 3.",
                    "sid": 89,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are only two possible so wˆ = arg max ) score(wi) . lutions subject to constraints (1) and (2), x = 110 w∈segGEN(c) i=1 where function segGEN maps character sequence c to the set of all possible segmentations of c. For example, w = (c1..cl1 )...(cn−lk +1...cn) represents a segmentation of k words and the lengths of the first and last word are l1 and lk respectively.",
                    "sid": 90,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In early work, rule-based models find words one by one based on heuristics such as forward maximum match (Sproat et al., 1996).",
                    "sid": 91,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Exact search is possible with a Viterbi-style algorithm, but beam- search decoding is more popular as used in (Zhang and Clark, 2007) and (Jiang et al., 2008a).",
                    "sid": 92,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose an Integer Linear Programming (ILP) formulation of word segmentation, which is naturally viewed as a word-based model for CWS.",
                    "sid": 93,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Character-based deterministic constraints, as discussed in Section 3.1, can be easily applied.",
                    "sid": 94,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 ILP formulation of CWS.",
                    "sid": 95,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a character sequence c=c1...cn, there are s(= n(n + 1)/2) possible words that are contiguous subsets of c, i.e. w1, ..., ws ⊆ c. Our goal is to find giving an output set {c1, c2}, or x = 001 giving an output set {c1c2}.",
                    "sid": 96,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The efficiency of solving this problem depends on the number of possible words (contiguous subsets) over a character sequence, i.e. the number of vari ables in x. So as to reduce |x|, we apply determin istic constraints predicting IB tags first, which are learned as described in Section 3.1.",
                    "sid": 97,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Possible words are generated with respect to the partially tagged character sequence.",
                    "sid": 98,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A character tagged with B always occurs at the beginning of a possible word.",
                    "sid": 99,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 illustrates the constrained and raw input with respect to a typical character sequence.",
                    "sid": 100,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Character- and word-based.",
                    "sid": 101,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "features As studied in previous work, word-based feature templates usually include the word itself, sub-words contained in the word, contextual characters/words and so on.",
                    "sid": 102,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has been shown that combining the use of character- and word based features helps improve performance.",
                    "sid": 103,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, in the character tagging formulation, word-based features are non-local.",
                    "sid": 104,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To incorporate these non-local features and make the search tractable, various efforts have been made.",
                    "sid": 105,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Jiang et al.",
                    "sid": 106,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008a) combine different levels of knowledge in an outside linear model of a two- layer cascaded model; Jiang et al.",
                    "sid": 107,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008b) uses the forest re-ranking technique (Huang, 2008); and in (Kruengkrai et al., 2009), only known words in vocabulary are included in the hybrid lattice consisting of both character- and word-level nodes.",
                    "sid": 108,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose to incorporate character-based features in word-based models.",
                    "sid": 109,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider a character- based feature function φ(c, t, c) that maps a character-tag pair to a high-dimensional feature space, with respect to an input character sequence c. For a possible word over c of length l , wi = ci0 ...ci0 +l−1, tag each character cij in this word with a character-based tag tij . Character-based features of wi can be computed as {φ(cij , tij , c)|0 ≤ j < l}.",
                    "sid": 110,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first row of Table 5 illustrates character-based features of a word of length 3, which is tagged with tagset BMES.",
                    "sid": 111,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From this view, the character-based feature templates defined in Section 3.1 are naturally used in a word-based model.",
                    "sid": 112,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When character-based features are incorporated into word-based CWS models, some word-based features are no longer of interest, such as the starting character of a word, sub-words contained in the word, contextual characters and so on.",
                    "sid": 113,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We consider word counting features as a complementary to character-based features, following the idea of using web-scale features in previous work, e.g.",
                    "sid": 114,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Bansal and Klein, 2011).",
                    "sid": 115,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a possible word w, let count(w) return the count of times that w occurs as a legal word in training data.",
                    "sid": 116,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word count number is further processed following (Bansal and Klein, 2011), wc(w) = f loor(log(count(w)) ∗ 5)/5.",
                    "sid": 117,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to wc(wi), we also use corresponding word count features of possible words that are composed of the boundary and contextual characters of wi.",
                    "sid": 118,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The specific word-based feature templates are illustrated in the second row of Table 5.",
                    "sid": 119,
                    "ssid": 59,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "training. ",
            "number": "4",
            "sents": [
                {
                    "text": "We use the following linear model for scoring predictions: score(y)=θT φ(x, y), where φ(y) is a high- dimensional binary feature representation of y over input x and θ contains weights of these features.",
                    "sid": 120,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For ch ar ac ter b a s e d φ( ci0 , B, c), φ( ci1 , M, c), φ( ci2 , E, c) w o r d b a s e d wc (ci 0 ci1 ci2 ), wc (cl ci0 ), wc (ci 2 cr ) Table 5: Character- and word-based features of a possible word wi over the input character sequence c. Suppose that wi = ci0 ci1 ci2 , and its preceding and following characters are cl and cr respectively.",
                    "sid": 121,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "parameter estimation of θ, we use the averaged per- ceptron as described in (Collins, 2002).",
                    "sid": 122,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This training algorithm relies on the choice of decoding algorithm.",
                    "sid": 123,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When we experiment with different decoders, by default, the parameter weights in use are trained with the corresponding decoding algorithm.",
                    "sid": 124,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Especially, for experiments with lookahead features of English POS tagging, we prepare training data with the stacked learning technique, in order to alleviate overfitting.",
                    "sid": 125,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More specifically, we divide the training data into k folds, and tag each fold with the deterministic model learned over the other k-1 folds.",
                    "sid": 126,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The predicted tags of all folds are then merged into the gold training data and used (only) as lookahead features.",
                    "sid": 127,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sun (2011) uses this technique to merge different levels of predictors for word segmentation.",
                    "sid": 128,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "5",
            "sents": [
                {
                    "text": "5.1 Data set.",
                    "sid": 129,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We run experiments on English POS tagging on the WSJ corpus in the Penn Treebank.",
                    "sid": 130,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following most previous work, e.g.",
                    "sid": 131,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Collins, 2002) and (Shen et al., 2007), we divide this corpus into training set (sections 018), development set (sections 1921) and the final test set (sections 2224).",
                    "sid": 132,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We run experiments on Chinese word segmentation on the Penn Chinese Treebank 5.0.",
                    "sid": 133,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following (Jiang et al., 2008a), we divide this corpus into training set (chapters 1260), development set (chapters 271300) and the final test set (chapters 301325).",
                    "sid": 134,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Deterministic constraints.",
                    "sid": 135,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experiments in this section are carried out on the development set.",
                    "sid": 136,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cutoff number and threshold as defined in 2.1.2, are fixed as 5 and 0.99 respectively.",
                    "sid": 137,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "pr ec isi on re ca ll F 1 b i g r a m 0 . 9 9 3 0.",
                    "sid": 138,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "84 1 0.",
                    "sid": 139,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "91 1 t r i g r a m 0 . 9 9 6 0.",
                    "sid": 140,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "60 8 0.",
                    "sid": 141,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "75 5 bi +t rig ra m 0 . 9 9 2 0.",
                    "sid": 142,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "85 7 0.",
                    "sid": 143,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "92 0 Table 6: POS tagging with deterministic constraints.",
                    "sid": 144,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The maximum in each column is bold.",
                    "sid": 145,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "m0 ={VBN, VBZ} & m1 ={JJ, VBD, VBN} → VBN w0 =also & m1 ={VBD, VBN} → RB m0 =−es & m−1 ={IN, RB, RP} → NNS w0 =last & w−1 = the → JJ Table 7: Deterministic constraints for POS tagging.",
                    "sid": 146,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Deterministic constraints for POS tagging For English POS tagging, we evaluate the deterministic constraints generated by the templates described in Section 2.1.1.",
                    "sid": 147,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since these deterministic constraints are only applied to words that occur in a constrained context, we report F-measure as the accuracy measure.",
                    "sid": 148,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Precision p is defined as the percentage of correct predictions out of all predictions, and recall r is defined as the percentage of gold predictions that are correctly predicted.",
                    "sid": 149,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F-measure F1 is computed by 2pr/(p + r).",
                    "sid": 150,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Table 6, deterministic constraints learned with both bigram and trigram templates are all very accurate in predicting POS tags of words in their context.",
                    "sid": 151,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Constraints generated by bigram template alone can already cover 84.1% of the input words with a high precision of 0.993.",
                    "sid": 152,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By adding the constraints generated by trigram template, recall is increased to 0.857 with little loss in precision.",
                    "sid": 153,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since these deterministic constraints are applied before the decoding of probabilistic models, reliably high precision of their predictions is crucial.",
                    "sid": 154,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are 114589 bigram deterministic constraints and 130647 trigram constraints learned from the training data.",
                    "sid": 155,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show a couple of examples of bigram deterministic constraints in Table 7.",
                    "sid": 156,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As defined in Section 2.2, we use the set of all possible POS tags for a word, e.g. {VBN, VBZ}, as its morph feature if the word is frequent (occurring more than 5 times in training data).",
                    "sid": 157,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a rare word, the last two characters are used as its morph feature, e.g. −es.",
                    "sid": 158,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A constraint is composed of w−1, w0 and w1, as well as the morph features m−1, m0 and m1.",
                    "sid": 159,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For ex Table 8: Character tagging with deterministic constraints.",
                    "sid": 160,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ample, the first constraint in Table 7 determines the tag VBN of w0.",
                    "sid": 161,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A deterministic constraint is aware of neither the likelihood of each possible tag or the relative rank of their likelihoods.",
                    "sid": 162,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Deterministic constraints for character tagging For the character tagging formulation of Chinese word segmentation, we discussed two tagsets IB and BMES in Section 3.1.",
                    "sid": 163,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With respect to either tagset, we use both bigram and trigram templates to generate deterministic constraints for the corresponding tagging problem.",
                    "sid": 164,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These constraints are also evaluated by F-measure as defined above.",
                    "sid": 165,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Table 8, when tagset IB is used for character tagging, high precision predictions can be made by the deterministic constraints that are learned with respect to this tagset.",
                    "sid": 166,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, when tagset BMES is used, the learned constraints don’t always make reliable predictions, and the overall precision is not high enough to constrain a probabilistic model.",
                    "sid": 167,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we will only use the deterministic constraints that predict IB tags in following CWS experiments.",
                    "sid": 168,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.3 English POS tagging.",
                    "sid": 169,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For English POS tagging, as well as the CWS problem that will be discussed in the next section, we use the development set to choose training iterations (= 5), set beam width etc. The following experiments are done on the final test set.",
                    "sid": 170,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As introduced in Section 2.2, we adopt a very compact feature set used in (Ratnaparkhi, 1996)1.",
                    "sid": 171,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While searching in a constrained space, we can also extend this feature set with some basic lookahead features as defined in Section 2.2.",
                    "sid": 172,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This replicates the feature set B used in (Shen et al., 2007).",
                    "sid": 173,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, our main interest in the POS tagging problem is on its efficiency.",
                    "sid": 174,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A well-known technique to speed up Viterbi decoding is to conduct beam search.",
                    "sid": 175,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on experiments carried out 1 Our implementation of this feature set is basically the same as the version used in (Collins, 2002).",
                    "sid": 176,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "R at n a p ar k hi (1 9 9 6) ’s fe at ur e B e a m = 1 B e a m = 5 r a w 9 6.",
                    "sid": 177,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 6 % / 3 × 9 7.",
                    "sid": 178,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 6 / 1 × c o n s t r a i n e d 96 .8 0 % /1 4 × 97 .2 0/ 10 × Fe atu re B in (Sh en et al., 20 07 ) (S he n et al., 20 07 ) 97 .1 5 % (B e a m = 3) c o n s t r a i n e d 97 .0 3 % /1 1 × 9 7.",
                    "sid": 179,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 0 / 8 × Table 9: POS tagging accuracy and speed.",
                    "sid": 180,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The maximum in each column is bold.",
                    "sid": 181,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline for speed in all cases is the unconstrained tagger using (Ratnaparkhi, 1996)’s feature and conducting a beam (=5) search.",
                    "sid": 182,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "on the development set, we set beam-width of our baseline model as 5.",
                    "sid": 183,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our baseline model, which uses Ratnaparkhi (1996)’s feature set and conducts a beam (=5) search in the unconstrained space, achieves a tagging accuracy of 97.16%.",
                    "sid": 184,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tagging accuracy is measured by the percentage of correct predictions out of all gold predictions.",
                    "sid": 185,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We consider the speed of our baseline model as 1×, and compareother taggers with this one.",
                    "sid": 186,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The speed of a POS tag ger is measured by the number of input words processed per second.",
                    "sid": 187,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Table 9, when the beam-width is reduced from 5 to 1, the tagger (beam=1) is 3 times faster but tagging accuracy is badly hurt.",
                    "sid": 188,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, when searching in a constrained space rather than the raw space, the constrained tagger (beam=5) is 10 times fast as the baseline and the tagging accuracy is even moderately improved, increasing to 97.20%.",
                    "sid": 189,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When we evaluate the speed of a constrained tag- ger, the time of decoding deterministic constraints is included.",
                    "sid": 190,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These constraints make more accurate predictions than probabilistic models, thus besides improving the overall tagging speed as we expect, tagging accuracy also improves by a little.",
                    "sid": 191,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Viterbi decoding, all possible transitions between two neighbour states are evaluated, so the addition of locally lookahead features may have NO impact on performance.",
                    "sid": 192,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When beam-width is set to 5, tagging accuracy is not improved by the use of Feature B in (Shen et al., 2007); and because the size of the feature model grows, efficiency is hurt.",
                    "sid": 193,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, when lookahead features are used, Viterbi-style decoding is less affected by the reduction of beam-width.",
                    "sid": 194,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As compared to the con strained greedy tagger using Ratnaparkhi (1996)’s feature set, with the additional use of three locally lookahead feature templates, tagging accuracy is increased from 96.80% to 97.02%.",
                    "sid": 195,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When no further data is used other than training data, the bidirectional tagger described in (Shen et al., 2007) achives an accuracy of 97.33%, using a much richer feature set (E) than feature set B, the one we compare with here.",
                    "sid": 196,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As noted above, the addition of three feature templates already has a notable negative impact on efficiency, thus the use of feature set E will hurt tagging efficiency much worse.",
                    "sid": 197,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rich feature sets are also widely used in other work that pursue state-of-art tagging accuracy, e.g.",
                    "sid": 198,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Toutanova et al., 2003).",
                    "sid": 199,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, we focus on the most compact feature sets, since tagging efficiency is our main consideration in our work on POS taging.",
                    "sid": 200,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed constrained taggers as described above can achieve near state-of-art POS tagging accuracy in a much more efficient manner.",
                    "sid": 201,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.4 Chinese word segmentation.",
                    "sid": 202,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Like other tagging problems, Viterbi-style decoding is widely used for character tagging for CWS.",
                    "sid": 203,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We transform tagged character sequences to word segmentations first, and then evaluate word segmentations by F-measure, as defined in Section 5.2.",
                    "sid": 204,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We proposed an ILP formulation of the CWS problem in Section 3.3, where we present a word- based model.",
                    "sid": 205,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 3.4, we describe a way of mapping words to a character-based feature space.",
                    "sid": 206,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From this view, the highest scoring tagging sequence is computed subject to structural constraints, giving us an inference alternative to Viterbi decoding.",
                    "sid": 207,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, recall the example of input character sequence c = c1c2 discussed in Section 3.3.",
                    "sid": 208,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two possible ILP solutions give two possible segmentations {c1, c2} and {c1c2}, thus there are 2 tag se quences evaluated by ILP, BB and BI.",
                    "sid": 209,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, there are 4 tag sequences evaluated by Viterbi decoding: BI, BB, IB and II.",
                    "sid": 210,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the same feature templates as described in Section 3.1, we now compare these two decoding methods.",
                    "sid": 211,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tagset BMES is used for character tagging as well as for mapping words to character-based feature space.",
                    "sid": 212,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the same Viterbi decoder as implemented for English POS tagging and use a noncommercial ILP solver included in GNU Linear ProF m ea su re av g. |x| #c h ar p er s e c. r a w 0 . 9 7 4 1 2 9 0.",
                    "sid": 213,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 1 1 3 ( 1 × ) co nst rai ne d 0 . 9 7 4 8 3 . 7 5 12 19 0 (1 07 ×) Table 11: ILP problem size and segmentation speed.",
                    "sid": 214,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 10: F-measure on Chinese word segmentation.",
                    "sid": 215,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only character-based features are used.",
                    "sid": 216,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "POS-/+: perceptron trained without/with POS.",
                    "sid": 217,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "gramming Kit (GLPK), version 4.3.",
                    "sid": 218,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 As shown in Table 10, optimal solutions returned by an ILP solver are more accurate than optimal solutions returned by a Viterbi decoder.",
                    "sid": 219,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The F-measure is improved by a relative error reduction of 18.8%, from 0.968 to 0.974.",
                    "sid": 220,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results are compared to the core perceptron trained without POS in (Jiang et al., 2008a).",
                    "sid": 221,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They only report results with ’lexical-target’ features, a richer feature set than the one we use here.",
                    "sid": 222,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Table 10, we achieve higher performance even with more compact features.",
                    "sid": 223,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Joint inference of CWS and Chinese POS tagging is popularly studied in recent work, e.g.",
                    "sid": 224,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Ng and Low, 2004), (Jiang et al., 2008a), and (Kruengkrai et al., 2009).",
                    "sid": 225,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has been shown that better performance can be achieved with joint inference, e.g. F-measure 0.978 by the cascaded model in (Jiang et al., 2008a).",
                    "sid": 226,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We focus on the task of word segmentation only in this work and show that a comparable F-measure is achievable in a much more efficient manner.",
                    "sid": 227,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sun (2011) uses the stacked learning technique to merge different levels of predictors, obtaining a combined system that beats individual ones.",
                    "sid": 228,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word-based features can be easily incorporated, since the ILP formulation is more naturally viewed as a word-based model.",
                    "sid": 229,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We extend character-based features with the word count features as described in Section 3.4.",
                    "sid": 230,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Currently, we only use word counts computed from training data, i.e. still a closed test.",
                    "sid": 231,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The addition of these features makes a moderate improvement on the F-measure, from 0.974 to 0.975.",
                    "sid": 232,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As discussed in Section 3.3, if we are able to determine that some characters always start new words, the number of possible words is reduced, i.e. the number of variables in an ILP solution is reduced.",
                    "sid": 233,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Table 11, when character se 2 http://www.gnu.org/software/glpk quences are partially tagged by deterministic constraints, the number of possible words per sentence, i.e. avg.",
                    "sid": 234,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "|x|, is reduced from 1290.4 to 83.7.",
                    "sid": 235,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This re duction of ILP problem size has a very important im pact on the efficiency.",
                    "sid": 236,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Table 11, when taking constrained input, the segmentation speed is increased by 107 times over taking raw input, from 113 characters per second to 12,190 characters per second on a dual-core 3.0HZ CPU.",
                    "sid": 237,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Deterministic constraints predicting IB tags are only used here for constraining possible words.",
                    "sid": 238,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are very accurate as shown in Section 5.2.",
                    "sid": 239,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Few gold predictions are missed from the.",
                    "sid": 240,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "constrained set of possible words.",
                    "sid": 241,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Table 11, F-measure is not affected by applying these constraints, while the efficiency is significantly improved.",
                    "sid": 242,
                    "ssid": 114,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion and future. ",
            "number": "6",
            "sents": [
                {
                    "text": "work We have shown by experiments that large number of deterministic constraints can be learned from training examples, as long as the proper representation is used.",
                    "sid": 243,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These deterministic constraints are very useful in constraining probabilistic search, for example, they may be directly used for determining predictions as in English POS tagging, or used for reducing the number of variables in an ILP solution as in Chinese word segmentation.",
                    "sid": 244,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most notable advantage in using these constraints is the increased efficiency.",
                    "sid": 245,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two applications are both well-studied; there isn’t much space for improving accuracy.",
                    "sid": 246,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even so, we have shown that as tested with the same feature set for CWS, the proposed ILP formulation significantly improves the F-measure as compared to Viterbi decoding.",
                    "sid": 247,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These two simple applications suggest that it is of interest to explore data-driven deterministic constraints learnt from training examples.",
                    "sid": 248,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are more interesting ways in applying these constraints, which we are going to study in future work.",
                    "sid": 249,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}