{
    "ID": "P13-2036",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper studies named entity translation and proposes “selective temporal- ity” as a new feature, as using temporal features may be harmful for translating “atemporal” entities.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our key contribution is building an automatic classifier to distinguish temporal and atemporal entities then align them in separate procedures to boost translation accuracy by 6.1%.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "300 250 200 150 100 50 0 80 60 40 20 0 English Chinese 0 5 10 15 20 25 30 35 40 45 50 Week (a) Temporal entity: “Usain Bolt” English Chinese Named entity translation discovery aims at mapping entity names for people, locations, etc. in source language into their corresponding names in target language.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As many new named entities appear every day in newspapers and web sites, their translations are nontrivial yet essential.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Early efforts of named entity translation have focused on using phonetic feature (called PH) to estimate a phonetic similarity between two names (Knight and Graehl, 1998; Li et al., 2004; Virga and Khudanpur, 2003).",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, some approaches have focused on using context feature (called CX) which compares surrounding words of entities (Fung and Yee, 1998; Diab and Finch, 2000; Laroche and Langlais, 2010).",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently, holistic approaches combining such similarities have been studied (Shao and Ng, 2004; You et al., 2010; Kim et al., 2011).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Shao and Ng, 2004) rank translation candidates using PH and CX independently and return results with the highest average rank.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(You et al., 2010) compute initial translation scores using PH and iteratively update the scores using relationship feature (called R).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Kim et al., 2011) boost You’s approach by additionally leveraging CX.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More recent approaches consider temporal feature (called T) of entities in two corpora (Klementiev and Roth, 2006; Tao et al., 2006; Sproat et 0 5 10 15 20 25 30 35 40 45 50 Week (b) Atemporal entity: “Hillary Clinton” Figure 1: Illustration on temporality al., 2006; Kim et al., 2012).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "T is computed using frequency vectors for entities and combined with PH (Klementiev and Roth, 2006; Tao et al., 2006).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Sproat et al., 2006) extend Tao’s approach by iteratively updating overall similarities using R.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Kim et al., 2012) holistically combine all the features: PH, CX, T, and R. However, T used in previous approaches is a good feature only if temporal behaviors are “symmetric” across corpora.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, Figure 1 illustrates asymmetry, by showing the frequencies of “Usain Bolt,” a Jamaican sprinter, and “Hillary Clinton,” an American politician, in comparable news articles during the year 2008.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The former is mostly mentioned in the context of some temporal events, e.g., Beijing Olympics, while the latter is not.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In such case, as Hillary Clinton is a famous female leader, she may be associated with other Chinese female leaders in Chinese corpus, while such association is rarely observed in English corpus, which causes asymmetry.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, Hillary Clinton is “atemporal,” as Figure 1(b) shows, such that using such dissimilarity against deciding this pair as a correct translation would be harmful.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In clear contrast, for Usain Bolt, similarity of temporal dis 201 Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics, pages 201–205, Sofia, Bulgaria, August 49 2013.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2013 Association for Computational Linguistics tributions in Figure 1(a) is a good feature for concluding this pair as a correct one.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To overcome such problems, we propose a new notion of “selective temporality” (called this fea 2.3 Step 3: Reinforcement.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We reinforce R0 by leveraging R and obtain a converged matrix R∞ using the following model: ture ST to distinguish from T) to automaticallydistinguish temporal and atemporal entities.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To Rt+1 0 ) + (1 − λ) ∑ t (u,v) ward this goal, we design a classifier to distinguish (i,j) = λR(i,j 2k (u,v)k ∈Bt (i,j,θ) temporal entities from atemporal entities, based on which we align temporal projections of entity graphs for the temporal ones and the entire entity graphs for the atemporal ones.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also propose a method to identify the optimal window size for temporal entities.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We validate this “selective” use of temporal features boosts the accuracy by 6.1%.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "preliminaries. ",
            "number": "2",
            "sents": [
                {
                    "text": "Our approach follows a graph alignment framework proposed in (You et al., 2010).",
                    "sid": 26,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our graph alignment framework consists of 4 steps.",
                    "sid": 27,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Step 1: Graph Construction.",
                    "sid": 28,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first build a graph G = (V, E) from each language corpus, where V is a set of entities (nodes) and E is a set of co-occurrence relationships (un- weighted edges) between entities.",
                    "sid": 29,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We consider entities occurring more than η times as nodes and entity pairs co-occurring more than σ times as edges.",
                    "sid": 30,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To identify entities, we use a CRF-based named entity tagger (Finkel et al., 2005) and a Chinese word breaker (Gao et al., 2003) for English and Chinese corpora, respectively.",
                    "sid": 31,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Step 2: Initialization.",
                    "sid": 32,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given two graphs Ge = (Ve, Ee) and Gc = (Vc, Ec), we initialize |Ve|-by-|Vc| initial similarity matrix R0 using PH and CX for every pair (e, c) where e ∈ Ve and c ∈ Vc.",
                    "sid": 33,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For PH, we use a variant of Edit-Distance (You et al., 2010) between English entity and a romanized representation of Chinese entity called Pinyin.",
                    "sid": 34,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For CX, the context similarity is computed based on entity context which is defined as a set of words near to the entity (we ignore some words such as stop words and other entities).",
                    "sid": 35,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compute similarity of the most frequent 20 words for each entity using a variant of Jaccard index.",
                    "sid": 36,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To integrate two similarity scores, we adopt an average as a composite function.",
                    "sid": 37,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We finally compute initial similarity scores for all pairs (e, c) where e ∈ Ve and c ∈ Vc, and build the initial similarity matrix R0.",
                    "sid": 38,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This model is a linear combination of (a) the initial similarity R0 of entity pair (i, j) ∈ Ve × Vc and (b) the similarities Rt of their matched neighbors (u, v) ∈ Ve × Vc where t indicates iteration, Bt(i, j, θ) is an ordered set of the matched neighbors, and k is the rank of the matched neighbors.",
                    "sid": 39,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "λ is the coefficient for balancing two terms.",
                    "sid": 40,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, as we cannot assure the correctly matched neighbors (u, v), a chicken-and-egg dilemma, we take advantage of the current similarity Rt to estimate the next similarity Rt+1.",
                    "sid": 41,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Algorithm 1 describes the process of matching the neighbors where N (i) and N (j) are the sets of neighbor nodes of i ∈ Ve and j ∈ Vc, respectively, and H is a priority queue sorting the matched pairs in non-increasing order of similarities.",
                    "sid": 42,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To guarantee that the neighbors are correctly matched, we use only the matches such that Rt ≥ θ.",
                    "sid": 43,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Algorithm 1 Bt(i, j, θ) 1: M ← {}; H ← {} 2: ∀u ∈ N (i), ∀v ∈ N (j) H.push(u, v) such that (u,v) ≥ θ 3: while H is not empty do 4: (u, v) ← H.pop() 5: if neither u nor v are matched yet then 6: M ← M ∪ {(u, v)} 7: end if 8: end while 9: return M 2.4 Step 4: Extraction.",
                    "sid": 44,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From R∞, we finally extract one-to-one matches by using simple greedy approach of three steps: (1) choosing the pair with the highest similarity score; (2) removing the corresponding row and column from R∞; (3) repeating (1) and (2) until the matching score is not less than a threshold δ.",
                    "sid": 45,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "entity translation discovery using. ",
            "number": "3",
            "sents": [
                {
                    "text": "Selective Temporality Overall Framework: We propose our framework by putting together two separate procedures for temporal and atemporal entities to compute the overall similarity matrix R We first build two temporal graphs from the corpora within every time window, optimized in Sec node symmetry Sn as follows: ∑ I (e, c; M ) tion 3.1.",
                    "sid": 46,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then compute the reinforced matrix Rs obtained from the window starting at the time- stamp s. To keep the best match scores among Sn(Ge, Gc; M ) = (e,c)∈Ve ×Vc max{|Ve|, |Vc|}all windows, we update R using the best similarwhere I (u, v; M ) to be 1 if (u, v) ∈ M , 0 otherwise.",
                    "sid": 47,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "High node symmetry leads to accurate trans ity among ∀s, R∞. we then extract the candidate lation in R0(Initialization step).",
                    "sid": 48,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, we de translation pairs Mours by running step 4.",
                    "sid": 49,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As there can exist atemporal entities in Mours, we classify them (Section 3.2).",
                    "sid": 50,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, we fine the edge symmetry Se Se(Ge, Gc; M ) = as follows: build two entire graphs and compute R∞. We then distinguish temporal entities from atemporal ones using our proposed metric for each matched pair ∑ (e1 ,e2 )∈Ee ∑(c1 ,c2 )∈Ec I (e1, c1; M )I (e2, c2; M ) max{|Ee|, |Ec|} (i, j) ∈ Mours and, if the pair is atemporal, R(i,j) In contrast, high edge symmetry leads to accurate is updated as the atemporal similarity R∞ . translation in R∞ (Reinforcement step).",
                    "sid": 51,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the final matrix R, we extract the matched pairs by running step 4 with R once again.",
                    "sid": 52,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Projecting Graph for Temporal Entities.",
                    "sid": 53,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first project graphs temporally to improve translation quality for temporal entities.",
                    "sid": 54,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the optimal projection would differ across entities, we generate many projected graphs by shifting time window over all periods, and then identify the best window for each entity.",
                    "sid": 55,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of this section describes how we set the right window size w. Though each entity may have its own optimal w, we find optimizing for each entity may negatively influence on considering relationships with entities of different window sizes.",
                    "sid": 56,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we instead find the optimal window size wˆ to maximize the global “symmetry” of the given two graphs.",
                    "sid": 57,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now define “symmetry” with respect to the truth translation pair M . We note it is infeasible to assume we have M during translation, and will later relax to consider how M can be approximated.",
                    "sid": 58,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a set of graph pairs segmented by the shifted windows We finally define the symmetry S as the weighted sum of Sn and Se with parameter α (empirically tuned to 0.8 in our experiment).",
                    "sid": 59,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "S(Ge, Gc; M ) = αSn(Ge, Gc; M ) + (1 − α)Se(Ge, Gc; M ) However, as it is infeasible to assume we have the truth translation pair M , we approximate M using intermediate translation results Mours computed at step 4.",
                    "sid": 60,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To insert only true positive pairs in Mours, we set threshold higher than the optimized value from the step 4.",
                    "sid": 61,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found out that symmetry from Mours closely estimates that from M : S(Ge, Gc; M ) ≈ S(Ge, Gc; Mours) Specifically, observe from Table 1 that, given a manually built ground-truth set Mg ⊂ M as described in Section 4.1, S(Ge, Gc; Mours) returns the best symmetry value in two weeks for person entities, which is expectedly the same as the result of S(Ge, Gc; Mg ).",
                    "sid": 62,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that we can use Mours for optimizing window size.",
                    "sid": 63,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "{(G(0,w) (0,w) (s,s+w) (s,s+w) e , Gc ), · · · , (Ge , Gc ), (G(s+∆s,s+∆s+w) (s+∆s,s+∆s+w) e , Gc ), · · · }, where s is the time-stamp, our goal is to find the window size wˆ maximizing the average symmetry S of graph pairs: Table 1: Symmetry of window size 3.2 Building Classifier.",
                    "sid": 64,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then classify temporal/atemporal entities.",
                    "sid": 65,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As ( ∑ (s,s+w) (s,s+w) ) a first step, we observe their characteristics: Tem wˆ = arg max ∀w s S(Ge , Gc ; M ) N poral entities have peaks in the frequency distribution of both corpora and these peaks are aligned, Given M , symmetry S can be defined for (1) node and (2) edge respectively.",
                    "sid": 66,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first define the while such distribution of atemporal entities are more uniform and less aligned.",
                    "sid": 67,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on these observations, we identify the following criteria for temporal entities: (1) Their two distributions m in English corpus and n in Chinese corpus should have aligned peaks.",
                    "sid": 68,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Frequencies at the peaks are the higher the better.",
                    "sid": 69,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the first criterion, we first normalize the two We implemented and compared the following approaches denoted as the naming convention of listing of the used features in a parenthesis (): • (PH+R) in (You et al., 2010).",
                    "sid": 70,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• (PH+CX+R) in (Kim et al., 2011).",
                    "sid": 71,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "vectors mˆ and nˆ since two corpora have different • (PH+CX+ R+T) in (Kim et al., 2012).",
                    "sid": 72,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "scales, i.e., different number of documents.",
                    "sid": 73,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then calculate the inner product of the two vectors x = ⟨mˆ , nˆ⟩, such that this aggregated distribution • (PH+CX+R+ST): This is our approach.We evaluated the effectiveness of our new ap x peaks, only if both mˆ time.",
                    "sid": 74,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and nˆ peak at the same proach using four measures: MRR, precision, re call, and F1-score, where MRR (Voorhees, 2001) For the second criterion, we have a spectrum of option from taking the frequencies at all peaks in one extreme, to taking only the maximum frequency in another extreme.",
                    "sid": 75,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A metric representing is the average of the reciprocal ranks of the query results defined as follows: MRR = 1 ∑ 1 , such a spectrum is p-norm, which represents sum |Q| (u,v) rank(u,v) Q when p = 1 and maximum when p = ∞. We empirically tune the right balance to distinguish temporal and atemporal entities, which turns out to be p = 2.2.",
                    "sid": 76,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall, we define a metric d(m, n) which satisfies both criteria as follow: where Q is a set of ground-truth matched pairs (u, v) such that u ∈ Ve and v ∈ Vc, and rank(u,v) is the rank of R(u,v) among all R(u,w)’s such that w ∈ Vc.",
                    "sid": 77,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We performed a 5-fold cross validation by dividing ground truth into five groups.",
                    "sid": 78,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used four groups to training the parameters to maximize d(m, n) = ( n ) p ∑ (mˆ inˆi)p i=1 F1-scores, used the remaining group as a test-set using trained parameters, and computed average of five results.",
                    "sid": 79,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(bold numbers indicate the best performance for each metric.)",
                    "sid": 80,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, this measure returns 0.50 and 0.03 for the distributions in Figure 1(a) and (b), respectively, from which we can determine the translation of Figure 1(a) is temporal and the one of Figure 1(b) is atemporal.",
                    "sid": 81,
                    "ssid": 36,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental evaluation. ",
            "number": "4",
            "sents": [
                {
                    "text": "4.1 Experimental Settings.",
                    "sid": 82,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We obtained comparable corpora from English and Chinese Gigaword Corpora (LDC2009T13 and LDC2009T27) published by the Xinhua News Agency during the year 2008.",
                    "sid": 83,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From them, we extracted person entities and built two graphs, Ge = (Ve, Ee) and Gc = (Vc, Ec) by setting η = 20 which was used in (Kim et al., 2011).",
                    "sid": 84,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, we built a ground truth translation pair set Mg for person entities.",
                    "sid": 85,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first selected 500 person names randomly from English corpus.",
                    "sid": 86,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then hired a Chinese annotator to translate them into their Chinese names.",
                    "sid": 87,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among them, only 201 person names were matched to our Chinese corpus.",
                    "sid": 88,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used all such pairs to identify the best parameters and compute the evaluation measures.",
                    "sid": 89,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Experimental Results.",
                    "sid": 90,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Effect of window size We first validated the effectiveness of our approach for various window sizes (Table 2).",
                    "sid": 91,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Observe that it shows the best performance in two weeks for MRR and F1 measures.",
                    "sid": 92,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Interestingly, this result also corresponds to our optimization result wˆ of Table 1 in Section 3.1.",
                    "sid": 93,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "W e ek s 2 6 1 3 4 2 1 M R R Pr ec isi o n R ec all F 1 .74 36 .77 78 .66 17 .71 51 .80 66 .74 86 .68 75 .71 65 .81 66 .81 26 .73 20 .77 01 .82 33 .83 06 .72 95 .77 65 .81 48 .83 33 .72 14 .77 33 Table 2: Optimality of window size Overall performance Table 3 shows the results of four measures.",
                    "sid": 94,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Observe that (PH+CX+R+T) and (PH+CX+R+ST) outperform the others in all our settings.",
                    "sid": 95,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can also observe the effect of selective temporal- ity, which maximizes the symmetry between two graphs as shown in Table 1, i.e., (PH+CX+R+ST) Method MRR Precision Recall F1 (PH+R) .6500 .7230 .4548 .5552 (PH+CX+R) .7499 .7704 .6623 .7120 (PH+CX+R+T) .7658 .8223 .6608 .7321 (PH+CX+R+ST) .8233 .8306 .7295 .7765 Table 3: MRR, Precision, Recall, and F1-score (QJOLVK 1DPH 7/+&;+5 7/+&;+5+7 7/+&;+5+67+X LQWDR 贀齍 矂 贀齍 矂 贀齍 矂 .LP <RQJ 1DP 蜥薆筸 綎薆 網 綎薆 網 .DU]DL 筕蟁 绸紙 靈霁 顼蝌 Figure 2: The translation examples where shaded cells indicate the correctly translated pairs.",
                    "sid": 96,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "outperforms (PH+CX+R+T) by 6.1%.",
                    "sid": 97,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These improvements were statistically significant according to the Student’s t-test at P < 0.05 level.",
                    "sid": 98,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows representative translation examples.",
                    "sid": 99,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All approaches found famous entities such as “Hu Jintao,” a former leader of China, but (PH+CX+R) failed to find translation of lesser known entities, such as “Kim Yong Nam.” Using temporal features help both (PH+CX+R+T) and (PH+CX+R+ST) identify the right translation, as Kim’s temporal occurrence is strong and symmetric in both corpora.",
                    "sid": 100,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, (PH+CX+R+T) failed to find the translation of “Karzai”, the president of Afghanistan, as it only appears weakly and transiently during a short period time, for which only (PH+CX+R+ST) applying varying sizes of window per entity is effective.",
                    "sid": 101,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "5",
            "sents": [
                {
                    "text": "This paper validated that considering temporal- ity selectively is helpful for improving the translation quality.",
                    "sid": 102,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We developed a classifier to distinguish temporal/atemporal entities and our proposed method outperforms the state-of-the-art approach by 6.1%.",
                    "sid": 103,
                    "ssid": 2,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgment",
            "number": "",
            "sents": [
                {
                    "text": "This research was supported by the MKE (The Ministry of Knowledge Economy), Korea and Microsoft Research, under IT/SW Creative research program supervised by the NIPA (National IT Industry Promotion Agency).",
                    "sid": 104,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(NIPA2012- H0503 121036).",
                    "sid": 105,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}