{
    "ID": "P13-2015",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Most coreference resolvers rely heavily on string matching, syntactic properties, and semantic attributes of words, but they lack the ability to make decisions based on individual words.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we explore the benefits of lexicalized features in the setting of domain-specific coreference resolution.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that adding lexicalized features to off-the-shelf coreference resolvers yields significant performance gains on four domain-specific data sets and with two types of coreference resolution architectures.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Coreference resolvers are typically evaluated on collections of news articles that cover a wide range of topics, such as the ACE (ACE03, 2003; ACE04, 2004; ACE05, 2005) and OntoNotes (Pradhan et al., 2007) data sets.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many NLP applications, however, involve text analysis for specialized domains, such as clinical medicine (Gooch and Roudsari, 2012; Glinos, 2011), legal text analysis (BouayadAgha et al., 2009), and biological literature (BatistaNavarro and Ananiadou, 2011; Castan˜ o et al., 2002).",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Learning-based coreference resolvers can be easily retrained for a specialized domain given annotated training texts for that domain.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we found that retraining an off-the-shelf coreference resolver with domain- specific texts showed little benefit.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This surprising result led us to question the nature of the feature sets used by noun phrase (NP) coreference resolvers.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nearly all of the features employed by recent systems fall into three categories: string match and word overlap, syntactic properties (e.g., appositives, predicate nominals, parse features, etc.), and semantic matching (e.g., gender agreement, WordNet similarity, named entity classes, etc.).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conspicuously absent from most systems are lexical features that allow the classifier to consider the specific words when making a coreference decision.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A few researchers have experimented with lexical features, but they achieved mixed results in evaluations on broad-coverage corpora (Bengston and Roth, 2008; Bjo¨ rkelund and Nugues, 2011; Rahman and Ng, 2011a).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We hypothesized that lexicalized features can have a more substantial impact in domain-specific settings.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexical features can capture domain- specific knowledge and subtle semantic distinctions that may be important within a domain.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, based on the resolutions found in domain-specific training sets, our lexicalized features captured the knowledge that “tomcat” can be coreferent with “plane”, “UAW” can be coreferent with “union”, and “anthrax” can be coreferent with “diagnosis”.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Capturing these types of domain-specific information is often impossible using only general-purpose resources.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, WordNet defines “tomcat” only as an animal, does not contain an entry for “UAW”, and categorizes “anthrax” and “diagnosis” very differently.1 In this paper, we evaluate the impact of lexicalized features on 4 domains: management succession (MUC6 data), vehicle launches (MUC7 data), disease outbreaks (ProMed texts), and terrorism (MUC4 data).",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We incorporate lexical- ized feature sets into two different coreference architectures: Reconcile (Stoyanov et al., 2010), a pairwise coreference classifier, and Sieve (Raghunathan et al., 2010), a rule-based system.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our results show that lexicalized features significantly improve performance in all four domains and in both types of coreference architectures.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "We are not the first researchers to use lexicalized features for coreference resolution.",
                    "sid": 19,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, pre 1 WordNet defines “anthrax” as a disease (condition/state).",
                    "sid": 20,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and “diagnosis” as an identification (discovery event).",
                    "sid": 21,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Test Train --.--.--.",
                    "sid": 22,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MUC6 MUC7 Promed MUC4 P R F P R F P R F P R F MUC6 80.79 62.71 70.61 84.33 61.74 71.29 83.54 70.34 76.37 80.22 60.81 69.18 MUC7 74.78 65.59 69.88 82.73 64.09 72.23 85.29 71.82 77.98 77.35 64.19 70.16 Promed 73.60 64.20 68.60 82.88 63.37 71.82 80.31 72.66 76.29 74.52 65.65 69.80 MUC4 69.27 65.66 67.42 71.49 67.22 69.29 76.92 74.25 75.56 71.76 67.37 69.50 Table 1: Cross-domain B3 (Bagga and Baldwin, 1998) results for Reconcile with its general feature set.",
                    "sid": 23,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Paired Permutation test (Pesarin, 2001) was used for statistical significance testing and gray cells represent results that are not significantly different from the best result.",
                    "sid": 24,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "vious work has evaluated the benefit of lexical features only for broad-coverage data sets.",
                    "sid": 25,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bengston and Roth (2008) incorporated a memorization feature to learn which entities can refer to one another.",
                    "sid": 26,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They created a binary feature for every pair of head nouns, including pronouns.",
                    "sid": 27,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They reported no significant improvement from these features on the ACE 2004 data.",
                    "sid": 28,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rahman and Ng (2011a) also utilized lexical features, going beyond strict memorization with methods to combat data sparseness and incorporating semantic information.",
                    "sid": 29,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They created a feature for every ordered pair of head nouns (for pronouns and nominals) or full NPs (for proper nouns).",
                    "sid": 30,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semi-lexical features were also used when one NP was a Named Entity, and unseen features were used when the NPs were not in the training set.",
                    "sid": 31,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their features did yield improvements on both the ACE 2005 and OntoNotes2 data, but the semi- lexical features included Named Entity classes as well as word-based features.",
                    "sid": 32,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rahman and Ng (2011b) explored the use of lexical features in greater detail and showed their benefit on the ACE05 corpus independent of, and combined with, a conventional set of coreference features.",
                    "sid": 33,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ACE05 corpus is drawn from six sources (Newswire, Broadcast News, Broadcast Conversations, Conversational Telephone Speech, Webblogs, and Usenet).",
                    "sid": 34,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The authors experimented with utilizing lexical information drawn from different sources.",
                    "sid": 35,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results showed that the best performance came from training and testing with lexical knowledge drawn from the same source.",
                    "sid": 36,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although our approach is similar, this paper focuses on learning lexical information from different domains as opposed to the different genres found in the six sources of the ACE05 corpus.",
                    "sid": 37,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bjo¨ rkelund and Nugues (2011) used lexical word pairs for the 2011 CoNLL Shared Task, showing significant positive impact on performance.",
                    "sid": 38,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They used over 2000 annotated documents from the broad-coverage OntoNotes corpus for training.",
                    "sid": 39,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work aims to show the benefit of lexical features using much smaller training sets (< 50 documents) focused on specific domains.",
                    "sid": 40,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexical features have also been used for slightly different purposes.",
                    "sid": 41,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Florian et al.",
                    "sid": 42,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) utilized lexical information such as mention spelling and context for entity tracking in ACE.",
                    "sid": 43,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ng (2007) used lexical information to assess the likelihood of a noun phrase being anaphoric, but this did not show clear improvements on ACE data.",
                    "sid": 44,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There has been previous work on domain- specific coreference resolution for several domains, including biological literature (Castan˜ o et al., 2002; Liang and Lin, 2005; Gasperin and Briscoe, 2008; Kim et al., 2011; BatistaNavarro and Ananiadou, 2011), clinical medicine (He, 2007; Zheng et al., 2011; Glinos, 2011; Gooch and Roudsari, 2012) and legal documents (BouayadAgha et al., 2009).",
                    "sid": 45,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, BABAR (Bean and Riloff, 2004) used contextual role knowledge for coreference resolution in the domains of terrorism and natural disasters.",
                    "sid": 46,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But BABAR acquired and used lexical information to match the compatibility of contexts surrounding NPs, not the NPs themselves.",
                    "sid": 47,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To the best of our knowledge, our work is the first to examine the impact of lexicalized features for domain-specific coreference resolution.",
                    "sid": 48,
                    "ssid": 30,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "exploiting lexicalized features. ",
            "number": "3",
            "sents": [
                {
                    "text": "Table 1 shows the performance of a learning-based coreference resolver, Reconcile (Stoyanov et al., 2010), with its default feature set using different combinations of training and testing data.",
                    "sid": 49,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reconcile does not include any lexical features, but does contain over 60 general features covering semantic agreement, syntactic constraints, string match and recency.",
                    "sid": 50,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each row represents a training set, each column represents a test set, and each cell shows precision (P), recall (R), and F score results under the B3 metric when using the corresponding training and test data.",
                    "sid": 51,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best results for each test set appear MUC6 MUC7 ProM ED MUC4 P R F P R F P R F P R F Re co nci le 80.79 62.71 70.61 82.73 64.09 72.23 80.31 72.66 76.29 71.76 67.37 69.50 +L ex Lo ok up 87.",
                    "sid": 52,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "01 63.40 73.",
                    "sid": 53,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "35 87.",
                    "sid": 54,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "39 62.86 73.",
                    "sid": 55,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "12 86.",
                    "sid": 56,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "66 70.95 78.",
                    "sid": 57,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "02 82.",
                    "sid": 58,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "89 67.53 74.",
                    "sid": 59,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "42 +L ex Set s 86.",
                    "sid": 60,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "50 63.76 73.",
                    "sid": 61,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "41 85.",
                    "sid": 62,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "86 64.35 73.",
                    "sid": 63,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "56 86.",
                    "sid": 64,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "19 72.14 78.",
                    "sid": 65,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "54 81.",
                    "sid": 66,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "98 67.73 74.",
                    "sid": 67,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "18 Sie ve 92.20 61.70 73.90 91.46 59.59 72.16 94.43 67.25 78.55 91.30 59.84 72.30 +L ex Be gin 91.",
                    "sid": 68,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "22 62.97 74.",
                    "sid": 69,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "51 91.",
                    "sid": 70,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "24 60.28 72.",
                    "sid": 71,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "59 93.",
                    "sid": 72,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "51 69.15 79.",
                    "sid": 73,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "51 89.",
                    "sid": 74,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "01 62.84 73.",
                    "sid": 75,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "67 +L ex En d 90.",
                    "sid": 76,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "59 63.47 74.",
                    "sid": 77,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "64 91.",
                    "sid": 78,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "17 60.56 72.",
                    "sid": 79,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "78 93.",
                    "sid": 80,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "99 68.87 79.",
                    "sid": 81,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "49 89.",
                    "sid": 82,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "04 64.03 74.",
                    "sid": 83,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "47 Table 2: B3 results for baselines and lexicalized feature sets across four domains.",
                    "sid": 84,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "in boldface.",
                    "sid": 85,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We performed statistical significance testing using the Paired Permutation test (Pesarin, 2001) and the gray cells represent results where there was not significant difference from the best results in the same column.",
                    "sid": 86,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If just one cell is gray in a column, that indicates the result was significantly better than the other results in the same column with p ≤ 0.05.Table 1 does not show much benefit from train ing on the same domain as the test set.",
                    "sid": 87,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Three different training sets produce F scores that are not significantly different for both the MUC6 and MUC4 test data.",
                    "sid": 88,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For ProMed, training on the MUC7 data yields significantly better results than training on all the other data sets, including ProMed texts!",
                    "sid": 89,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on these results, it would seem that training on the MUC7 texts is likely to yield the best results no matter what domain you plan to use the coreference resolver for.",
                    "sid": 90,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The goal of our work is to investigate whether lexical features can extract additional knowledge from domain-specific training texts to help tailor a coreference resolver to perform better for a specific domain.",
                    "sid": 91,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Extracting Coreferent Training Pairs.",
                    "sid": 92,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopt the terminology introduced by Stoyanov et al.",
                    "sid": 93,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009) to define a coreference element (CE) as a noun phrase that can participate in a coreference relation based on the task definition.",
                    "sid": 94,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each training document has manually annotated gold coreference chains corresponding to the sets of CEs that are coreferent.",
                    "sid": 95,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each CE in a gold chain, we pair that CE with all of the other CEs in the same chain.",
                    "sid": 96,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We consider the coreference relation to be bidirectional, so we don’t retain information about which CE was the antecedent.",
                    "sid": 97,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do not extract CE pairs that share the same head noun because they are better handled with string match.",
                    "sid": 98,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For nominal NPs, we retain only the head noun, but we use the entire NP for proper names.",
                    "sid": 99,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We discard pairs that include a pronoun, and nor malize strings to lower case for consistency.",
                    "sid": 100,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Lexicalized Feature Sets.",
                    "sid": 101,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We explore two ways to capture lexicalized information as features.",
                    "sid": 102,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first approach indicates whether two CEs have ever been coreferent in the training data.",
                    "sid": 103,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We create a single feature called LEXLOOKUP(X,Y) that receives a value of 1 when x and y have been coreferent at least twice, or a value of 0 otherwise.2 LEXLOOKUP(X,Y) is a single feature that captures all CE pairs that were coreferent in the training data.",
                    "sid": 104,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also created set-based features that capture the set of terms that have been coreferent with a particular CE.",
                    "sid": 105,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The C oref Set(x) is the set of CEs that have appeared in the same coreference chain as mention x at least twice.",
                    "sid": 106,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We create a set of binary-valued features LEXSET(X,Y), one for each CE x in the training data.",
                    "sid": 107,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a pair of CEs, x and y, LEXSET(X,Y)= 1 if y ∈ C oref Set(x), or 0 otherwise.",
                    "sid": 108,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The benefit of the set-based features over a single mono lithic feature is that the classifier has one set-based feature for each mention found in the training data, so it can learn to handle individual terms differently.",
                    "sid": 109,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also tried encoding a separate feature for each distinct pair of words, analogous to the memorization feature in Bengston and Roth (2008).",
                    "sid": 110,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This did not improve performance as much as the other feature representations presented here.",
                    "sid": 111,
                    "ssid": 63,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "evaluation. ",
            "number": "4",
            "sents": [
                {
                    "text": "4.1 Data Sets.",
                    "sid": 112,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluated the performance of lexicalized features on 4 domain-specific corpora including two standard coreference benchmarks, the MUC6 and MUC7 data sets.",
                    "sid": 113,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The MUC6 domain is management succession and consists of 30 training texts and 30 test texts.",
                    "sid": 114,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The MUC7 domain is vehicle 2 We require a frequency ≥ 2 to minimize overfitting because many cases occur only once in the training data.",
                    "sid": 115,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "launches and consists of 30 training texts and 20 test texts.",
                    "sid": 116,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used these standard train/test splits to be consistent with previous work.",
                    "sid": 117,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also created 2 new coreference data sets which we will make freely available.",
                    "sid": 118,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We manually annotated 45 ProMed-mail articles (www.promedmail.org) about disease outbreaks and 45 MUC4 texts about terrorism, following the MUC guidelines (Hirschman, 1997).",
                    "sid": 119,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inter- annotator agreement between two annotators was .77 (κ) on ProMed and .84 (MUC F Score)(Villain et al., 1995) on both ProMed and MUC4.3 We performed 5-fold cross-validation on both data sets and report the micro-averaged results.",
                    "sid": 120,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gold CE spans were used in all experiments to factor out issues with markable identification and anaphoricity across the different domains.",
                    "sid": 121,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Coreference Resolution Models.",
                    "sid": 122,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We conducted experiments using two coreference resolution architectures.",
                    "sid": 123,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reconcile4 (Stoyanov et al., 2010) is a freely available pairwise mention classifier.",
                    "sid": 124,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For classification, we chose Weka’s (Witten and Frank, 2005) Decision Tree learner inside Reconcile.",
                    "sid": 125,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reconcile contains roughly 60 features (none lexical), largely modeled after Ng and Cardie (2002).",
                    "sid": 126,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We modified Reconcile’s Single Link clustering scheme to enforce an additional rule that non-overlapping proper names cannot be merged into the same chain.",
                    "sid": 127,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also conducted experiments with the Sieve coreference resolver, which applies high precision heuristic rules to incrementally build coreference chains.",
                    "sid": 128,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We implemented the LEXLOOKUP(X,Y) feature as an additional heuristic rule.",
                    "sid": 129,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We tried inserting this heuristic before Sieve’s other rules (LexBegin), and also after Sieve’s other rules (LexEnd).",
                    "sid": 130,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Experimental Results.",
                    "sid": 131,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 presents results for Reconcile trained with and without lexical features and when adding a lexical heuristic with data drawn from same- domain texts to Sieve.",
                    "sid": 132,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first row shows the results without the lexicalized features (from Table 1).",
                    "sid": 133,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All F scores for Reconcile with lexicalized features are significantly better than without these features based on the Paired Permutation test (Pesarin, 2001) with 3 We also computed κ on MUC4, but unfortunately the score and original data were lost.",
                    "sid": 134,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 http://www.cs.utah.edu/nlp/reconcile/ p ≤ 0.05.",
                    "sid": 135,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MUC4 showed the largest gain for Reconcile, with the F score increasing from 69.5 to over 74.",
                    "sid": 136,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For most domains, adding the lexical features to Reconcile substantially increased precision with comparable levels of recall.",
                    "sid": 137,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bottom half of Table 2 contains the results of adding a lexical heuristic to Sieve.",
                    "sid": 138,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first row shows the default system with no lexical information.",
                    "sid": 139,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All F scores with the lexical heuristic are significantly better than without it.",
                    "sid": 140,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Sieve’s high-precision coreference architecture, the lexical heuristic yields additional recall gains without sacrificing much precision.",
                    "sid": 141,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A C E 2 0 0 4 P R F Re co nci le 70.",
                    "sid": 142,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "59 83.09 76.",
                    "sid": 143,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "33 +L ex Lo ok up 71.",
                    "sid": 144,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "32 82.93 76.",
                    "sid": 145,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "69 +L ex Set s 71.",
                    "sid": 146,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "44 83.45 76.",
                    "sid": 147,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "98 Sie ve 90.",
                    "sid": 148,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "09 74.23 81.",
                    "sid": 149,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "39 +L ex Be gin 86.54 75.43 80.61 +L ex En d 87.00 75.45 80.82 Table 3: B3 results for baselines and lexicalized feature sets on the broad-coverage ACE 2004 data set.",
                    "sid": 150,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows the results for Reconcile and Sieve when training and testing on the ACE 2004 data.",
                    "sid": 151,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we see little improvement from adding lexical information.",
                    "sid": 152,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Reconcile, the small differences in F scores are not statistically significant.",
                    "sid": 153,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Sieve, the unlexicalized system yields a significantly higher F score than when adding the lexical heuristic.",
                    "sid": 154,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results support our hypothesis that lexicalized information can be beneficial for capturing domain-specific word associations, but may not be as helpful in a broad-coverage setting where the language covers a diverse set of topics.",
                    "sid": 155,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 shows a re-evaluation of the cross- domain experiments from Table 1 for Reconcile with the LexSet features added.",
                    "sid": 156,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bottom half of the table shows cross-domain experiments for Sieve using the lexical heuristic at the end of its rule set (LexEnd).",
                    "sid": 157,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results are presented using both the B3 metric and the MUC Score (Villain et al., 1995).",
                    "sid": 158,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training and testing on the same domain always produced the highest recall scores for MUC 7, ProMed, and MUC4 when utilizing lexical features.",
                    "sid": 159,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all cases, lexical features acquired from same-domain texts yield results that are either clearly the best or not significantly different from the best.",
                    "sid": 160,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Train Test --.--.",
                    "sid": 161,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4: Cross-domain B3 and MUC results for Reconcile and Sieve with lexical features.",
                    "sid": 162,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gray cells represent results that are not significantly different from the best results in the column at the 0.05 p-level.",
                    "sid": 163,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For MUC6 and MUC7, the highest F score results almost always come from training on same- domain texts, although in some cases these results are not significantly different from training on other domains.",
                    "sid": 164,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexical features can yield improvements when training on a different domain if there is overlap in the vocabulary across the domains.",
                    "sid": 165,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the ProMed domain, the Sieve system performs significantly better, under both metrics, with same-domain lexical features than with lexical features acquired from a different domain.",
                    "sid": 166,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Reconcile, there is not a significant difference in the F score for ProMed when training on ProMed, MUC4, or MUC7.",
                    "sid": 167,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the MUC4 domain, using same-domain lexical information always produces the best F score, under both metrics and in both coreference systems.",
                    "sid": 168,
                    "ssid": 57,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "5",
            "sents": [
                {
                    "text": "We explored the use of lexical information for domain-specific coreference resolution using 4 domain-specific data sets and 2 coreference re- solvers.",
                    "sid": 169,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexicalized features consistently improved performance for all of the domains and in both coreference architectures.",
                    "sid": 170,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see benefits from lexicalized features in cross-domain training, but the gains are often more substantial when utilizing same-domain lexical knowledge.",
                    "sid": 171,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the future, we plan to explore additional types of lexical information to benefit domain-specific coreference resolution.",
                    "sid": 172,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This material is based upon work supported by the National Science Foundation under Grant No.",
                    "sid": 173,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "IIS1018314 and the Defense Advanced Research Projects Agency (DARPA) Machine Reading Program under Air Force Research Laboratory (AFRL) prime contract no.",
                    "sid": 174,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "FA875009-C-0172.",
                    "sid": 175,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Any opinions, findings, and conclusion or recommendations expressed in this material are those of the authors and do not necessarily reflect the view of the DARPA, AFRL, or the U.S. government.",
                    "sid": 176,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}