{
    "ID": "P13-1121",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "In automatic summarization, centrality is the notion that a summary should contain the core parts of the source text.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Current systems use centrality, along with redundancy avoidance and some sentence compression, to produce mostly extractive summaries.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we investigate how summarization can advance past this paradigm towards robust abstraction by making greater use of the domain of the source text.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We conduct a series of studies comparing human-written model summaries to system summaries at the semantic level of caseframes.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that model summaries (1) are more abstractive and make use of more sentence aggregation, (2) do not contain as many topical caseframes as system summaries, and (3) cannot be reconstructed solely from the source text, but can be if texts from in-domain documents are added.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results suggest that substantial improvements are unlikely to result from better optimizing centrality-based criteria, but rather more domain knowledge is needed.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "In automatic summarization, centrality has been one of the guiding principles for content selection in extractive systems.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We define centrality to be the idea that a summary should contain the parts of the source text that are most similar or representative of the source text.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is most transparently illustrated by the Maximal Marginal Relevance (MMR) system of Carbonell and Goldstein (1998), which defines the summarization objective to be a linear combination of a centrality term and a non-redundancy term.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since MMR, much progress has been made on more sophisticated methods of measuring central- ity and integrating it with non-redundancy (See Nenkova and McKeown (2011) for a recent survey).",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, term weighting methods such as the signature term method of Lin and Hovy (2000) pick out salient terms that occur more often than would be expected in the source text based on frequencies in a background corpus.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method is a core component of the most successful sum- marization methods (Conroy et al., 2006).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While extractive methods based on centrality have thus achieved success, there has long been recognition that abstractive methods are ultimately more desirable.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One line of work is in text simplification and sentence fusion, which focus on the ability of abstraction to achieve a higher compression ratio (Knight and Marcu, 2000; Barzilay and McKeown, 2005).",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A less examined issue is that of aggregation and information synthesis.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A key part of the usefulness of summaries is that they provide some synthesis or analysis of the source text and make a more general statement that is of direct relevance to the user.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, a series of related events can be aggregated and expressed as a trend.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The position of this paper is that centrality is not enough to make substantial progress towards abstractive summarization that is capable of this type of semantic inference.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, summarization systems need to make more use of domain knowledge.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We provide evidence for this in a series of studies on the TAC 2010 guided summarization data set that examines how the behaviour of automatic summarizers can or cannot be distinguished from human summarizers.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we confirm that abstraction is a desirable goal, and 1233 Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics, pages 1233–1242, Sofia, Bulgaria, August 49 2013.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2013 Association for Computational Linguistics provide a quantitative measure of the degree of sentence aggregation in a summarization system.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, we show that centrality-based measures are unlikely to lead to substantial progress towards abstractive summarization, because current top- performing systems already produce summaries that are more “central” than humans do.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Third, we consider how domain knowledge may be useful as a resource for an abstractive system, by showing that key parts of model summaries can be reconstructed from the source plus related in-domain documents.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our contributions are novel in the following respects.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, our analyses are performed at the level of caseframes, rather at the level of words or syntactic dependencies as in previous work.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Case- frames are shallow approximations of semantic roles which are well suited to characterizing a domain by its slots.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we take a developmental rather than evaluative perspective—our goal is not to develop a new evaluation measure as defined by correlation with human responsiveness judgments.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, our studies reveal useful criteria with which to distinguish human-written and system summaries, helping to guide the development of future summarization systems.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Domain-dependent template-based summarization systems have been an alternative to extractive systems which make use of rich knowledge about a domain and information extraction techniques to generate a summary, possibly using a natural language generation system (Radev and McKeown, 1998; White et al., 2001; McKeown et al., 2002).",
                    "sid": 30,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper can be seen as a first step towards reconciling the advantages of domain knowledge with the resource-lean extraction approaches popular today.",
                    "sid": 31,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As noted above, Lin and Hovy’s (2000) signature terms have been successful in discovering terms that are specific to the source text.",
                    "sid": 32,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These terms are identified by a log-likelihood ratio test based on their relative frequencies in relevant and irrelevant documents.",
                    "sid": 33,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They were originally proposed in the context of single-document summarization, where they were calculated using in- domain (relevant) vs. out-of-domain (irrelevant) text.",
                    "sid": 34,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In multi-document summarization, the in- domain text has been replaced by the source text cluster (Conroy et al., 2006), thus they are now used as a form of centrality-based features.",
                    "sid": 35,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we use guided summarization data as an opportunity to reopen the investigation into the effect of domain, because multiple document clusters from the same domain are available.",
                    "sid": 36,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Summarization evaluation is typically done by comparing system output to human-written model summaries, and are validated by their correlation with user responsiveness judgments.",
                    "sid": 37,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The comparison can be done at the word level, as in ROUGE (Lin, 2004), at the syntactic level, as in Basic Elements (Hovy et al., 2006), or at the level of summary content units, as in the Pyramid method (Nenkova and Passonneau, 2004).",
                    "sid": 38,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are also automatic measures which do not require model summaries, but compare against the source text instead (Louis and Nenkova, 2009; Saggion et al., 2010).",
                    "sid": 39,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several studies complement this paper by examining the best possible extractive system using current evaluation measures, such as ROUGE (Lin and Hovy, 2003; Conroy et al., 2006).",
                    "sid": 40,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They find that the best possible extractive systems score higher or as highly than human summarizers, but it is unclear whether this means the oracle summaries are actually as useful as human ones in an extrinsic setting.",
                    "sid": 41,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Genest et al.",
                    "sid": 42,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009) ask humans to create extractive summaries, and find that they score in between current automatic systems and human-written abstracts on responsiveness, linguistic quality, and Pyramid score.",
                    "sid": 43,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the lecture domain, He et al.",
                    "sid": 44,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1999; 2000) find that lecture transcripts that have been manually highlighted with key points improve students’ quiz scores more than when using automated summarization techniques or when providing only the lecture transcript or slides.",
                    "sid": 45,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Jing and McKeown (2000) manually analyzed 30 human-written summaries, and find that 19% of sentences cannot be explained by cut-and-paste operations from the source text.",
                    "sid": 46,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Saggion and La- palme (2002) similarly define a list of transformations necessary to convert source text to summary text, and manually analyzed their frequencies.",
                    "sid": 47,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Copeck and Szpakowicz (2004) find that at most 55% of vocabulary items found in model summaries occur in the source text, but they do not investigate where the other vocabulary items might be found.",
                    "sid": 48,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentence: At one point, two bomb squad trucks sped to the school after a backpack scare.",
                    "sid": 49,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dependencies: num(point, one) prep at(sped, point) num(trucks, two) nn(trucks, bomb) nn(trucks, squad) nsubj(sped, trucks) root(ROOT , sped) det(school, the) prep to(sped, school) det(scare, a) nn(scare, backpack) prep af ter(sped, scare) Caseframes: (speed, prep at) (speed, nsubj) (speed, prep to) (speed, prep af ter) Table 1: A sentence decomposed into its dependency edges, and the caseframes derived from those edges that we consider (in black).",
                    "sid": 50,
                    "ssid": 21,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "theoretical basis of our analysis. ",
            "number": "3",
            "sents": [
                {
                    "text": "Many existing summarization evaluation methods rely on word or N-gram overlap measures, but these measures are not appropriate for our analysis.",
                    "sid": 51,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word overlap can occur due to shared proper nouns or entity mentions.",
                    "sid": 52,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Good summaries should certainly contain the salient entities in the source text, but when assessing the effect of the domain, different domain instances (i.e., different document clusters in the same domain) would be expected to contain different salient entities.",
                    "sid": 53,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, the realization of entities as noun phrases depends strongly on context, which would confound our analysis if we do not also correctly resolve coreference, a difficult problem in its own right.",
                    "sid": 54,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We leave such issues to other work (Nenkova and McKe- own, 2003, e.g.).",
                    "sid": 55,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Domains would rather be expected to share slots (a.k.a. aspects), which require a more semantic level of analysis that can account for the various ways in which a particular slot can be expressed.",
                    "sid": 56,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another consideration is that the structures to be analyzed should be extracted automatically.",
                    "sid": 57,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on these criteria, we selected caseframes to be the appropriate unit of analysis.",
                    "sid": 58,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A caseframe is a shallow approximation of the semantic role structure of a proposition-bearing unit like a verb, and are derived from the dependency parse of a sentence1 . 1 Note that caseframes are distinct from (though directly.",
                    "sid": 59,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Relation Caseframe Pair Sim.",
                    "sid": 60,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Degree (kill, dobj) (wound, dobj) 0.82 Causal (kill, dobj) (die, nsubj) 0.80 Type (rise, dobj) (drop, prep to) 0.81 Figure 1: Sample pairs of similar caseframes by relation type, and the similarity score assigned to them by our distributional model.",
                    "sid": 61,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, they are (gov, role) pairs, where gov is a proposition-bearing element, and role is an approximation of a semantic role with gov as its head (See Figure 1 for examples).",
                    "sid": 62,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Caseframes do not consider the dependents of the semantic role approximations.The use of caseframes is well grounded in a va riety of NLP tasks relevant to summarization such as coreference resolution (Bean and Riloff, 2004), and information extraction (Chambers and Juraf- sky, 2011), where they serve the central unit of semantic analysis.",
                    "sid": 63,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Related semantic representations are popular in Case Grammar and its derivative formalisms such as frame semantics (Fillmore, 1982).",
                    "sid": 64,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the following algorithm to extract case- frames from dependency parses.",
                    "sid": 65,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we extract those dependency edges with a relation type of subject, direct object, indirect object, or prepositional object (with the preposition indicated), along with their governors.",
                    "sid": 66,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The governor must be a verb, event noun (as defined by the hyponyms of the WordNet EV EN T synset), or nominal or adjectival predicate.",
                    "sid": 67,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, a series of deterministic transformations are applied to the syntactic relations to account for voicing alternations, control, raising, and copular constructions.",
                    "sid": 68,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Caseframe Similarity.",
                    "sid": 69,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Direct caseframe matches account for some variation in the expression of slots, such as voicing alternations, but there are other reasons different caseframes may indicate the same slot (Figure 1).",
                    "sid": 70,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, (kill, dobj) and (wound, dobj) both indicate the victim of an attack, but differ by the degree of injury to the victim.",
                    "sid": 71,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(kill, dobj) and (die, nsubj) also refer to a victim, but are linked by a causal relation.",
                    "sid": 72,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(rise, dobj) and inspired by) the similarly named case frames of Case Grammar (Fillmore, 1968).",
                    "sid": 73,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(drop, prep to) on the other hand simply share a named entity type (in this case, numbers).",
                    "sid": 74,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To account for these issues, we measure caseframe similarity based on their distributional similarity in a large training corpus.",
                    "sid": 75,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we construct vector representations of each caseframe, where the dimensions of the vector correspond to the lemma of the head word that fills the caseframe in the training corpus.",
                    "sid": 76,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, kicked the ball would result in a count of1 added to the caseframe (kick, dobj) for the con text word ball.",
                    "sid": 77,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we rescale the counts into pointwise mutual information values, which has been shown to be more effective than raw counts at detecting semantic relatedness (Turney, 2001).",
                    "sid": 78,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarity between caseframes can then be compared by cosine similarity between the their vector representations.",
                    "sid": 79,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For training, we use the AFP portion of the Gigaword corpus (Graff et al., 2005), which we parsed using the Stanford parser’s typed dependency tree representation with collapsed conjunctions (de Marneffe et al., 2006).",
                    "sid": 80,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For reasons of sparsity, we only considered caseframes that appear at least five times in the guided summarization corpus, and only the 3000 most common lemmata in Gigaword as context words.",
                    "sid": 81,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 An Example.",
                    "sid": 82,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To illustrate how caseframes indicate the slots in a summary, we provide the following fragment of a model summary from TAC about the Unabomber trial: (1) In Sacramento, Theodore Kaczynski faces a 10-count federal indictment for 4 of the 16 mail bomb attacks attributed to the Unabomber in which two people were killed.",
                    "sid": 83,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If found guilty, he faces a death penalty.",
                    "sid": 84,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He has pleaded innocent to all charges.",
                    "sid": 85,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "U.S. District Judge Garland Burrell Jr. presides in Sacramento.",
                    "sid": 86,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All of the slots provided by TAC for the Investigations and Trials domain can be identified by one or more caseframes.",
                    "sid": 87,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The DEFEN DA N T can be identified by (f ace, nsubj), and (plead, nsubj); the CH A R G ES by (f ace, dobj); the REA SO N by (indictment, prep f or); the SEN TEN C E by (f ace, dobj); the PLEA D by (plead, dobj); and the IN V ESTIG ATO R by (preside, nsubj).",
                    "sid": 88,
                    "ssid": 38,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "4",
            "sents": [
                {
                    "text": "We conducted our experiments on the data and results of the TAC 2010 summarization workshop.",
                    "sid": 89,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This data set contains 920 newspaper articles in 46 topics of 20 documents each.",
                    "sid": 90,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ten are used in an initial guided summarization task, and ten are used in an update summarization task, in which a summary must be produced assuming that the original ten documents had already been read.",
                    "sid": 91,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All summaries have a word length limit of 100 words.",
                    "sid": 92,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We analyzed the results of the two summarization tasks separately in our experiments.",
                    "sid": 93,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 46 topics belong to five different categories or domains: Accidents and natural disasters, Criminal or terrorist attacks, Health and safety, Endangered resources, and Investigations and trials.",
                    "sid": 94,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each domain is associated with a template specifying the type of information that is expected in the domain, such as the participants in the event or the time that the event occurred.",
                    "sid": 95,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our study, we compared the characteristics of summaries generated by the eight human summarizers with those generated by the peer summaries, which are basically extractive systems.",
                    "sid": 96,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are 43 peer summarization systems, including two baselines defined by NIST.",
                    "sid": 97,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We refer to systems by their ID given by NIST, which are alphabetical for the human summarizers (A to H), and numeric for the peer summarizers (1 to 43).",
                    "sid": 98,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We removed two peer systems (systems 29 and 43) which did not generate any summary text in the workshop, presumably due to software problems.",
                    "sid": 99,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each measure that we consider, we compare the average among the human-written summaries to the three individual peer systems, which we chose in order to provide a representative sample of the average and best performance of the automatic systems according to current evaluation methods.",
                    "sid": 100,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These systems are all primarily extractive, like most of the systems in the workshop: Peer average The average of the measure among the 41 peer summarizers.",
                    "sid": 101,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Peer 16 This system scored the highest in responsiveness scores on the original summarization task and in ROUGE-2, responsiveness, and Pyramid score in the update task.",
                    "sid": 102,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Peer 22 This system scored the highest in ROUGE-2 and Pyramid score in the original sum- marization task.",
                    "sid": 103,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.5 1.6 1.4 1.2 1.0 1.0 0.8 0.5 0.6 0.4 0.0 1 28 12 15 36 42 14 37 13 24 21 41 27 17 23 34 7 20 11 5 G F E D H 4 25 10 31 18 8 30 33 19 16 40 3 38 35 39 22 6 26 32 9 2 B A C System IDs (a) Initial guided summarization task 0.2 0.0 28 31 42 10 36 25 13 30 27 9 14 33 7 39 19 26 17 21 32 5 F 2 C A D 1 18 4 15 24 12 16 34 3 8 37 40 11 38 35 23 22 6 41 20 G E B H System IDs (b) Update summarization task Figure 2: Average sentence cover size: the average number of sentences needed to generate the case- frames in a summary sentence (Study 1).",
                    "sid": 104,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Model summaries are shown in darker bars.",
                    "sid": 105,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Peer system numbers that we focus on are in bold.",
                    "sid": 106,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "C on dit io n M od el av er ag e In iti al 1 . 5 8 U p d at e 1 . 5 7 i n g c o n s t i t u e n t s o f a s o u r c e t e x t s e n t e n c e . H u m a n s u m m a r i z e r s w o u l d b e e x p e c t e d t o s c o r e h i g h e r , i f Pe er av er ag e 1 . 0 6 1 . 0 6 t h e y a c t u a l l y a g g r e g a t e i n f o r m a t i o n f r o m m u l t i p l e Pe er 1 1 . 0 0 1 . 0 0 p o i n t s i n t h e s o u r c e t e x t . Pe er 16 1 . 0 4 1 . 0 4 T o i l l u s t r a t e , s u p p o s e w e a s s i g n a r b i t r a r y i n Pe er 22 1 . 0 8 1 . 0 9 d i c e s t o c a s e f r a m e s , a s u m m a r y s e n t e n c e c o n Table 2: The average number of source text sentences needed to cover a summary sentence.",
                    "sid": 107,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The model average is statistically significantly differ ent from all the other conditions p < 10−7 (Study 1).",
                    "sid": 108,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Peer 1 The NIST-defined baseline, which is the leading sentence baseline from the most recent document in the source text cluster.",
                    "sid": 109,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This system scored the highest on linguistic quality in both tasks.",
                    "sid": 110,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Study 1: Sentence aggregation.",
                    "sid": 111,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first confirm that human summarizers are more prone to sentence aggregation than system sum- marizers, showing that abstraction is indeed a desirable goal.",
                    "sid": 112,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To do so, we propose a measure to quantify the degree of sentence aggregation exhibited by a summarizer, which we call average sentence cover size.",
                    "sid": 113,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is defined to be the minimum number of sentences from the source text needed to cover all of the caseframes found in a summary sentence (for those caseframes that can be found in the source text at all), averaged over all of the summary sentences.",
                    "sid": 114,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Purely extractive systems would thus be expected to score 1.0, as would systems that perform text compression by remov tains caseframes {1, 2, 3, 4, 5}, and the source text contains three sentences with caseframes, which can be represented as a nested set{{1, 3, 4}, {2, 5, 6}, {1, 4, 7}}.",
                    "sid": 115,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, the sum mary sentence can be covered by two sentences from the source text, namely {{1, 3, 4}, {2, 5, 6}}.",
                    "sid": 116,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This problem is actually an instance of the minimum set cover problem, in which sentences are sets, and caseframes are set elements.",
                    "sid": 117,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Minimum set cover is NP-hard in general, but the standard integer programming formulation of set cover sufficed for our data set; we used ILOG CPLEX 12.4’s mixed integer programming mode to solve all the set cover problems optimally.",
                    "sid": 118,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results Figure 2 shows the ranking of the sum- marizers by this measure.",
                    "sid": 119,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most peer systems have a low average sentence cover size of close to 1, which reflects the fact that they are purely or almost purely extractive.",
                    "sid": 120,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Human model summarizers show a higher degree of aggregation in their summaries.",
                    "sid": 121,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The averages of the tested conditions are shown in Table 2, and are statistically significant.",
                    "sid": 122,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Peer 2 shows a relatively high level of aggregation despite being an extractive system.",
                    "sid": 123,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Upon inspection of its summaries, it appears that Peer 2 tends to select many datelines, and without punctuation to separate them from the rest of the summary, our automatic analysis tools incorrectly merged many sentences together, resulting in incorrect parses and novel caseframes not found in 0.10 0.08 0.08 0.06 0.04 0.02 0.06 0.04 0.02 0.00 A B 42 37 G 5 7 2 F 35 15 D 20 36 19 13 8 4 10 18 21 24 25 22 38 32 12 27 33 1 28 39 E H 26 C 11 9 14 40 16 30 6 3 41 34 17 31 23 System IDs (a) Initial guided summarization task 0.00 E G 37 33 12 26 39 H F 2 32 35 40 4 8 14 36 18 9 24 13 25 31 6 38 A B 1 C 27 42 11 28 15 D 20 5 7 10 19 30 41 3 21 34 22 16 17 23 System IDs (b) Update summarization task Figure 3: Density of signature caseframes (Study 2).",
                    "sid": 124,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Topic: Unabomber trial (charge, dobj), (kill, dobj), (trial, prep of ), (bombing, prep in) Topic: Mangrove forests (beach, prep of ), (save, dobj) (development, prep of ), (recover, nsubj) Topic: Bird Flu (inf ect, prep with), (die, nsubj) (contact, dobj), (import, prep f rom) Figure 4: Examples of signature caseframes found in Study 2.",
                    "sid": 125,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the source text.",
                    "sid": 126,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Study 2: Signature caseframe density.",
                    "sid": 127,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Study 1 shows that human summarizers are more abstractive in that they aggregate information from multiple sentences in the source text, but how is this aggregation performed?",
                    "sid": 128,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possibility is that human summary writers are able to pack a greater number of salient caseframes into their summaries.",
                    "sid": 129,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, humans are fundamentally relying on centrality just as automatic summarizers do, and are simply able to achieve higher compression ratios by being more succinct.",
                    "sid": 130,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If this is true, then sentence fusion methods over the source text alone might be able to solve the problem.",
                    "sid": 131,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, we show that this is false and that system summaries are actually more central than model ones.",
                    "sid": 132,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To extract topical caseframes, we use Lin and Hovy’s (2000) method of calculating signature terms, but extend the method to apply it at the caseframe rather than the word level.",
                    "sid": 133,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We follow Lin and Hovy (2000) in using a significance Condition Initial Update Model average 0.065 0.052 Peer average 0.080∗ 0.072∗ Peer 1 0.066 0.050 Peer 16 0.083∗ 0.085∗ Peer 22 0.101∗ 0.084∗ Table 3: Signature caseframe densities for different sets of summarizers, for the initial and update guided summarization tasks (Study 2).",
                    "sid": 134,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "∗: p < 0.005.",
                    "sid": 135,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "threshold of 0.001 to determine signature case- frames2 . Figure 4 shows examples of signature caseframes for several topics.",
                    "sid": 136,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we calculate the signature caseframe density of each of the summarization systems.",
                    "sid": 137,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is defined to be the number of signature caseframes in the set of summaries divided by the number of words in that set of summaries.",
                    "sid": 138,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results Figure 3 shows the density for all of the summarizers, in ascending order of density.",
                    "sid": 139,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As can be seen, the human abstractors actually tend to use fewer signature caseframes in their summaries than automatic systems.",
                    "sid": 140,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only the leading baseline is indistinguishable from the model average.",
                    "sid": 141,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows the densities for the conditions that we described earlier.",
                    "sid": 142,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The differences in density between the human average and the non-baseline conditions are highly statistically significant, according to paired two-tailed Wilcoxon signed-rank tests for the statistic calculated for each topic cluster.",
                    "sid": 143,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results show that human abstractors do 2 We tried various other thresholds, but the results were much the same.",
                    "sid": 144,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Threshold 0.9 0.8 Co nd iti on In it.",
                    "sid": 145,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "U p. In it.",
                    "sid": 146,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "U p. M od el av era ge 0.0 66 0.0 52 0.0 62 0.0 47 Pe er av era ge 0.0 80 0.0 71 0.0 71 0.0 63 Pe er 1 0.0 68 0.0 50 0.0 60 0.0 44 Pe er 16 0.0 83 0.0 86 0.0 72 0.0 77 Pe er 22 0.1 00 0.0 86 0.0 84 0.0 75 Table 4: Density of signature caseframes after merging to various threshold for the initial (Init.)",
                    "sid": 147,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and update (Up.)",
                    "sid": 148,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "summarization tasks (Study 2).",
                    "sid": 149,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "not merely repeat the caseframes that are indicative of a topic cluster or use minor grammatical alternations in their summaries.",
                    "sid": 150,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rather, a genuine sort of abstraction or distillation has taken place, either through paraphrasing or semantic inference, to transform the source text into the final informative summary.",
                    "sid": 151,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Merging Caseframes We next investigate whether simple paraphrasing could account for the above results; it may be the case that human summarizers simply replace words in the source text with synonyms, which can be detected with distributional similarity.",
                    "sid": 152,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we merged similar caseframes into clusters according to the distributional semantic similarity defined in Section 3.1, and then repeated the previous experiment.",
                    "sid": 153,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose two relatively high levels of similarity (0.8 and 0.9), and used complete-link agglomerative (i.e., bottom-up) clustering to merge similar caseframes.",
                    "sid": 154,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, each caseframe begins as a separate cluster, and the two most similar clusters are merged at each step until the desired similarity threshold is reached.",
                    "sid": 155,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cluster similarity is defined to be the minimum similarity (or equivalently, maximum distance) between elements in the two clusters; that is, maxc∈C1 ,c′∈C2 −sim(c, c′).",
                    "sid": 156,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Complete-link agglomerative clustering tends to form coherent clusters where the similarity between any pair within a cluster is high (Manning et al., 2008).",
                    "sid": 157,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cluster Results Table 4 shows the results after the clustering step, with similarity thresholds of 0.9 and 0.8.",
                    "sid": 158,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once again, model summaries contain a lower density of signature caseframes.",
                    "sid": 159,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The statistical significance results are unchanged.",
                    "sid": 160,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This indicates that simple paraphrasing alone cannot account for the difference in the signature caseframe densities, and that some deeper abstraction or semantic inference has occurred.",
                    "sid": 161,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that we are not claiming that a lower density of signature caseframes necessarily correlates with a more informative summary.",
                    "sid": 162,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, some automatic summarizers are comparable to the human abstractors in their relatively low density of signature caseframes, but these turn out to be the lowest performing summarization systems by all measures in the workshop, and they are unlikely to rival human abstractors in any reasonable evaluation of summary informativeness.",
                    "sid": 163,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It does, however, appear that further optimizing centrality- based measures alone is unlikely to produce better informative summaries, even if we analyze the summary at a syntactic/semantic rather than lexical level.",
                    "sid": 164,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Study 3: Summary Reconstruction.",
                    "sid": 165,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The above studies show that the higher degree of abstraction in model summaries cannot be explained by better compression of topically salient caseframes alone.",
                    "sid": 166,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now switch perspectives to ask how model summaries might be automatically generated at all.",
                    "sid": 167,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will show that they cannot be reconstructed solely from the source text, extending Copeck and Szpakowicz (2004)’s result to caseframes.",
                    "sid": 168,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we also show that if articles from the same domain are added, reconstruction then becomes possible.",
                    "sid": 169,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our measure of whether a model summary can be reconstructed is case- frame coverage.",
                    "sid": 170,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We define this to be the proportion of caseframes in a summary that is contained by some reference set.",
                    "sid": 171,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is thus a score between 0 and 1.",
                    "sid": 172,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike in the previous study, we use the full set of caseframes, not just signature caseframes, because our goal now to create a hypothesis space from which it is in principle possible to generate the model summaries.",
                    "sid": 173,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results We first calculated caseframe coverage with respect to the source text alone (Figure 5).",
                    "sid": 174,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As expected, automatic systems show close to perfect coverage, because of their basically extractive nature, while model summaries show much lower coverage.",
                    "sid": 175,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These statistics are summarized by Table 5.",
                    "sid": 176,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results present a fundamental limit to extractive systems, and also text simplification and sentence fusion methods based solely on the source text.",
                    "sid": 177,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Impact of Domain Knowledge How might automatic summarizers be able to acquire these 1.0 1.0 0.8 0.8 0.6 0.6 0.4 0.4 0.2 0.2 0.0 A E H C 38 2 20 39 5 34 23 19 33 12 37 42 27 24 10 8 16 30 22 15 36 G B F D 17 32 6 40 9 14 35 7 41 11 26 21 3 28 4 13 31 25 1 18 System IDs (a) Initial guided summarization task 0.0 G B H F 2 17 11 39 35 26 5 14 40 42 25 6 7 30 31 24 34 28 3 16 36 A E C D 38 32 41 20 19 21 23 37 27 12 4 33 8 22 10 13 15 1 9 18 System IDs (b) Update summarization task Figure 5: Coverage of summary text caseframes in source text (Study 3).",
                    "sid": 178,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "C on dit io n In iti al U pd at e Re fe re nc e co rp us In iti al U pd at e M od el av er ag e 0 . 7 7 0 . 7 5 So ur ce te xt on ly 0.",
                    "sid": 179,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 7 0 . 7 5 Pe er av er ag e 0 . 9 9 0 . 9 9 +outof do m ai n 0.",
                    "sid": 180,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 1 0 . 9 1 Pe er 1 1 . 0 0 1 . 0 0 +in do m ai n 0.",
                    "sid": 181,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 8 0 . 9 7 Pe er 16 1 . 0 0 1 . 0 0 Peer 22 1.00 1.00 Table 5: Coverage of caseframes in summaries with respect to the source text.",
                    "sid": 182,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The model average is statistically significantly different from all the other conditions p < 10−8 (Study 3).",
                    "sid": 183,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "caseframes from other sources?",
                    "sid": 184,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Traditional systems that perform semantic inference do so from a set of known facts about the domain in the form of a knowledge base, but as we have seen, most ex- tractive summarization systems do not make much use of in-domain corpora.",
                    "sid": 185,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We examine adding in-domain text to the source text to see how this would affect coverage.",
                    "sid": 186,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recall that the 46 topics in TAC 2010 are categorized into five domains.",
                    "sid": 187,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To calculate the impact of domain knowledge, we add all the documents that belong in the same domain to the source text to calculate coverage.",
                    "sid": 188,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To ensure that coverage does not increase simply due to increasing the size of the reference set, we compare to the baseline of adding the same number of documents that belong to another domain.",
                    "sid": 189,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Table 6, the effect of adding more in-domain text on caseframe coverage is substantial, and noticeably more than using out-of-domain text.",
                    "sid": 190,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, nearly all case- frames can be found in the expanded set of articles.",
                    "sid": 191,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The implication of this result is that it may be possible to generate better summaries by mining in-domain text for relevant caseframes.",
                    "sid": 192,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6: The effect on caseframe coverage of adding in-domain and out-of-domain documents.",
                    "sid": 193,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The difference between adding in-domain and out of-domain text is significant p < 10−3 (Study 3).",
                    "sid": 194,
                    "ssid": 106,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "5",
            "sents": [
                {
                    "text": "We have presented a series of studies to distinguish human-written informative summaries from the summaries produced by current systems.",
                    "sid": 195,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our studies are performed at the level of caseframes, which are able to characterize a domain in terms of its slots.",
                    "sid": 196,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we confirm that model summaries are more abstractive and aggregate information from multiple source text sentences.",
                    "sid": 197,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we show that this is not simply due to summary writers packing together source text sentences containing topical caseframes to achieve a higher compression ratio, even if paraphrasing is taken into account.",
                    "sid": 198,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, model summaries cannot be reconstructed from the source text alone.",
                    "sid": 199,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, our results are also positive in that we find that nearly all model summary caseframes can be found in the source text together with some in- domain documents.",
                    "sid": 200,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Current summarization systems have been heavily optimized towards centrality and lexical- semantical reasoning, but we are nearing the bottom of the barrel.",
                    "sid": 201,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Domain inference, on the other hand, and a greater use of in-domain documents as a knowledge source for domain inference, are very promising indeed.",
                    "sid": 202,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mining useful caseframes for a sentence fusion-based approach has the potential, as our experiments have shown, to deliver results in just the areas where current approaches are weakest.",
                    "sid": 203,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "This work is supported by the Natural Sciences and Engineering Research Council of Canada.",
                    "sid": 204,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}