{
    "ID": "P170300_w06",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Linguistic relations in oral conversations present how opinions are constructed and developed in a restricted time.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relations bond ideas, arguments, thoughts, and feelings, re- shape them during a speech, and finally build knowledge out of all information provided in the conversation.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Speakers share a common interest to discuss.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is expected that each speakers reply includes duplicated forms of words from previous speakers.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, linguistic adaptation is observed and evolves in a more complex path than just transferring slightly modified versions of common concepts.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A conversation aiming a benefit at the end shows an emergent cooperation inducing the adaptation.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Not only cooperation, but also competition drives the adaptation or an opposite scenario and one can capture the dynamic process by tracking how the concepts are linguistically linked.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To uncover salient complex dynamic events in verbal communications, we attempt to discover self-organized linguistic relations hidden in a conversation with explicitly stated winners and losers.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We examine open access data of the United States Supreme Court.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our understanding is crucial in big data research to guide how transition states in opinion mining and decision-making should be modeled and how this required knowledge to guide the model should be pinpointed, by filtering large amount of data.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Traditionally, in computational linguistics, it is essential to integrate models and algorithms with fundamental laws of language.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Widely applied hierarchical dependency trees and parsing in natural language processing (NLP) follow existing grammatical relations.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nowadays, while algorithms and models reach higher levels and available data becomes bigger, not enough linguistic laws are uncovered and can have a chance to meet with developed techniques.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Language processing in data science mainly considers evaluated data as single source in terms of language.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are approaches such as cross-media topic analysis, retrieving information referring various data platforms including websites, blogs, and mobile phones, and multimodal analysis (Poria et al. 2016; Poria et al. 2017a; Poria et al. 2017b), combining text data with images, videos, and audio, however, they only gather all available channels and do not address the richness of language.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, language itself has many dimensions, language of a text written by a single author is different than language used in a dialogue or that of a group speech, e.g., trialogue discussions.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, it is emergent that current conventional NLP should meet with the revolutionary philosophy of linguistics (Chomsky 1975) and establish new hidden laws applicable in data science: the human mind easily knows and applies by birth, but hardly formulates to understand the underlying structure.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the remarkable perspectives to dig into natural linguistic laws is provided by social and behavior sciences, adaptation in language during communication as a result of changes in opinions and decisions.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Opinions and decisions are personal in individual level, however, they are flexible while facing public opinions and decisions.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Linguistic adaptation is twofold.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In one part, collective voice unifies opinions and decisions in a complex process, ideas are biased, and consequently people start acting similarly, talking similarly, and so writing similarly.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Twitter conversations (DanescuNiculescu-Mizil, Gamon, and Dumais 2011; Purohit et al. 2013) and popular memes (Myers and Leskovec 2012; Coscia 2013) prove this similarity in social media.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the other part, when people have a well-defined goal at the end, they tend to reshape their arguments.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the presence of distinct winning and losing sides and social hierarchy, people at lower status show both cooperation through that at the higher status and competition among each other.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, a verbal discussion in such explicitly opposing groups host linguistic adaptation, investigated in social exchange theory (Willer 1999; Thye, Willer, and Markovsky 2006).",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While information and emotions are the fundamental elements of human knowledge, commonsense knowledge is the fundamental element for gluing society (Cambria et al. 2009; Cambria et al. 2016).",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Commonsense is implicit semantic and affective information humans continuously tap on for decision-making, communication, and reasoning in general (Cambria and Hussain 2015; Rajagopal et al. 2013; Poria et al. 2013; Tran, Cambria, and Hussain 2016).",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Effective speeches and public talks use commonsense efficiently to drive opinions and change decisions in large scales (Drath and Palus 1994).",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resultant unified collective motion is extremely interesting in social groups (BorgeHolthoefer et al. 2011; GonzalezBailon et al. 2011).",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Opinions and decisions are personal in individual level.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, as observed, they are quite flexible facing with a collective decision.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Complex knowledge extraction process in micro state suddenly becomes less valuable and group decision gains (Conover et al. 2011).",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can argue that our opinions are biased when our decisions mostly rely on our previous knowledge, e.g., commonsense, and so richness of opinions kept in each individual is relatively unimportant.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can further argue that commonsense drives an adaptation in extracting knowledge.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To measure commonsense for a particular situation is hard, however, adaptations can be easily captured in Twitter conversations (DanescuNiculescu- Mizil, Gamon, and Dumais 2011; Purohit et al. 2013), in memes (Myers and Leskovec 2012; Coscia 2013), and face- to-face discussions (DanescuNiculescu-Mizil et al. 2012).",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, our main concerns are firstly to construct discussion groups including agents having different social powers and serving opposite aims.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondly, we investigate how we can track the progress of opinions together with their influences on decisions in oral conversations.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We claim that linguistic relations (Poria et al. 2015) preserve all rich phenomena, shortly discussed above, including collective voice, reshaping arguments, and so adaptation.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To analyze adaptation induced by both cooperation and competition, we consider court conversations: they are held in clearly stated winner and loser groups with distinct hierarchy in decision- making due to the presence of Justices and lawyers.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To this end, we evaluate the open access data of the United States Supreme Court (Hawes, Lin, and Resnik 2009; Hawes 2009; DanescuNiculescu-Mizil et al. 2012), prepare conversation groups with different adaptation levels, implement a suitable algorithm to extract linguistic relations in these group conversations, and finally provide a comparison between the groups and the discovered linguistic relations.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of the paper is organized as follows: the first section presents the dataset we consider and designed conversation groups out of the data; the second section describes our algorithm in detail; the following section explains how we implement pointwise mutual information for the conversation groups and then link with linguistic relations; finally, we provide experimental results and conclude the paper.",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Supreme Court Data We borrow the textual data of the conversations in the United States Supreme Court pre-processed by (Hawes, Lin, and Resnik 2009; Hawes 2009) and enriched by (DanescuNiculescu-Mizil et al. 2012) including the final votes of Justices.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both the original data and the most updated version used here are publicly available (DanescuNiculescu- Mizil et al. 2012).",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The data gathers oral speeches before the Supreme Court and hosts 50,389 conversational exchanges among Justices and lawyers.",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Distinct hierarchy between Justices (high power) and lawyers (low power) impose lawyers to tune their arguments under the perspective and understandings of Justices, and as a result, speech adaptation and linguistic coordination leaves their traces in a sudden occurrence of sharing the same adverbs, conjunctions, and pronouns.",
                    "sid": 45,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tracking initial utterances, the sides present a unique and personal speaking, but after a while in the communication, word selections, their forms, and frequencies mirror each other’s language preference.",
                    "sid": 46,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The linguistic coordination is systematically quantified by (DanescuNiculescu-Mizil et al. 2012) and the arguments follow the principles of exchange theory examining behavior dynamics in low and high power groups (Willer 1999; Thye, Willer, and Markovsky 2006): Lawyers tend to cooperate more to Justices than conversely and demonstrate strong linguistic coordination in their speech.",
                    "sid": 47,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, lawyers show even more cooperation to unfavorable Justices than favorable ones.",
                    "sid": 48,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we enrich the comparison including the identity of winners and losers in lawsuits.",
                    "sid": 49,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The data provides whether the petitioner or the respondent is the winner at the end of each lawsuit.",
                    "sid": 50,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, the speaker of each utterance is labeled as their position, e.g., Justice or lawyer.",
                    "sid": 51,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, Justice’s votes and the side of lawyers are tagged with the utterances.",
                    "sid": 52,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 identifies all roles carried by Justices and lawyers.",
                    "sid": 53,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Justices, both the vote (middle) and whom to speak (last) are given.",
                    "sid": 54,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lawyers are allowed to speak only when Justices address their side.",
                    "sid": 55,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ID Roles of Justices (J ) and Lawyers (l) 1 J - Vote Petitioner - Speak to Petitioner’s l",
                    "sid": 56,
                    "ssid": 56,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "j - vote petitioner - speak to respondent’s l",
            "number": "2",
            "sents": [
                {
                    "text": "4 J - Vote Respondent - Speak to Respondent’s l 5 l - Petitioner Side 6 l - Respondent Side Table 1: The segregation schema of the roles in conversations: Support sides of Justices and sides of lawyers.",
                    "sid": 57,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "16 summarize all potential roles present in the data.",
                    "sid": 58,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In 14, who supported by the Justice is given in the middle.",
                    "sid": 59,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the last indicates the side of lawyer the Justice speaks to.",
                    "sid": 60,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Referring exchange theory (Willer 1999; Thye, Willer, and Markovsky 2006) and the measured coordination (DanescuNiculescu-Mizil et al. 2012), one can order the relative power of each Justice and lawyer pair P (Ju , l) > P (Js , l), (1) where J and l represent Justices and lawyers, respectively (note that for comparing individually following the social exchange theory, P (J ) > P (l) for both supportive and unsupported Justices).",
                    "sid": 61,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The subscript u indicates that Justice doesn’t support the side of lawyer and the supportive version is described by s. For instance, in Table 1, in the communications of 1 and 5; 4 and 6, Justices show supports and play as Js , whereas that of 3 and 5; 2 and 6, lawyers are unsupported by Ju . The scenarios and pairs guide to construct groups with different cooperation level induced by P as illustrated in Table 2.",
                    "sid": 62,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We further add another dimension in the relative power: Winners and Losers, haven’t been investigated in the previous study (DanescuNiculescu-Mizil et al. 2012).",
                    "sid": 63,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To this end, Eq. 1 is reformulated P (Ju , l)win > P (Js , l)win , (2) P (Ju , l)lose > P (Js , l)lose .",
                    "sid": 64,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) Group ID Cooperation Pool of J and l I.i supportive, P (Js , l) 1 and 5 I.ii unsupported, P (Ju , l) 3 and 5 II.i unsupported, P (Ju , l) 2 and 6 II.ii supportive, P (Js , l) 4 and 6 Table 2: Grouping communications with respect to level of cooperation, based on the relative power of the partners in the conversations.",
                    "sid": 65,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "16 and the power pairs P (Js , l) and P (Ju , l) as defined previously.",
                    "sid": 66,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, win and lose subscripts highlight that the concerned Justice and lawyer pairs are the partners in a won or lost lawsuit.",
                    "sid": 67,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an illustration, P (Js , l)win occurs in the group I.i when petitioners are the winner and also in II.ii while respondents are the winners of the lawsuits.",
                    "sid": 68,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, P (Js , l)lose is the Justices-lawyers of I.i in respondent won lawsuits as well as of II.ii in petitioner won lawsuits.",
                    "sid": 69,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The situations are generated for the unsupported Justice-lawyer groups and all are listed in Table 3.",
                    "sid": 70,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "κ Cooperation Gathering Group ID A supportive, win: P (Js , l)win I.i of Pe + II.ii of Re B supportive, lose: P (Js , l)lose I.i of Re + II.ii of Pe C unsupported, win: P (Ju , l)win I.ii of Pe + II.i of Re D unsupported, lose: P (Ju , l)lose I.ii of Re + II.i of Pe Table 3: Designed conversation groups κ based on different expectations for the level of linguistic coordination, induced by distinct P . The groups κ are presented in A, B, C , and D, whether they preserve supportive or unsupported conversations as well as a winner or loser status stated by the Supreme Court.",
                    "sid": 71,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pe and Re represent the particular lawsuits where Petitioner and Respondent as the winner, respectively.",
                    "sid": 72,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gathered conversations of the cases I.i, I.ii, II.i, and II.ii and the relative powers P are as introduced earlier.",
                    "sid": 73,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Calculating utterances in κ, we have 21,105 for A, 15,116 for B, 15,489 for C , and 24,461 for D, gathered by different combinations of 195 lawsuits.",
                    "sid": 74,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The large number of each pool convinces that we have enough examples to perform statistics and our measurement won’t be biased by the size effect.",
                    "sid": 75,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, noting the total number of 50,389 utterances, almost the half of the data presents P (Ju , l)lose type social relations, e.g., case D. Eqs.",
                    "sid": 76,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) and (3) do not include the comparison of {P (Ju , l)win ; P (Js , l)lose } and {P (Ju , l)lose ; P (Js , l)win } on purpose since it is unknown whether P (Ju , l) > P (Js , l) is still valid in the presence of win and lose, bringing interesting perspective while coupling the power hypothesis with the cooperation and not considered in social exchange theory.",
                    "sid": 77,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We aim to understand this full picture by correlating determined linguistic relations with the separated relative power groups.",
                    "sid": 78,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Linguistic Relation Extraction The Supreme Court hosts lawsuits of rich subjects.",
                    "sid": 79,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To design specific linguistic relations in each distinct lawsuit is challenging and not required.",
                    "sid": 80,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our aim is to suggest relations suit able for any discussion concept.",
                    "sid": 81,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To generalize the task, we first determine noun phrases in the data following the definition in (Pennacchiotti and Pantel 2006).",
                    "sid": 82,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The phrases are combinations of adjectives and nouns.",
                    "sid": 83,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The technical steps include standard part-of-speech tagging including grammar based chunk parser.",
                    "sid": 84,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then restrict our attention to address the relations linking only determined noun phrases within one sentence.",
                    "sid": 85,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The data shows utterances of grammatically correct and well-organized sentences.",
                    "sid": 86,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To this end, we apply rule-based relation extraction.",
                    "sid": 87,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While Fig.",
                    "sid": 88,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 shows each step of the developed algorithm, steps (A-C) indicate the discussed concept recognition of noun phrases.",
                    "sid": 89,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rule-based schema starts with first restricting linguistic relations and then constructing static surface patterns (regular expressions) for them.",
                    "sid": 90,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The assigned patterns run as an iterative process searching the exact match of the real patterns between any concept pair, which is any noun phrase pair here.",
                    "sid": 91,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Within a sentence, multiple relations can be addressed based on the comparison in the iteration, to capture both different relations or the same relation but with the different patterns.",
                    "sid": 92,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To balance the relations without over- weighting extreme cases, we first apply classical IsA (Hearst 1992) and PartOf (Girju, Badulescu, and Moldovan 2003) relations.",
                    "sid": 93,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The patterns of the relations follow both lexico- syntactic formalisms (Klaussner and Zhekova 2011) and manual investigations of the data.",
                    "sid": 94,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then recommend further relations as UsedBy, Used- For, UsedIn, UsedOver, and UsedWith to cover the rest of the data.",
                    "sid": 95,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Used relations do not accumulate for certain lawsuits and nicely distribute over entire data, which provides us reliable analysis.",
                    "sid": 96,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fig.",
                    "sid": 97,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1(D and E) highlight the iteration process to detect all potential relations.",
                    "sid": 98,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To illustrate the outcome of our algorithm, we provide examples for each relation.",
                    "sid": 99,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are given with the detected noun phrases in Table 4.",
                    "sid": 100,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The identity of the sentences, a-g, are to guide the following concerned examples, where the linked noun phrases are highlighted in bold: (a) That was so because her claim is that J. Howard intended to give her a catchall trust.",
                    "sid": 101,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(b) And when you look at the core value of the two clauses, they do not clash.",
                    "sid": 102,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(c) And what I’m trying to do here for the Court is to draw upon your own authority, the word you’ve spoken, as opposed to the test proposed by the Criminal Justice Foundation and by the United States.",
                    "sid": 103,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(d) One, the manufacturing process allows there to be a safe use for one of the components in marijuana.",
                    "sid": 104,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(e) The phrase Justice Harlan used in the Davis case.",
                    "sid": 105,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(f) For 124 years, as state power over alcohol has ebbed and flowed.",
                    "sid": 106,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(g) The haulers are required today to comply with the program.",
                    "sid": 107,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The validation of the discovered linguistic relations and their suggested patterns are systematically satisfied by the following protocol.",
                    "sid": 108,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From each conversation group κ in Table 3, 1000 utterances are randomly selected.",
                    "sid": 109,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Utterances present averages sentences of 24, the minimum is for the group C , P (Ju , l)win , and the maximum for group D, P (Ju , l)lose .",
                    "sid": 110,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(A) (B) (C) (D) (E) i n p u t s e n t e n c e p a r t o f s p e e c h n o u n p h r a s e s ( n p ) : g r a m m a r + p a r s i n g ( a d j e c t i v e s & n o u n s ) r e g u l a r e x p r e s s i o n s : e.g.: ( n p ) : : i s t h a t : : ( n p ) ( n p ) : : u s e d i n : : ( n p ) . . .",
                    "sid": 111,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a s s i g n i n g r e l a t i o n s : in Fig.",
                    "sid": 112,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1(D F).",
                    "sid": 113,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The over all aver age scor es, com parin g the relati ons gene rated by our algo rith m with the grou nd truth , are obtai ned as 59.9 2% for Rec all, 67.2 % for Prec ision , and 63.3 5% for the resul tant F1.",
                    "sid": 114,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The scor es are relati vely high er than that of the rule base d relat ion extr actio n algo rith ms for more gene ral purp oses appli ed in large data sets (Pa n- tel, Ravi chan dran, and Hov y 2004 ).",
                    "sid": 115,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our man ual effor ts, the gra mma ticall y corr ect sent ence s, and relat ively sma ll and well orga nize d data are the reas ons behi nd the good perf or- man ce.",
                    "sid": 116,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How ever, we obse rve that the fore most reas on is the ling uisti c coor dinat ion extra cting man y relati ons from the sam e static patt erns . In the rest of the pape r, we will dem onstr ate how we in- terpr et thes e lingu istic relati ons in the Supr eme Cour t con- vers ation grou ps of diffe rent relati ve pow ers.",
                    "sid": 117,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P o i n t w i s e M u t u a l I n f o r m a t i o n Poin twis e mut ual infor mati on (PM I) is a metri c to mea sure (F) no relati on e.g.: (n p) ::I s A :: (n p) (np) ::Use dIn:: (np) . . .",
                    "sid": 118,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "coin cide nce of two discr ete rand om even ts.",
                    "sid": 119,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It com bines in divi dual prob abilit ies of even ts and their join ed pro babi lity to dete rmin e how ofte n the two even ts occu r at the sam e occasi on.",
                    "sid": 120,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We qua ntify to what exte nd lingu istic relati ons R are addr esse d by conv ersat ion grou ps κ and whet her we obse rve any varia tion in the sele ctio ns.",
                    "sid": 121,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "validation manual annotation To this end, PMI between R and κ is introduced (Pantel, Ravichandran, and Hovy 2004)Figure 1: Flow diagram of the rule-based relation extrac f (R,κ) M I (R, κ) = log N .",
                    "sid": 122,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4) tion algorithm.",
                    "sid": 123,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The important steps are summarized from (A) to (F): (A-C) present suggesting concepts based on noun phrases of combined adjectives and nouns.",
                    "sid": 124,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(D-E) de all R 2: f (Ri ,κ) Ri N × all κ 2: f (R,κj ) κj N scribe the iteration of applying designed static surface patterns (regular expressions) together with supervising for the 6 relations, namely, IsA, PartOf, UsedBy, UsedFor, UsedIn, UsedOver, and UsedWith.",
                    "sid": 125,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(F) indicates the final step of validation compared with the manual annotation set and formulating again regular expressions in (D) to increase the performance.",
                    "sid": 126,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Re lati on L i n k e d N o u n P h r a s e s Se nt.",
                    "sid": 127,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ID Is A c l a i m : : c a t c h a l l t r u s t ( a ) Pa rt Of c o r e v a l u e : : c l a u s e s ( b ) Us ed By tes t :: Cri mi na l Ju sti ce Fo un da tio n, ( c ) U n i t e d S t a t e s Us ed Fo r s a f e u s e : : c o m p o n e n t s , ( d ) m a r i j u a n a Us ed In phr as e Ju sti ce Ha rla n :: Da vis cas e ( e ) Us ed Ov er s t a t e p o w e r : : a l c o h o l ( f ) Us ed Wi th h a u l e r s : : p r o g r a m ( g ) Table 4: Extracted relations with our algorithms and the corresponded (linked) noun phrases.",
                    "sid": 128,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sent.",
                    "sid": 129,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ID refers the labeled example sentences above in the main text.",
                    "sid": 130,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, manual annotations are provided for each pool, which works as the ground truth, and the patterns are readjusted if necessary based on the performance, as shown Here, f (R, κ) represents the frequency of occurrence for certain R in particular κ and N is the total number of all R in all κ.",
                    "sid": 131,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, while the numerator describes the probabilistic occurrence of R in κ, the denominator provides individual probability of R and that of κ in the pool.",
                    "sid": 132,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We expect high M I (R, κ) while R appears in a specific κ and that is an indicator of its rare presence in the other conversation groups.",
                    "sid": 133,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike the previous study (DanescuNiculescu-Mizil et al. 2012), entirely tracking back and forth utterances and proving the adaptation, e.g., linguistic coordination, by identifying the frequency of selected keywords, we directly utilize their overall conclusion and claim that linguistic relations already preserve the adaptation and any other complex collective linguistic process induced by both cooperation and competition in different power groups.",
                    "sid": 134,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We expect that the variation in M I (R, κ) of gathered utterances of each relative power group, independent of the utterance order, suggests which relations can distinguish the difference in the groups and the magnitude of M I (R, κ) of that difference highlights which relative power groups drastically influence the applied language.",
                    "sid": 135,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will analyze M I (R, κ) following this discussed understanding in coming Section.",
                    "sid": 136,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results We perform M I (R, κ) for each group κ separated by different coordination level and linguistic dynamics, expected due to the distinct relative powers as introduced in Table 3, and each relation R described in Section Linguistic Relation Extraction.",
                    "sid": 137,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are presented in Fig.",
                    "sid": 138,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 and suggests rich behavior.",
                    "sid": 139,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, M I for the relations IsA, PartOf, and UsedBy is almost indistinguishable overall κ.",
                    "sid": 140,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We understand that these relations cannot uncover the linguistic variations in different power groups.",
                    "sid": 141,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is an obvious outcome of NLP and examining sentences by lexico-syntactic patterns: Any sentence can consider them with no complex linguistic process such as coordination and competition.",
                    "sid": 142,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, we observe quite remarkable separation starting with UsedFor.",
                    "sid": 143,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Successfully, the results of UsedIn, Use- dOver, and UsedWith show that their appearances in κ are not arbitrary.",
                    "sid": 144,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A states impose observable deviations and none group resembles each other, oppositely, each presents very unique behavior.",
                    "sid": 145,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a simplified picture, M I (R, κ) for C always indicates significantly positive values.",
                    "sid": 146,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This proves that the utterances in C consider all type of relations, can be the reason behind the success of the “win” state in spite of the presence of unsupported Justices.",
                    "sid": 147,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conclusion We investigated the linguistic dynamics in terms of a restricted set of linguistic relations in oral conversations while the actors have different powers such as Justices (high power) and lawyers (low power) in the United States Supreme Court.",
                    "sid": 148,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initially, defined cooperation of lawyers to Justices and the resultant linguistic coordination are only based on the relative power.",
                    "sid": 149,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a microscopic picture underestimating the dynamics of emergent competition 0.4 0.2 0.0 0.2 0.4 B C D IsA Part Of UsedBy UsedFor UsedIn UsedOverUs edWith R e l a t i o n s ( R ) arises in a losing state (lost lawsuits ), which can change the nature of the linguist ic coordin ation and make the linguistic relation s richer.",
                    "sid": 150,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our argume nt is proven by measuring M I (R, κ) always positive for the group C , P (Ju , l)win . Novelt y of our approac h is that it evaluate s supporti ve and unsupp orted situatio ns in more realistic ally.",
                    "sid": 151,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The principl e of exchang e theory suggest s P (Ju , l) > P (Js , l) and one should expect high coordin ation in the former.",
                    "sid": 152,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How ever, this can be always true if there is no explicitly stated decision at the end of the commu nication : Winner or loser lawyer.",
                    "sid": 153,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can observe P (Js , l)lose c:: P (Ju , l)lose and so the linguist ic coordin ation (dynami cs) for both can be compara ble, as we trace in our result, e.g., very similar trend of M I (R, κ) for groups B and D. Therefo re, both social exchan ge theory and their impacts on the linguistic behavio r need to be reinterp reted under exogen ous Figure 2: PMI between relations R and conversation groups κ: M I (R, κ).",
                    "sid": 154,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall values indicate that, unlike IsA, PartOf, and UsedBy relations, the occurrences of UsedFor, UsedIn, UsedOver, and UsedWith are driven by the relative power and the resultant linguistic coordination and further complex process.",
                    "sid": 155,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The marker representations are as follows: Circles (blue) for A, squares (red) for B, left triangles (green) for C , and right triangles (yellow) for D. Evaluating the results in more detail, let us remind Table 3.",
                    "sid": 156,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A is expected to have the least relative power, P (Js , l)win , and consequently, no significant variation is observed.",
                    "sid": 157,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the situations are much more challenging for B, C , and D: They face with many conceptual challenges while defending their sides and competing with the opposite arguments, C and D, and to experiment different communications in a losing state, B and D. Each difficulty is a potential origin of the competition, some can build sufficient cooperation and make the lawyer winner, C , some cannot help to overcome the situation, keep the coordination limited, and so we experience lost lawsuits, B and D. To remind, B for P (Js , l)lose , C for P (Ju , l)win , and D for P (Ju , l)lose . If we just call social exchange theory, for any measurable linguistic quantity, we would need to have A ≡ B and C ≡ D. However, we show that the win and lose factors such as win-lose situations.",
                    "sid": 158,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we experience that the rule-based relation extraction is well-applicable for speech data, in this grammatically correct form with minor noise, because of the presence of the linguistic adaptation, providing a better performance than its usage for other type of textual data such as internet data.",
                    "sid": 159,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, M I (R, κ) brings another perspective to uncover complex linguistic dynamics, including cooperation and competition, and discover the correlations between the linguistic relations and the relative powers.",
                    "sid": 160,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We establish the preliminary setup to examine the linguistic dynamics of trialogue discussions hosting in social groups with distinct hierarchy.",
                    "sid": 161,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our main conclusion is that win and lose states impose further complexity and change the conventional application of social exchange theory in language and communication.",
                    "sid": 162,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our future study, we attempt to analyze back and forth utterances in detail regarding semantics bonding by the linguistic relations by applying advanced tools.",
                    "sid": 163,
                    "ssid": 107,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This work was conducted within the Rolls-Royce@NTU Corporate Lab with support from the National Research Foundation (NRF) Singapore under the Corp Lab@University Scheme.",
                    "sid": 164,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thank San Linn for his useful comments on the rule based relation extraction approach.",
                    "sid": 165,
                    "ssid": 109,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}