{
    "ID": "P98-2143",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Robust pronoun resolution with limited knowledge",
                    "sid": 0,
                    "ssid": null,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most traditional approaches to anaphora resolution rely heavily on linguistic and domain knowledge.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the disadvantages of developing a knowledge­ based system, however, is that it is a very labour­ intensive and time-consuming task.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper pres­ ents a robust, knowledge-poor approach to resolving pronouns in technical manuals, which operates on texts pre-processed by a part-of-speech tagger.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Input is checked against agreement and for a number of antecedent indicators.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Candidates are assigned scores by each indicator and the candidate with the highest score is returned as the antecedent.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation reports a success rate of 89.7% which is better than the suc­ cess rates of the approaches selected for comparison and tested on the same data.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, preliminary experiments show that the approach can be success­ fully adapted for other languages with minimum modifications.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "For the most part, anaphora resolution has focused on traditional linguistic methods (Carbonell & Brown 1988; Carter 1987; Hobbs 1978; Ingria & Stallard 1989; Lappin & McCord 1990; Lappin & Leass 1994; Mitkov 1994; Rich & LuperFoy 1988; Sidner 1979; Webber 1979).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, to represent and manipulate the various types of linguistic and domain knowledge involved requires considerable human input and computational expense.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While various alternatives have been proposed, making use of e.g. neural networks, a situation se­ mantics framework, or the principles of reasoning with uncertainty (e.g. Connoly et al. 1994; Mitkov 1995; Tin & Akman 1995), there is still a strong need for the development of robust and effective strategies to meet the demands of practical NLP systems, and to enhance further the automatic pro­ cessing of growing language resources.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several proposals have already addressed the anaphora resolution problem by deliberately limiting the extent to which they rely on domain and/or lin­ guistic knowledge (Baldwin 1997; Dagan & ltai 1990; Kennedy & Boguraev 1996; Mitkov 1998; Nasukawa 1994; Williams et al. 1996).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work is a continuation of these latest trends in the search for inexpensive, fast and reliable procedures for anaph­ ora resolution.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also an example of how anaphors in a specific genre can be resolved quite successfully without any sophisticated linguistic knowledge or even without parsing.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, our evaluation shows that the basic set of antecedent tracking indicators can work well not only for English, but also for other languages (in our case Polish and Arabic).",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the approach. ",
            "number": "2",
            "sents": [
                {
                    "text": "With a view to avoiding complex syntactic, seman­ tic and discourse analysis (which is vital for real­ world applications), we developed a robust, knowl­ edge-poor approach to pronoun resolution which does not parse and analyse the input in order to identify antecedents of anaphors.",
                    "sid": 15,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It makes use of only a part-of-speech tagger, plus simple noun phrase rules (sentence constituents are identified at the level of noun phrase at most) and operates on the basis of antecedent-tracking preferences (referred to hereafter as \"antecedent indicators\").",
                    "sid": 16,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach works as follows: it takes as an input the output of a text processed by a part-of-speech tagger, identifies the noun phrases which precede the anaphor within a distance of 2 sentences, checks them for gender and number agreement with the anaphor and then applies the genre-specific antecedent indicators to the re­ maining candidates (see next section).",
                    "sid": 17,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The noun phrase with the highest aggregate score is proposed as antecedent; in the rare event of a tie, priority is given to the candidate with the higher score for im­ mediate reference.",
                    "sid": 18,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If immediate reference has not been identified, then priority is given to the candi date with the best collocation pattern score.",
                    "sid": 19,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If this does not help, the candidate with the higher score for indicating verbs is preferred.",
                    "sid": 20,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If still no choice is possible, the most recent from the remaining candi­ dates is selected as the antecedent.",
                    "sid": 21,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Antecedent indicators.",
                    "sid": 22,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Antecedent indicators (preferences) play a decisive role in tracking down the antecedent from a set of possible candidates.",
                    "sid": 23,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Candidates are assigned a score (-1, 0, 1 or 2) for each indicator; the candidate with the highest aggregate score is proposed as the ante­ cedent.",
                    "sid": 24,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The antecedent indicators have been identi­ fied empirically and are related to salience (definiteness, givenness, indicating verbs, lexical reiteration, section heading preference, \"non­ prepositional\" noun phrases), to structural matches (collocation, immediate reference), to referential distance or to preference of terms.",
                    "sid": 25,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whilst some of the indicators are more genre-specific (term prefer­ ence) and others are less genre-specific (\"immediate reference\"), the majority appear to be genre­ independent.",
                    "sid": 26,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following we shall outline some the indicators used and shall illustrate them by ex­ amples.",
                    "sid": 27,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Definiteness Definite noun phrases in previous sentences are more likely antecedents of pronominal anaphors than indefinite ones (definite noun phrases score 0 and indefinite ones are penalised by -1).",
                    "sid": 28,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We regard a noun phrase as definite if the head noun is modified by a definite article, or by demonstrative or posses­ sive pronouns.",
                    "sid": 29,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This rule is ignored if there are no definite articles, possessive or demonstrative pro­ nouns in the paragraph (this exception is taken into account because some English user's guides tend to omit articles).",
                    "sid": 30,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Givenness Noun phrases in previous sentences representing the \"given information\" (theme) 1 are deemed good candidates for antecedents and score I (candidates not representing the theme score 0).",
                    "sid": 31,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a coherent text (Firbas 1992), the given or known information, or theme, usually appears first, and thus forms a co­ referential link with the preceding text.",
                    "sid": 32,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The new information, or rheme, provides some information about the theme.",
                    "sid": 33,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1We use the simple heuristics that the given information is the first noun phrase in a non-imperative sentence.",
                    "sid": 34,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indicating verbs If a verb is a member of the Verb_set = {discuss, present, illustrate, identify, summarise, examine, describe, define, show, check, develop, review, re­ port, outline, consider, investigate, explore, assess, analyse, synthesise, study, survey, deal, cover}, we consider the first NP following it as the preferred an­ tecedent (scores 1 and 0).",
                    "sid": 35,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Empirical evidence sug­ gests that because of the salience of the noun phrases which follow them, the verbs listed above are particularly good indicators.",
                    "sid": 36,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexical reiteration Lexically reiterated items are likely candidates for antecedent (a NP scores 2 if is repeated within the same paragraph twice or more, 1 if repeated once and 0 if not).",
                    "sid": 37,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexically reiterated items include re­ peated synonymous noun phrases which may often be preceded by definite articles or demonstratives.",
                    "sid": 38,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, a sequence of noun phrases with the same head counts as lexical reiteration (e.g. \"toner bottle\", \"bottle of toner\", \"the bottle\").",
                    "sid": 39,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section heading preference If a noun phrase occurs in the heading of the section, part of which is the current sentence, then we con­ sider it as the preferred candidate (1, 0).",
                    "sid": 40,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"Non-prepositional\" noun phrases A \"pure\", \"non-prepositional\" noun phrase is given a higher preference than a noun phrase which is part of a prepositional phrase (0, -1 ).",
                    "sid": 41,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: Insert the cassettei into the VCR making sure iti is suitable for the length of recording.",
                    "sid": 42,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here \"the VCR\" is penalised (-1) for being part of the prepositional phrase \"into the VCR\".",
                    "sid": 43,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This preference can be explained in terms of sali­ ence from the point of view of the centering theory.",
                    "sid": 44,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The latter proposes the ranking \"subject, direct ob­ ject, indirect object\" (Brennan et al. 1987) and noun phrases which are parts of prepositional phrases are usually indirect objects.",
                    "sid": 45,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Collocation pattern preference This preference is given to candidates which have an identical collocation pattern with a pronoun (2,0).",
                    "sid": 46,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The collocation preference here is restricted to the patterns \"noun phrase (pronoun), verb\" and \"verb, noun phrase (pronoun)\".",
                    "sid": 47,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Owing to lack of syntactic information, this preference is somewhat weaker than the collocation preference described in (Dagan & ltai 1990).",
                    "sid": 48,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: Press the keyi down and turn the volume up...",
                    "sid": 49,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Press iti again.",
                    "sid": 50,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Immediate reference In technical manuals the \"immediate reference\" clue can often be useful in identifying the antecedent.",
                    "sid": 51,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The heuristics used is that in constructions of the form \"...(You) V 1 NP ... con (you) V 2 it (con (you) V3 it)\", where con e {and/or/before/after...}, the noun phrase immediately after V 1 is a very likely candidate for antecedent of the pronoun \"it\" imme­ diately following V2 and is therefore given preference (scores 2 and 0).",
                    "sid": 52,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This preference can be viewed as a modification of the collocation preference.",
                    "sid": 53,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also quite fre­ quent with imperative constructions.",
                    "sid": 54,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: To print the paper, you can stand the printeri up or lay iti flat.",
                    "sid": 55,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To turn on the printer, press the Power buttoni and hold iti down for a moment.",
                    "sid": 56,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unwrap the paperi• form iti and align iti• then load iti into the drawer.",
                    "sid": 57,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Referential distance In complex sentences, noun phrases in the previous clause2 are the best candidate for the antecedent of an anaphor in the subsequent clause, followed by noun phrases in the previous sentence, then by nouns situated 2 sentences further back and finally nouns 3 sentences further back (2, 1, 0, -1).",
                    "sid": 58,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For anaphors in simple sentences, noun phrases in the previous sen­ tence are the best candidate for antecedent, followed by noun phrases situated 2 sentences further back and finally nouns 3 sentences further back {1, 0, -1).",
                    "sid": 59,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Term preference NPs representing terms in the field are more likely to be the antecedent than NPs which are not terms (score 1 if the NP is a term and 0 if not).",
                    "sid": 60,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "21dentification of clauses in complex sentences is do e heuristically.",
                    "sid": 61,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As already mentioned, each of the antecedent in­ dicators assigns a score with a value {-1, 0, 1, 2}.",
                    "sid": 62,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These scores have been determined experimentally on an empirical basis and are constantly being up­ dated.",
                    "sid": 63,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Top symptoms like \"lexical reiteration\" as­ sign score \"2\" whereas \"non-prepositional\" noun phrases are given a negative score of \"-1\".",
                    "sid": 64,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We should point out that the antecedent indicators are preferences and not absolute factors.",
                    "sid": 65,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There might be cases where one or more of the antecedent indicators do not \"point\" to the correct antecedent.",
                    "sid": 66,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For in­ stance, in the sentence \"Insert the cassette into the VCRi making sure iti is turned on\", the indicator \"non-prepositional noun phrases\" would penalise the correct antecedent.",
                    "sid": 67,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When all preferences (antecedent indicators) are taken into account, however, the right antecedent is still very likely to be tracked down - in the above example, the \"non-prepositional noun phrases\" heuristics (penalty) would be overturned by the \"collocational preference\" heuristics.",
                    "sid": 68,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Informal description of the algorithm.",
                    "sid": 69,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm for pronoun resolution can be de­ scribed informally as follows: 1.",
                    "sid": 70,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examine the current sentence and the two pre­.",
                    "sid": 71,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ceding sentences (if available).",
                    "sid": 72,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Look for noun phrases3 only to the left of the anaphor4 2.",
                    "sid": 73,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Select from the noun phrases identified only.",
                    "sid": 74,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "those which agree in gender and numberS with the pronominal anaphor and group them as a set of potential candidates",
                    "sid": 75,
                    "ssid": 61,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "apply the antecedent indicators to each poten­. ",
            "number": "3",
            "sents": [
                {
                    "text": "tial candidate and assign scores; the candidate with the highest aggregate score is proposed as 3A sentence splitter would already have segmented the text into sentences, a POS tagger would already have determined the parts of speech and a simple phrasal grammar would already have detected the noun phrases 4In this project we do not treat cataphora; non-anaphoric \"it\" occurring in constructions such as \"It is important\", \"It is necessary\" is eliminated by a \"referential filter\" 5Note that this restriction may not always apply in lan­ guages other than English (e.g. German); on the other hand, there are certain collective nouns in English which do not agree in number with their antecedents (e.g. \"government\", \"team\", \"parliament\" etc. can be referred to by \"they\"; equally some plural nouns (e.g. \"data\") can be referred to by \"it\") and are exempted from the agree­ ment test.",
                    "sid": 76,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this purpose we have drawn up a compre­ hensive list of all such cases; to our knowledge, no other computational treatment of pronominal anaphora resolu­ tion has addressed the problem of \"agreement excep­ tions\".",
                    "sid": 77,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "antecedent.",
                    "sid": 78,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If two candidates have an equal score, the candidate with the higher score for immediate reference is proposed as antecedent.",
                    "sid": 79,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If immediate reference does not hold, propose the candidate with higher score for collocational pattern.",
                    "sid": 80,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If collocational pattern suggests a tie or does not hold, select the candidate with higher score for indicating verbs.",
                    "sid": 81,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If this indicator does not hold again, go for the most recent candidate.",
                    "sid": 82,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 83,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation.",
                    "sid": 84,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For practical reasons, the approach presented does not incorporate syntactic and semantic information (other than a list of domain terms) and it is not real­ istic to expect its performance to be as good as an approach which makes use of syntactic and semantic knowledge in terms of constraints and preferences.",
                    "sid": 85,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lack of syntactic information, for instance, means giving up c-cornmand constraints and subject preference (or on other occasions object preference, see Mitkov I995) which could be used in center tracking.",
                    "sid": 86,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic parallelism, useful in discrimi­ nating between identical pronouns on the basis of their syntactic function, also has to be forgone.",
                    "sid": 87,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lack of semantic knowledge rules out the use of verb se­ mantics and semantic parallelism.",
                    "sid": 88,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our evaluation, however, suggests that much less is lost than might be feared.",
                    "sid": 89,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, our evaluation shows that the re­ sults are comparable to syntax-based methods (Lappin & Leass I994).",
                    "sid": 90,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe that the good success rate is due to the fact that a number of ante­ cedent indicators are taken into account and no fac­ tor is given absolute preference.",
                    "sid": 91,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, this strategy can often override incorrect decisions linked with strong centering preference (Mitkov & Belguith I998) or syntactic and semantic parallelism prefer­ ences (see below).",
                    "sid": 92,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Evaluation A. Our first evaluation exercise (Mitkov & Stys 1997) was based on a random sample text from a technical manual in English (Minolta 1994).",
                    "sid": 93,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There were 71 pronouns in the 140 page technical manual; 7 of the pronouns were non-anaphoric and 16 exophoric.",
                    "sid": 94,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resolution of anaphors was carried out with a suc­ cess rate of 95.8%.",
                    "sid": 95,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach being robust (an attempt is made to resolve each anaphor and a pro­ posed antecedent is returned), this figure represents both \"precision\" and \"recall\" if we use the MUC terminology.",
                    "sid": 96,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To avoid any terminological confusion, we shall therefore use the more neutral term \"success rate\" while discussing the evaluation.",
                    "sid": 97,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to evaluate the effectiveness of the ap­ proach and to explore if I how far it is superior over the baseline models for anaphora resolution, we also tested the sample text on (i) a Baseline Model which checks agreement in number and gender and, where more than one candidate remains, picks as antece­ dent the most recent subject matching the gender and number of the anaphor (ii) a Baseline Model which picks as antecedent the most recent noun phrase that matches the gender and number of the anaphor.",
                    "sid": 98,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The success rate of the \"Baseline Subject\" was 29.2%, whereas the success rate of \"Baseline Most Recent NP\" was 62.5%.",
                    "sid": 99,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given that our knowledge­ poor approach is basically an enhancement of a baseline model through a set of antecedent indica­ tors, we see a dramatic improvement in performance (95.8%) when these preferences are called upon.",
                    "sid": 100,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typically, our preference-based model proved superior to both baseline models when the antece­ dent was neither the most recent subject nor the most recent noun phrase matching the anaphor in gender and number.",
                    "sid": 101,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: Identify the draweq by the lit paper port LED and add paper to itj.",
                    "sid": 102,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The aggregate score for \"the drawer\" is 7 (definiteness 1 + givenness 0 + term preference 1 + indicating verbs I + lexical reiteration 0 + section heading 0 + collocation 0 + referential distance 2 + non-prepositional noun phrase 0 + immediate refer­ ence 2 = 7), whereas aggregate score for the most recent matching noun phrase (\"the lit paper port LED\") is 4 (definiteness 1 + givenness 0 + term preference I + indicating verbs 0 + lexical reitera­ tion 0 + section heading 0 + collocation 0 + referen­ tial distance 2 + non-prepositional noun phrase 0 + immediate reference 0 = 4).",
                    "sid": 103,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From this example we can also see that our knowledge-poor approach successfully tackles cases in which the anaphor and the· antecedent have not only different syntactic functions but also different semantic roles.",
                    "sid": 104,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Usually knowledge-based ap­ proaches have difficulties in such a situation because they use preferences such as \"syntactic parallelism\" or \"semantic parallelism\".",
                    "sid": 105,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our robust approach does not use these because it has no information about the syntactic structure of the sentence or about the syn­ tactic function/semantic role of each individual word.",
                    "sid": 106,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As far as the typical failure cases are concerned, we anticipate the knowledge-poor approach to have difficulties with sentences which have a more com­ plex syntactic structure.",
                    "sid": 107,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This should not be surpris ing, given that the approach does not rely on any syntactic knowledge and in particular, it does not produce any parse tree.",
                    "sid": 108,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, the approach fails on the sentence: The paper through key can be used to feed [a blank sheet of paper]j through the copier out into the copy tray without making a copy on itj.",
                    "sid": 109,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "where \"blank sheet of paper\" scores only 2 as op­ posed to the \"the paper through key\" which scores 6.",
                    "sid": 110,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Evaluation B. We carried out a second evaluation of the approach on a different set of sample texts from the genre of technical manuals (47-page Portable Style-Writer User's Guide (Stylewriter 1994).",
                    "sid": 111,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Out of 223 pro­ nouns in the text, 167 were non-anaphoric (deictic and non-anaphoric \"it\").",
                    "sid": 112,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evaluation carried out was manual to ensure that no added error was gen­ erated (e.g. due to possible wrong sentence/clause detection or POS tagging).",
                    "sid": 113,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another reason for doing it by hand is to ensure a fair comparison with Breck Baldwin's method, which not being available to us, had to be hand-simulated (see 3.3).",
                    "sid": 114,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evaluation indicated 83.6% success rate.",
                    "sid": 115,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The \"Baseline subject\" model tested on the same data scored 33.9% recall and 67.9% precision, whereas \"Baseline most recent\" scored 66.7%.",
                    "sid": 116,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that \"Baseline subject\" can be assessed both in terms of recall and precision because this \"version\" is not robust: in the event of no subject being available, it is not able to propose an antecedent (the manual guide used as evaluation text contained many im­ perative zero-subject sentences).",
                    "sid": 117,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second experiment we evaluated the ap­ proach from the point of view also of its \"critical success rate\".",
                    "sid": 118,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This measure (Mitkov 1998b) applies only to anaphors \"ambiguous\" from the point of view of number and gender (i.e. to those \"tough\" anaphors which, after activating the gender and number filters, still have more than one candidate for antecedent) and is indicative of the performance of the antecedent indicators.",
                    "sid": 119,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our evaluation estab­ lished the critical success rate as 82%.",
                    "sid": 120,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A case where the system failed was when the anaphor and the antecedent were in the same sen­ tence and where preference was given to a candidate in the preceding sentence.",
                    "sid": 121,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This case and other cases suggest that it might be worthwhile reconsider­ ing/refining the weights for the indicator \"referential distance\".",
                    "sid": 122,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly to the first evaluation, we found that the robust approach was not very successful on sen­ tences with too complicated syntax - a price we have to pay for the \"convenience\" of developing a knowl­ edge-poor system.",
                    "sid": 123,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results from experiment 1 and experiment 2 can be summarised in the following (statistically) slightly more representative figures.",
                    "sid": 124,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "R ob ust aQ pr oa ch B a s el i n e s u b je ct B as eli ne m os t re ce nt Su cc es s rat e (= Pr ec isi on / Re ca ll) 8 9.",
                    "sid": 125,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 % 31.",
                    "sid": 126,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "55 % I 48 .5 5 % 6 5 . 9 5 % The lower figure in \"Baseline subject\" corresponds to \"recall\" and the higher figure- to \"precision\".",
                    "sid": 127,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we regard as \"discriminative power\" of each antecedent indicator the ratio \"number of successful antecedent identifications when this indicator was applied\"/\"number of applications of this indicator\" (for the non-prepositional noun phrase and definite­ ness being penalising indicators, this figure is calcu­ lated as the ratio \"number of unsuccessful antece­ dent identifications\"/\"number of applications\"), the immediate reference emerges as the most discrimi­ native indicator (100%), followed by non­ prepositional noun phrase (92.2%), collocation (90.9%), section heading (61.9%), lexical reiteration (58.5%), givenness (49.3%), term preference (35.7%) and referential distance (34.4%).",
                    "sid": 128,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rela­ tively low figures for the majority of indicators should not be regarded as a surprise: firstly, we should bear in mind that in most cases a candidate was picked (or rejected) as an antecedent on the ba­ sis of applying a number of different indicators and secondly, that most anaphors had a relatively high number of candidates for antecedent.",
                    "sid": 129,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In terms of frequency of use (\"number of nonzero applications\"/\"number of anaphors\"), the most fre­ quently used indicator proved to be referential dis­ tance used in 98.9% of the cases, followed by term preference (97.8%), givenness (83.3%), lexical reit­ eration (64.4%), definiteness (40%), section heading (37.8%), immediate reference (31.1%) and colloca­ tion (11.1%).",
                    "sid": 130,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As expected, the most frequent indica­ tors were not the most discriminative ones.",
                    "sid": 131,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Comparison to similar approaches: compara­.",
                    "sid": 132,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tive evaluation of Breck Baldwin's CogNIAC We felt appropriate to extend the evaluation of our approach by comparing it to Breck Baldwin's Cog­ NIAC (Baldwin 1997) approach which features \"high precision coreference with limited knowledge and linguistics resources\".",
                    "sid": 133,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reason is that both our approach and Breck Baldwin's approach share common principles (both are knowledge-poor and use a POS tagger to provide the input) and therefore a comparison would be appropriate.",
                    "sid": 134,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given that our approach is robust and returns an­ tecedent for each pronoun, in order to make the comparison as fair as possible, we used CogNIAC's \"resolve all\" version by simulating it manually on the same training data used in evaluation B above.",
                    "sid": 135,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CogNIAC successfully resolved the pronouns in 75% of the cases.",
                    "sid": 136,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result is comparable with the results described in (Baldwin 1997).",
                    "sid": 137,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the training data from the genre of technical manuals, it was rule 5 (see Baldwin 1997) which was most frequently used (39% of the cases, 100% success), followed by rule 8 (33% of the cases, 33% success), rule 7 (11%, 100%), rule I (9%, 100%) and rule 3 (7.4%, 100%).",
                    "sid": 138,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It would be fair to say that even though the results show superiority of our approach on the training data used (the genre of technical manuals), they cannot be generalised automatically for other genres or unrestricted texts and for a more accurate picture, further extensive tests are necessary.",
                    "sid": 139,
                    "ssid": 64,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "adapting the robust approach for other. ",
            "number": "4",
            "sents": [
                {
                    "text": "languages An attractive feature of any NLP approach would be its language \"universality\".",
                    "sid": 140,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While we acknowledge that most of the monolingual NLP approaches are not automatically transferable (with the same degree of efficiency) to other languages, it would be highly desirable if this could be done with minimal adapta­ tion.",
                    "sid": 141,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the robust approach as a basis for devel­ oping a genre-specific reference resolution approach in Polish.",
                    "sid": 142,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As expected, some of the preferences had to be modified in order to fit with specific features of Polish (Mitkov & Stys 1997).",
                    "sid": 143,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the time being, we are using the same scores for Polish.",
                    "sid": 144,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evaluation for Polish was based technical manuals available on the Internet (Internet Manual, 1994; Java Manual 1998).",
                    "sid": 145,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sample texts con­ tained 180 pronouns among which were 120 in­ stances of exophoric reference (most being zero pro­ nouns).",
                    "sid": 146,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The robust approach adapted for Polish demonstrated a high success rate of 93.3% in resolv­ ing anaphors (with critical success rate of 86.2%).",
                    "sid": 147,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly to the evaluation for English, we com­ pared the approach for Polish with (i) a Baseline Model which discounts candidates on the basis of agreement in number and gender and, if there were still competing candidates, selects as the antecedent the most recent subject matching the anaphor in gender and number (ii) a Baseline Model which checks agreement in number and gender and, if there were still more than one candidate left, picks up as the antecedent the most recent noun phrase that agrees with the anaphor.",
                    "sid": 148,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our preference-based approach showed clear su­ periority over both baseline models.",
                    "sid": 149,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first Base­ line Model (Baseline Subject) was successful in only 23.7% of the cases, whereas the second (Baseline Most Recent) had a success rate of 68.4%.",
                    "sid": 150,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There­ fore, the 93.3% success rate (see above) demon­ strates a dramatic increase in precision, which is due to the use of antecedent tracking preferences.",
                    "sid": 151,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have recently adapted the approach for Ara­ bic as well (Mitkov & Belguith 1998).",
                    "sid": 152,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our evalua­ tion, based on 63 examples (anaphors) from a tech­ nical manual (Sony 1992), indicates a success rate of 95.2% (and critical success rate 89.3 %).",
                    "sid": 153,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "5",
            "sents": [
                {
                    "text": "We have described a robust, knowledge-poor ap­ proach to pronoun resolution which operates on texts pre-processed by a part-of-speech tagger.",
                    "sid": 154,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation shows a success rate of 89.7% for the genre of tech­ nical manuals and at least in this genre, the approach appears to be more successful than other similar methods.",
                    "sid": 155,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have also adapted and evaluated the approach for Polish (93.3 % success rate) and for Arabic (95.2% success rate).",
                    "sid": 156,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}