{
    "ID": "P98-1046",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Investigating regular sense extensions based on intersective Levin classes",
                    "sid": 0,
                    "ssid": null,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we specifically address questions of polysemy with respect to verbs, and how regular extensions of meaning can be achieved through the adjunction of particular syntactic phrases.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see verb classes as the key to making gen­ eralizations about regular extensions of mean­ ing.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Current approaches to English classifica­ tion, Levin classes and WordNet, have limita­ tions in their applicability that impede their utility as general classification schemes.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present a refinement of Levin classes, intersec­ tive sets, which are a more fine-grained clas­ sification and have more coherent sets of syn­ tactic frames and associated semantic compo­ nents.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have preliminary indications that the membership of our intersective sets will be more compatible with WordNet than the orig­ inal Levin classes.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also have begun to ex­ amine related classes in Portuguese, and find that these verbs demonstrate similarly coherent syntactic and semantic properties.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The difficulty of achieving adequate hand­ crafted semantic representations has limited the field of natural language processing to applica­ tions that can be contained within well-defined subdomains.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The only escape from this lim­ itation will be through the use of automated or semi-automated methods of lexical acquisi­ tion.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the field has yet to develop a clear consensus on guidelines for a computa­ tional lexicon that could provide a springboard for such methods, although attempts are being made (Pustejovsky, 1991), (Copestake and San­ filippo, 1993), (Lowe et al., 1997), (Dorr, 1997).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The authors would like to acknowledge the sup­ port of DARPA grant N6600194C-6043, ARO grant DAAH0494G-0426, and CAPES grant 0914/952.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the most controversial areas has to do with polysemy.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What constitutes a clear sepa­ ration into senses for any one verb, and how can these senses be computationally characterized and distinguished?",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The answer to this question is the key to breaking the bottleneck of semantic representation that is currently the single great­ est limitation on the general application of nat­ ural language processing techniques.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we specifically address questions of polysemy with respect to verbs, and how regular extensions of meaning can be achieved through the adjunction of particular syntactic phrases.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We base these regular extensions on a fine-grained variation on Levin classes, inter­ sective Levin classes, as a source of semantic components associated with specific adjuncts.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also examine similar classes in Portuguese, and the predictive powers of alternations in this language with respect to the same semantic components.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The difficulty of determining a suitable lexical representation becomes multi­ plied when more than one language is involved and attempts are made to map between them.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preliminary investigations have indicated that a straightforward translation of Levin classes into other languages is not feasible (Jones et al., 1994), (Nomura et al., 1994), (Saint-Dizier, 1996).",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we have found interesting par­ allels in how Portuguese and English treat reg­ ular sense extensions.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "classifying verbs. ",
            "number": "2",
            "sents": [
                {
                    "text": "Two current approaches to English verb classi­ fications are WordNet (Miller et al., 1990) and Levin classes (Levin, 1993).",
                    "sid": 20,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WordNet is an on­ line lexical database of English that currently contains approximately 120,000 sets of noun, verb, adjective, and adverb synonyms, each rep­ resenting a lexicalized concept.",
                    "sid": 21,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A synset (syn onym set) contains, besides all the word forms that can refer to a given concept, a definitional gloss and - in most cases - an example sentence.",
                    "sid": 22,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Words and synsets are interrelated by means of lexical and semantic-conceptual links, respec­ tively.",
                    "sid": 23,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Antonymy or semantic opposition links individual words, while the super-/subordinate relation links entire synsets.",
                    "sid": 24,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WordNet was de­ signed principally as a semantic network, and contains little syntactic information.",
                    "sid": 25,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Levin verb classes are based on the ability of a verb to occur or not occur in pairs of syntac­ tic frames that are in some sense meaning pre­ serving (diathesis alternations) (Levin, 1993).",
                    "sid": 26,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distribution of syntactic frames in which a verb can appear determines its class member­ ship.",
                    "sid": 27,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fundamental assumption is that the syntactic frames are a direct reflection of the un­ derlying semantics.",
                    "sid": 28,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Levin classes are supposed to provide specific sets of syntactic frames that are associated with the individual classes.",
                    "sid": 29,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sets of syntactic frames associated with a particular Levin class are not intended to be arbitrary, and they are supposed to reflect un­ derlying semantic components that constrain al­ lowable arguments.",
                    "sid": 30,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, break verbs and cut verbs are similar in that they can all participate in the transitive and in the mid­ dle construction, John broke the window, Glass breaks easily, John cut the bread, This loaf cuts easily.",
                    "sid": 31,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, only break verbs can also occur in the simple intransitive, The window broke, *The bread cut.",
                    "sid": 32,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, cut verbs can oc­ cur in the conative, John valiantly cut/hacked at the frozen loaf, but his knife was too dull to make a dent in it, whereas break verbs cannot, *John broke at the window.",
                    "sid": 33,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The explanation given is that cut describes a series of actions di­ rected at achieving the goal of separating some object into pieces.",
                    "sid": 34,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is possible for these ac­ tions to be performed without the end result being achieved, but where the cutting manner can still be recognized, i.e., John cut at the loaf.",
                    "sid": 35,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Where break is concerned, the only thing speci­ fied is the resulting change of state where the object becomes separated into pieces.",
                    "sid": 36,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the result is not achieved, there are no attempted breaking actions that can still be recognized.",
                    "sid": 37,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Ambiguities in Levin classes.",
                    "sid": 38,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not clear how much WordNet synsets should be expected to overlap with Levin classes, and preliminary indications are that there is a wide discrepancy (Dorr and Jones, 1996), (Jones and Onyshkevych, 1997), (Dorr, 1997).",
                    "sid": 39,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it would be useful for the WordNet senses to have access to the detailed syntactic information that the Levin classes contain, and it would be equally useful to have more guidance as to when membership in a Levin class does in fact indicate shared seman­ tic components.",
                    "sid": 40,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of course, some Levin classes, such as braid (bob, braid, brush, clip, coldcream, comb, condition, crimp, crop, curl, etc.) are clearly not intended to be synonymous, which at least partly explains the lack of overlap be­ tween Levin and WordNet.",
                    "sid": 41,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The association of sets of syntactic frames with individual verbs in each class is not as straightforward as one might suppose.",
                    "sid": 42,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For in­ stance, carry verbs are described as not taking the conative, *The mother carried at the baby, and yet many of the verbs in the carry class {push, pull, tug, shove, kick) are also listed in the push/pull class, which does take the cona­ tive.",
                    "sid": 43,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This listing of a verb in more than one class (many verbs are in three or even four classes) is left open to interpretation in Levin.",
                    "sid": 44,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Does it indicate that more than one sense of the verb is involved, or is one sense primary, and the alternations for that class should take precedence over the alternations for the other classes in which the verb is listed?",
                    "sid": 45,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The grounds for deciding that a verb belongs in a particular class because of the alternations that it does not take are elusive at best.",
                    "sid": 46,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "intersective levin classes. ",
            "number": "3",
            "sents": [
                {
                    "text": "We augmented the existing database of Levin semantic classes with a set of intersective classes, which were created by grouping to­ gether subsets of existing classes with over­ lapping members.",
                    "sid": 47,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All subsets were included which shared a minimum of three members.",
                    "sid": 48,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If only one or two verbs were shared between two classes, we assumed this might be due to ho­ mophony, an idiosyncrasy involving individual verbs rather than a systematic relationship in­ volving coherent sets of verbs.",
                    "sid": 49,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This filter al­ lowed us to reject the potential intersective class that would have resulted from combining the re­ move verbs with the scribble verbs, for example.",
                    "sid": 50,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sole member of this intersection is the verb draw.",
                    "sid": 51,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, the scribble verbs do form an intersective class with the perfor­ mance verbs, since paint and write are also in both classes, in addition to draw.",
                    "sid": 52,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm we used is given in Figure 1.",
                    "sid": 53,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1. Enumerate all sets S = {c1, ...",
                    "sid": 54,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", Cn} of se-.",
                    "sid": 55,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "mantic classes such that let n ... n enI e, where e is a relevance cutoff.",
                    "sid": 56,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 57,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each such S = {ct, ...",
                    "sid": 58,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": ",en}, define an.",
                    "sid": 59,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "intersective class Is such that a verb v E Is iff v E c1 n ... n en, and there is no S' = {d1, ..• ,c} such that S C S' and v E ci n ... n dm (subset criterion).",
                    "sid": 60,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1: Algorithm for identifying relevant semantic-class intersections We then reclassified the verbs in the database as follows.",
                    "sid": 61,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A verb was assigned membership in an intersective class if it was listed in each of the existing classes that were combined to form the new intersective class.",
                    "sid": 62,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Simultaneously, the verb was removed from the membership lists of those existing classes.",
                    "sid": 63,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Using intersective Levin classes to.",
                    "sid": 64,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "isolate semantic components Some of the large Levin classes comprise verbs that exhibit a wide range of possible semantic components, and could be divided into smaller subclasses.",
                    "sid": 65,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The split verbs (cut, draw, kick, knock, push, rip, roll, shove, slip, split, etc.) do not obviously form a homogeneous seman­ tic class.",
                    "sid": 66,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, in their use as split verbs, each verb manifests an extended sense that can be paraphrased as \"separate by V-ing,\" where \"V\" is the basic meaning of that verb (Levin, 1993).",
                    "sid": 67,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many of the verbs (e.g., draw, pull, push, shove, tug, yank) that do not have an inherent semantic component of \"separating\" belong to this class because of the component of force in their meaning.",
                    "sid": 68,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are interpretable as verbs of splitting or separating only in particular syn­ tactic frames (I pulled the twig and the branch apart, I pulled the twig off {of) the branch, but not *I pulled the twig and the branch).",
                    "sid": 69,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ad­ junction of the apart adverb adds a change of state semantic component with respect to the object which is not present otherwise.",
                    "sid": 70,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These fringe split verbs appear in several other inter­ sective classes that highlight the force aspect of their meaning.",
                    "sid": 71,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 depicts the intersection of split, carry and push/pull.",
                    "sid": 72,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2: Intersective class formed from Levin carry, push/pull and split verbs- verbs in() are not listed by Levin in all the intersecting classes but participate in all the alternations The intersection between the push/pull verbs of exerting force, the carry verbs and the split verbs illustrates how the force semantic compo­ nent of a verb can also be used to extend its meaning so that one can infer a causation of accompanied motion.",
                    "sid": 73,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Depending on the par­ ticular syntactic frame in which they appear, members of this intersective class (pull, push, shove, tug, kick, draw, yank) * can be used to exemplify any one (or more) of the the compo­ nent Levin classes.",
                    "sid": 74,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 75,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nora pushed the package to Pamela..",
                    "sid": 76,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(carry verb implies causation of accompa­ nied motion, no separation) 2.",
                    "sid": 77,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nora pushed at/against the package..",
                    "sid": 78,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Although kick is not listed as a verb of exerting force, it displays all the alternations that define this class.",
                    "sid": 79,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sim­ ilarly, draw and yank can be viewed as carry verbs al­ though they are not listed as such.",
                    "sid": 80,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The list of members for each Levin verb class is not always complete, so to check if a particular verb belongs to a class it is better to check that the verb exhibits all the alternations that de­ fine the class.",
                    "sid": 81,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since intersective classes were built using membership lists rather than the set of defining alterna­ tions, they were similarly incomplete.",
                    "sid": 82,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is an obvious shortcoming of the current implementation of intersec­ tive classes, and might affect the choice of 3 as a relevance cutoff in later implementations.",
                    "sid": 83,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(verb of exerting force, no separation or causation of accompanied motion implied) 3.",
                    "sid": 84,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nora pushed the branches apart..",
                    "sid": 85,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(split verb implies separation, no causation of accompanied motion)",
                    "sid": 86,
                    "ssid": 40,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "nora pushed the package.. ",
            "number": "4",
            "sents": [
                {
                    "text": "{verb of exerting force; no separation im­ plied, but causation of accompanied motion possible) 5.",
                    "sid": 87,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "*Nora pushed at the package to Pamela.",
                    "sid": 88,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the Levin classes that make up an intersective class may have conflicting alterna­ tions {e.g., verbs of exerting force can take the conative alternation, while carry verbs cannot), this does not invalidate the semantic regularity of the intersective class.",
                    "sid": 89,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a verb of exerting force, push can appear in the conative alterna­ tion, which emphasizes its force semantic com­ ponent and ability to express an \"attempted\" action where any result that might be associ­ ated- with the verb (e.g., motion) is not nec­ essarily achieved; as a carry verb (used with a goal or directional phrase), push cannot take the conative alternation, which would conflict with the core meaning of the carry verb class (i.e., causation of motion).",
                    "sid": 90,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The critical point is that, while the verb's meaning can be extended to either \"attempted\" action or directed motion, these two extensions cannot co-occur - they are mutually exclusive.",
                    "sid": 91,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However the simultaneous potential of mutually exclusive extensions is not a problem.",
                    "sid": 92,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is exactly those verbs that are triple-listed in the split/push/carry intersective class (which have force exertion as a semantic component) that can take the conative.",
                    "sid": 93,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The carry verbs that are not in the intersective class (carry, drag, haul, heft, hoist, lug, tote, tow) are more \"pure\" examples of the carry class and always imply the achievement of causation of motion.",
                    "sid": 94,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus they cannot take the conative al­ ternation.",
                    "sid": 95,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Comparisons to WordNet.",
                    "sid": 96,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even though the Levin verb classes are defined by their syntactic behavior, many reflect seman­ tic distinctions made by WordNet, a classifica­ tion hierarchy defined in terms of purely se­ mantic word relations (synonyms, hypernyms, etc.).",
                    "sid": 97,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When examining in detail the intersec­ tive classes just described, which emphasize not only the individual classes, but also their rela­ tion to other classes, we see a rich semantic lat­ tice much like WordNet.",
                    "sid": 98,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is exemplified by the Levin cut verbs and the intersective class formed by the cut verbs and split verbs.",
                    "sid": 99,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The original intersective class (cut, hack, hew, saw) exhibits alternations of both parent classes, and has been augmented with chip, clip, slash, snip since these cut verbs also display the syntactic properties of split verbs.",
                    "sid": 100,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WordNet distinguishes two subclasses of cut, differentiated by the type of result: 1.",
                    "sid": 101,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Manner of cutting that results in separa­.",
                    "sid": 102,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tion into pieces (chip, clip, cut, hack, hew, saw, slash, snip), having cut, separate with an instrument as an immediate hypernym.",
                    "sid": 103,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 104,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Manner of cutting that doesn't separate.",
                    "sid": 105,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "completely (scrape, scratch), having cut into, incise as an immediate hypernym, which in turn has cut, separate with an in­ strument as an immediate hypernym.",
                    "sid": 106,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This distinction appears in the second-order Levin classes as membership vs. nonmember­ ship in the intersective class with split.",
                    "sid": 107,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Levin verb classes are based on an underlying lat­ tice of partial semantic descriptions, which are manifested indirectly in diathesis alternations.",
                    "sid": 108,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whereas high level semantic relations (syn­ onym, hypernym) are represented directly in WordNet, they can sometimes be inferred from the intersection between Levin verb classes, as with the cut/split class.",
                    "sid": 109,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, other intersective classes, such as the split/push/carry class, are no more con­ sistent with WordNet than the original Levin classes.",
                    "sid": 110,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most specific hypernym common to all the verbs in this intersective class is move, displace, which is also a hypernym for other carry verbs not in the intersection.",
                    "sid": 111,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, only one verb (pull) has a WordNet sense cor­ responding to the change of state - separation semantic component associated with the split class.",
                    "sid": 112,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fact that the split sense for these verbs does not appear explicitly in WordNet is not surprising since it is only an extended sense of the verbs, and separation is inferred only when the verb occurs with an appropriate adjunct, such as apart.",
                    "sid": 113,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, apart can also be used with other classes of verbs, including many verbs of motion.",
                    "sid": 114,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To explicitly list separa tion as a possible sense for all these verbs would be extravagant when this sense can be gener­ ated from the combination of the adjunct with the force (potential cause of change of physical state) or motion (itself a special kind of change of state, i.e., of position) semantic component of the verb.",
                    "sid": 115,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WordNet does not currently provide a consistent treatment of regular sense exten­ sion (some are listed as separate senses, others are not mentioned at all).",
                    "sid": 116,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It would be straight­ forward to augment it with pointers indicating which senses are basic to a class of verbs and which can be generated automatically, and in­ clude corresponding syntactic information.",
                    "sid": 117,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Sense extension for manner of.",
                    "sid": 118,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "motion Figure 3 shows intersective classes involving two classes of verbs of manner of motion (run and roll verbs) and a class of verbs of existence (me­ ander verbs).",
                    "sid": 119,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Roll and run verbs have seman­ tic components describing a manner of motion that typically, though not necessarily, involves change of location.",
                    "sid": 120,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the absence of a goal or path adjunct they do not specify any direction of motion, and in some cases (e.g., float, bounce) require the adjunct to explicitly specify any dis­ placement at all.",
                    "sid": 121,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two classes differ in that roll verbs relate to manners of motion charac­ teristic of inanimate entities, while run verbs describe manners in which animate entities can move.",
                    "sid": 122,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some manner of motion verbs allow a transitive alternation in addition to the basic in­ transitive.",
                    "sid": 123,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When a roll verb occurs in the tran­ sitive (Bill moved the box across the room), the subject physically causes the object to move, whereas the subject of a transitive run verb merely induces the object to move (the coach ran the athlete around the track).",
                    "sid": 124,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some verbs can be used to describe motion of both animate and inanimate objects, and thus appear in both roll and run verb classes.",
                    "sid": 125,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The slide class parti­ tions this roll/run intersection into verbs that can take the transitive alternation and verbs that cannot (drift and glide cannot be causative, because they are not typically externally con­ trollable).",
                    "sid": 126,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verbs in the slide/roll/run intersec­ tion are also allowed to appear in the dative alternation (Carla slid the book to Dale, Carla slid Dale the book), in which the sense of change of location is extended to change of possession.When used intransitively with a path prepo sitional phrase, some of the manner of motion verbs can take on a sense of pseudo-motional existence, in which the subject does not actu­ ally move, but has a shape that could describe a path for the verb (e.g., The stream twists through the valley).",
                    "sid": 127,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These verbs are listed in the intersective classes with meander verbs of existence.",
                    "sid": 128,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"Meander Verbs\" Figure 3: Intersections between roll and run verbs of motion and meander verbs of existence 4 Cross-linguistic verb classes.",
                    "sid": 129,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Portuguese verbs we examined behaved much more similarly to their English counter­ parts than we expected.",
                    "sid": 130,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many of the verbs participate in alternations that are direct trans­ lations of the English alternations.",
                    "sid": 131,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, there are some interesting differences in which sense extensions are allowed.",
                    "sid": 132,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Similar sense extensions.",
                    "sid": 133,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have made a preliminary study of the Por­ tuguese translation of the carry verb class.",
                    "sid": 134,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in English, these verbs seem to take different alter­ nations, and the ability of each to participate in an alternation is related to its semantic content.",
                    "sid": 135,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 shows how these Portuguese verbs natu­ rally cluster into two different subclasses, based on their ability to take the conative and apart alternations as well as path prepositions.",
                    "sid": 136,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These subclasses correspond very well to the English subclasses created by the intersective class.",
                    "sid": 137,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The conative alternation in Portuguese is mainly contra (against), and the apart alterna­ tion is mainly separando (separating).",
                    "sid": 138,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For ex­ ample, Eu puxei o ramo e o galho separandoos As in English, derivar and planar are not exter­ nally controllable actions and thus don't take the causativejinchoative alternation common to other verbs in the roll class.",
                    "sid": 139,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Planar doesn't take a direct object in Portuguese, and it shows the induced action alternation the same way as flu­ tuar (by using the light verb fazer).",
                    "sid": 140,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Derivar is usually said as \"estar a deriva\" (\"to be adrift\"), showing its non-controllable action more explic­ itly.",
                    "sid": 141,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1: Portuguese carry verbs with their al­ ternations (I pulled the twig and the branch apart ) , and Ele empurrou contra a parede (He pushed against the walQ.",
                    "sid": 142,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Changing class membership.",
                    "sid": 143,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also investigated the Portuguese translation of some intersective classes of motion verbs.",
                    "sid": 144,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We selected the slide/roll/run, meander/roll and roll/run intersective classes.",
                    "sid": 145,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most verbs have more than one translation into Portuguese, so we chose the translation that best described the meaning or that had the same type of arguments as described in Levin's verb classes.",
                    "sid": 146,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The elements of the slide/roll/run class are rebater (bounce), flutuar (float), rolar ( rolQ and deslizar (slide).",
                    "sid": 147,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resultative in Portuguese cannot be expressed in the same way as in En­ glish.",
                    "sid": 148,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It takes a gerund plus a reflexive, as in A porta deslizou abrindose (The door slid opening itself).",
                    "sid": 149,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Transitivity is also not always preserved in the translations.",
                    "sid": 150,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, flutuar does not take a direct object, so some of the alterna­ tions that are related to its transitive meaning are not present.",
                    "sid": 151,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For these verbs, we have the in­ duced action alternation by using the light verb fazer (make) before the verb, as in Maria fez o barco flutuar (Mary floated the boat).",
                    "sid": 152,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As can be seen in Table 2 the alternations for the Portuguese translations of the verbs in this intersective class indicate that they share simi­ lar properties with the English verbs, including the causative/inchoative.",
                    "sid": 153,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The exception to this, as just noted, is flutuar (float).",
                    "sid": 154,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result of this is that ftutuar should move out of the slide class, which puts it with derivar (drift) and pla­ nar (glide) in the closely related roll/run class.",
                    "sid": 155,
                    "ssid": 69,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discussion. ",
            "number": "5",
            "sents": [
                {
                    "text": "We have presented a refinement of Levin classes, intersective classes, and discussed the potential for mapping them to WordNet senses.",
                    "sid": 156,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whereas each WordNet synset is hierarchicalized accord­ ing to only one aspect (e.g., Result, in the case of cut), Levin recognizes that verbs in a class may share many different semantic features, without designating one as primary.",
                    "sid": 157,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intersective Levin sets partition these classes according to more co­ herent subsets of features (force, force+motion, force+separation), in effect highlighting a lattice of semantic features that determine the sense of a verb.",
                    "sid": 158,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the incompleteness of the list of members of Levin classes, each verb must be examined to see whether it exhibits all the al­ ternations of a class.",
                    "sid": 159,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This might be approxi­ mated by automatically extracting the syntac­ tic frames in which the verb occurs in corpus data, rather than manual analysis of each verb, as was done in this study.",
                    "sid": 160,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have also examined a mapping between the English verbs that we have discussed and their Portuguese translations, which have sev­ eral of the same properties as the corresponding verbs in English.",
                    "sid": 161,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of these verbs take the same alternations as in English and, by virtue of these alternations, achieve the same regular sense extensions.",
                    "sid": 162,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are still many questions that require further investigation.",
                    "sid": 163,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, since our experi­ ment was based on a translation from English to Portuguese, we can expect that other verbs in Portuguese would share the same alternations, so the classes in Portuguese should by no means be considered complete.",
                    "sid": 164,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will be using re­ sources such as dictionaries and online corpora to investigate potential additional members of our classes.",
                    "sid": 165,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, since the translation map­ pings may often be many-to-many, the alterna re bat er (bo unc e) flut uar (flo at) rola r (rol l) desl izar (sli de) deri var (dr ift) pla nar (gli de) dati ve • c o n a t i v e c a u s . / i n c h . m i d d l e acc ept.",
                    "sid": 166,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "cor e£.",
                    "sid": 167,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "y e s n o y e s y e s y e s y e s n o y e s y e s y e s y e s n o y e s y e s y e s cau s:f mc h. res ulta tive adj ect.",
                    "sid": 168,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "par t. y e s y e s y e s y e s y e s ye s ye s ye s y e s y e s y e s y e s y e s y e s y e s ind. acti on loc at.",
                    "sid": 169,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "inv ers.",
                    "sid": 170,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "me asu re •ad j. per f. •c og n. ob je ct ze ro no m. y e s y e s y e s n o n o y e s y e s y e s y e s n o n o y e s y e s y e s y e s n o n o n o y e s y e s y e s n o n o y e s n o y e s y e s n o n o y e s y e s y e s y e s n o n o y e s Table 2: Portuguese slide/roll/run and roll/run verbs with their alternations tions may depend on which translation is cho­ sen, potentially giving us different clusters, but it is uncertain to what extent this is a factor, and it also requires further investigation.",
                    "sid": 171,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this experiment, we have tried to choose the Portuguese verb that is most closely related to the description of the English verb in the Levin class.",
                    "sid": 172,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We expect these cross-linguistic features to be useful for capturing translation generalizations between languages as discussed in the litera­ ture (Palmer and Rosenzweig, 1996), (Copes­ take and Sanfilippo, 1993), (Dorr, 1997).",
                    "sid": 173,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In pursuing this goal, we are currently implement­ ing features for motion verbs in the English Tree-Adjoining Grammar, TAG (Bleam et al., 1998).",
                    "sid": 174,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TAGs have also been applied to Por­ tuguese in previous work, resulting in a small Portuguese grammar (Kipper, 1994).",
                    "sid": 175,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We in­ tend to extend this grammar, building a more robust TAG grammar for Portuguese, that will allow us to build an English/Portuguese trans­ fer lexicon using these features.",
                    "sid": 176,
                    "ssid": 21,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}