{
    "ID": "P98-1081",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Improving Data Driven Wordclass Tagging by System Combination",
                    "sid": 0,
                    "ssid": null,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we examine how the differences in modelling between different data driven systems performing the same NLP task can be exploited to yield a higher accuracy than the best individual system.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do this by means of an experiment involving the task of morpho-syntactic wordclass tagging.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Four well-known tagger generators (Hidden Markov Model, Memory-Based, Transformation Rules and Maximum Entropy) are trained on the same corpus data.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After comparison, their outputs are combined using several voting strategies and second stage classifiers.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All combination taggers outperform their best component, with the best combination showing a 19.1% lower error rate than the best individual tagger.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "In all Natural Language Processing (NLP) systems, we find one or more language models which are used to predict, classify and/or interpret language related observations.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Traditionally, these models were categorized as either rule-based/symbolic or corpus-based/probabilistic.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recent work (e.g. Brill 1992) has demonstrated clearly that this categorization is in fact a mix-up of two distinct Categorization systems: on the one hand there is the representation used for the language model (rules, Markov model, neural net, case base, etc.) and on the other hand the manner in which the model is constructed (hand crafted vs. data driven).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Data driven methods appear to be the more popular.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be explained by the fact that, in general, hand crafting an explicit model is rather difficult, especially since what is being modelled, natural language, is not (yet) well- understood.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When a data driven method is used, a model is automatically learned from the implicit structure of an annotated training corpus.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is much easier and can quickly lead to a model which produces results with a 'reasonably' good quality.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obviously, 'reasonably good quality' is not the ultimate goal.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, the quality that can be reached for a given task is limited, and not merely by the potential of the learning method used.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other limiting factors are the power of the hard- and software used to implement the learning method and the availability of training material.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of these limitations, we find that for most tasks we are (at any point in time) faced with a ceiling to the quality that can be reached with any (then) available machine learning system.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the fact that any given system cannot go beyond this ceiling does not mean that machine learning as a whole is similarly limited.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A potential loophole is that each type of learning method brings its own 'inductive bias' to the task and therefore different methods will tend to produce different errors.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we are concerned with the question whether these differences between models can indeed be exploited to yield a data driven model with superior performance.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the machine learning literature this approach is known as ensemble, stacked, or combined classifiers.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has been shown that, when the errors are uncorrelated to a sufficient degree, the resulting combined classifier will often perform better than all the individual systems (Ali and Pazzani 1996; Chan and Stolfo 1995; Tumer and Gosh 1996).",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The underlying assumption is twofold.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the combined votes will make the system more robust to the quirks of each learner's particular bias.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, the use of information about each individual method's behaviour in principle even admits the possibility to fix collective errors.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will execute our investigation by means of an experiment.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NLP task used in the experiment is morpho-syntactic wordclass tagging.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reasons for this choice are several.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First of all, tagging is a widely researched and well-understood task (cf.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "van Halteren (ed.)",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1998).",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, current performance levels on this task still leave room for improvement: 'state of the art' performance for data driven automatic wordclass taggers (tagging English text with single tags from a low detail tagset) is 9697% correctly tagged words.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, a number of rather different methods are available that generate a fully functional tagging system from annotated text.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Component taggers In 1992, van Halteren combined a number of taggers by way of a straightforward majority vote (cf.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "van Halteren 1996).",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the component taggers all used n-gram statistics to model context probabilities and the knowledge representation was hence fundamentally the same in each component, the results were limited.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now there are more varied systems available, a variety which we hope will lead to better combination effects.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this experiment we have selected four systems, primarily on the basis of availability.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each of these uses different features of the text to be tagged, and each has a completely different representation of the language model.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first and oldest system uses a traditional trig-ram model (Steetskamp 1995; henceforth tagger T, for Trigrams), based on context statistics P(ti[ti-l,ti-2) and lexical statistics P(tilwi) directly estimated from relative corpus frequencies.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Viterbi algorithm is used to determine the most probable tag sequence.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since this model has no facilities for handling unknown words, a Memory-Based system (see below) is used to propose distributions of potential tags for words not in the lexicon.",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second system is the Transformation Based Learning system as described by Brill (19941; henceforth tagger R, for Rules).",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This 1 Brill's system is available as a collection of C programs and Perl scripts at ftp ://ftp.",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "cs.",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "j hu.",
                    "sid": 45,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "edu/pub/brill/Programs/ RULE_BASED_TAGGER_V.",
                    "sid": 46,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I. 14.",
                    "sid": 47,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tar.",
                    "sid": 48,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Z. system starts with a basic corpus annotation (each word is tagged with its most likely tag) and then searches through a space of transformation rules in order to reduce the discrepancy between its current annotation and the correct one (in our case 528 rules were learned).",
                    "sid": 49,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During tagging these rules are applied in sequence to new text.",
                    "sid": 50,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of all the four systems, this one has access to the most information: contextual information (the words and tags in a window spanning three positions before and after the focus word) as well as lexical information (the existence of words formed by suffix/prefix addition/deletion).",
                    "sid": 51,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the actual use of this information is severely limited in that the individual information items can only be combined according to the patterns laid down in the rule templates.",
                    "sid": 52,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third system uses Memory-Based Learning as described by Daelemans et al. (1996; henceforth tagger M, for Memory).",
                    "sid": 53,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During the training phase, cases containing information about the word, the context and the correct tag are stored in memory.",
                    "sid": 54,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During tagging, the case most similar to that of the focus word is retrieved from the memory, which is indexed on the basis of the Information Gain of each feature, and the accompanying tag is selected.",
                    "sid": 55,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system used here has access to information about the focus word and the two positions before and after, at least for known words.",
                    "sid": 56,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For unknown words, the single position before and after, three suffix letters, and information about capitalization and presence of a hyphen or a digit are used.",
                    "sid": 57,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fourth and final system is the MXPOST system as described by Ratnaparkhi (19962; henceforth tagger E, for Entropy).",
                    "sid": 58,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It uses a number of word and context features rather similar to system M, and trains a Maximum Entropy model that assigns a weighting parameter to each feature-value and combination of features that is relevant to the estimation of the probability P(tag[features).",
                    "sid": 59,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A beam search is then used to find the highest probability tag sequence.",
                    "sid": 60,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both this system and Brill's system are used with the default settings that are suggested in their documentation.",
                    "sid": 61,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2Ratnaparkhi's Java implementation of this system is available at ftp://ftp.cis.upenn.edu/ pub/adwait/jmx/",
                    "sid": 62,
                    "ssid": 62,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the data. ",
            "number": "2",
            "sents": [
                {
                    "text": "The data we use for our experiment consists of the tagged LOB corpus (Johansson 1986).",
                    "sid": 63,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus comprises about one million words, divided over 500 samples of 2000 words from 15 text types.",
                    "sid": 64,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its tagging, which was manually checked and corrected, is generally accepted to be quite accurate.",
                    "sid": 65,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here we use a slight adaptation of the tagset.",
                    "sid": 66,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The changes are mainly cosmetic, e.g. non-alphabetic characters such as \"$\" in tag names have been replaced.",
                    "sid": 67,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, there has also been some retokenization: genitive markers have been split off and the negative marker \"n't\" has been reattached.",
                    "sid": 68,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example sentence tagged with the resulting tagset is: The ATI singular or plural article Lord NPT singular titular noun Major NPT singular titular noun extended VBD past tense of verb an AT singular article invitation NN singular common noun to IN preposition all ABN pre-quantifier the ATI singular or plural article parliamentary JJ adjective candidates NNS plural common noun SPER period The tagset consists of 170 different tags (including ditto tags 3) and has an average ambiguity of 2.69 tags per wordform.",
                    "sid": 69,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The difficulty of the tagging task can be judged by the two baseline measurements in Table 2 below, representing a completely random choice from the potential tags for each token (Random) and selection of the lexically most likely tag (LexProb).",
                    "sid": 70,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For our experiment, we divide the corpus into three parts.",
                    "sid": 71,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first part, called Train, consists of 80% of the data (931062 tokens), constructed 3Ditto tags are used for the components of multi- token units, e.g. if \"as well as\" is taken to be a coordination conjunction, it is tagged \"as_CC1 well_CC2 as_CC3\", using three related but different ditto tags.",
                    "sid": 72,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "by taking the first eight utterances of every ten.",
                    "sid": 73,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This part is used to train the individual tag- gers.",
                    "sid": 74,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second part, Tune, consists of 10% of the data (every ninth utterance, 114479 tokens) and is used to select the best tagger parameters where applicable and to develop the combination methods.",
                    "sid": 75,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third and final part, Test, consists of the remaining 10% (.115101 tokens) and is used for the final performance measurements of all tuggers.",
                    "sid": 76,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both Tune and Test contain around 2.5% new tokens (wrt Train) and a further 0.2% known tokens with new tags.",
                    "sid": 77,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The data in Train (for individual tuggers) and Tune (for combination tuggers) is to be the only information used in tagger construction: all components of all tuggers (lexicon, context statistics, etc.) are to be entirely data driven and no manual adjustments are to be done.",
                    "sid": 78,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The data in Test is never to be inspected in detail but only used as a benchmark tagging for quality measurement.",
                    "sid": 79,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "potential for improvement. ",
            "number": "3",
            "sents": [
                {
                    "text": "In order to see whether combination of the component tuggers is likely to lead to improvements of tagging quality, we first examine the results of the individual taggers when applied to Tune.",
                    "sid": 80,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As far as we know this is also one of the first rigorous measurements of the relative quality of different tagger generators, using a single tagset and dataset and identical circumstances.",
                    "sid": 81,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The quality of the individual tuggers (cf.",
                    "sid": 82,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 below) certainly still leaves room for improvement, although tagger E surprises us with an accuracy well above any results reported so far and makes us less confident about the gain to be accomplished with combination.",
                    "sid": 83,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, that there is room for improvement is not enough.",
                    "sid": 84,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As explained above, for combination to lead to improvement, the component taggers must differ in the errors that they make.",
                    "sid": 85,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That this is indeed the case can be seen in Table 1.",
                    "sid": 86,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that for 99.22% of Tune, at least one tagger selects the correct tag.",
                    "sid": 87,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it is unlikely that we will be able to identify this 4This implies that it is impossible to note if errors counted against a tagger are in fact errors in the benchmark tagging.",
                    "sid": 88,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We accept that we are measuring quality in relation to a specific tagging rather than the linguistic truth (if such exists) and can only hope the tagged LOB corpus lives up to its reputation.",
                    "sid": 89,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All Taggers Correct 92.49 Majority Correct (31,211) 4.34 Correct Present, No Majority 1.37 (22,1111) Minority Correct (13,121) 1.01 All Taggers Wrong 0.78 Table 1: Tagger agreement on Tune.",
                    "sid": 90,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The patterns between the brackets give the distribution of correct/incorrect tags over the systems.",
                    "sid": 91,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tag in each case.",
                    "sid": 92,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We should rather aim for optimal selection in those cases where the correct tag is not outvoted, which would ideally lead to correct tagging of 98.21% of the words (in Tune).",
                    "sid": 93,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Simple Voting There are many ways in which the results of the component taggers can be combined, selecting a single tag from the set proposed by these taggers.",
                    "sid": 94,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this and the following sections we examine a number of them.",
                    "sid": 95,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The accuracy measurements for all of them are listed in Table 2.",
                    "sid": 96,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 The most straightforward selection method is an n-way vote.",
                    "sid": 97,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each tagger is allowed to vote for the tag of its choice and the tag with the highest number of votes is selected.",
                    "sid": 98,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 The question is how large a vote we allow each tagger.",
                    "sid": 99,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most democratic option is to give each tagger one vote (Majority).",
                    "sid": 100,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it appears more useful to give more weight to taggers which have proved their quality.",
                    "sid": 101,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be general quality, e.g. each tagger votes its overall precision (TotPrecision), or quality in relation to the current situation, e.g. each tagger votes its precision on the suggested tag (Tag- Precision).",
                    "sid": 102,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The information about each tagger's quality is derived from an inspection of its results on Tune.",
                    "sid": 103,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5For any tag X, precision measures which percentage of the tokens tagged X by the tagger are also tagged X in the benchmark and recall measures which percentage of the tokens tagged X in the benchmark are also tagged X by the tagger.",
                    "sid": 104,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When abstracting away from individual tags, precision and recall are equal and measure how many tokens are tagged correctly; in this case we also use the more generic term accuracy.",
                    "sid": 105,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6In our experiment, a random selection from among the winning tags is made whenever there is a tie.",
                    "sid": 106,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2: Accuracy of individual taggers and combination methods.",
                    "sid": 107,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But we have even more information on how well the taggers perform.",
                    "sid": 108,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We not only know whether we should believe what they propose (precision) but also know how often they fail to recognize the correct tag (recall).",
                    "sid": 109,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This information can be used by forcing each tagger also to add to the vote for tags suggested by the opposition, by an amount equal to 1 minus the recall on the opposing tag (Precision-Recall).",
                    "sid": 110,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As it turns out~ all voting systems outperform the best single tagger, E. 7 Also, the best voting system is the one in which the most specific information is used, Precision-Recall.",
                    "sid": 111,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, specific information is not always superior, for TotPrecision scores higher than TagPrecision.",
                    "sid": 112,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This might be explained by the fact that recall information is missing (for overall performance this does not matter, since recall is equal to precision).",
                    "sid": 113,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7Even the worst combinator, Majority, is significantly better than E: using McNemar's chi-square, p--0.",
                    "sid": 114,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pairwise Voting So far, we have only used information on the performance of individual taggers.",
                    "sid": 115,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A next step is to examine them in pairs.",
                    "sid": 116,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can investigate all situations where one tagger suggests T1 and the other T2 and estimate the probability that in this situation the tag should actually be Tx.",
                    "sid": 117,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When combining the taggers, every tagger pair is taken in turn and allowed to vote (with the probability described above) for each possible tag, i.e. not just the ones suggested by the component taggers.",
                    "sid": 118,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a tag pair T1T2 has never been observed in Tune, we fall back on information on the individual taggers, viz.",
                    "sid": 119,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the probability of each tag Tx given that the tagger suggested tag Ti.",
                    "sid": 120,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that with this method (and those in the next section) a tag suggested by a minority (or even none) of the taggers still has a chance to win.",
                    "sid": 121,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In principle, this could remove the restriction of gain only in 22 and 1111 cases.",
                    "sid": 122,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In practice, the chance to beat a majority is very slight indeed and we should not get our hopes up too high that this should happen very often.",
                    "sid": 123,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When used on Test, the pairwise voting strategy (TagPair) clearly outperforms the other voting strategies, 8 but does not yet approach the level where all tying majority votes are handled correctly (98.31%).",
                    "sid": 124,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Stacked classifiers From the measurements so far it appears that the use of more detailed information leads to a better accuracy improvement.",
                    "sid": 125,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It ought therefore to be advantageous to step away from the underlying mechanism of voting and to model the situations observed in Tune more closely.",
                    "sid": 126,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The practice of feeding the outputs of a number of classifiers as features for a next learner sit is significantly better than the runner-up (Precision-Recall) with p=0.",
                    "sid": 127,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is usually called stacking (Wolpert 1992).",
                    "sid": 128,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second stage can be provided with the first level outputs, and with additional information, e.g. about the original input pattern.",
                    "sid": 129,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first choice for this is to use a Memory- Based second level learner.",
                    "sid": 130,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the basic version (Tags), each case consists of the tags suggested by the component taggers and the correct tag.",
                    "sid": 131,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the more advanced versions we also add information about the word in question (Tags+Word) and the tags suggested by all taggers for the previous and the next position (Tags+Context).",
                    "sid": 132,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the first two the similarity metric used during tagging is a straightforward overlap count; for the third we need to use an Information Gain weighting (Daelemans ct al. 1997).",
                    "sid": 133,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Surprisingly, none of the Memory-Based based methods reaches the quality of TagPair.",
                    "sid": 134,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 The explanation for this can be found when we examine the differences within the Memory- Based general strategy: the more feature information is stored, the higher the accuracy on Tune, but the lower the accuracy on Test.",
                    "sid": 135,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is most likely an overtraining effect: Tune is probably too small to collect case bases which can leverage the stacking effect convincingly, especially since only 7.51% of the second stage material shows disagreement between the featured tags.",
                    "sid": 136,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To examine if the overtraining effects are specific to this particular second level classifier, we also used the C5.0 system, a commercial version of the well-known program C4.5 (Quinlan 1993) for the induction of decision trees, on the same training material.",
                    "sid": 137,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1° Because C5.0 prunes the decision tree, the overfitting of training material (Tune) is less than with Memory-Based learning, but the results on Test are also worse.",
                    "sid": 138,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We conjecture that pruning is not beneficial when the interesting cases are very rare.",
                    "sid": 139,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To realise the benefits of stacking, either more data is needed or a second stage classifier that is better suited to this type of problem.",
                    "sid": 140,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9Tags (Memory-Based) scores significantly worse than TagPair (p=0.0274) and not significantly better than Precision-Recall (p=0.2766).",
                    "sid": 141,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1°Tags+Word could not be handled by C5.0 due to the huge number of feature values.",
                    "sid": 142,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Test Increase vs % Reduc- Component tion Error Average Rate Best Component T 96.08 - R 96.46 M 96.95 MR 97.03 96.70+0.33 2.6 (M) RT 97.11 96.27+0.84 18.4 (R) MT 97.26 96.52+0.74 lO.2 (M) E 97.43 MRT 97.52 96.50+1.02 18.7 (M) ME 97.56 97.19+0.37 5.1 (E) ER 97.58 96.95+0.63 5.8 (E) ET 97.60 96.76+0.84 6.6 (E) MER 97.75 96.95+0.80 12.5 (E) ERT 97.79 96.66+1.13 14.0 (E) MET 97.86 96.82+1.04 16.7 (E) MERT 97.92 96.73+1.19 19.1 (E) Table 3: Correctness scores on Test for Pairwise Voting with all tagger combinations 7 The value of combination.",
                    "sid": 143,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relation between the accuracy of combinations (using TagPair) and that of the individual taggers is shown in Table 3.",
                    "sid": 144,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most important observation is that every combination (significantly) outperforms the combination of any strict subset of its components.",
                    "sid": 145,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also of note is the improvement yielded by the best combination.",
                    "sid": 146,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pairwise voting system, using all four individual taggers, scores 97.92% correct on Test, a 19.1% reduction in error rate over the best individual system, viz.",
                    "sid": 147,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the Maximum Entropy tagger (97.43%).",
                    "sid": 148,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A major factor in the quality of the combination results is obviously the quality of the best component: all combinations with E score higher than those without E (although M, R and T together are able to beat E alone11).",
                    "sid": 149,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After that, the decisive factor appears to be the difference in language model: T is generally a better combiner than M and R, 12 even though it has the lowest accuracy when operating alone.",
                    "sid": 150,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A possible criticism of the proposed combi11By a margin at the edge of significance: p=0.0608.",
                    "sid": 151,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "12Although not significantly better, e.g. the differences within the group ME/ER/ET are not significant.",
                    "sid": 152,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "nation scheme is the fact that for the most successful combination schemes, one has to reserve a nontrivial portion (in the experiment 10% of the total material) of the annotated data to set the parameters for the combination.",
                    "sid": 153,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To see whether this is in fact a good way to spend the extra data, we also trained the two best individual systems (E and M, with exactly the same settings as in the first experiments) on a concatenation of Train and Tune, so that they had access to every piece of data that the combination had seen.",
                    "sid": 154,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It turns out that the increase in the individual taggers is quite limited when compared to combination.",
                    "sid": 155,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The more extensively trained E scored 97.51% correct on Test (3.1% error reduction) and M 97.07% (3.9% error reduction).",
                    "sid": 156,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conclusion.",
                    "sid": 157,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our experiment shows that, at least for the task at hand, combination of several different systems allows us to raise the performance ceiling for data driven systems.",
                    "sid": 158,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obviously there is still room for a closer examination of the differences between the combination methods, e.g. the question whether Memory-Based combination would have performed better if we had provided more training data than just Tune, and of the remaining errors, e.g. the effects of inconsistency in the data (cf.",
                    "sid": 159,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ratnaparkhi 1996 on such effects in the Penn Treebank corpus).",
                    "sid": 160,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Regardless of such closer investigation, we feel that our results are encouraging enough to extend our investigation of combination, starting with additional component taggers and selection strategies, and going on to shifts to other tagsets and/or languages.",
                    "sid": 161,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But the investigation need not be limited to wordclass tagging, for we expect that there are many other NLP tasks where combination could lead to worthwhile improvements.",
                    "sid": 162,
                    "ssid": 83,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "Our thanks go to the creators of the tagger generators used here for making their systems available.",
                    "sid": 163,
                    "ssid": 84,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}