{
    "ID": "P9852_p00",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper presents our efforts at developing an Indonesian morphological analyser that pro­ vides a detailed analysis of the rich affixation process 1• We model Indonesian morphology us­ ing a two-level morphology approach, decom­ posing the process into a set of morphotactic and morphophonemic rules.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These rules are modelled as a network of finite state transduc­ ers and implemented using xfst and lexc.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach is able to handle reduplication, a non-concatenative morphological process.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Morphology is the study of the way that words are built up from smaller units called morphemes, the minimal meaning-bearing units in a language (Ju­ rafsky, 2000).",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the English word kind consists of a single morpheme (the root word kind) whilst the word players consists of three mor­ phemes: play, -er and -s.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The morphemes kind and play can stand alone as words, while affixes -er and -s must appear bound to another morpheme.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By applying a set of morphological rules, we can produce not just morphemes but also other in­ formation relating to the words; for example, the grammatical category of the whole word as well as the subcategorisation frame of the word if it is a verb.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This process is called morphological analysis.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this respect, the value of a morphological ana­ lyser would be twofold: from a theoretical (linguis­ tic) viewpoint, it is a very useful tool for linguistic modelling and for testing certain analyses.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the 1 This research is part of a collaborative research project.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "funded by ARC Discovery Grant DP0877595.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "other hand, from a practical viewpoint, it supports many applications, e.g. information retrieval, search engines, and machine translation, among others.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is currently some interest in developing morphological tools for the Indonesian language.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In previous work, Siregar (1995) and Adriani et al.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) discuss the development of Indonesian stemmers that recover a root from an affixed word, implemented procedurally.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, stemmers are of limited use as they do not provide any more lin­ guistic information beyond the stem.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hartono (2002) presents an initial version of a morphologi­ cal analyser developed with PC-K.IMMO, but un­ fortunately, it does not handle reduplication, a key aspect of Indonesian morphology.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The morpho­ logical analyser that we are developing and that we describe here is designed to be able to handle the rich semantic, lexical and grammatical information associated with words and word formation in NLP applications.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 2, we first discuss Indonesian mor­ phology, followed by a brief explanation of two­ level morphology in Section 3.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sections 4 and 5 present our work in applying two-level morphol­ ogy for the Indonesian language.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, Section 6 presents the results of some evaluations we carried out on our developed analyser.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "indonesian language morphology. ",
            "number": "2",
            "sents": [
                {
                    "text": "Indonesian is a variety of Malay, which belongs to the Austronesian language family (Gordon, 2005; Sneddon, 2003).",
                    "sid": 22,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is spoken by about 190 million people in Indonesia and other parts of the world2• 2 According to Biro Pusat Statistik, as of 2004..",
                    "sid": 23,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Words in Indonesian are built from their roots by means of a variety of morphological operations including compounding, affixation, and reduplica­ tion.",
                    "sid": 24,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indonesian concatenative morphology regu­ lates how a stem and its affixes glue together, while a non-concatenative one combines mor­ phemes in more complex ways.",
                    "sid": 25,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Affixes in Indonesian can be classified as four categories (Alwi et al., 2003).",
                    "sid": 26,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prefixes precede the base form, i.e. meN-, di-, peN-, per-, ke-, and ter-.",
                    "sid": 27,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suffixes follow the base form, i.e. -kan, -an, and -i.",
                    "sid": 28,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Infixes are inside the base form, i.e. -el-, -em-, and -er-.",
                    "sid": 29,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Circumfixes wrap around the base form.",
                    "sid": 30,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While circumfixes formally are combinations of allowed prefixes and suffixes, they have to be treated as discontinuous units for semantic and grammatical reasons.",
                    "sid": 31,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our Indonesian morpho­ logical analyser, we have handled prefixes, suf­ fixes, and circumfixes.",
                    "sid": 32,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indonesian non-concatenative morphology re­ fers to reduplicated morpheme forms.",
                    "sid": 33,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reduplicated words based on morpheme regularity are grouped into full reduplication (e.g., the word bukubuku is derived from the stem buku) and partial reduplica­ tion of different kinds.",
                    "sid": 34,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The latter includes redupli­ cated stems with affixes (e.g. the word buah­ buahan is derived from stem buah, bertingkat­ tingkat is derived from stem bertingkat) and vari­ ous (often rather irregular) reduplications (e.g. sa­ yurmayur is derived from sayur).",
                    "sid": 35,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indonesian affixation and reduplication are illus­ trated in the following example.",
                    "sid": 36,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the stem pukul, we can derive words like pemukul (by con­ catenating the prefix peN-), memukuli (by concate­ nating the circumfix meN-i), and pukulanpukulan (by first concatenating the suffix -an, then apply­ ing full reduplication).",
                    "sid": 37,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other examples include dipukul, pemukulan, and berpukulpukulan.",
                    "sid": 38,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All kinds of regular word-formation with or without reduplication are recognized in this re­ search.",
                    "sid": 39,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Morphology generally makes a distinction be­ tween inflectional and derivational processes.",
                    "sid": 40,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the previous example, the formation of memukuli appears to be 'inflectional' as the formation does not change the category of the stem, and the forma­ tion of pemukul and pukulanpukulan is deriva­ tional because the derived words are nouns while the stem pukul is a verb.",
                    "sid": 41,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the distinction between inflection and derivation, particularly in Indonesian, is not always clear cut.",
                    "sid": 42,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The formation of verbs such as memukuli from pukul is arguably derivational in nature because the new words have quite different lexical properties, even though both the new verbs and the stems are of the same cate­ gory (i.e. 'verb').",
                    "sid": 43,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "two-level morphology. ",
            "number": "3",
            "sents": [
                {
                    "text": "A morphological analyser can be used to process a list of morphemes in a lexicon to yield fully derived words.",
                    "sid": 44,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the other direction, it can be used to identify affixes and roots from derived words.",
                    "sid": 45,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, taking the word membaca as input, an Indonesian morphological analyser should produce the string baca+Verb+AV, indicating that the active verb membaca is derived from baca.",
                    "sid": 46,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it is difficult to accomplish morpho­ logical analysis in one step only.",
                    "sid": 47,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Indonesian, affixation does not consist of just fusing the affix with the stem.",
                    "sid": 48,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Modification of phonemes may be necessary, e.g. the concatenation of meN+putar will produce word memutar, while the result of meN+siram is menyiram.",
                    "sid": 49,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To solve this problem, we adopt a two-level morphology model.",
                    "sid": 50,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two-level morphology is based on finite-state transducers (Koskenniemi, 1983).",
                    "sid": 51,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In practice, this model has been success­ fully applied to several languages such as English, Finnish, Japanese, Russian, and French.",
                    "sid": 52,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not only useful to account for various concatenative morphologies, but is also able to handle non­ concatenative processes, as has been developed in Malagasy tokenization and morphological analysis (Dalrymple et al., 2006).",
                    "sid": 53,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "design. ",
            "number": "4",
            "sents": [
                {
                    "text": "Our design for an Indonesian morphological ana­ lyser is divided into two components: morphotac­ tic rules that explain which classes of morphemes can follow other classes of morphemes inside a word, and morphophonemic rules which model the changes that occur in a word.",
                    "sid": 54,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rules in each component are typically applied in parallel.",
                    "sid": 55,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Addi­ tionally, these rules are combined with a lexicon of stems in order to complete the full design.",
                    "sid": 56,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A word, in order to be analysed, will follow the path lexicon -7 morphotactic rules -7 morphopho­ nemic rules-7 surface.",
                    "sid": 57,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Before the result of the morphological analyser appears at the surface, it will follow the lexicon path to determine the actual morpheme of that word.",
                    "sid": 58,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After moving from the lexicon, that word will be analysed by morphotac­ tic and morphophonemic rules.",
                    "sid": 59,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only after finishing the process in morphotactic and morphophonemic rules, will the result of morphological analyser for that word be delivered.",
                    "sid": 60,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The explanation below will explore, in a little more depth, the design of lexicon, morphotactic rules, and morphophonemic rules.",
                    "sid": 61,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Lexicon design.",
                    "sid": 62,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our lexicon equates to a set of Indonesian stem words.",
                    "sid": 63,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Affixes are not stored in the lexicon as they are already accounted for by the morphotactic rules.",
                    "sid": 64,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For our initial design, our lexicon is divided into four classes, i.e. verbs, nouns, adjectives, and 'etc', which includes all other stems, e.g. pronouns, ad­ verbs, numbers, and particles.",
                    "sid": 65,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clustering these word classes together is certainly a large oversim­ plification, and one which we hope to address in future revisions.",
                    "sid": 66,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Tag design.",
                    "sid": 67,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The design of tags has become very important in the development of morphological analysers, since the tags will deliver linguistic information that oc­ curs on a word being analysed.",
                    "sid": 68,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our research, the tags to be designed can be divided into normal tags and special tags.",
                    "sid": 69,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normal tags can be output by the morphotactics component without any circumstances, whilst special tags only occur if the involved stems are associated with specific markers in the lexicon.",
                    "sid": 70,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The normal tags are +VERB, +NoUN, +ADJ, +BAREVERB, +BARENoUN, +BAREADJ, +BAREETc, +AV, +PASS, +UV, and +REDUP, whilst the special tags are +CAus_KAN, +APPL_KAN, +CAUS_I,+APPL_I,+AcTOR,+INS . Tags like +VERB, +NoUN, and +ADJ give the part of speech (POS) information for fully inflected words, whereas +BAREVERB, +BARENoUN, +BAREADJ, and +BAREETc give the POS information for stems.",
                    "sid": 71,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other tags provide important linguistic informa­ tion, such as voice, a grammatical category playing a central role in Indonesian syntax, e.g. +AV, which indicates active voice, +PASS, which indicates pas­ sive voice, and +UV, which is reserved for under­ goer voice.",
                    "sid": 72,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, +REouP is a tag indicating redupli­ cation.",
                    "sid": 73,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "+CAUS_KAN, +CAUS_I, +APPL_KAN, and +APPL_I show whether words are causative or applicative with respect to their suffixes.",
                    "sid": 74,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last two tags (+AcToR and +INsTRUMENT) indicate either it is an ac­ tor or an instrument that is being brought with the construction of that word.",
                    "sid": 75,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Morphotactic rules.",
                    "sid": 76,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In designing a morphological analyser, morphotac­ tic rules are crucial to model how two or more morphemes can be merged.",
                    "sid": 77,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on (Alwi et al., 2003), the morphotactic rules for Indonesian can be classified into 13 classes.",
                    "sid": 78,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ten of these classes are determined based on which suffixes are merged with the stem, while the other three are reduplication cases.",
                    "sid": 79,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first ten classes can be identified as concatenative mor­ phology, while the other three are nonconcatena­ tive morphology.",
                    "sid": 80,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our design, the ten classes that belong to con­ catenative morphology are the morphotactic rules for the prefixes meN-, peN-, di-, per-, ber-, ter-, and ke-, and the morphotactic rules for the suffixes -an, -kan, and -i.",
                    "sid": 81,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some example cases that belong to these 10 classes are as follows: • meN+ stem(verb, noun, adjective or etc)+ kan 7 Verb.",
                    "sid": 82,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: membersihkan.",
                    "sid": 83,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(meN+bersih+kan).",
                    "sid": 84,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this example, the word bersih is an adjective.",
                    "sid": 85,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After merging with meN-kan, the resulting word is a verb.",
                    "sid": 86,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• peN+ ber + stem(verb, noun, adjective or etc) + an 7 Noun.",
                    "sid": 87,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: pembelajaran (peN+ber+ajar+an).",
                    "sid": 88,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this example, the word ajar is a verb.",
                    "sid": 89,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After merging with peN-ber-an, the resulting word is a noun.",
                    "sid": 90,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• ke + ber + stem(verb, noun, adjective or etc)+ an 7 Noun.",
                    "sid": 91,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: keberhasilan (ke+ber+hasil+an).",
                    "sid": 92,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this example, the word hasil is a noun.",
                    "sid": 93,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After merging with keber-an, the resulting word is also a noun.",
                    "sid": 94,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• stem(verb, noun or adjective)+ i 7 Verb.",
                    "sid": 95,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ex­ ample: terangi (terang+i).",
                    "sid": 96,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this example, the word terang is an adjective.",
                    "sid": 97,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After merging with -i, the resulting word is a verb.",
                    "sid": 98,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last three classes, which belong to the category of nonconcatenative morphology, are the morpho­ tactic rules for full reduplication, partial reduplica­ tion, and affixed reduplication.",
                    "sid": 99,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some example cases that belong to these three classes are as fol­ lows: • Full reduplication without affixation.",
                    "sid": 100,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: bukubuku.",
                    "sid": 101,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this example, the word buku­ buku, which is a noun, is generated from the word buku, which is also a noun.",
                    "sid": 102,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Full reduplication with ke-an.",
                    "sid": 103,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This case has the following rule: reduplication of (ke+stem (bare verb, adjective or etc)+an) 7 Noun.",
                    "sid": 104,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: kekayaankekayaan (reduplication of ke+kaya+an).",
                    "sid": 105,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this example, the word kaya is an adjective.",
                    "sid": 106,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After the morphological proc­ ess, the resulting word is a noun.",
                    "sid": 107,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Partial reduplication with ber-.",
                    "sid": 108,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This case has the following rule: ber+ reduplicated stem (bare verb) 7 Verb.",
                    "sid": 109,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: berlarilari (ber+larilari).",
                    "sid": 110,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this example, the word lari is a verb.",
                    "sid": 111,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After the morphological process, the resulting word is also a verb.",
                    "sid": 112,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Affixed reduplication with meN-.",
                    "sid": 113,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This case has the following rule: stem (bare verb) +meN+stem (bare verb) 7 Verb.",
                    "sid": 114,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: tanammenanam (tanam-meN+tanam).",
                    "sid": 115,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this example, the word tanam is a verb.",
                    "sid": 116,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After the process, the resulting word is also a verb.",
                    "sid": 117,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During the stage of morphotactic rules, there are several steps that must be followed in order to complete the process.",
                    "sid": 118,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Those steps include the addi­ tion of prefixes and preprefixes, the addition of stems and part-of-speech, the addition of suffixes, and the final processing of additional tags.",
                    "sid": 119,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After finishing all of these steps, the process moves on to the morphophonemic process.",
                    "sid": 120,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.4 Morphophonemic rules.",
                    "sid": 121,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the rules that define how two or more mor­ phemes can merge have been designed in morpho­ tactic rules.",
                    "sid": 122,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the merging process is still not completed; hence we still have to define what changes have to be made after these morphemes merge.",
                    "sid": 123,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For these issues, we define morphophone­ mic rules that defme the phonetic changes that oc­ cur.",
                    "sid": 124,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Indonesian, these rules can generally be di­ vided into two groups.",
                    "sid": 125,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first group consists of four rules that model the phonetic changes in stems, whereas the second group consists of seven rules that model the phonetic changes in affixes.",
                    "sid": 126,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on (Alwi et al., 2003), the four rules in the first group are: • /k/ replacement with /ng/ if the word starts with meN- or peN-.",
                    "sid": 127,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: meN+kantuk 7 mengantuk.",
                    "sid": 128,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Is/ replacement with /ny/ if the word starts with meN- or peN-.",
                    "sid": 129,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: peN+sebaran 7 pen­ yebaran.",
                    "sid": 130,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• /pi replacement with lm/ if the word starts with meN- or peN-.",
                    "sid": 131,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: peN+pakai 7 pe­ makai.",
                    "sid": 132,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• It/ replacement with In/ if the word starts with meN- or peN-.",
                    "sid": 133,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: meN+tertawakan 7 menertawakan.",
                    "sid": 134,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the rules above only change the stem­ initial segment.",
                    "sid": 135,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To complete the replacement processes, the following seven rules from the sec­ ond group are needed to get the correct prefix forms: • IN/ deletion if meN- is followed by Ill, /m/, In/, lr/, ly/, lw/, It/, Is/, /pi, /k/ or if there is peN­ followed by Ill, /m/, In/, /r/, /d/, /w/, It/, Is/, /pi, /k/.",
                    "sid": 136,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: meN+lukis 7 melukis.",
                    "sid": 137,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• /r/ deletion if there is ber-, ter-, or per- fol­ lowed by lr/ or the word that its first syllable ended with /er/.",
                    "sid": 138,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: ber+runding 7 berunding.",
                    "sid": 139,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• IN/ replacement with In/ if there is meN- fol­ lowed by /d/, lei, /j/, /sy/ or there is peN- fol­ lowed by /d/, lei, /j/.",
                    "sid": 140,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: peN+jual 7 penjual.",
                    "sid": 141,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• IN/ replacement with /m/ if there is meN- or peN- followed by /b/, /fl.",
                    "sid": 142,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: peN+buru 7 pemburu.",
                    "sid": 143,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• IN/ replacement with /nge/ if there is meN- fol­ lowed by a word that has only one syllable.",
                    "sid": 144,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: meN+rem 7 mengerem.",
                    "sid": 145,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• IN/ replacement with Ill if there is peN- fol­ lowed by the word ajar.",
                    "sid": 146,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: peN+ajar 7 pelajar.",
                    "sid": 147,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• /r/ replacement with Ill if there is ber- followed by the word ajar.",
                    "sid": 148,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example: ber+ajar 7 bela­ jar.",
                    "sid": 149,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After all sub-processes invoked by the rules in the frrst group and the second group are parallel ized, then the whole morphophonemic process is finished.",
                    "sid": 150,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The design of morphophonemic rules for redu­ plication is very much the same as the one in af­ fixation, since basically the morphophonemic process in reduplication occurs in the affixation part of reduplication.",
                    "sid": 151,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, several rules, in particular those that model morphophonemic processes where both af­ fix and stem undergo changes, had to be revised to account for their behaviour when applied to redu­ plicated forms.",
                    "sid": 152,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the morphophonemic rules '/k/ replacement with lng/' and 'IN/ deletion', which work in tandem, were originally defmed as '/k/ deletion' and 'IN/ replacement with /ng/' . However, this approach would not have worked for cases involving reduplication.",
                    "sid": 153,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the word mengotakngotakkan will not be analysed properly if the morphological analyser uses the rules '/k/ deletion' and 'IN/ replacement with /ng/'.",
                    "sid": 154,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word mengotakngotakkan is generated from the stem kotak that is modified with affixed redu­ plication meN-kan. If '/k/ deletion' and 'IN/ re­ placement with /ng/' are being used, the word will become mengotakotakkan which is not valid.",
                    "sid": 155,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is why, for the sake of reduplication, the rule is changed to '/k/ replacement with /ng/' that is paral­ lelized with 'IN/ deletion'.",
                    "sid": 156,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, mengo­ takngotakkan can be properly generated.",
                    "sid": 157,
                    "ssid": 104,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "implementation. ",
            "number": "5",
            "sents": [
                {
                    "text": "This Indonesian morphological analyser is imple­ mented in xfst and lexc (Beesley & Karttunen, 2003).",
                    "sid": 158,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The morphotactic rules are implemented in xfst while morphophonemic rules are imple­ mented in lexc.",
                    "sid": 159,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Morphotactic rules implementation.",
                    "sid": 160,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The morphotactic rules can be illustrated as the fmite-state automata shown in Figure 1.",
                    "sid": 161,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Valid In­ donesian words, i.e. those that are constructed through legal morphological processes, are ac­ cepted by the automata, whereas invalid words are rejected.",
                    "sid": 162,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Starting from the root, each state defmes the next possible state whilst emitting (or consuming) a certain symbol.",
                    "sid": 163,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In lexc, these states are called continuation classes.",
                    "sid": 164,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All continuation classes reachable from the root represent prefixes and pre­ prefixes.",
                    "sid": 165,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distinction between the two is neces­ sary to encode the possible morphological varia­ tions that take two prefixes, e.g. memper-, diper-.",
                    "sid": 166,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From there, the next continuation class is the stem, where the root word is emitted or consumed.",
                    "sid": 167,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is subsequently followed by several classes repre­ senting possible suffixes, but there are also Redupl and Redup2 classes that appear before and after the suffixes.",
                    "sid": 168,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their function is to handle reduplication (Section 5.3).",
                    "sid": 169,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lastly, the TagEmit class processes Suffix classes Figure 1.",
                    "sid": 170,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Illustration of Process Flow all tags not yet handled by preceding classes (Sec­ tion 4.2).",
                    "sid": 171,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Throughout this morphotactic process, we ex­ tensively employ flag diacritics, a crucial feature of lexc which approximates the power of feature structures, i.e. being able to specify certain con­ straints to ensure that only valid paths of the net­ work may be traversed.",
                    "sid": 172,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One benefit of this ap­ proach is the maintenance of a compact network representation.",
                    "sid": 173,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are three flag diacritics used in our model: positive setting (@P.feat.val@), required test (@R . feat .val@), and disallow test (@D.feat.val@).",
                    "sid": 174,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using these diacritics, we are able to stipulate values and constraints of certain aspects, which must be consistent throughout a path.",
                    "sid": 175,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the prefix meN- may combine with the suffix -kan and -i, but not -an.",
                    "sid": 176,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can repre­ sent this with a feature, e.g. PREF, which is set to meN at the appropriate (pre)prefix state (@P.PREF.meN@).",
                    "sid": 177,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suitable tests are then added to the suffix states, e.g. if the current path went through the meN- prefix state, @R . PREF .meN@ stipulates that a suffix can be applied, whereas @D. PREF.",
                    "sid": 178,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "meN@ prevents a suffix from being ap­ plied.",
                    "sid": 179,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To further exhibit the usage of flag diacritics in our morphological analyser, we provide an exam­ ple of analysing the word memukuli, which con­ sists of the prefix meN-, followed by the stem pu kul, and the suffix -i.",
                    "sid": 180,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows the path through the network used to analyse this word.",
                    "sid": 181,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Starting from the root, the analyser parses the prefix meN- in memukuli and appropriately sets the flag diacritic for the feature PREF.",
                    "sid": 182,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be seen by the following lexc rule snippet: LEXICON PrefixMeN <[0 .x. me '\"\"N\"] \"@P.PREF.meN@\"> Stems; The LEXICON PrefixMeN line defines the state in the network that represents the meN- prefix.",
                    "sid": 183,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The next line defmes a state transition where, by emit­ ting or consuming the meN- prefix, the analyser can proceed to the stems continuation class.",
                    "sid": 184,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Addi­ tionally, the PREF flag is set to meN.",
                    "sid": 185,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In reality, the PrefixMeN state has five other possible transitions, but they are not presented here.",
                    "sid": 186,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subsequently, at the Stems state, the analyser positively sets the flag diacritic for the feature STEM with value verb.",
                    "sid": 187,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Various required and disal­ low test flags will be called at the Redupl, Suffix!, Redup2, and TagEmit stages.",
                    "sid": 188,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, for now, we focus on the Suffix!",
                    "sid": 189,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "state, detailed in the fol­ lowing lexc rule snippet: LEXICON Suffix!",
                    "sid": 190,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "<\"+Verb\":i \"+AV\":O \"@D.PREPREF@\" \"@D.REDUP@\" [\"@R.STEM.Vrb@\"I \"@R.STEM.Nom@\"I\"@R.STEM.Adj@\"] \"@R.PREF.meN@\" \"@P.SUFF.i@\"> Redup2; Suffix classes Figure 2.",
                    "sid": 191,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The path for memukuli This rule represents a valid transition from the suffixi state to the Redup2 state by parsing the -i suffix and emitting the +VERB and +Av tags (\"+Verb\" :i \"+AV\" :o).",
                    "sid": 192,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, the diacritic tests \"@D . PREPREF@ \" and \" @D .REDUP@ \" stipulate that this transition can only be taken if the PREPREF and REDUP flags are not set, the disjunction [\"@R .STEM .Vrb@\"I\"@R .STEM .Nom@\"I\"@R .STEM .A dj@ \"1 states that the STEM flag must be either Vrb, Nom, or Adj, and the \"@R . PREF.meN@\" test requires that the PREF flag is set to meN.",
                    "sid": 193,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, \"@ p .SUFF.",
                    "sid": 194,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "i@ \" states that the SUFF flag is set to i. Should any of these tests fail, the transition cannot be taken.",
                    "sid": 195,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If no other alternative paths are available to reach the End state, the word is rejected.",
                    "sid": 196,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Reduplication Process.",
                    "sid": 197,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As discussed above in Sections 2 and 4, Indonesian morphology includes the non-concatenative proc­ ess of reduplication.",
                    "sid": 198,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Handling this with pure regu­ lar grammars as implemented by finite state auto­ mata is very difficult.",
                    "sid": 199,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we employ the com­ pile-replace feature in xfst (Beesley & Karttunen, 2000).",
                    "sid": 200,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This feature allows the repetition of arbi­ trarily complex sublanguages by specifying the brackets '\"'[ \" and \"A 1 \" to mark the domain of re­ duplication.",
                    "sid": 201,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The right bracket is also augmented with A2 to indicate duplication; thus, the full anno­ tation is nA[\" and nA2A1\" . Given this network defmition, xfst compiles and post-processes these annotations to produce a new network where the appropriate reduplications have been carried out.",
                    "sid": 202,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, nA [bukuA2AJ\" would eventually be compiled to become bukubuku.",
                    "sid": 203,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the idea is to insert the \"A [ \" and \"A 2 A 1 \" annotations in the right places.",
                    "sid": 204,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the various types of reduplication in Indonesian (see Section 2), the rules for reduplication can be found at the Re­ dup (pre)prefix state and the Redupl and Redup2 states.",
                    "sid": 205,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Redup prefix state emits the opening \"A [ \" brackets and sets an appropriate flag as a reminder that the closing brackets are required.",
                    "sid": 206,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Redupl state is responsible for closing partial and affixed reduplications, i.e. where the suffix is not included in the reduplication, whilst the Redup2 state is responsible for closing full reduplication, i.e. where the suffix is part of the reduplication process.",
                    "sid": 207,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both Redupl and Redup2 states check for the value of the REDUP flag as set by the Redup pre­ fix state.",
                    "sid": 208,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.3 Morphophonemic rules implementation.",
                    "sid": 209,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The full transducer composes the morphotactic and morphophonemic rules.",
                    "sid": 210,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, the output of the morphotactic rules implementation serves as the input to the morphophonemic rules implemen­ tation.",
                    "sid": 211,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the example in Section 5.1 regarding the implementation of morphotactic rules, it can be observed that the string me/\\Npukuli has been pro­ duced.",
                    "sid": 212,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the morphological analysis proc­ ess is still incomplete since me/\\Npukuli is not a valid word in Indonesian.",
                    "sid": 213,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to complete the process, the morphophonemic rules must be im­ plemented.",
                    "sid": 214,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the full transducer composes the morphotactic and morphophonemic rules, the word me/\\Npukuli becomes the input for the morphopho­ nemic process.",
                    "sid": 215,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The implementation of morphophonemic rules differs slightly from the implementation of mor­ photactic rules.",
                    "sid": 216,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For morphotactic rules, there are several steps that can be illustrated as a flow of process.",
                    "sid": 217,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the implementation of morpho­ phonemic rules generally implies the rules itself.",
                    "sid": 218,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each rule is defined as a replacement rule that will collaborate with other rules through composition or parallelization.",
                    "sid": 219,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All rules in Section 4.4 have been implemented.",
                    "sid": 220,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, due to space constraints, we will only explain the implementation of rule 'RG4 ', which encodes IN/ deletion parallelized with four pho­ netic stem changes: define RG4 %A N->OII [m el [p e] ]_\"lbrac es\"* [llml nl r l y lw l t l s l p lkJ \" t->n I I [m IPI e %AN \"lbra c es \"* _ \" p->m l l [m l pl e %\"'N 11 1braces11 * _ u s->n y II [ml pJ e % AN \"lbraces\"* _\" k->n g II [ml pl e % AN 11 1braces11 * _; ! push define d RG4; This rule actually consists of five rules that are parallelized.",
                    "sid": 221,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first rule is IN/ deletion, where the nasal symbol fAN/ is omitted if it is preceded by /mel or !pel and followed by either of the pho­ nemes Ill, /m/, In/, /r/, /y/, /w/, It/, Is/, /pi, or /k/.",
                    "sid": 222,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The next four rules are the phonetic stem changes, which apply to stem words preceded by the morpheme lme/\\N/ or /pe/\\N/ , and whose initial phoneme is one of It/, /pi, lr/, Is/ , or /k/.",
                    "sid": 223,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More spe­ cifically, the phoneme It/ will transform into In/, /pi will transform into /m/, Is/ will transform into /ny/, and finally the phoneme /k/ will transform into /ng/.",
                    "sid": 224,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All morphophonemic rules that implement the various processes are composed into one large rule, from which the morphophonemic transducer net­ work can be constructed.",
                    "sid": 225,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The morphophonemic rule that applies to the word me'Npukuli used as an example in Section 5.1 would be the above \"IN!",
                    "sid": 226,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "deletion parallelized with four phonetic stem changes\", because the word me1'Npukuli fulfils the requirements of that rule.",
                    "sid": 227,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As can be seen from the implementation, to get the \"IN!",
                    "sid": 228,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "deletion process\" and \"/p/ replacement with /m/ process\" (\"/pi replacement with lm/ proc­ ess\" is one of those four phonetic rules), in that word there must appear the phoneme fAN/ preceded by /mel or !pel and followed by phoneme Ill, lm/, In/, /r/, !y/, !w/, It/, Is/, !pi, or !kl and it also must have the phoneme It/, /pi, /r/, Is/, or /k/ preceded by the morpheme /meAN/ or lpeANf.",
                    "sid": 229,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the word me'Npukuli fulfils these requirements, fAN/ will be omitted and /p/ will transform into /m/ so that the word me'Npukuli will transform into the word memukuli.",
                    "sid": 230,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the word memukuli being gener­ ated, the process is finished and the word memu­ kuli is recognised as a valid word in Indonesian.",
                    "sid": 231,
                    "ssid": 74,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "evaluation. ",
            "number": "6",
            "sents": [
                {
                    "text": "To assess our implemented system, we ran some test cases in the form of words extracted from an electronic version of the Kamus Besar Bahasa Indonesia 3 • We tested the implementations of the morphotactic and morphophonemic rules separately.",
                    "sid": 232,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To evaluate the ability of the analyser to both accept valid forms and reject invalid forms, the test cases included both valid and invalid morpheme combinations.",
                    "sid": 233,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Executing all of the test cases, we obtained the results shown in Table 1, which presents the results of morphotactic test cases, and Table 2, which presents the results of morphophonemic test cases.",
                    "sid": 234,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 'Analysis' column displays the results of test cases where the surface form of an Indonesian word was provided as input, and our system was tasked with parsing the morphological structure.",
                    "sid": 235,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, given the word memukul, our system should return pukul+VERB+Av.",
                    "sid": 236,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, the 'Synthesis' column concerns the opposite situation, i.e. test cases where the input is the string of morphological tags, and our system was tasked with generating the fully inflected form.",
                    "sid": 237,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 http://www.pusatbahasa.diknas.go.id/kbbi R e s u l t An aly sis Sy nth esi s T o t a l 1.",
                    "sid": 238,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Co rre ct res ult 1 0 3 4 3 1 4 6 2 . S e v e r a l r e s u l t s , i n c l u d i n l ! c o r r e c t 4 6 1 0 6 1 5 2 3.",
                    "sid": 239,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inc orr ect res ult 3 3 6 To tal 1 5 2 1 5 2 3 0 8 Table 1.",
                    "sid": 240,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results of morphotactic test cases Table 2.",
                    "sid": 241,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results ofmorphophoneimc test cases We classify the test case results into three cate­ gories.",
                    "sid": 242,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first category indicates that our system returned exactly one correct analysis or synthesis for a valid test case, or does not produce anything for an invalid test case.",
                    "sid": 243,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second category is that, when given a valid test case, the system produces several answers, one of which is the desired result.",
                    "sid": 244,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the last category is seen when the system fails to analyse or synthesize a valid test case, or incorrectly produces an answer for an invalid test case.",
                    "sid": 245,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the tables, we can observe that the results for analysis are more accurate than for synthesis, where the system tends to produce more than one result.",
                    "sid": 246,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, our system correctly provides the single analysis for memukul.",
                    "sid": 247,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, when trying to synthesize pukul+VERB+Av, it produces other alternatives, e.g. memukulkan, memperpukuli, mengepukulkan, etc. This suggests the need for a more refined set of morphological feature tags.",
                    "sid": 248,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "summary. ",
            "number": "7",
            "sents": [
                {
                    "text": "We have presented the design of an Indonesian morphological analyser that provides a detailed analysis of its rich affixation process using the two-level morphology approach, implemented us­ ing xfst and lexc.",
                    "sid": 249,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach is able to handle reduplication, a non-concatenative morphological process.",
                    "sid": 250,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our (not very rigorous) evaluation shows that the implementation is generally able to encode the rules of the various morphological processes.",
                    "sid": 251,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}