{
    "ID": "PS15684-W09",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Paraphrase Extraction involves the discovery of equivalent text segments from large corpora and ﬁnds application in tasks such as multi-document summarization and document clustering.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantic similarity identiﬁcation is a challenging problem which is further compounded by the large size of the corpus.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper a two- stage approach which involves clustering followed by Paraphrase Recognition has been proposed for extraction of sentence-level paraphrases from text collections.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to handle the ambiguity and inherent variability of natural language a fuzzy hierarchical clustering approach which combines agglomeration based on verbs and division on nouns has been used.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentences within each resultant cluster are then processed by a machine-learning based Paraphrase Recognizer to discover the paraphrases.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two-stage approach has been applied on the Microsoft Research Paraphrase Corpus and a subset of the Microsoft Research Video Description Corpus.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance has been evaluated against an existing k-means clustering approach as well as cosine-similarity technique and Fuzzy C-Means clustering and the two- stage system has consistently demonstrated better performance.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "©2015 Elsevier B.V. All rights reserved.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Vast amounts of natural language text are available on the web as well as in large-scale repositories; much of which is redundant.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The task of Paraphrase Extraction focuses on identiﬁcation of text units which convey the same meaning.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The detection of similar text is complicated due to the rich variability of natural languages.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The large scale of the corpora is another factor which poses hurdles in Paraphrase Extraction.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performing one-on-one matching of sentences is practically ruled out, even if it is assumed that a suitable Paraphrase Recognition system is available.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, efﬁcient techniques are required to identify possibly similar candidates from large scale corpora and then subject them to further processing to detect exact matches.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An effective Paraphrase Extraction system will beneﬁt various Natural Language Processing applications such as multi-document summarization, plagiarism detection, question answering and document clustering.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The signiﬁcant aspect of this work is that a novel two-level fuzzy clustering technique has been proposed for sentence-level Paraphrase Extraction.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As similar sentences tend to describe the same or similar actions, Fuzzy Agglomerative Clustering based on verbs ∗ Corresponding author.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tel.: +91 9443760000.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Email addresses: ctr.psg@gmail.co (A. Chitra), anupriya rajkumar@yahoo.co.in (A. Rajkumar).",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 Tel.: +91 9843222273..",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is performed initially.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Divisive clustering is then applied to identify subgroups of sentences which center on the same nouns.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Support Vector Machine (SVM) based Paraphrase Recognizer is then used to identify the paraphrases within each cluster.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of the Paraphrase Extraction system has been evaluated using the Microsoft Research Paraphrase Corpus (MSRPC) and a subset of the Microsoft Research Video Description Corpus (MSRVDC).",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The outline of the paper is as follows: Section 2 contains an overview of previous work related to Paraphrase Extraction and Hierarchical Clustering.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 describes the methodology adopted for extracting paraphrases using a fuzzy hierarchical clustering approach and machine learning based Paraphrase Recognizer.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 presents the results of experiments conducted using two different corpora.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Possible directions for future work and applications are discussed in Section 5, which concludes the paper.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "The task of Paraphrase Extraction or acquisition aims at extracting paraphrases from a given corpus.",
                    "sid": 29,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several approaches exploit Harris’s distributional hypothesis which states that words in similar contexts tend to have same meanings [1].",
                    "sid": 30,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bhagat and Ravichandran [2] have used this approach to extract phrase level entities, by constructing a feature vector for each phrase based on its context and computing the cosine similarity between the feature vectors of phrases.",
                    "sid": 31,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Metzler and Hovy [3] have deployed the http://dx.doi.org/10.1016/j.asoc.2015.05.017 15684946/© 2015 Elsevier B.V. All rights reserved.",
                    "sid": 32,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "distributional hypothesis in a Hadoop-based framework to operate on large-scale corpora.",
                    "sid": 33,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bootstrapping methods rely on seed patterns for acquiring paraphrases.",
                    "sid": 34,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Szpektor et al. have used terms from a domain-speciﬁc lexicon and coupled these with frequently co-occurring noun phrases to form seed slots and have then extracted templates [4].",
                    "sid": 35,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Regneri et al. have extracted phrase level paraphrases from similar sentence pairs by assigning semantic role labels and then locating equivalent arguments or anchors.",
                    "sid": 36,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dependency parse of the sentences has then been used to group anchors with their corresponding predicates, yielding matched predicate argument structures which were then extended to extract equivalent phrases [5].",
                    "sid": 37,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Barzilay and Lee (2003) have applied hierarchical complete-link clustering to cluster the sentences describing the same type of event [6].",
                    "sid": 38,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentence level paraphrases were discovered by applying multiple sequence alignment on pairs of sentences from each cluster.",
                    "sid": 39,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A similar sequence alignment technique has been employed by Regneri and Wang [7] to ﬁrst extract sentence-level paraphrases and then phrase-level paraphrases.",
                    "sid": 40,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yan et al. [8] have extracted multilingual phrasal paraphrases by aligning deﬁnition sentences extracted from Wikipedia articles.",
                    "sid": 41,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A minimally supervised approach was then used to extract paraphrases by computing global and local similarity measures between phrasal pairs from the aligned sentences.",
                    "sid": 42,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Wubben et al. have compared Clustering against pairwise matching for extracting paraphrases from news corpora [9].",
                    "sid": 43,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A k-means clustering approach was used to subdivide already existing clusters of headlines.",
                    "sid": 44,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentence-level paraphrases were then extracted by matching all possible sentence pairs within each cluster.",
                    "sid": 45,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Traditional clustering algorithms create a hard partitioning of data in which each object is assigned to only one cluster.",
                    "sid": 46,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fuzzy clustering is an alternate, wherein a soft partition is constructed with each object belonging to multiple clusters with different degrees of membership.",
                    "sid": 47,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two popular variants of fuzzy clustering are Fuzzy C-Means and fuzzy hierarchical approach.",
                    "sid": 48,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Fuzzy C-Means approach is a fuzzy variant of the original k-means partitioning approach and is limited by the necessity of specifying ‘c’; though techniques for automatically detecting ‘c’ exist, they become infeasible in large corpora.",
                    "sid": 49,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hierarchical clustering methods operate on the inter-cluster similarity matrix.",
                    "sid": 50,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bank and Schwenker [10] have proposed a fuzzi- ﬁed version of the agglomerative algorithm where, on merging Ci and Cj to create Cij , only the similarity value Sij is set to zero and the remaining values corresponding to the clusters Ci and Cj are retained.",
                    "sid": 51,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This permits the clusters Ci and Cj to take part in subsequent mergers.",
                    "sid": 52,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When a cluster is a part of several parent clusters, normalized membership values are assigned.",
                    "sid": 53,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rodrigues et al. [11] have proposed an Online Divisive Agglomerative Clustering where a semi-fuzzy approach has been used for assigning objects to clusters by computing the distance between the object and the candidate clusters during division.",
                    "sid": 54,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the computed distance is greater than the Hoeffding bound, the object is assigned to the corresponding cluster otherwise it is assigned to multiple clusters.",
                    "sid": 55,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DiazValenzuela et al. [12] have developed a fuzzy hierarchical clustering technique which works in a semi-supervised fashion for classifying scientiﬁc publications.",
                    "sid": 56,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The method outperforms the unsupervised approach but requires instance-level constraints to be speciﬁed to determine the optimal ex-cut of the dendrograms produced by hierarchical clustering.",
                    "sid": 57,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clustering of sentences is a common task which ﬁnds several applications.",
                    "sid": 58,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Seno and Nunes [13] have used an incremental approach for clustering sentences from multiple documents belonging to Portuguese language.",
                    "sid": 59,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ﬁrst cluster was created with the ﬁrst sentence, and each subsequent sentence was either added to an existing cluster based on cosine similarity and word overlap measures or assigned to a new cluster.",
                    "sid": 60,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Khoury has proposed a sentence clustering approach based on Parts-Of-Speech (POS) information [14].",
                    "sid": 61,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A POS hierarchy has been used to compute the distance between two words or POS based on which existing clusters are split.",
                    "sid": 62,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fuzzy approaches have been previously applied to both document clustering as well as sentence clustering.",
                    "sid": 63,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rodrigues and Sacks [15] have proposed Hierarchical Hyper-spherical Fuzzy C- Means (H2FCM) approach for clustering documents which uses cosine similarity for forming hyper-spherical clusters that are then merged.",
                    "sid": 64,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Skabar and Abdalgader [16] have proposed a fuzzy cluster ing algorithm for relational data termed as FRECCA, where sentence similarity values are used rather than the vector space representation of the sentences and expectation maximization has been used to determine cluster memberships.",
                    "sid": 65,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Wazarkar and Manjrekar have proposed an extension of the FRECCA approach which forms hierarchical clusters by using a divisive clustering approach [17].",
                    "sid": 66,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From a study of related literature it has been concluded that, of the approaches applied for Paraphrase Extraction, the alignment approach is better suited for the extraction of sentence level paraphrases.",
                    "sid": 67,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Applying alignment approach directly on a large corpus is infeasible.",
                    "sid": 68,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence it is better to ﬁrst apply clustering and then match sentences within the cluster.",
                    "sid": 69,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fuzzy clustering approach is more applicable to natural language input than crisp approaches.",
                    "sid": 70,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Likewise hierarchical clustering approach which automatically establishes the number of clusters using thresholds on the similarity metric and also supports incremental clustering is better than partitioning approaches.",
                    "sid": 71,
                    "ssid": 43,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "fuzzy clustering for paraphrase extraction. ",
            "number": "3",
            "sents": [
                {
                    "text": "In this work, Paraphrase Extraction is performed in two stages: fuzzy hierarchical clustering stage which focuses on grouping similar sentences followed by Paraphrase Recognition applied on each pair of sentences within a cluster.",
                    "sid": 72,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since a sentence may describe multiple events and involve several entities and can therefore be placed within multiple clusters, fuzzy clustering approach has been preferred.",
                    "sid": 73,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, since the number of clusters is not known the hierarchical clustering technique has been used.",
                    "sid": 74,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The process of fuzzy hierarchical clustering shown in Fig.",
                    "sid": 75,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 consists of the following steps: • Sentences from the corpus are subject to pre-processing where Parts-Of Speech tags are assigned.",
                    "sid": 76,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• All sentences which contain the same verb are clustered together.",
                    "sid": 77,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These clusters are then merged based on the similarity between the verbs.• Divisive clustering is then used to split the clusters into sub clusters, such that each sub-cluster relates to the same/similar set of nouns.",
                    "sid": 78,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second stage of the Paraphrase Extraction process, a Paraphrase Recognizer is used to identify the paraphrases within each cluster as shown in Fig.",
                    "sid": 79,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 80,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Various lexical, syntactic and semantic features are extracted from pairs of sentences and an SVM classi- ﬁer uses these features to classify each pair as positive or negative cases of Paraphrasing.",
                    "sid": 81,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The positive pairs are grouped together due to the transitive nature of paraphrases, to produce the output which consists of a collection of sentence-level paraphrases.",
                    "sid": 82,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1.",
                    "sid": 83,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preprocessing.",
                    "sid": 84,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During preprocessing, each sentence is assigned a unique identi- ﬁer.",
                    "sid": 85,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the clustering process is centered on the verbs and nouns within each sentence, the words of each sentence are assigned POS tags using the Tree Tagger developed by Helmut Schmidt [18].",
                    "sid": 86,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Corpus Pre-processing Sentences Fuzzy Agglomerative Clustering on Verbs Cluster 1 (C1) Cluster 2 (C2) Cluster n (Cn) Fuzzy Divisive Clustering on Nouns Fuzzy Divisive Clustering on Nouns Fuzzy Divisive Clustering on Nouns C1 -Sub Clusters C2 -Sub Clusters Cn -Sub Clusters Fig.",
                    "sid": 87,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 88,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fuzzy hierarchical clustering for Paraphrase Extraction.",
                    "sid": 89,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sub-Cluster Pair of Feature Extraction SVM Classifier Features Paraphrases Group Formation Collection of Paraphrases Sentences Fig.",
                    "sid": 90,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 91,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Collecting paraphrases using a Paraphrase Recognizer.",
                    "sid": 92,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tree Tagger uses Probabilistic tagging to assign POS tags based on the Penn Treebank tagset [19] and also identiﬁes the root form or lemma for each word of the sentence.",
                    "sid": 93,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2.",
                    "sid": 94,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fuzzy agglomerative clustering based on verbs.",
                    "sid": 95,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to cluster the sentences, a two-stage approach has been used.",
                    "sid": 96,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the ﬁrst stage fuzzy agglomerative clustering based on verbs has been carried out due to the following reasons: • Due to the ambiguous nature of natural language input, fuzzy clustering is better suited than crisp techniques.",
                    "sid": 97,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Partitioning based approaches require the number of clusters to be prespeciﬁed; therefore a hierarchical clustering approach has been preferred.",
                    "sid": 98,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Typically in a large-scale corpus, several sentences focus on same or similar actions.",
                    "sid": 99,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence sentences involving same verbs are ﬁrst placed in the same cluster, these clusters are then merged depending on the similarity between the verbs.",
                    "sid": 100,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Ability to handle incremental data; new sentences can be added to the most similar cluster during any stage of the clustering process.",
                    "sid": 101,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The process of fuzzy agglomerative clustering on verbs starts with initial cluster formation, followed by grouping and merging of clusters.",
                    "sid": 102,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The grouping and merging steps are repeatedly carried out, until no further merging is possible.",
                    "sid": 103,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm has been given in Fig.",
                    "sid": 104,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 105,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2.1.",
                    "sid": 106,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initial cluster formation A fuzzy clustering of the sentences is initially established by placing each sentence in as many clusters as there are verbs.",
                    "sid": 107,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To prevent the formation of generic clusters, the process targets only main verbs and ignores auxiliary verbs.",
                    "sid": 108,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentences which do not contain a main verb are placed in the ﬁrst cluster with a membership value of 1.",
                    "sid": 109,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In case multiple verbs are present, sentence i has to be placed in the corresponding clusters – j, with a membership value as follows: 1 J-ij = number of main verbs in sentence i (1) J-ik = 0 for all other clusters k (2) In order to create ﬁner clusters, Word Sense Disambiguation (WSD) can be used.",
                    "sid": 110,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The speciﬁc sense of the candidate verb is determined based on the context of the verb by using the Lesk disambiguation algorithm.",
                    "sid": 111,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The simpliﬁed version of the Lesk algorithm is used to determine the correct sense of a word, given its context [20,21].",
                    "sid": 112,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A target word may have multiple senses, each of which has a corresponding gloss or textual deﬁnition.",
                    "sid": 113,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sense whose gloss has the highest degree of word overlap with the context is chosen as the best sense of the word.",
                    "sid": 114,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, context refers to the sentence containing the target word.",
                    "sid": 115,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the absence of WSD, the default or most common sense is chosen for each word.",
                    "sid": 116,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In either case, the selected sense number is concatenated to the target verb to generate the cluster label.",
                    "sid": 117,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In case the cluster label matches any of the existing clusters, the sentence is placed in the matching cluster; otherwise a new cluster is created with the generated label and the sentence is added to it.",
                    "sid": 118,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pseudo-code for the simpliﬁed Lesk algorithm [21] is given in Fig.",
                    "sid": 119,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 120,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2.2.",
                    "sid": 121,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Grouping of clusters Once the clusters are formed, similar clusters will have to be combined.",
                    "sid": 122,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fuzzy agglomerative clustering approach used here differs from previous work with respect to the formation of overlapping fuzzy partitions or groups.",
                    "sid": 123,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each cluster is labeled with a representative verb and similarity between clusters is computed between their labels.",
                    "sid": 124,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Jiang–Conrath measure [22] which assesses the similarity between two words in terms of information content of the given words and their lowest common subsumer in the WordNet hierarchy as given in Eq.",
                    "sid": 125,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) has been used to compute the similarity.",
                    "sid": 126,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sim(w1 , w2 ) = 1 IC (w1 ) + IC (w2 ) − 2 ∗ IC (LCS) (3) In Eq.",
                    "sid": 127,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) LCS represents the Least Common Subsumer or lowest common ancestor for the two words w1 , w2 in the Wordnet hierarchy and IC represents the information content assessed using Eq.",
                    "sid": 128,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4).",
                    "sid": 129,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "IC (w) = − log P(w) (4) where P(w) is the probability of encountering an instance of word w in a large corpus.The traditional Centroid Clustering technique proceeds by iden tifying the pair of clusters which have greatest similarity and merges them; this, results in dendrograms with several levels as shown in Fig.",
                    "sid": 130,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5a.",
                    "sid": 131,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, a grouping strategy is utilized to Fig.",
                    "sid": 132,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 133,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Algorithm for Fuzzy Agglomerative Clustering based on verbs.",
                    "sid": 134,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fig.",
                    "sid": 135,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 136,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Simpliﬁed Lesk algorithm [21].",
                    "sid": 137,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ﬁrst identify all clusters which have a similarity greater than or equal to a prespeciﬁed threshold.",
                    "sid": 138,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initially each cluster Ci is placed in a group of its own.",
                    "sid": 139,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each group is then expanded, by including all other clusters whose similarity with Ci exceeds the threshold.",
                    "sid": 140,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Before merging, all subgroups, duplicate and singleton groups are removed from further consideration.",
                    "sid": 141,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The merging of multiple clusters in each step results in ﬂatter dendrograms as shown in Fig.",
                    "sid": 142,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5b.",
                    "sid": 143,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The similarity threshold imposed during merging has been chosen based on a study conducted using the benchmark verb dataset consisting of 130 verb pairs developed by Yang and Powers [23].",
                    "sid": 144,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Jiang–Conrath scores for word pairs in the categories ‘inseparably related’ and ‘strongly related’ were examined and it was concluded that 0.15 and 0.2 are suitable similarity threshold values.",
                    "sid": 145,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(a) P3 P2 P1 C4 C3 C1 C2 (b) P C1 C2 C3 C4 Fig.",
                    "sid": 146,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.",
                    "sid": 147,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(a) Binary merging of clusters.",
                    "sid": 148,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(b) Merging of multiple clusters.",
                    "sid": 149,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fig.",
                    "sid": 150,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.",
                    "sid": 151,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Algorithm for fuzzy divisive clustering based on nouns.",
                    "sid": 152,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2.3.",
                    "sid": 153,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Merging of clusters Once the clusters are grouped, the candidate clusters within each group have to be merged together by ﬁrst determining the parent verb for the representative verbs from each cluster.",
                    "sid": 154,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parent of two words in the WordNet hierarchy is the lowest common ancestor of the words in the WordNet hierarchy.",
                    "sid": 155,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This concept is extended to multiple candidates using the following steps: Step 1: Identify the Parent – P, or lowest common ancestor of the ﬁrst two candidate cluster labels.",
                    "sid": 156,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 2: For each subsequent candidate cluster label Li , determine the parent – Pi of P and Li . If no parent exists, which happens when the words may not be directly related, the process terminates.",
                    "sid": 157,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Step 3: Set P = Pi and repeat Step 2.",
                    "sid": 158,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If no parent verb can be identiﬁed the candidates within the group are not merged.",
                    "sid": 159,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a parent verb exists, and in case of WSD, the correct sense of the parent verb is determined by using the original Lesk algorithm [20].",
                    "sid": 160,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here instead of matching the target word and context, overlap is determined between each of the n senses of the parent and the best sense of each candidate verb.",
                    "sid": 161,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the absence of WSD, the default sense is used.",
                    "sid": 162,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the parent cluster happens to be any of the existing clusters, the candidate clusters are all attached as child clusters of the parent; if not a new parent cluster is created.",
                    "sid": 163,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When a child cluster Ci is added to a parent cluster Pj its membership is assigned according to Eq.",
                    "sid": 164,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5), using the method proposed by Bank and Schwenker [10]: sij J-Ci Pj = L p (5) where p represents all the parent clusters for the child cluster i, sij and sip are the Jiang–Conrath scores calculated between representative verbs of the child cluster and the parent cluster.",
                    "sid": 165,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The membership value for a sentence k of the child cluster i in parent cluster j is computed using Eq.",
                    "sid": 166,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(6).",
                    "sid": 167,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "J-kj = J-ki J-Ci Pj (6) After all groups have been processed, a new similarity matrix is constructed between the current set of cluster labels and the pro cess of grouping and merging clusters is repeated until no further groups are formed.",
                    "sid": 168,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This results when all similarity values are lesser than the speciﬁed threshold.",
                    "sid": 169,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3.",
                    "sid": 170,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fuzzy divisive clustering.",
                    "sid": 171,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The clusters formed by grouping sentences with the same or similar verbs are then divided such that all sentences within the same sub-cluster deal with the same or related nouns.",
                    "sid": 172,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fuzzy division is applied since a sentence may contain multiple nouns and C S5 S2 S6 S8 S1 S9 S4 S3 S7 S10 S11 Fig.",
                    "sid": 173,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.",
                    "sid": 174,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example of fuzzy divisive clustering.",
                    "sid": 175,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "may therefore belong to more than one cluster.",
                    "sid": 176,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm used is given in Fig.",
                    "sid": 177,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.",
                    "sid": 178,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The normalized noun similarity nsim, between every pair of sentences x and y, is computed as in Eq.",
                    "sid": 179,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(7).",
                    "sid": 180,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "nx and ny represent the number of nouns in the sentences x and y, respectively.",
                    "sid": 181,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Jiang–Conrath measure is used to compute the noun similarities.",
                    "sid": 182,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "nx max ny 1 {similarity(noun xi , noun xj )} nsimxy = ) j= x i=1 (7)These similarity values are used to create a partition of the sen tences within the cluster.",
                    "sid": 183,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A threshold value is used for controlling the division of clusters.",
                    "sid": 184,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The similarity scores for the Miller–Charles dataset [24] were used to identify suitable threshold values of 0.15 and 0.2.",
                    "sid": 185,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the next step the sentences are partitioned based on the threshold.",
                    "sid": 186,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A group is formed for each sentence, comprising of itself as well as other sentences which have a similarity greater than the threshold.",
                    "sid": 187,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Duplicate groups and subgroups are eliminated as before.",
                    "sid": 188,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In practice, when the number of sentences is high, different groups which have a high degree of overlap are formed.",
                    "sid": 189,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This, results in the presence of the same sentence in several groups, which ultimately increases processing time and reduces the advantage gained due to clustering of sentences.",
                    "sid": 190,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This problem is overcome by permitting a sentence to be a part of only two groups to which it is most similar to.",
                    "sid": 191,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Fig.",
                    "sid": 192,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7, the 11 sentences in Cluster C are split into four partitions: {S1, S2, S3, S4} {S5} {S2, S4, S6, S7, S8, S9} and {S8, S9, S10, S11}.",
                    "sid": 193,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentences S2, S4, S8 and S9 are placed within two groups.",
                    "sid": 194,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once groups are identiﬁed, the original cluster is split by creating child clusters and distributing the sentences according to the partitioning scheme.",
                    "sid": 195,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The membership value J-ij , of a sentence i in child cluster j, is computed using Eq.",
                    "sid": 196,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(8).",
                    "sid": 197,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "J- J-iC (8) ij = number of groups containing i where J-iC is the membership of the sentence in the original cluster C. Splitting of clusters can be continued recursively until all sentences within a cluster have a similarity not less than the given threshold.",
                    "sid": 198,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This continued splitting results in highly fragmented clusters and may produce several clusters with a single sentence.",
                    "sid": 199,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, in this work recursive splitting has not been applied.",
                    "sid": 200,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After divisive clustering, each cluster contains sentences with the same/similar nouns and verbs.",
                    "sid": 201,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4.",
                    "sid": 202,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paraphrase Recognition.",
                    "sid": 203,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second phase of Paraphrase Extraction, the sentences within each cluster must be processed to identify paraphrases.",
                    "sid": 204,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sentences which share the same verbs and nouns need not necessarily be paraphrases.",
                    "sid": 205,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore an SVM based Paraphrase Recognizer [25] has been used to identify the paraphrases within each cluster.",
                    "sid": 206,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of the existing approaches for Paraphrase Recognition, machine learning techniques, notably SVMs have achieved considerable success [1] by extracting various features from the input sentences.",
                    "sid": 207,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexical, syntactic and semantic features have been previously used both individually and in various combinations for detecting paraphrases [1,25].",
                    "sid": 208,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to extract only sentences which are very similar, the membership value of a sentence can be considered.",
                    "sid": 209,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A simple strategy would be to choose all sentences with membership greater than a threshold.",
                    "sid": 210,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A better tactic is to rank sentences by membership and choose only the top 50% as it avoids the usage of a threshold.",
                    "sid": 211,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4.1.",
                    "sid": 212,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lexical features The adapted BiLingual Evaluation Understudy (BLEU) precision and recall metrics [26] have been calculated by considering the extent of unigram match with respect to each of the input sentences.",
                    "sid": 213,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Skipgrams of a sentence can be formed by considering both contiguous and non-contiguous n-grams [27].",
                    "sid": 214,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Skipgram precision and recall have been computed by dividing the number of common skipgrams by total possible number of Skipgrams constructed from each of the input sentences.",
                    "sid": 215,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Longest Common Subsequence feature was evaluated by dividing the length of the longest common in-sequence portion by the length of the shorter sentence.",
                    "sid": 216,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4.2.",
                    "sid": 217,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic features Stanford Parser developed by Klein and Manning [28] was used to construct dependency trees which are syntactic representations of a sentence as shown in Fig.",
                    "sid": 218,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8.",
                    "sid": 219,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tree edit distance has been computed as the minimum number of operations required to transform one dependency tree into another [29].",
                    "sid": 220,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For every edge in a dependency tree a triple can be formed in terms of parent/headword, child/dependent and relationship between them.",
                    "sid": 221,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of shared triples between the sentences was divided by the number of triples in the ﬁrst and second sentence to obtain a pair of triple similarity measures [30].",
                    "sid": 222,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A total of 96 POSPER (Parts-Of-Speech Position independent word Error Rate) features [31] have been generated by taking into account the degree of matches and non-matches for each tag.",
                    "sid": 223,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4.3.",
                    "sid": 224,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantic features Four word similarity features have been evaluated by computing the Jiang–Conrath score between nouns, verbs, adverbs and adjectives.",
                    "sid": 225,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in [32], features which assess the extent of cardinal number and proper noun match have been used.",
                    "sid": 226,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additional negation features which consider the number of antonym occurrences as well as the presence of explicit negation terms have also been used.",
                    "sid": 227,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From earlier work carried out using a SVM classiﬁer on the MSRPC, it was observed that the choice of features has a significant effect on the performance of the Paraphrase Recognizer as shown in Table 1 [25].",
                    "sid": 228,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For discovering the best subset of features, Wrapper method of feature selection was employed by combining genetic algorithms with SVM classiﬁers.",
                    "sid": 229,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best performance was obtained using 57 features out of the original set of 114 features.",
                    "sid": 230,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The selected features include: • All ﬁve lexical features.",
                    "sid": 231,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Verb, adverb similarity and two of the negation features from the Semantic category.",
                    "sid": 232,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Dependency tree edit distance, triple similarity function from the syntactic category in addition to POSPER features corresponding to simple and comparative adjectives, singular and plural nouns, particles, modals, ‘be’ forms of the verb.",
                    "sid": 233,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After feature extraction, for classifying the input sentences as paraphrases, a SVM classiﬁer has been used.",
                    "sid": 234,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The LibSVM tool [33] has been used for performing SVM classiﬁcation.",
                    "sid": 235,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A nu-classiﬁcation scheme with a Radial Basis Kernel function was employed.",
                    "sid": 236,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classiﬁer model which yielded a high performance of 76.97% [25] on the test set of the MSRPC has been used for the current work.",
                    "sid": 237,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Candidate sentences extracted from each cluster are fed to the Paraphrase Recognizer and classiﬁed.",
                    "sid": 238,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With respect to the MSRVDC there are no annotations available on whether all the sentences describing the same video are paraphrases or not.",
                    "sid": 239,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the MSRPC is a standard corpora suitable for Paraphrase Recognition evaluation, in this work the classiﬁer model constructed from the MSRPC training set has been used for the MSRVDC also.",
                    "sid": 240,
                    "ssid": 169,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.5.",
                    "sid": 241,
                    "ssid": 170,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Grouping of paraphrases.",
                    "sid": 242,
                    "ssid": 171,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the objective of this work is to extract all the equivalent sentences within a cluster, once the Paraphrase Recognizer categorizes the sentences they must be collected together.",
                    "sid": 243,
                    "ssid": 172,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paraphrasing is transitive in nature, that is if A ⇔ B and B ⇔ C, then A ⇔ C. Hence a chaining model is used to group the paraphrases within a cluster.",
                    "sid": 244,
                    "ssid": 173,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results. ",
            "number": "4",
            "sents": [
                {
                    "text": "Some of the factors which inﬂuence the evaluation of Paraphrase Extraction systems are: • One-on-one comparison of Paraphrase Extraction systems may not be possible as the systems may work on different types of corpora and extract units of different sizes.",
                    "sid": 245,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• The systems may be evaluated either in a stand-alone manner or in the context of speciﬁc tasks such as information extraction, query expansion, etc. • The efﬁciency of the underlying Paraphrase Recognition system.",
                    "sid": 246,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best Paraphrase Recognition systems today have an accuracy of only 77% [1] which will deﬁnitely impact the task of Paraphrase Extraction.",
                    "sid": 247,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Availability of benchmark corpora is yet another challenge.",
                    "sid": 248,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Though there are a few large-scale sentence-level paraphrase collections such as the MSRVDC, annotating the entire corpus is difﬁcult.",
                    "sid": 249,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Choosing suitable evaluation metrics is another hurdle because of the difﬁculty in identifying set of all Positives and Negatives in large scale corpora.",
                    "sid": 250,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fuzzy hierarchical clustering approach has been implemented in Java and the WordNet electronic dictionary has been used as an additional resource.",
                    "sid": 251,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of the proposed approach has been evaluated on two different corpora: the MSRPC and the MSRVDC.",
                    "sid": 252,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The obtained results have been compared with that of the Paraphrase Acquisition system developed by Wubben et al. [9].",
                    "sid": 253,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1.",
                    "sid": 254,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation metrics.",
                    "sid": 255,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to two traditional Paraphrase Extraction evaluation measures – precision and relative-recall [2], clustering measures Burke said Mr landing nn(Burke3, Said-1) nn(Burke3, Mr2) nsubj(landing 8, it-4) cop(landing-8, be-5) det(landing-8, a-6) it be a textbook consider circumstance the nn(landing-8, textbook-7) dep(Burke3, landing-8) partmod(landing-8, consider-9) det(circumstance 11, the-10) dobj(consider-9, circumstance-11) Fig.",
                    "sid": 256,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8.",
                    "sid": 257,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dependency parse and triples for the sentence – “Mr Burke said it was a textbook landing considering the circumstances”.",
                    "sid": 258,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 Performance of Paraphrase Recognition system on MSRPC [25].",
                    "sid": 259,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Features Number of features Accuracy % Precision % Recall % F-Measure % Lexical 573.6 873.4 094.7 782.7 2 Syntactic 10 0 73 .3 3 74 .3 8 91 .3 7 82 .0 0 Se ma ntic 9 68 .4 1 69 .0 3 95 .2 0 80 .0 3 Lexi cal, POS PER, NV Sim, pro per nou n 10 4 75 .3 6 76 .2 91 .5 4 83 .1 7 All lexi cal, synt acti c and sem anti c feat ures exc ept card inal nu mb er mat ch 11 3 75 .5 8 79 .8 3 86 .5 9 83 .0 7 Fea ture s sele cted usin g GA SV M met hod 5 7 76 .9 7 80 .4 7 88 .0 9 84 .1 1 which are used to evaluate the goodness of clusters have also been used here.",
                    "sid": 260,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Precision is deﬁned as the number of true paraphrases out of the total number of sentences declared as paraphrases.",
                    "sid": 261,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is calculated using Eq.",
                    "sid": 262,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(9).",
                    "sid": 263,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Entropy of a cluster Ei is a measure of disorder and measures how the classes are distributed within a cluster [16].",
                    "sid": 264,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall entropy E is the weighted average of the individual cluster entropies.",
                    "sid": 265,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 |K | C K C K TP Precision = TP ( 9) FP Ei = − log |K | ) | i ∩ Kj j=1 j | log | i ∩ j | Kj (13) where TP refers to True Positives and FP stands for False Positives.",
                    "sid": 266,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the non-availability of decisions (paraphrase/non- paraphrase) for all the possible sentence pairs from the MSRPC, TP and FP are assessed only with respect to the annotated sentence 1 E = N |C | ) i=1 (|Ci | · Ei ) (14) pairs.",
                    "sid": 267,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other metric Relative Recall (RR) has been adapted from the Information Retrieval version [34] and assesses the recall of the current system S with respect to other systems as given in Eq.",
                    "sid": 268,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(10).",
                    "sid": 269,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This measure has been used due to limited information on all the possible relevant paraphrase pairs.",
                    "sid": 270,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Number of relevant pairs extracted by Sv-Measure focuses on both homogeneity as well as complete ness, which is the extent to which all objects from a single class are assigned to a single cluster.",
                    "sid": 271,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is deﬁned as the harmonic mean of homogeneity h and completeness c which are calculated in terms of entropies H(K), H(C) and conditional entropies H(K|C) and H(C|K).",
                    "sid": 272,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By varying ˇ, the preference given to h and c can be controlled; if both are equally important, ˇ is set to 1 [35].",
                    "sid": 273,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(ˇ + 1)hc relative recallS = Cumulative set of relevant pairs extracted by all systems (10) V = (ˇh + c) H(K |C ) (15) Purity, entropy and v-measure are the popular measures used to assess the quality of clustering.",
                    "sid": 274,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Purity of a cluster is the fraction of one class, to the number of objects in the cluster [16].",
                    "sid": 275,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given that C represents the set of clusters and K the set of reference classes h = 1 − c = 1 − H(K ) H(C |K ) H(C ) (16) (17) purity of a cluster Ci is: 1 Besides the above measures, the Partition Coefﬁcient (PC) has been used speciﬁcally with reference to fuzzy clustering.",
                    "sid": 276,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parti Pi = |Ci | maxj (|Ci ∩ Kj |) (11) tion coefﬁcient measure given in Eq.",
                    "sid": 277,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(18) quantiﬁes the fuzziness of a partition with higher values which indicate least fuzzy clustering, being preferable.",
                    "sid": 278,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall purity (P) for a set of clusters is the weighted sum of the purity of the individual clusters, where N is the total number of sentences.",
                    "sid": 279,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "|C | N PC 1 )) = N i=1 j=1 J-2 (18) 1 P = N |C | ) i=1 (|Ci | · Pi ) (12) In Eq.",
                    "sid": 280,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(18), N represents the total number of objects and J-ij is the membership value of object j in cluster i. News headlines have ﬁrst been re-clustered into ﬁner sub-clusters similarity was between thresholds, the context in which the headline occurred was used to decide.",
                    "sid": 281,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cosine similarity approach has been used by Wubben as a baseline.",
                    "sid": 282,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the current performance evaluation, both systems proposed by Wubben have been used with modiﬁcations.",
                    "sid": 283,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In k-means clustering approach, PK3 cluster stopping criteria has been used in place of PK1, as PK3 has been reported to be more efﬁcient than PK1 [38].",
                    "sid": 284,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since no clusters exist initially, k-means clustering has straightaway been applied on the entire corpus.",
                    "sid": 285,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the pairwise cosine similarity computation, due to lack of context when dealing with stand-alone sentences, a single threshold value has been used.",
                    "sid": 286,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the similarity exceeds the threshold then the sentence pair is accepted as equivalent and rejected otherwise.",
                    "sid": 287,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides Wubben et al.’s systems, a Fuzzy C-Means (FCM) clustering approach has also been adopted.",
                    "sid": 288,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Wubben et al. have attempted k-means clustering, while the proposed system uses fuzzy clustering.",
                    "sid": 289,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to obtain a comprehensive performance evaluation the FCM approach has also been implemented using the R package.",
                    "sid": 290,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The optimal number of clusters has been identiﬁed by choosing the partition which yields highest partition coefﬁcient and lowest classiﬁcation entropy.",
                    "sid": 291,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3.",
                    "sid": 292,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experiments on MSRPC.",
                    "sid": 293,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The MSRPC consists of 5801 pairs of sentences and is best suited for evaluating the performance of Paraphrase Recognition systems.",
                    "sid": 294,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It consists of 3900 positive cases of paraphrases and 1901 negative cases [39].",
                    "sid": 295,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to use it for Paraphrase Extraction, the corpus has been viewed as a collection of individual sentences.",
                    "sid": 296,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 10,948 unique sentences out of 11,602 sentences were taken up for further processing after assigning unique IDs.",
                    "sid": 297,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since MSRPC contains pairs of paraphrases rather than groups, only precision and relative recall have been calculated.",
                    "sid": 298,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For testing the performance of the proposed system, the sentences were subject to Fuzzy Agglomerative Clustering followed by divisive clustering, both with and without WSD.",
                    "sid": 299,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As described in Sections 3.2 and 3.3, the thresholds for merging and splitting of clusters were chosen as 0.15 and 0.2.",
                    "sid": 300,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Candidate sentences were chosen from each cluster based on the two schemes: all sentences and 50% of sentences from each cluster based on the membership values.",
                    "sid": 301,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using these choices, eight variants of the proposed system are framed, namely: With and Without WSD, threshold of 0.15 and 0.2, using all sentences in a cluster and only the top 50%.",
                    "sid": 302,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best set of features (57 features) identiﬁed in the feature selection process (Section 3.4) were extracted from each pair of sentences and passed on to the Paraphrase Recognizer to classify the sentences.",
                    "sid": 303,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the MSRPC contains only paraphrase pairs, the chaining of paraphrases described in Section 3.5 has been omitted.",
                    "sid": 304,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Eq.",
                    "sid": 305,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(9) has been used to assess the precision by ﬁrst picking the set of sentence pairs with a decision from the complete set of retrieved pairs.",
                    "sid": 306,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The positive cases retrieved are counted as True Positives whereas the non-paraphrased pairs retrieved are considered as False Positives.",
                    "sid": 307,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 presents the performance of the existing system as well as the proposed system variants in terms of pairs with a known decision, True Positives and False Positives.",
                    "sid": 308,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system which involves direct computation of cosine similarity was tested with ﬁve different thresholds starting from 0.3 and an increment of 0.1.",
                    "sid": 309,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The value of T represents the cutoff threshold used in the cosine similarity system and the semantic similarity threshold for the proposed system variants.",
                    "sid": 310,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cosine similarity based system with low thresholds is found to retrieve a larger number of known pairs followed by the k-means approach.",
                    "sid": 311,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Though it has reported a very large number of possible pairs, the FCM approach was found to retrieve the least number of known pairs.",
                    "sid": 312,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The WSD based variants of the proposed system retrieve more candidates due to the tighter clusters based on speciﬁc word senses.",
                    "sid": 313,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The precision of the existing approaches: cosine similarity, k-means, FCM Clustering as well as all the proposed system variants have been presented in Table 3.",
                    "sid": 314,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed system outscores the existing system variants in terms of precision by combining the fuzzy clustering approach with a Paraphrase Recognizer which exploits lexical, syntactic and semantic features.",
                    "sid": 315,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best precision is registered by the most rigorous system: With WSD, threshold = 0.2 and extracting only top 50% sentences.",
                    "sid": 316,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since these options result in ﬁner clusters, precision is better.",
                    "sid": 317,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From Table 3 the following inferences can be drawn: • Using WSD option yields better precision across all cases.",
                    "sid": 318,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be attributed to the fact that, by using WSD a distinction can be made among the sentences having the same verb.",
                    "sid": 319,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This results in ﬁner clusters and hence during Paraphrase Extraction the number of true positives is higher.",
                    "sid": 320,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• With respect to similarity thresholds, since both the thresholds yield comparable performance, any one of the thresholds can be used in the proposed system.",
                    "sid": 321,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This observation is in line with the study conducted on the Miller–Charles dataset and Yang–Powers dataset for ﬁxing the thresholds.• In terms of the membership values of sentences within a clus ter, the strategy of using only the top ranking 50% yields slightly better precision than using all the sentences.",
                    "sid": 322,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This shows that the precision is affected only by the overall clustering and not by the speciﬁc membership values.",
                    "sid": 323,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 Precision of existing and proposed approaches.",
                    "sid": 324,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Proposed system variants No WSD Threshold 0.15 Threshold 0.2 WSD Threshold 0.15 Threshold 0.2 The results of the four systems which are considered for further evaluation (Fig.",
                    "sid": 325,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9) have been given in bold.",
                    "sid": 326,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 Relative recall evaluation.",
                    "sid": 327,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "System Relative recall k-Means clustering 0.78 Proposed system variant – WSD, threshold = 0.2, top 50% 0.73 Cosine similarity – threshold = 0.7 0.64 FCM clustering 0.11 The relative recall has been assessed with respect to four systems namely: • Best proposed system variant using WSD option, threshold of 0.2 and top 50% of sentences.",
                    "sid": 328,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• k-Means approach [9].",
                    "sid": 329,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Cosine similarity variant [9] using threshold = 0.7.",
                    "sid": 330,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• FCM Clustering approach.",
                    "sid": 331,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relative recall computation has also been carried out according to Eq.",
                    "sid": 332,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(10) with respect to known relevant pairs or True Positives (Table 2) retrieved by the systems.",
                    "sid": 333,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are presented in Table 4 and the k-means approach exhibits the highest relative recall.",
                    "sid": 334,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is followed by the proposed system variant whereas the FCM Clustering approach has least relative recall.",
                    "sid": 335,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system which retrieves most pairs is found to have higher relative recall as there is a greater scope for containing the relevant pairs.",
                    "sid": 336,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the results it is obvious that the proposed system has yielded the best precision and also possesses reasonable relative recall when compared to the other variants.",
                    "sid": 337,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the objective of the proposed system is to extract paraphrases from large corpora, an unsupervised clustering approach has been used to ﬁrst cluster the sentences.",
                    "sid": 338,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second stage a supervised approach has been used to ﬁlter the paraphrases from within each cluster.",
                    "sid": 339,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prior work using MSRPC have either relied on a purely supervised approach or in the case of unsupervised learning, have computed scores between each speciﬁc sentence pair only.",
                    "sid": 340,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast this work considers all the sentences within the MSRPC corpus for determining paraphrases.",
                    "sid": 341,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, when the unsupervised approach is used a large number of sentence pairs are reported as paraphrases but the output decision is available only for 5801 pairs.",
                    "sid": 342,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence the evaluation results presented in Tables 3 and 4 have been computed using only the known pairs.",
                    "sid": 343,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the above reasons a direct comparison of the results with that of previous work on MSRPC would deﬁnitely be biased with the unsupervised approaches which use speciﬁc pairwise comparison approaches having an advantage.",
                    "sid": 344,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However to identify the performance level of the proposed system, a brief comparison with prior work using unsupervised approaches on MSRPC has been presented in Table 5.",
                    "sid": 345,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be seen that the proposed system gives good results only with respect to precision.",
                    "sid": 346,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results can be attributed to the fact that the previous unsupervised approaches – Fernando et al. [40] and Mihalcea et al. [41] judge only the given sentence pair and focus on Paraphrase Recognition only.",
                    "sid": 347,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However the proposed system undertakes the responsibility of ﬁrst identifying possible candidates through clustering and then judging them, which would be the requirement of a Paraphrase Extraction system.",
                    "sid": 348,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the proposed system performs better than Wubben et al.’s approaches as well as FCM Clustering for Paraphrase Extraction.",
                    "sid": 349,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, it can be concluded that the proposed system is suitable for the task of Paraphrase Extraction.",
                    "sid": 350,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.4.",
                    "sid": 351,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experiments on MSRVDC.",
                    "sid": 352,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The MSRVDC was constructed by Chen and Dolan [42] and consists of 120,000 sentences collected from multilingual descriptions of short video snippets supplied by workers on Mechanical Turk.",
                    "sid": 353,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Out of the 85,000 English sentences, 33,855 were from Tier-2 workers who had a higher rating.",
                    "sid": 354,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For evaluating the performance of the proposed system, two different datasets were constructed from MSRVDC.",
                    "sid": 355,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ﬁrst dataset consists of 2007 sentences extracted from the 35 K sentences contributed by Tier-2 workers.",
                    "sid": 356,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Descriptions of the same video were treated as belonging to a single cluster.",
                    "sid": 357,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Duplicate sentences were eliminated from within each cluster and the major or repeated verbs in each cluster were identiﬁed.",
                    "sid": 358,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It was observed that many of the clusters described the same actions and involved the same entities.",
                    "sid": 359,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence in order to test the performance of the system in a controlled environment consisting of clusters with little or no overlap, it was decided to handpick a set of clusters and to limit the size of the dataset to around 2000 sentences.",
                    "sid": 360,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "143 clusters involving distinct verbs were chosen and each cluster was inspected by two judges to eliminate sentences which did not agree with the overall theme of the cluster; disagreement between judges was resolved by a third judge.",
                    "sid": 361,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed system, the existing systems (Wubben et al.) and FCM Clustering approach were tested on this dataset.",
                    "sid": 362,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For implementing the proposed system, after fuzzy clustering, all the candidate sentences within a cluster were classiﬁed by the Paraphrase Recognizer and the positive pairs were chained together as described in Section 3.5 to generate clusters of paraphrases.",
                    "sid": 363,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in the case of MSRPC, various implementations of the proposed system with respect to similarity threshold, sentence membership and WSD were investigated.",
                    "sid": 364,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the focus is on extracting groups of paraphrases, the second set of performance evaluation measures namely entropy, purity and v-measure were computed as shown in Table 6.",
                    "sid": 365,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 143 clusters identiﬁed were ﬁxed as reference classes against which the created clusters have been judged.",
                    "sid": 366,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In terms of entropy, the best performance was registered by the rigorous system, with WSD, threshold 0.2 and using only the Table 5 Comparative performance on MSRPC.",
                    "sid": 367,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Approach Accuracy % Precision % Recall % F-Measure % Fernando et al.",
                    "sid": 368,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) [40] 74.1 75.2 91.3 82.4 Mihalcea et al.",
                    "sid": 369,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006) [41] 70.3 69.6 97.7 81.3 Proposed system variant WSD, threshold = 0.2, top 50% 66.4 81.0 65.2 72.3 Cosine similarity, threshold = 0.7 (Wubben et al. [9]) 62.5 80.5 56.6 66.5 k-Means clustering (Wubben et al. [9]) 60.6 70.6 71.0 70.8 FCM clustering 36.2 68.1 9.5 16.7 Table 6 Performance of proposed system on MSRVDC Dataset 1.",
                    "sid": 370,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Without WSD With WSD Threshold = 0.15 Threshold = 0.2 Threshold = 0.15 Threshold = 0.2 Top 50% All Top 50% All Top 50% All Top 50% All Entropy % 5.68 10.98 5.55 10.9 5.06 6.88 4.7 56.86 Purity % 64.82 79.42 65.62 78.77 63.08 70.8 61.34 70.05 v-Measure % 83.87 83.05 84.04 82.97 83.98 84.",
                    "sid": 371,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "14 84.25 84.3 The highest value for each evaluation measure has been given in bold.",
                    "sid": 372,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "top 50% in terms of membership values.",
                    "sid": 373,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using WSD forms several smaller clusters and therefore the entropy is lesser.",
                    "sid": 374,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Likewise using a threshold of 0.2 and only top 50% of sentences is more restrictive, hence the entropy is lower.",
                    "sid": 375,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, the most lenient system that is the one without WSD, threshold = 0.15 and considering all sentences within a cluster, has the highest purity.",
                    "sid": 376,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be attributed to the fact that this variant, results in the formation of lesser number of large clusters which tend to have a greater degree of overlap with reference classes.",
                    "sid": 377,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With respect to the v-measure, the variant with WSD and threshold of 0.2 but considering all sentences has registered the best performance of 84.3%.",
                    "sid": 378,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using a higher threshold with WSD improves the homogeneity, whereas including all sentences within a cluster increases the completeness.",
                    "sid": 379,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the rigorous system has very close v-measure, it is chosen as the best out of the eight variants as it has moderate performance with respect to purity and low entropy and high v-measure.",
                    "sid": 380,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 7 records the performance of the existing systems on MSRVDC Dataset1.",
                    "sid": 381,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be observed that similar to the results obtained on MSRPC, the cosine similarity method with threshold = 0.7, achieves better performance than k-means and FCM clustering techniques.",
                    "sid": 382,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparing proposed and existing systems, it can be seen that almost all the eight variants of the proposed system perform better with respect to all three parameters.",
                    "sid": 383,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally the rigorous variant of the proposed fuzzy hierarchical clustering approach and the FCM approach were compared in terms of the partition coefﬁcient yielding values of 0.44 and 0.16, respectively.",
                    "sid": 384,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This indicates that the quality of fuzzy clustering is better in the proposed system.",
                    "sid": 385,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence it can be concluded that the proposed system is better at identifying groups of paraphrases due to reﬁnement of fuzzy clusters by using the Paraphrase Recognizer.",
                    "sid": 386,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second dataset was also extracted from MSRVDC and consists of 27,291 unique sentences from 33,855 Tier-II English sentences.",
                    "sid": 387,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All sentences describing the same video were grouped into a cluster and a total of 1931 clusters were formed.",
                    "sid": 388,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the large size of the corpus, only the lenient and rigorous variants of the proposed system have been evaluated against Wubben’s Clustering approach, cosine similarity system with threshold = 0.7 and FCM approach as shown in Table 8.",
                    "sid": 389,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rigorous variant of the Proposed system, performs much better than the other systems in terms of entropy as well as v- measure.",
                    "sid": 390,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In terms of purity, the lenient variant performs well as in the case of Dataset 1, but the improvement in purity is less when compared to the increase in entropy.",
                    "sid": 391,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In terms of partition coef- ﬁcient also the rigorous variant performs better than the lenient variant as well as FCM Clustering.",
                    "sid": 392,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the rigorous variant is chosen as the better of the two proposed system variants.",
                    "sid": 393,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sample clusters produced by the various systems have been shown in Table 9.",
                    "sid": 394,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The clusters produced by the proposed system and cosine similarity approach tend to be more homogeneous.",
                    "sid": 395,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be observed that in the cluster produced by the proposed system all sentences involve the same verb – ‘reading’ and related nouns – teacher or woman.",
                    "sid": 396,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Though the cosine similarity clustering is better than the k-means approach, it has also considered only word matching and not the concepts.",
                    "sid": 397,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "FCM Clustering has resulted in large-sized clusters of low purity and high entropy and has therefore not been included in Table 9.",
                    "sid": 398,
                    "ssid": 154,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discussion. ",
            "number": "5",
            "sents": [
                {
                    "text": "The proposed system has consistently exhibited better performance with respect to all the three datasets as shown in Fig.",
                    "sid": 399,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9.",
                    "sid": 400,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rigorous variant has been chosen for comparison against the existing systems.",
                    "sid": 401,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of the four systems, the two stage fuzzy clustering followed by Paraphrase Recognition approach performs best.",
                    "sid": 402,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second best performance is demonstrated by Wubben’s cosine similarity approach.",
                    "sid": 403,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A signiﬁcant aspect is that, the improvement in performance of the proposed system is more with respect to MSRVDC Dataset 2, which is the biggest of the three datasets.",
                    "sid": 404,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With respect to k-means clustering, the determination of ideal k value for clustering is tedious for large corpora.",
                    "sid": 405,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cosine similarity computation has a complexity of O (N2 ) where N is the number of sentences in the corpus.",
                    "sid": 406,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fuzzy hierarchical clustering approach the number of clusters is determined automatically.",
                    "sid": 407,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, once the sentences are initially assigned to clusters in O (N) time all further operations are either within the clusters or between the cluster representatives.",
                    "sid": 408,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore the efﬁciency of the fuzzy hierarchical clustering approach is better.",
                    "sid": 409,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The proposed approach also supports incremental clustering as a new sentence can be added to the clusters labeled with the most similar verbs.",
                    "sid": 410,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The major contribution of this work is the design of a novel fuzzy hierarchical clustering approach and its application for the task of Paraphrase Extraction.",
                    "sid": 411,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Though several sentence clustering approaches exist previously in information extraction and multi-document summarization applications, the uniqueness of this approach is its usage of a fuzzy hierarchical technique based on Sentence similarity.",
                    "sid": 412,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach has been tested on two different corpora and the following inferences can be drawn from the performance evaluation.",
                    "sid": 413,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "k-Means clustering [9] FCM clustering Cosine similarity approach [9] with varying thresholds (T) T = 0.3 T = 0.4 T = 0.5 T = 0.6 T = 0.7 Entr opy % 1 9 . 6 8 3 2 . 6 9 9 . 5 6 9 9 . 5 8 9 3 . 4 8 6 3 . 8 6 1 0 . 2 7 Puri ty % 3 9 . 0 1 4 7 . 7 3 1 . 6 9 3 . 3 4 1 1 . 2 6 3 3 . 5 8 5 4 . 9 5v Me asur e % 8 0 . 0 3 6 7 . 3 3 0 . 1 7 0 . 1 5 1 1 . 3 6 3 3 . 8 9 8 4 . 0 3 The highest value for each evaluation measure has been given in bold.",
                    "sid": 414,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 8 Performance evaluation on MSRVDC Dataset 2.",
                    "sid": 415,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "W i t h o u t W S D T h r e s h o l d = 0 . 1 5 , a l l W i t h W S D t h r e s h o l d = 0 . 2 , t o p 5 0 % k M e a n s c l u s t e r i n g C o s i n e s i m i l a r i t y T h r e s h o l d = 0 . 7 F C M c l u s t e r i n g Entr opy % 3 4 . 8 8 1 9 . 4 1 6 8 . 0 3 6 6 . 9 1 8 6 . 7 8 Puri ty % 4 4 . 0 7 4 1 . 3 0 2 . 4 2 6 . 9 7 0 . 7 8v Me asur e % 6 8 . 9 5 7 7 . 0 9 4 2 . 6 7 4 3 . 2 4 1 9 . 5 6 Part itio n coe fﬁci ent 0 . 7 8 0 . 9 8 – – 0 . 3 3 The highest value for each evaluation measure has been given in bold.",
                    "sid": 416,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 9 Sample clusters on MSRVDC Dataset 2.",
                    "sid": 417,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Proposed system clustering (sample clusterpurity = 0.82, entropy = 0.08) • A woman is reading something, while another woman measures the ﬁrst woman’s ankle with a tape measure • A female teacher reads to the class • A female teacher is reading out loud from a piece of paper • A teacher read a paper to the class • A teacher reads aloud from a piece of paper • A teacher reads to her class • A woman is holding a sheet of paper and reading the text • A woman is reading a piece of paper • The teacher is reading the paper • The teacher read from a paper to the class k-Means clustering (sample cluster purity = 0.11 (highest), entropy = 0.37 (lowest)) • A woman is applying a lotion to her hair • Workers are tending to the ﬁeld • A woman is dancing by the water • A woman is baking a ﬁsh in the pan • People sing and dance in a surreal scene • A woman trims a ﬂower plant • A cat is jumping into a cardboard box • A woman is straightening her hair • The boxers fought in the ring • A whale rises out of the water • A whale surfaces in the water • Two dogs are wrestling • The man did acrobatic jumps in his routine • Two women eat hamburgers in a cafe and chat • Two men are standing in a kitchen and one is talking on a cell phone • A boy and woman are playing catch with a pumpkin • Someone is putting sauce into a pan • A little kid dances Cosine sample cluster purity = 0.78, entropy = 0.07) • A group of cars are driving down a road • Several different kinds of racing cars are driving down a road • A group of deer are crossing a road • A group of deer cross the road in a forest • A group of deers are crossing road • A herd of caribou are crossing a road • A herd of deer are crossing a road • A herd of deer are crossing the street • A herd of deer cross a road Fig.",
                    "sid": 418,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9.",
                    "sid": 419,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance evaluation of proposed and existing systems.",
                    "sid": 420,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• The approach results in meaningful and cohesive clusters when compared to other clustering approaches such k-means and FCM.",
                    "sid": 421,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• It is computationally efﬁcient when compared to the cosine similarity approach and at the same time considers semantic similarity also.• The approach is incremental and can also be parallelized as divi sive clustering can be carried out on each cluster independently.",
                    "sid": 422,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Therefore, the fuzzy hierarchical clustering approach is a viable alternative to existing distributional and bootstrapping approaches for Paraphrase Extraction and can be employed for sentence-level Paraphrase Extraction.",
                    "sid": 423,
                    "ssid": 25,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "6",
            "sents": [
                {
                    "text": "A two-stage approach centered on fuzzy clustering followed by Paraphrase Recognition has been proposed for Paraphrase Extraction.",
                    "sid": 424,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The signiﬁcant aspects of the approach are: usage of a soft hierarchical clustering which has scope for parallelism and the ability to perform incremental clustering.",
                    "sid": 425,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further a novel fuzzy grouping strategy has been utilized for merging clusters which ensures faster clustering and ﬂatter hierarchies.",
                    "sid": 426,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system has been evaluated on two different paraphrase corpora and has exhibited good performance in comparison to a cosine similarity technique as well as k-means and FCM Clustering approaches.",
                    "sid": 427,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The effect of applying WSD has also been investigated and is found to improve the performance.",
                    "sid": 428,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In future, the performance of the two- stage approach on larger corpora can be probed.",
                    "sid": 429,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The supervised classiﬁer used in the second stage for Paraphrase Recognition can be replaced by suitable paraphrase evaluation metrics enabling the entire process to work in an unsupervised fashion.",
                    "sid": 430,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach can also be adapted for tasks such as tweet clustering, plagiarism detection and multi-document summarization.",
                    "sid": 431,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}