{
    "ID": "PSS07_w06",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "There has been recent research in open-ended information extraction from text that finds relational triples of the form (arg1, relation phrase, arg2), where the relation phrase is a text string that expresses a relation between two arbitrary noun phrases.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While such a relational triple is a good first step, much further work is required to turn such a textual relation into a logical form that supports inferencing.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The strings from arg1 and arg2 must be normalized, disambiguated, and mapped to a formal taxonomy.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relation phrase must likewise be normalized and mapped to a clearly defined logical relation.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some relation phrases can be mapped to a set of predefined relations such as Part-0f and Causes.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We focus instead on arbitrary relation phrases that are discovered from text.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this, we need to automatically merge synonymous relations and discover meta-properties such as entail- ment.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ultimately, we want the coverage of a bottom-up approach together with the rich set of axioms associated with a top-down approach.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have begun exploratory work in “ontologizing” the output of TextRunner, an open information extraction system that finds arbitrary relational triples from text.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our test domain is 2.5 million Web pages on health and nutrition, which yields relational triples such as (orange, contains, vitamin C) and (fruits, are rich in, antioxidants).",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We automatically disambiguate the strings arg1 and arg2, mapping them to WordNet synsets.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also learn entailments between normalized relation strings (e.g. “be rich in” entails “contain”).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This enhanced ontology enables reasoning about relationships that are not seen in the corpus, but can be inferred by inheritance and entailment.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, we define ontology-based relationships between the extracted triples themselves, and experimentally show that these can be used in significantly improving probability estimation for the triples.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "A dream from the early days of Artificial Intelligence is to build a system that can read autonomously with deep understanding.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the 1970’s and 1980’s natural language processing (NLP) research tackled this problem directly, but in a way that was too brittle to apply to unrestricted text.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While we may dismiss this body of research as “toy systems” that required carefully selected input text, they genuinely performed deep reasoning about those texts.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the 1990’s the mainstream of NLP research shifted to robust information extraction (IE) systems with shallow reasoning, often statistically based.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such IE systems can handle unseen text that the earlier NLP systems could not handle, but have the more modest goal of scanning for a limited number of predefined relations, and ignoring everything else.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Current IE systems have hardly any mechanisms to make inferences beyond what is explicitly stated in the text.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the time may be ripe to combine the best of both eras, and build robust NLP systems that support deep reasoning.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider textual relations with instances in the form (arg1, relation phrase, arg2) that have text strings for the arguments and the relation phrase.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The argument strings must be normalized and mapped to a formal taxonomy to enable inheritance-based reasoning.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, the relation string must be normalized and mapped to an axiomatized set of relations where possible.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Learning entailments between relations can enable further inferencing.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The normalized instances of relations must be converted into probabilistic logical statements with clearly defined semantics.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suppose we have an instance (X, relation, Y) where X and Y are mapped to non-leaf nodes of a WordNet-like taxonomy.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Does this mean that for all instances of X there exists an instance of Y where the relationship holds, or some other combination of universal and existential quantifiers?",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ontologized instances should be in a format suitable for an inference engine that can make plausible inferences.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have taken some early steps in this research direction, but the bulk of these ideas still need to be tested and validated.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remainder of this paper is organized as follows.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2 gives a brief overview of NLP research from the 1970’s up to the present.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 presents a case study of the steps needed to transform textual relations into ontologized relations.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 gives some preliminary results where we use relationships between the ontologized relations for better confidence estimation of these relations.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We conclude in Section 5 with some general discussion.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "trends in nlp research. ",
            "number": "2",
            "sents": [
                {
                    "text": "NLP research has seen extreme swings in goals and methods over the last thirty years.",
                    "sid": 36,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Research in the 1970’s and Copyright Qc 2007, Association for the Advancement of Artificial 1980’s lacked robust techniques, but had lofty goals of deep Intelligence (www.aaai.org).",
                    "sid": 37,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All rights reserved.",
                    "sid": 38,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "understanding.",
                    "sid": 39,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NLP systems by Roger Schank and his stu dents could read that John went into a restaurant, and infer that John was hungry and had a goal of eating, that he sat at a table, ordered food, ate it, paid, and left the restaurant.",
                    "sid": 40,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Good overviews of this work are given in (Schank & Abelson 1977; Dyer 1983; Lehnert 1988).",
                    "sid": 41,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These deep understanding systems parsed the text into unambiguous meaning, represented by a network of semantic primitives (Schank & Reisbeck 1982) and a rich knowledge base used to make plausible inferences from this semantic representation.",
                    "sid": 42,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, neither the parsing nor the reasoning could scale to the variablility of naturally occurring text.",
                    "sid": 43,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NLP research since the early 1990’s has focused primarily on robustness, at the expense of deep reasoning.",
                    "sid": 44,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Message Understanding Conferences (MUC) (Sundheim 1991; Chinchor 1998) spurred the NLP community to create systems that could selectively extract relevant information from previously unseen texts.",
                    "sid": 45,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, hardly any inferencing is done beyond normalizing the information that goes into an output template.",
                    "sid": 46,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Statistical and machine learning systems have almost completely replaced the intricate handcrafted knowledge of earlier language understanding systems.",
                    "sid": 47,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some recent IE systems have extracted domain- independent relations, but still narrowly focused on a few relations.",
                    "sid": 48,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pennachiotti and Pantel developed a system that extracts the relations such as is-a, part-of, and succession from the Trec9 corpus and is-a, part-of, production, and reaction from a chemistry corpus (Pennacchiotti & Pantel 2006).",
                    "sid": 49,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Snow, Jurafsky, and Ng used a hyponym classifier to extract is-a relations from a large collection of newswire and encyclopedia text (Snow, Jurafsky, & Ng 2006).",
                    "sid": 50,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently, a few systems have been created that do “open IE”.",
                    "sid": 51,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is general purpose information extraction that operates bottom-up from a text corpus, without a predefined notion of what information is relevant.",
                    "sid": 52,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Open IE gathers all relational triples it finds, in the form (arg1, relation phrase, arg2), where arg1 and arg2 are noun phrases and the relation phrase expresses a logical relation of some kind between the two arguments.",
                    "sid": 53,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most advanced open IE system is TextRunner from Etzioni’s research group (Banko et al. 2007), which extracts relational triples from text corpora using domain- independent, self-supervised learning.",
                    "sid": 54,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TextRunner merges duplicate triples and assigns a redundancy-based probability of correctness to each triple (Downey, Etzioni, & Soder- land 2005).",
                    "sid": 55,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples of triples found from a corpus of Web pages on nutrition are (tomatoes, are high in, lycopene) and (antioxidant, can help prevent, many forms of cancer).",
                    "sid": 56,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently some NLP systems are moving toward deep reasoning.",
                    "sid": 57,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An impressive example is the HALO project (Fried- land et al. 2004), which combines a common sense knowledge base with knowledge gleaned from chemistry textbooks.",
                    "sid": 58,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The chemistry knowledge is input by a combination of automatic NLP and manual knowledge engineering.",
                    "sid": 59,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This general purpose and domain-specific knowledge enables an NLP system to read and answer questions from a standardized Advanced Placement test in Chemistry, and perform at One of the three research teams for HALO used the University of Texas KM1 component library (Barker, Porter, & Clark 2001) as their knowledge base.",
                    "sid": 60,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This knowledge base contains hundreds of axiomatized concepts, such as the concept Be-Contained, which is defined as a relation between a Tangible-Entity as the object (passive participant in an event) and a Tangible-Entity as the base (relatively fixed thing).",
                    "sid": 61,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The KM system can reason about how Be-Contained is related to Spatial-Entities as origin and destination and how Be-Contained is related to the concepts Encloses, Has- Region, Is-Inside, Is-Region-Of, Move-Into, and Move-Out- Of.",
                    "sid": 62,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such fully axiomatized concepts, along with the KM reasoner, provide the capability of deep understanding equal to that of Schank’s semantic primitives.",
                    "sid": 63,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "towards deep information extraction. ",
            "number": "3",
            "sents": [
                {
                    "text": "In this section, we will discuss the individual steps involved in ontologizing textual relations, and getting them ready for use in an automated reasoning system.",
                    "sid": 64,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will use as our running example, textual relations from TextRunner for a corpus of nutrition Web pages.",
                    "sid": 65,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We enumerate the steps below.",
                    "sid": 66,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will discuss many of these in greater detail in later sections.",
                    "sid": 67,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 68,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normalize the argument phrases.",
                    "sid": 69,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This involves map-.",
                    "sid": 70,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ping the argument strings to the “objects” of some logical domain.",
                    "sid": 71,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we consider WordNet noun synsets as our objects domain.",
                    "sid": 72,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normalizing arguments thus becomes a problem of word sense disambiguation.",
                    "sid": 73,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We need to be able to enhance this domain and add new synsets, if we want to handle unrestricted text.",
                    "sid": 74,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We don’t yet cover this case in our implementation.",
                    "sid": 75,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also note that normalization solves the important problem of identity resolution – do two strings si and sj refer to the same real world entity or not?",
                    "sid": 76,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 77,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normalize the relation phrase.",
                    "sid": 78,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This involves normal-.",
                    "sid": 79,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "izing to drop unimportant differences between phrases, such as adverbs or verb morphological form.",
                    "sid": 80,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It may also involve mapping predicate phrases to a predefined set of concepts.",
                    "sid": 81,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 82,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Formalize the semantics.",
                    "sid": 83,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ontologized relations must be.",
                    "sid": 84,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "given precise logical semantics before automated reasoning can be applied.",
                    "sid": 85,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Does (x, rel, y) mean that for all hyponyms of x the relation holds for all hyponyms of y, or some other combination of the two quantifiers?",
                    "sid": 86,
                    "ssid": 23,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "learn meta-properties of relation phrases. are two re-. ",
            "number": "4",
            "sents": [
                {
                    "text": "lation phrases synonymous, or does relation r1 existing between x and y imply that relation r2 also holds between them (entailment)?",
                    "sid": 87,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Is a relation transitive with respect to another relation?",
                    "sid": 88,
                    "ssid": 2,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "assign probability of correctness. automatically ex-. ",
            "number": "5",
            "sents": [
                {
                    "text": "tracted relations will inevitably include errors.",
                    "sid": 89,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Can we use relationships between the ontologized relations to better estimate their probabilities.",
                    "sid": 90,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We later define such relationships, using the hyponymy and siblinghood relationships that we have between objects (available from Word a level close to that of typical high school students who take that test.",
                    "sid": 91,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 http://ww w.cs.utexa s.edu/users /mfkb/RK F/clib.html Net), and the entailment relationships that we have derived between relation phrases.",
                    "sid": 92,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "inference engine. the inference engine should be able. ",
            "number": "6",
            "sents": [
                {
                    "text": "to combine the relations that were derived from text with other relations and axioms in a knowledge base.",
                    "sid": 93,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Case Study: Fruit and Antioxidants.",
                    "sid": 94,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first present some examples of TextRunner relations to better motivate the issues involved in executing the steps we listed above.",
                    "sid": 95,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 shows three such relations.",
                    "sid": 96,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These illustrate textual relations that we want to ontologize.",
                    "sid": 97,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some normalization has been done to the original source text phrases: modifiers and adverbs have been dropped, and nouns and verbs are transformed into their morphological base.",
                    "sid": 98,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This normalization, however, is not sufficient to enable machine reasoning about the relations.",
                    "sid": 99,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 100,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(orange, contain, vitamin C) “One orange contains all the vitamin C your body needs for the day!” 2.",
                    "sid": 101,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(fruit, be rich in, antioxidant) “Whole grains, fruits, and vegetables are also rich in antioxidants, such as vitamins C and E, and beta-carotene.” 3.",
                    "sid": 102,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(green bean, should be alert to, problem) “Growers who rotate with soybeans or green beans should be alert to potential problems with fields infested with soybean cyst nematodes.” Figure 1: Examples of textual relations extracted from a corpus of Web pages on nutrition, along with a sentence from which the relation was extracted.",
                    "sid": 103,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the first two of these textual relations seem perfectly reasonable, they have limited utility for an automated reasoner.",
                    "sid": 104,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first two relations have no terms in common and, thus, appear to be totally unrelated strings.",
                    "sid": 105,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A language understanding system should be able to reason that oranges are a type of fruit, that vitamin C is a type of antioxidant, and that being “rich in” x can imply containing x. None of this reasoning is possible at the level of text phrases.",
                    "sid": 106,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the first two relations have interrelated meaning, and thus corroborate each other, the third relation can be immediately labeled as false by a human reader.",
                    "sid": 107,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Green beans or any other vegetable having cognition runs counter to any other true assertions in a human reader’s knowledge, and thus can be assigned low belief.",
                    "sid": 108,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Normalizing Argument Noun Phrases.",
                    "sid": 109,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As mentioned above, we normalize the argument noun phrases of a relation by mapping them to WordNet noun synsets (Harabagiu, Miller, & Moldovan 1999).",
                    "sid": 110,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we are dealing with a word sense disambiguation (WSD) problem, since most terms in WordNet occur in multiple synsets.",
                    "sid": 111,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example “orange” could be a fruit, a color, a tree, a pigment, or a river in South Africa.",
                    "sid": 112,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fruit sense is what we want in the context of example 1 in Figure 1.",
                    "sid": 113,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now describe the technique we use for WSD.",
                    "sid": 114,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To disambiguate x in (x, rel, y), we consider all the sentences S1, . . .",
                    "sid": 115,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": ", Sk from which this relation was extracted.",
                    "sid": 116,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using these, and a window size of 4 words on each side of x, we create a set C of context words for x. Words with similar meaning tend to be distributionally similar, and have sim ilar PMI (pointwise mutual information) values with other words.",
                    "sid": 117,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus these occurrences of x will on average have greater similarity with words similar to the correct sense compared to those similar to incorrect senses.",
                    "sid": 118,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each sense, we compute the average similarity of x with all the WordNet synonyms, siblings and direct hyponyms of that sense.",
                    "sid": 119,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We measure similarity according to the metric proposed in (Dagan, Marcus, & Markovitch 1993).",
                    "sid": 120,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It computes similarity between corresponding vectors of PMI values.",
                    "sid": 121,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The set of words forming the PMI vector space is just the set C and not all the words in the corpus (this is important).",
                    "sid": 122,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We assign the sense for which this average similarity is highest.",
                    "sid": 123,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the experiments section, we report the results we got with this method.",
                    "sid": 124,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A formal taxonomy enables a system to make inferences that cannot be made otherwise.",
                    "sid": 125,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If (orange, contain, vitamin C), we can infer from inheritance that (orange, contain, vitamin) and that (orange, contain, antioxidant), since vitamin C is a subclass of vitamin and also a subclass of antioxidant.",
                    "sid": 126,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, (orange, contain, vitamin C) is a specialization of (citrus fruit, contain, vitamin C).",
                    "sid": 127,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A general-purpose taxonomy like WordNet is likely to have gaps for some domain concepts – a taxonomy may have “fat” but not its hyponym “unsaturated fat”.",
                    "sid": 128,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Snow, Jurafsky, & Ng 2006) have shown that adding terms to a taxonomy can be done with high precision, given a good classifier for expressions that denote is-a relations.",
                    "sid": 129,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Augmenting WordNet on the fly while normalizing relations is in our plan for future work.",
                    "sid": 130,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Proper names are another case where a taxonomy is unlikely to help.",
                    "sid": 131,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There has been considerable research re cently in named entity recognition (Collins & Singer 1999; McCallum & Li 2003) and in identity resolution across alternate forms of the same name (Dong, Halevey, & Madhavan 2005; Kanani, McCallum, & Pal 2007).",
                    "sid": 132,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would also like to leverage these in future work.",
                    "sid": 133,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Normalizing Relation Phrases.",
                    "sid": 134,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first normalize the relation phrase by dropping adverbs and reducing verbs to a morphological base form.",
                    "sid": 135,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, “are also rich in” is normalized to “be rich in”.",
                    "sid": 136,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also learn entailments between relation phrases – (X, be rich in, Y) implies that (X, contains, Y) is also true with high probability, as described in Section 3.5.",
                    "sid": 137,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This allows inheritance between relations that goes beyond what would be provided by a verb taxonomy.",
                    "sid": 138,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our future plans are to tie the normalized relation phrases to formal concepts such as Be-Contained from the KM component library that was described in Section 2.3.",
                    "sid": 139,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each of these formal concepts is fully axiomatized to enable a rich set of inferences.",
                    "sid": 140,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "KM currently has a few hundred of such general purpose concepts, and ultimately may need several thousand axiomatized concepts for adequate coverage of free text.",
                    "sid": 141,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A scalable approach to mapping relation phrases to a set of formal concepts is to associate each formal concept with a small set of the most common terms used to refer to the concept.",
                    "sid": 142,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is already done for each of the manually engineered KM concepts.",
                    "sid": 143,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The set of relations that map to a given concept is then expanded by learning entailments.",
                    "sid": 144,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If (X, contain, Y) is manually mapped to Be-Contained, and (X, be rich in, Y) entails (X, contain, Y), then “be rich in” is implicitly mapped to Be-Contained as well.",
                    "sid": 145,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Quantification.",
                    "sid": 146,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Human language is typically underspecified about scoping and quantification.",
                    "sid": 147,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Automated reasoning systems that are based on first order logic require a clear resolution to scoping and quantification.",
                    "sid": 148,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Does example 2 in Figure 1 mean that all instances of fruit are rich in all instances of antioxidants (interpretation A).",
                    "sid": 149,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Or does it mean that at all instances of fruit are rich in at least one instance of antioxidant (B)?",
                    "sid": 150,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Or does it mean that at least one instance of fruit is rich in all antioxidants (C) or that at least one fruit is rich in at least one antioxidant(D)?",
                    "sid": 151,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A. ∀x ∈ fruit ∀y ∈ antioxidant, rich in(x, y) B. ∀x ∈ fruit ∃y ∈ antioxidant, rich in(x, y) C. ∃x ∈ fruit ∀y ∈ antioxidant, rich in(x, y) D. ∃x ∈ fruit ∃y ∈ antioxidant, rich in(x, y) Figure 2: Possible semantics of the textual relation (fruit, rich in, antioxidant).",
                    "sid": 152,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most likely interpretation is a probabilistic version of B: most fruits contain at least one antioxidant.",
                    "sid": 153,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Interpretations A and C contradict domain knowledge about nutrition, and interpretation D is a trivially weak version of B. Example 1 with its generic use of “the orange”, is an even knottier problem for determining quantification automatically.",
                    "sid": 154,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even with domain knowledge, determining correct quantification from natural language is a difficult problem.",
                    "sid": 155,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We choose option B as the default quantification.",
                    "sid": 156,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This enables inference of relations where arg1 is replaced with a hyponym (specialization).",
                    "sid": 157,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the system believes that (citrus fruit, contain, vitamin C), it can infer with equal certainty that (grapefruit, contain, vitamin C) and (pink grapefruit, contain, vitamin C).",
                    "sid": 158,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Arg2 may similarly be replaced with a hypernym (generalized class).",
                    "sid": 159,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If (citrus fruit, contain, vitamin C) then (citrus fruit, contain, antioxidant) and, somewhat vacuously, (citrus fruit, contain, substance).",
                    "sid": 160,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.5 Learning Meta-properties of Relation Phrases.",
                    "sid": 161,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our goal is to automatically extract relational triples spanning a large set of relation phrases, which precludes manually engineering axioms for these relations.",
                    "sid": 162,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, we can learn meta-properties of relation phrases, such as entail- ment, transitivity, and transitivity-through.",
                    "sid": 163,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Relation r entails another relation r’ if an instance (x, r, y) implies that (x, r’, y) is also true.",
                    "sid": 164,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the domain of nutrition, (x, be rich in, y) entails (x, contain, y).",
                    "sid": 165,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Transitivity holds for a relation r if (a, r, b) and (b, r, c) imply that (a, r, c) is also true.",
                    "sid": 166,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another meta-property that can be learned is transitive-through.",
                    "sid": 167,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Relation r’ is transitive through relation r if whenever (a, r, b) and (b, r’, c) are true, then so is (a, r’, c).",
                    "sid": 168,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if (tomato, contain, lycopene) and (lycopene, help prevent, cancer) , then (tomato, help prevent, cancer) We now describe how we compute entailments in our implementation.",
                    "sid": 169,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For any relation r, we say the ordered pair (x, y) is an instance of r if (x, r, y) has been extracted from the corpus.",
                    "sid": 170,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given relations r1, r2 , let their respective in stance sets be I1 , I2.",
                    "sid": 171,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If r1 ⇒ r2 holds, then we should have I1 ⊆ I2.",
                    "sid": 172,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to data sparseness, we don’t expect this containment to actually hold.",
                    "sid": 173,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we would expect a measure like |I1 ∩ I2 |/|I1| to be a good score to give to this entailment.",
                    "sid": 174,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, this did not turn out to work well.",
                    "sid": 175,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distribution we had for instance set sizes for relations was very skewed.",
                    "sid": 176,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It varied from 6 to more than 10, 000.",
                    "sid": 177,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If I2 is orders of magnitude larger than I1 then this score can be high just by chance overlap.",
                    "sid": 178,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We need to con sider |I2 | too in assigning a score.",
                    "sid": 179,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We experimented with several metrics, and the one that was found to work best was |I1 ∩ I2 |/|I1| log|I2 |.",
                    "sid": 180,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose a threshold 0.01 for this score, and chose all entailments with score greater than this value.",
                    "sid": 181,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.6 Assigning Probabilities.",
                    "sid": 182,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A set of relations that have been extracted automatically from text are bound to contain some errors.",
                    "sid": 183,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Probability estimation for extracted relations is an important component of information extraction systems.",
                    "sid": 184,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We consider three types of evidence for such probability estimates.",
                    "sid": 185,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 186,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Language Based Features: These are features derived.",
                    "sid": 187,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "from the output of POS taggers and deep parsers on the corpus text.",
                    "sid": 188,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These include the POS tags themselves, their bigrams and trigrams, the number of words separating the argument noun phrases, features derived from paths connecting them in the parse tree, and so on (Kambhatla 2004).",
                    "sid": 189,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "State of the art relation extraction systems are mostly based on these features.",
                    "sid": 190,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 191,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Redundancy: The more frequently an instance has been.",
                    "sid": 192,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "extracted from a large corpus, the more likely it is to be correct (Downey, Etzioni, & Soderland 2005).",
                    "sid": 193,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When redundancy is present, this has been shown to be a very effective source of evidence.",
                    "sid": 194,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, an open IE system like TextRunner is bound to give a lot of good extractions with low counts, in addition to good extractions with high counts.",
                    "sid": 195,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 196,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ontological Corroboration: This is a new source of ev-.",
                    "sid": 197,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "idence that we introduce.",
                    "sid": 198,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It becomes available from our ontologizing the relations.",
                    "sid": 199,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is derived from ontology- based relationships between the extracted relations themselves.",
                    "sid": 200,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describe these next.",
                    "sid": 201,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We define the following relationships between ontologized relations.",
                    "sid": 202,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Acc Precision Recall F Naive Bayes – BFS Naive Bayes – OFS Log Reg – BFS Log Reg – OFS SVM – BFS SVM – OFS 69% 74% 72% 75% 73% 75% 0.57 0.65 0.67 0.70 0.70 0.71 0.61 0.61 0.46 0.54 0.43 0.50 0.59 0.63 0.54 0.61 0.53 0.59 Figure 3: Illustration of relationships between ontologized triples 1.",
                    "sid": 203,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hyponymy: We define a relation (x′ , r′ , y′) to be a hy-.",
                    "sid": 204,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ponym of (x, r, y) if x′ is a hyponym or synonym of x, y′ is a hyponym or synonym of y, and relation phrase r′ entails r. For example, in Figure 3, (tomato, rich in, lycopene) can be seen to be a hyponym of (vegetable, contains, antioxidant).",
                    "sid": 205,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 206,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hypernymy: We define hypernymy to just be the inverse.",
                    "sid": 207,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "relationship of hyponymy.",
                    "sid": 208,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 209,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Siblinghood: We define a relation (x′ , r′ , y′) to be a sib-.",
                    "sid": 210,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ling of (x, r, y) if x′ is a sibling or synonym of x, y′ is a sibling or synonym of y, and r and r′ are related by an entailment in either direction.",
                    "sid": 211,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in Figure 3, (tomato, rich in, lycopene) can be seen to be a sibling of (carrot, loaded with, beta-carotene).",
                    "sid": 212,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is easy to see why, if two relations are related by hyponymy, this provides additional evidence that they are both true.",
                    "sid": 213,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hyponym relation can be thought of as an “instance” of the hypernym relation.",
                    "sid": 214,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We discussed this earlier when we talked about the semantics of relations between non-leaf nodes in the ontology.",
                    "sid": 215,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We claim that two relations related by siblinghood present a similar scenario.",
                    "sid": 216,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Relation phrases, like predicates in logic, tend to have fixed argument classes.",
                    "sid": 217,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Siblinghood between relations is evidence for particular argument classes for the involved relation phrases.",
                    "sid": 218,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 219,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preliminary Results.",
                    "sid": 220,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our dataset consisted of 272, 960 relations extracted from a corpus of web pages on health and nutrition.",
                    "sid": 221,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These spanned around 27, 000 WordNet synsets, and 7, 000 distinct relation phrases.",
                    "sid": 222,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our entailment threshold of 0.01 gave us 20, 550 entailments.",
                    "sid": 223,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on a sample of 60 drawn from these, we obtained a precision of 0.67.",
                    "sid": 224,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For word sense disambiguation, we tagged a sample of 125 relations.",
                    "sid": 225,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "70% of these were found to have correct senses assigned to both their arguments.",
                    "sid": 226,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline WSD that always selected the first WordNet synset had accuracy 55%.",
                    "sid": 227,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline was pretty good, presumably because WordNet numbers senses according to decreasing frequency of usage.",
                    "sid": 228,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now turn to probability estimation for these relations.",
                    "sid": 229,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We trained classifiers to predict labels (true or false) for them, and assign them truth probabilities.",
                    "sid": 230,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Baseline Feature Set (BFS) consists of POS tags, bigrams of POS tags, size of the relation phrase, and the extraction frequency of the relation.",
                    "sid": 231,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used feature selection methods to choose Table 1: Classifier performance comparison between the two feature sets eight features from the large candidate set of POS tags and their bigrams.",
                    "sid": 232,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Ontology Feature Set (OFS) uses all the features in BFS.",
                    "sid": 233,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, it uses three additional features derived from the kind of ontological evidence that we discussed earlier.",
                    "sid": 234,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each relation, we use the counts for the number of hyponyms, hypernyms, and siblings that the relation has in the entire set of 272, 960 relations, as features.",
                    "sid": 235,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We expect nonzero values for these features to provide additional evidence that the relation is true.",
                    "sid": 236,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first evaluate the accuracy and F-measure performance.",
                    "sid": 237,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We tried three classifiers – Naive Bayes, Logistic Regression, and SVMs with a RBF kernel using (Frank et al. 2005).",
                    "sid": 238,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used a set of 355 tagged relations, and performed 5-fold cross-validation.",
                    "sid": 239,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The set had 127 correct relations, giving an overall precision of 0.36.",
                    "sid": 240,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results we obtained are shown in Table 1.",
                    "sid": 241,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluating the quality of the assigned probabilities is of greater interest to us.",
                    "sid": 242,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will assess this by using the probabilities as a ranking function on the relations, and determining the precision – recall tradeoff that occurs as we descend this ranked list.",
                    "sid": 243,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We determine precision and recall values for the top k relations for a range of k values.",
                    "sid": 244,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We determine precision by tagging a random sample of size 50.",
                    "sid": 245,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For recall, we had a common, fixed set of 100 correct relations, randomly chosen from all relations.",
                    "sid": 246,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fraction of this set contained in the top k relations gave the corresponding recall value.",
                    "sid": 247,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 4 compares the precision–recall curves given by Logistic Regression and Naive Bayes when using the two feature sets.",
                    "sid": 248,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see significant improvements when using the OFS feature set compared to BFS.",
                    "sid": 249,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results seems to indicate that while these ontological features are not active for all correct relations, when they are active they are very accurate evidence for the relation being true.",
                    "sid": 250,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.",
                    "sid": 251,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discussion.",
                    "sid": 252,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have outlined the basic steps needed to “ontologize” instances of relations of the form (arg1, relation phrase, arg2).",
                    "sid": 253,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This maps the argument strings to a formal taxonomy, adding new concepts to the taxonomy as required, normalizes the relation phrases, and learns meta-relations that form semantic links between relations.",
                    "sid": 254,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This enables a reasoner to draw plausible inferences beyond what is stated directly in the original text.",
                    "sid": 255,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have presented experimental results for several of these steps.",
                    "sid": 256,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have shown that current technology is sufficient to disambiguate noun phrases, to normalize relation phrases, and to learn entailments between relations.",
                    "sid": 257,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also 0.8 0.7 0.6 0.5 0.4 0.3 0.2 0.1 0 0.8 0.7 0.6 0.5 0.4 0.3 0.2 0.1 0 L R O F S L R B F S 0 0.2 0.4 0.6 0.8 1 R e c a l l N B O F S N B B F S 0 0.2 0.4 0.6 0.8 1 R e c a l l Named Entity Classifica tion.",
                    "sid": 258,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Procs.",
                    "sid": 259,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of the Joint SIGDAT Conferen ce on Empirical Methods in Natural Language Processin g and Very Large Corpora, 100–111.",
                    "sid": 260,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dagan, I.; Marcus, S.; and Markovit ch, S. 1993.",
                    "sid": 261,
                    "ssid": 169,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Contextual word similarity and estimatio n from sparse data.",
                    "sid": 262,
                    "ssid": 170,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Proceedin gs of the 31st ACL, 164–171.",
                    "sid": 263,
                    "ssid": 171,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dong, X.; Halevey, A. Y.; and Madhava n, J. 2005.",
                    "sid": 264,
                    "ssid": 172,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reference reconcilia tion in complex informati on spaces.",
                    "sid": 265,
                    "ssid": 173,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Procs.",
                    "sid": 266,
                    "ssid": 174,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of SIGMOD Conferen ce.",
                    "sid": 267,
                    "ssid": 175,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Downey, D.; Etzioni, O.; and Soderland , S. 2005.",
                    "sid": 268,
                    "ssid": 176,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Probabilistic Model of Redundan cy in Informati on Extractio n. In Procs.",
                    "sid": 269,
                    "ssid": 177,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of IJCAI.",
                    "sid": 270,
                    "ssid": 178,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dyer, M. 1983.",
                    "sid": 271,
                    "ssid": 179,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Depth Understa nding.",
                    "sid": 272,
                    "ssid": 180,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MIT Press.",
                    "sid": 273,
                    "ssid": 181,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Frank, E.; Hall, M. A.; Holmes, G.; Kirkby, R.; and Pfahringe r, B. 2005.",
                    "sid": 274,
                    "ssid": 182,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Weka - a machine learning work bench for data mining.",
                    "sid": 275,
                    "ssid": 183,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In The Data Mining and Knowledg e D i s c o v e r y H a n d b o o k . 1 3 0 5 – 1 3 1 4 . Friedland , N. S.; Allen, P. G.; Matthews , G.; Witbrock, M.; Baxter, D.; Curtis, J.; Shepard, B.; P, M.; Angele, J.; Moench, E.; Opperma nn, H.; Wenke, D.; Israel, D.; Chaudhri, V.; Porter, B.; Barker, K.; Fan, J.; Chaw, S. Y.; Yeh, P.; Tecuci, D.; and Clark, P. 2004.",
                    "sid": 276,
                    "ssid": 184,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Project Halo: towards a digital aristotle.",
                    "sid": 277,
                    "ssid": 185,
                    "kind_of_tag": "s"
                },
                {
                    "text": "AI Magazine . Figure 4: Using ontological feature set (OFS) for a Logistic Regression (LR) or Naive Bayes (NB) classifier gives a large boost to the precision-recall compared with a baseline feature set (BFS).",
                    "sid": 278,
                    "ssid": 186,
                    "kind_of_tag": "s"
                },
                {
                    "text": "demonstrated that the resulting ontology can assists in information extraction by validating extractions that are corroborated by the ontology.",
                    "sid": 279,
                    "ssid": 187,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In preliminary experiments the recall- precision curve was raised considerably when we incorporated ontology-based features in estimating relation probabilities.",
                    "sid": 280,
                    "ssid": 188,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The high precision end of the curve was raised from precision 0.51 to precision 0.76, and area under the curve was increased by 32%.",
                    "sid": 281,
                    "ssid": 189,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Much work remains to move from extraction of textual relations to formal ontologies that support automatic reasoning.",
                    "sid": 282,
                    "ssid": 190,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While deep reasoning at a human level is beyond our reach in the near future, a first pass at each of the steps outlined in this paper can be accomplished with current techniques in natural language processing and knowledge representation.",
                    "sid": 283,
                    "ssid": 191,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}