{
    "ID": "Q13-1015",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We introduce a new approach to semantics which combines the benefits of distributional and formal logical semantics.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Distributional models have been successful in modelling the meanings of content words, but logical semantics is necessary to adequately represent many function words.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We follow formal semantics in mapping language to logical representations, but differ in that the relational constants used are induced by offline distributional clustering at the level of predicate- argument structure.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our clustering algorithm is highly scalable, allowing us to run on corpora the size of Gigaword.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different senses of a word are disambiguated based on their induced types.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We outperform a variety of existing approaches on a wide-coverage question answering task, and demonstrate the ability to make complex multi-sentence inferences involving quantifiers on the FraCaS suite.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Mapping natural language to meaning representations is a central challenge of NLP.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There has been much recent progress in unsupervised distributional semantics, in which the meaning of a word is induced based on its usage in large corpora.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach is useful for a range of key applications including question answering and relation extraction (Lin and Pantel, 2001; Poon and Domingos, 2009; Yao et al., 2011).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because such a semantics can be automically induced, it escapes the limitation of depending on relations from hand-built training data, knowledge bases or ontologies, which have proved of limited use in capturing the huge variety of meanings that can be expressed in language.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, distributional semantics has largely developed in isolation from the formal semantics literature.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whilst distributional semantics has been effective in modelling the meanings of content words such as nouns and verbs, it is less clear that it can be applied to the meanings of function words.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantic operators, such as determiners, negation, conjunctions, modals, tense, mood, aspect, and plurals are ubiquitous in natural language, and are crucial for high performance on many practical applications— but current distributional models struggle to capture even simple examples.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conversely, computational models of formal semantics have shown low recall on practical applications, stemming from their reliance on ontologies such as WordNet (Miller, 1995) to model the meanings of content words (Bobrow et al., 2007; Bos and Markert, 2005).",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, consider what is needed to answer a question like Did Google buy YouTube?",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "from the following sentences: 1.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Google purchased YouTube.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "google’s acquisition of youtube. ",
            "number": "2",
            "sents": [
                {
                    "text": "4.",
                    "sid": 18,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "YouTube may be sold to Google.",
                    "sid": 19,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.",
                    "sid": 20,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Google will buy YouTube or Microsoft.",
                    "sid": 21,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.",
                    "sid": 22,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Google didn’t takeover YouTube.",
                    "sid": 23,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All of these require knowledge of lexical semantics (e.g. that buy and purchase are synonyms), but some also need interpretation of quantifiers, negatives, modals and disjunction.",
                    "sid": 24,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It seems unlikely that 179 Transactions of the Association for Computational Linguistics, 1 (2013) 179–192.",
                    "sid": 25,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Action Editor: Johan Bos.",
                    "sid": 26,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Submitted 1/2013; Revised 3/2013; Published 5/2013.",
                    "sid": 27,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Oc 2013 Association for Computational Linguistics.",
                    "sid": 28,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "distributional or formal approaches can accomplish the task alone.",
                    "sid": 29,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose a method for mapping natural language to first-order logic representations capable of capturing the meanings of function words such as every, not and or, but which also uses distributional statistics to model the meaning of content words.",
                    "sid": 30,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach differs from standard formal semantics in that the non-logical symbols used in the logical form are cluster identifiers.",
                    "sid": 31,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Where standard semantic formalisms would map the verb write to a write’ symbol, we map it to a cluster identifier such as relation37, which the noun author may also map to.",
                    "sid": 32,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This mapping is learnt by offline clustering.",
                    "sid": 33,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike previous distributional approaches, we perform clustering at the level of predicate-argument structure, rather than syntactic dependency structure.",
                    "sid": 34,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that we abstract away from many syntactic differences that are not present in the semantics, such as conjunctions, passives, relative clauses, and long-range dependencies.",
                    "sid": 35,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This significantly reduces sparsity, so we have fewer predicates to cluster and more observations for each.",
                    "sid": 36,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of course, many practical inferences rely heavily on background knowledge about the world—such knowledge falls outside the scope of this work.",
                    "sid": 37,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Background.",
                    "sid": 38,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach is based on Combinatory Categorial Grammar (CCG; Steedman, 2000), a strongly lexicalised theory of language in which lexical entries for words contain all language-specific information.",
                    "sid": 39,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lexical entry for each word contains a syntactic category, which determines which other categories the word may combine with, and a semantic interpretation, which defines the compositional semantics.",
                    "sid": 40,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the lexicon may contain the entry: write f- (S\\NP)/NP : λ yλ x.write!(x, y) Crucially, there is a transparent interface between the syntactic category and the semantics.",
                    "sid": 41,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example the transitive verb entry above defines the verb syntactically as a function mapping two noun- phrases to a sentence, and semantically as a binary relation between its two argument entities.",
                    "sid": 42,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means that it is relatively straightforward to deterministically map parser output to a logical form, as in the Boxer system (Bos, 2008).",
                    "sid": 43,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This Every dog barks NP↑/N N S\\NP λ pλ q.∀x[ p(x) =⇒ q(x)] λ x.dog!(x) λ x.bark!(x) > NP↑ λ q.∀x[dog!(x) =⇒ q(x)] > S ∀x[dog!(x) =⇒ bark!(x)] Figure 1: A standard logical form derivation using CCG.",
                    "sid": 44,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NP↑ notation means that the subject is type-raised, and taking the verb-phrase as an argument—so is an abbreviation of S/(S\\NP).",
                    "sid": 45,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is necessary in part to sup port a correct semantics for quantifiers.",
                    "sid": 46,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Input Sentence Shakespeare wrote Macbeth ⇓ Intial semantic analysis writearg0,arg1(shakespeare, macbeth) ⇓ Entity Typing writearg0:PE R,arg1:BOOK (shakespeare:PER, macbeth:BOOK) ⇓ Distributional semantic analysis relation37(shakespeare:PER, macbeth:BOOK) Figure 2: Layers used in our model.",
                    "sid": 47,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "form of semantics captures the underlying predicate- argument structure, but fails to license many important inferences—as, for example, write and author do not map to the same predicate.",
                    "sid": 48,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the lexicon, there is a small set of binary combinators and unary rules, which have a syntactic and semantic interpretation.",
                    "sid": 49,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 gives an example CCG derivation.",
                    "sid": 50,
                    "ssid": 33,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "overview of approach. ",
            "number": "3",
            "sents": [
                {
                    "text": "We attempt to learn a CCG lexicon which maps equivalent words onto the same logical form—for example learning entries such as: author f- N/PP[o f ] : λ xλ y.relation37(x, y) write f- (S\\NP)/NP : λ xλ y.relation37(x, y) The only change to the standard CCG derivation is that the symbols used in the logical form are arbitrary relation identifiers.",
                    "sid": 51,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We learn these by first mapping to a deterministic logical form (using predicates such as author’ and write’), using a process similar to Boxer, and then clustering predicates based on their arguments.",
                    "sid": 52,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This lexicon can then be used to parse new sentences, and integrates seamlessly with CCG theories of formal semantics.",
                    "sid": 53,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typing predicates—for example, determining that writing is a relation between people and books— has become standard in relation clustering (Schoenmackers et al., 2010; Berant et al., 2011; Yao et al., 2012).",
                    "sid": 54,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We demonstate how to build a typing model into the CCG derivation, by subcategorizing all terms representing entities in the logical form with a more detailed type.",
                    "sid": 55,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These types are also induced from text, as explained in Section 5, but for convenience we describe them with human-readable labels, such as PER, LOC and BOOK.",
                    "sid": 56,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A key advantage of typing is that it allows us to model ambiguous predicates.",
                    "sid": 57,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following Berant et al.",
                    "sid": 58,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011), we assume that different type signatures of the same predicate have different meanings, but given a type signature a predicate is unambiguous.",
                    "sid": 59,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example a different lexical entry for the verb born is used in the contexts Obama was born in Hawaii and Obama was born in 1961, reflecting a distinction in the semantics that is not obvious in the syntax1.",
                    "sid": 60,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typing also greatly improves the efficiency of clustering, as we only need to compare predicates with the same type during clustering (for example, we do not have to consider clustering a predicate between people and places with predicates between people and dates).",
                    "sid": 61,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, we focus on inducing binary relations.",
                    "sid": 62,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many existing approaches have shown how to produce good clusterings of (nonevent) nouns (Brown et al., 1992), any of which could be simply integrated into our semantics—but relation clustering remains an open problem (see Section 9).",
                    "sid": 63,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nary relations are binarized, by creating a binary relation between each pair of arguments.",
                    "sid": 64,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, for the sentence Russia sold Alaska to the United States, the system creates three binary relations— corresponding to sellToSomeone(Russia, Alaska), buyFromSomeone(US, Alaska), sellSomethingTo(Russia, US).",
                    "sid": 65,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This transformation does not 1Whilst this assumption is very useful, it does not always hold— for example, the genitive in Shakespeare’s book is ambiguous between ownership and authorship relations even given the types of the arguments.",
                    "sid": 66,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "exactly preserve meaning, but still captures the most important relations.",
                    "sid": 67,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that this allows us to compare semantic relations across different syntactic types—for example, both transitive verbs and argument-taking nouns can be seen as expressing binary semantic relations between entities.",
                    "sid": 68,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows the layers used in our model.",
                    "sid": 69,
                    "ssid": 19,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "initial semantic analysis. ",
            "number": "4",
            "sents": [
                {
                    "text": "The initial semantic analysis maps parser output onto a logical form, in a similar way to Boxer.",
                    "sid": 70,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The semantic formalism is based on Steedman (2012).",
                    "sid": 71,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first step is syntactic parsing.",
                    "sid": 72,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the C&C parser (Clark and Curran, 2004), trained on CCGBank (Hockenmaier and Steedman, 2007), using the refined version of Honnibal et al.",
                    "sid": 73,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) which brings the syntax closer to the predicate- argument structure.",
                    "sid": 74,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An automatic post-processing step makes a number of minor changes to the parser output, which converts the grammar into one more suitable for our semantics.",
                    "sid": 75,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PP (prepositional phrase) and PR (phrasal verb complement) categories are sub-categorised with the relevant preposition.",
                    "sid": 76,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun compounds with the same MUC named-entity type (Chinchor and Robinson, 1997) are merged into a single non-compositional node2 (we otherwise ignore named-entity types).",
                    "sid": 77,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All argument NPs and PPs are type-raised, allowing us to represent quantifiers.",
                    "sid": 78,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All prepositional phrases are treated as core arguments (i.e. given the category PP, not adjunct cat egories like (N\\N)/NP or ((S\\NP)\\(S\\NP))/NP),as it is difficult for the parser to distinguish argu ments and adjuncts.",
                    "sid": 79,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initial semantic lexical entries for almost all words can be generated automatically from the syntactic category and POS tag (obtained from the parser), as the syntactic category captures the underlying predicate-argument structure.",
                    "sid": 80,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use a Davidsonian-style representation of arguments (Davidson, 1967), which we binarize by creating a separate predicate for each pair of arguments of a word.",
                    "sid": 81,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These predicates are labelled with the lemma of the head word and a Propbank-style argument key (Kingsbury and Palmer, 2002), e.g. arg0, argIn.",
                    "sid": 82,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We distinguish noun and verb predicates based on POS 2For example, this allows us to give Barack Obama the semantics λ x.barack obama(x) instead of λ x.barack(x) ∧ obama(x), which is more convenient for collecting distributional statistics.",
                    "sid": 83,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "W or d C at eg or y S e m an tic s A ut o m ati c au th or wr ite N / P P [ o f ] ( S \\ N P ) / N P λ xλ y. au th or arg 0,ar gOf (y, x) λ xλ y. wr ite arg 0,a rg1 (y, x) M an ua l ev er y no t N P↑ /N (S \\ N P) /( S\\ N P) λ pλ q. ∀x [ p( x) → q( x)] λ pλ x. p( x) Figure 3: Example initial lexical entries tag—so, for example, we have different predicates for effect as a noun or verb.",
                    "sid": 84,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This algorithm can be overridden with manual lexical entries for specific closed-class function words.",
                    "sid": 85,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whilst it may be possible to learn these from data, our approach is pragmatic as there are relatively few such words, and the complex logical forms required would be difficult to induce from dis- tributional statistics.",
                    "sid": 86,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We add a small number of lexical entries for words such as negatives (no, not etc.), and quantifiers (numbers, each, every, all, etc.).",
                    "sid": 87,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some example initial lexical entries are shown in Figure 3.",
                    "sid": 88,
                    "ssid": 19,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "entity typing model. ",
            "number": "5",
            "sents": [
                {
                    "text": "Our entity-typing model assigns types to nouns, which is useful for disambiguating polysemous predicates.",
                    "sid": 89,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach is similar to O’Seaghdha (2010) in that we aim to cluster entities based on the noun and unary predicates applied to them (it is simple to convert from the binary predicates to unary predicates).",
                    "sid": 90,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, we want the pair (bornargIn, 1961) to map to a DAT type, and (bornargIn, Hawaii) to map to a LOC type.",
                    "sid": 91,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is nontrivial, as both the predicates and arguments can be ambiguous between multiple types—but topic models offer a good solution (described below).",
                    "sid": 92,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Topic Model.",
                    "sid": 93,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We assume that the type of each argument of a predicate depends only on the predicate and argument, although Ritter et al.",
                    "sid": 94,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) demonstrate an advantage of modelling the joint probability of the types of multiple arguments of the same predicate.",
                    "sid": 95,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the standard Latent Dirichlet Allocation model (Blei et al., 2003), which performs comparably to more complex models proposed in O’Seaghdha (2010).",
                    "sid": 96,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In topic-modelling terminology, we construct a document for each unary predicate (e.g. bornargIn), based on all of its argument entities (words).",
                    "sid": 97,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We assume that these arguments are drawn from a small number of types (topics), such as PER, DAT or LOC3.",
                    "sid": 98,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each type j has a multinomial distribution φ j over arguments (for example, a LOC type is more likely to generate Hawaii than 1961).",
                    "sid": 99,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each unary predicate i has a multinomial distribution θi over topics, so the bornargIn predicate will normally generate a DAT or LOC type.",
                    "sid": 100,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sparse Dirichlet priors α and β on the multinomials bias the distributions to be peaky.",
                    "sid": 101,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parameters are estimated by Gibbs sampling, using the Mallet implementation (McCallum, 2002).",
                    "sid": 102,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The generative story to create the data is: For every type k: Draw the p(arg|k) distribution φk from Dir(β ) For every unary predicate i: Draw the p(ty pe|i) distribution θi from Dir(α ) For every argument j: Draw a type zi j from Mult(θi) Draw an argument wi j from Mult(φθi ) 5.2 Typing in Logical Form.",
                    "sid": 103,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the logical form, all constants and variables representing entities x can be assigned a distribution over types px(t) using the type model.",
                    "sid": 104,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An initial type distribution is applied in the lexicon, using the φ distributions for the types of nouns, and the θi distributions for the type of arguments of binary predicates (inverted using Bayes’ rule).",
                    "sid": 105,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then at each β - reduction in the derivation, we update probabilities of the types to be the product of the type distributions of the terms being reduced.",
                    "sid": 106,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If two terms x and 3Types are induced from the text, but we give human-readable labels here for convenience.",
                    "sid": 107,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "file a suit (S\\NP)/NP NP↑ DOC = 0.5 ) PER = 0.7 ) CLOTHES = 0.6 ) λ y : L E G A L = 0.",
                    "sid": 108,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 CLOT HES = 0.01 . . .",
                    "sid": 109,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "λ x : ORG = 0.2 . . .",
                    "sid": 110,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "f ilearg0 ,arg1 (x, y) λ p.∃y : S \\ N P LEGA L = 0.3 DOC = 0.001 . . .",
                    "sid": 111,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[suit!",
                    "sid": 112,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(y) ∧ p(y)] < λ x : PER = 0.7 ORG = 0.2 ...",
                    "sid": 113,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": ") ∃y : LEGAL = 0.94 CLOTHES = 0.05 DOC = 0.004 ...",
                    "sid": 114,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": ") )[suit!(y) ∧ f ilearg0,arg1 (x, y)] Figure 4: Using the type model for disambiguation in the derivation of file a suit.",
                    "sid": 115,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Type distributions are shown after the variable declarations.",
                    "sid": 116,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both suit and the object of file are lexically ambiguous between different types, but after the β -reduction only one interpretation is likely.",
                    "sid": 117,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the verb were wear, a different interpretation would be preferred.",
                    "sid": 118,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "y combine to a term z: pz(t) = px(t) py(t) ∑ t!",
                    "sid": 119,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "px(t!) py(t!) The entity-pair counts for authorarg0:PER,argOf :BOOK may be similar, on the assumption that both are samples from the same underlying semantic relation.",
                    "sid": 120,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To find the expected number of occurrences of For example, in wore a suit and file a suit, the variable representing suit may be lexically ambiguous between CLOTHES and LEGAL types, but the variables representing the objects of wear and f ile will have preferences that allow us to choose the correct type when the terms combine.",
                    "sid": 121,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 4 shows an example derivation using the type model for disambiguation4.",
                    "sid": 122,
                    "ssid": 34,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "distributional relation clustering. ",
            "number": "6",
            "sents": [
                {
                    "text": "Model The typed binary predicates can be grouped into clusters, each of which represents a distinct semantic relation.",
                    "sid": 123,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that because we cluster typed predicates, bornarg0:PE R,argIn:LOC and bornarg0:PE R,argIn:DAT can be clustered separately.",
                    "sid": 124,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1 Corpus statistics.",
                    "sid": 125,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typed binary predicates are clustered based on the expected number of times they hold between each argument-pair in the corpus.",
                    "sid": 126,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means we create a single vector of argument-pair counts for each predicate (not a separate vector for each argument).",
                    "sid": 127,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the vector for the typed predicate writearg0:PE R,arg1:BOOK may contain nonzero counts for entity-pairs such as (Shakespeare, Macbeth), (Dickens, Oliver Twist) and (Rowling, Harry Potter).",
                    "sid": 128,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4Our implementation follows Steedman (2012) in using Generalized Skolem Terms rather than existential quantifiers, in order to capture quantifier scope alternations monotonically, but we omit these from the example to avoid introducing new notation.",
                    "sid": 129,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "argument-pairs for typed binary predicates in a corpus, we first apply the type model to the derivation of each sentence, as described in Section 5.2.",
                    "sid": 130,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This outputs untyped binary predicates, with distributions over the types of their arguments.",
                    "sid": 131,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The type of the predicate must match the type of its arguments, so the type distribution of a binary predicate is simply the joint distribution of the two argument type distributions.",
                    "sid": 132,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if the arguments in a bornarg0,argIn(obama, hawaii) derivation have the respective type distributions (PER=0.9, LOC=0.1) and (LOC=0.7, DAT=0.3), the distribution over binary typed predicates is (bornarg0:PE R,argIn:LOC =0.63, bornarg0:PE R,argIn:DAT =0.27, etc.) The expected counts for (obama, hawaii) in the vectors for bornarg0:PE R,argIn:LOC and bornarg0:PE R,argIn:DAT are then incremented by these probabilities.",
                    "sid": 133,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.2 Clustering.",
                    "sid": 134,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many algorithms have been proposed for clustering predicates based on their arguments (Poon and Domingos, 2009; Yao et al., 2012).",
                    "sid": 135,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of relations in the corpus is unbounded, so the clustering algorithm should be non-parametric.",
                    "sid": 136,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also important that it remains tractable for very large numbers of predicates and arguments, in order to give us a greater coverage of language than can be achieved by hand-built ontologies.",
                    "sid": 137,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We cluster the typed predicate vectors using the Chinese Whispers algorithm (Biemann, 2006)— although somewhat ad-hoc, it is both non-parametric and highly scalable5.",
                    "sid": 138,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This has previously been used for noun-clustering by Fountain and Lapata (2011), who argue it is a cognitively plausible model for language acquisition.",
                    "sid": 139,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The collection of predicates and arguments is converted into a graph with one node per predicate, and edge weights representing the similarity between predicates.",
                    "sid": 140,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Predicates with different types have zero-similarity, and otherwise similarity is computed as the cosine-similarity of the tfidf vectors of argument-pairs.",
                    "sid": 141,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We prune nodes occurring fewer than 20 times, edges with weights less be untyped), we perform a deterministic lookup in the cluster model learned in Section 6, using all possible corresponding typed predicates.",
                    "sid": 142,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This allows us to represent the binary predicates as packed predicates: functions from argument types to relations.",
                    "sid": 143,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if the clustering maps bornarg0:PE R,argIn:LOC to rel49 (“birthplace”) and bornarg0:PE R,argIn:DAT to rel53 (“birthdate”), our lexicon contains the following packed lexical entry (type-distributions on the variables are suppressed): born f- (S\\NP)/PP[in] : ) than 10−3, and a short list of stop predicates.",
                    "sid": 144,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm proceeds as follows: λ yλ x.",
                    "sid": 145,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(x : PER, y : LOC) ⇒ rel49 (x : PER, y : DAT ) ⇒ rel53 (x, y) 1.",
                    "sid": 146,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each predicate p is assigned to a different se-.",
                    "sid": 147,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "mantic relation rp 2.",
                    "sid": 148,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Iterate over the predicates p in a random order.",
                    "sid": 149,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 150,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Set rp = arg max ∑p! ✶r=rp!",
                    "sid": 151,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sim( p, p!), where.",
                    "sid": 152,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "rsim( p, p!)",
                    "sid": 153,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is the distributional similarity be tween p and p!, and ✶r=r! is 1 iff r=r’ and 0 otherwise.",
                    "sid": 154,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 155,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Repeat (2.) to convergence..",
                    "sid": 156,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distributions over argument types then imply a distribution over relations.",
                    "sid": 157,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if the packed-predicate for bornarg0,argIn is applied to arguments Obama and Hawaii, with respective type distributions (PER=0.9, LOC=0.1) and (LOC=0.7, DAT=0.3)6, the distribution over relations will be (rel49=0.63, rel53=0.27, etc.).",
                    "sid": 158,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If 1961 has a type-distribution (LOC=0.1, DAT=0.9), the output packed-logical form for Obama was born in Hawaii in 1961 will be:",
                    "sid": 159,
                    "ssid": 37,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "semantic parsing using relation. ",
            "number": "7",
            "sents": [
                {
                    "text": "rel49=0.63 rel49=0.09     Clusters rel53=0.27 (ob, hw) ∧ rel53=0.81 (ob, 1961)  The final phase is to use our relation clusters in the ...   ...  lexical entries of the CCG semantic derivation.",
                    "sid": 160,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is slightly complicated by the fact that our predicates are lexically ambiguous between all the possible types they could take, and hence the relations they could express.",
                    "sid": 161,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the system cannot tell whether born in is expressing a birthplace or birthdate relation until later in the derivation, when it combines with its arguments.",
                    "sid": 162,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, all the possible logical forms are identical except for the symbols used, which means we can produce a packed logical form capturing the full distribution over logical forms.",
                    "sid": 163,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To do this, we make the predicate a function from argument types to relations.",
                    "sid": 164,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each word, we first take the lexical semantic definition produced by the algorithm in Section 4.",
                    "sid": 165,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For binary predicates in this definition (which will 5We also experimented with a Dirichlet Process Mixture Model (Neal, 2000), but even with the efficient A* search algorithms introduced by Daume´ III (2007), the cost of inference was found to be prohibitively high when run at large scale.",
                    "sid": 166,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability of a given logical form can be read from this packed logical form.",
                    "sid": 167,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "8",
            "sents": [
                {
                    "text": "Our approach aims to offer a strong model of both formal and lexical semantics.",
                    "sid": 168,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We perform two evaluations, aiming to target each of these separately, but using the same semantic representations in each.",
                    "sid": 169,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We train our system on Gigaword (Graff et al., 2003), which contains around 4 billion words of newswire.",
                    "sid": 170,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The type-model is trained using 15 types7, and 5,000 iterations of Gibbs sampling (using the distributions from the final sample).",
                    "sid": 171,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 6These distributions are composed from the type-distributions for both the predicate and argument, as explained in Section 5 7This number was chosen by examination of models trained with different numbers of types.",
                    "sid": 172,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm produces semantically coherent clusters for much larger numbers of types, but many of these are fine-grained categories of people, which introduces sparsity in the relation clustering.",
                    "sid": 173,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ty pe To p W or ds 1 2 5 8 10 s u s p e c t, a s s a il a n t, f u g it i v e , a c c o m p li c e a u t h o r , s i n g e r , a c t r e s s , a c t o r , d a d ci ty , ar e a, c o u nt ry , re gi o n, to w n, c a pi t al s u b si di ar y, a ut o m a k er , ai rli n e, C o. , G M m u si c al , t h ril le r, s e q u el , s p e ci al Table 1: Most probable terms in some clusters induced by the Type Model.",
                    "sid": 174,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "shows some example types.",
                    "sid": 175,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relation clustering uses only proper nouns, to improve precision (sparsity problems are partly offset by the large input corpus).",
                    "sid": 176,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Aside from parsing, the pipeline takes around a day to run using 12 cores.",
                    "sid": 177,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8.1 Question Answering Experiments.",
                    "sid": 178,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As yet, there is no standard way of evaluating lexical semantics.",
                    "sid": 179,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Existing tasks like Recognising Textual Entailment (RTE; Dagan et al., 2006) rely heavily on background knowledge, which is beyond the scope of this work.",
                    "sid": 180,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intrinsic evaluations of entailment relations have low inter-annotator agreement (Szpektor et al., 2007), due to the difficulty of evaluating relations out of context.",
                    "sid": 181,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our evaluation is based on that performed by Poon and Domingos (2009).",
                    "sid": 182,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We automatically construct a set of questions by sampling from text, and then evaluate how many answers can be found in a different corpus.",
                    "sid": 183,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From dependency-parsed answers to the same question (e.g. What did Google buy?",
                    "sid": 184,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "may have many valid answers), and all of these contribute to the result.",
                    "sid": 185,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As none of the systems model tense or temporal semantics, annotators were instructed to annotate answers as correct if they were true at any time.",
                    "sid": 186,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach means we evaluate on relations in proportion to corpus frequency.",
                    "sid": 187,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We sample 1000 questions from the New York Times subset of Gigaword from 2010, and search for answers in the New York Times from 2009.",
                    "sid": 188,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluate the following approaches: • CCG-Baseline The logical form produced by our CCG derivation, without the clustering.",
                    "sid": 189,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• CCGWordNet The CCG logical form, plus WordNet as a model of lexical semantics.",
                    "sid": 190,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• CCGDistributional The logical form including the type model and clusters.",
                    "sid": 191,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Relational LDA An LDA based model for clustering dependency paths (Yao et al., 2011).",
                    "sid": 192,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We train on New York Times subset of Gigaword9, using their setup of 50 iterations with 100 relation types.",
                    "sid": 193,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Reverb A sophisticated Open Information Extraction system (Fader et al., 2011).",
                    "sid": 194,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unsupervised Semantic Parsing (USP; Poon and Domingos, 2009; USP; Poon and Domingos, 2010; USP; Titov and Klementiev, 2011) would be another nsub j dob j nsub j newswire, we sample either X ← verb → Y, X ← obvious baseline.",
                    "sid": 195,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, memory requirements pob j nsub j dob j pob j verb → Y or X ← be → noun → Y patterns, mean it is not possible to run at this scale (our system where X and Y are proper nouns and the verb is not on a list of stop verbs, and deterministically convert these to questions.",
                    "sid": 196,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, from Google bought YouTube we create the questions What did Google buy?",
                    "sid": 197,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and What bought YouTube?.",
                    "sid": 198,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The task is to find proper-noun answers to these questions in a different corpus, which are then evaluated by human annotators based on the sentence the answer was retrieved from8.",
                    "sid": 199,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Systems can return multiple 8Common nouns are filtered automatically.",
                    "sid": 200,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To focus on evaluating the semantics, annotators ignored garbled sentences due to errors pre-processing the corpus (these are excluded from the results).",
                    "sid": 201,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also automatically exclude weekday and month answers, which are overwhelmingly syntax errors for all systems—e.g. treating Tuesday as an object in Obama announced Tuesday that... is trained on 4 orders of magnitude more data than the USP evaluation).",
                    "sid": 202,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yao et al.",
                    "sid": 203,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011) found it had comparable performance to Relational LDA.",
                    "sid": 204,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the CCG models, rather than performing full first-order inference on a large corpus, we simply test whether the question predicate subsumes a candidate answer predicate, and whether the arguments match10.",
                    "sid": 205,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of CCGDistributional, we calculate the probability that the two packed-predicates 9This is around 35% of Gigaword, and was the largest scale possible on our resources.",
                    "sid": 206,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "10We do this as it is much more efficient than full first-order theorem-proving.",
                    "sid": 207,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We could in principle make additional inferences with theorem-proving, such as answering What did Google buy?",
                    "sid": 208,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "from Google bought the largest video website and YouTube is the largest video website.",
                    "sid": 209,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "S ys te m An sw er s C or re ct R el ati onal L D A R ev er b C CG B as eli ne C CG W or d N et C CG Di str ib uti on al @ 25 0 C CG Di str ib uti on al @ 50 0 70 46 18 0 20 3 21 1 25 0 50 0 11 .6 % 89 .4 % 95 .8 % 94 .8 % 94 .1 % 82 .0 % Table 2: Results on wide-coverage Question Answering task.",
                    "sid": 210,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CCGDistributional ranks question/answer pairs by confidence—@250 means we evaluate the top 250 of these.",
                    "sid": 211,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not possible to give a recall figure, as the total number of correct answers in the corpus is unknown.",
                    "sid": 212,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "are in the same cluster, marginalizing over their argument types.",
                    "sid": 213,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Answers are ranked by this probability.",
                    "sid": 214,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For CCGWordNet, we check if the question predicate is a hypernym of the candidate answer predicate (using any WordNet sense of either term).",
                    "sid": 215,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results are shown in Table 2.",
                    "sid": 216,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Relational-LDA induces many meaningful clusters, but predicates must be assigned to one of 100 relations, so results are dominated by large, noisy clusters (it is not possible to take the N-best answers as the cluster assignments do not have a confidence score).",
                    "sid": 217,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CCG- Baseline errors are mainly caused by parser errors, or relations in the scope of non-factive operators.",
                    "sid": 218,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CCGWordNet adds few answers to CCG-Baseline, reflecting the limitations of hand-built ontologies.",
                    "sid": 219,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CCGDistributional substantially improves recall over other approaches whilst retaining good precision, demonstrating that we have learnt a powerful model of lexical semantics.",
                    "sid": 220,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows some correctly answered questions.",
                    "sid": 221,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system improves over the baseline by mapping expressions such as merge with and acquisition of to the same relation cluster.",
                    "sid": 222,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many of the errors are caused by conflating predicates where the entailment only holds in one direction, such as was elected to with ran for.",
                    "sid": 223,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hierarchical clustering could be used to address this.",
                    "sid": 224,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8.2 Experiments on the FraCaS Suite.",
                    "sid": 225,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are also interested in evaluating our approach as a model of formal semantics—demonstrating that it is possible to integrate the formal semantics of Steedman (2012) with our distributional clusters.",
                    "sid": 226,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The FraCaS suite (Cooper et al., 1996)11 contains a hand-built set of entailment problems designed to be challenging in terms of formal semantics.",
                    "sid": 227,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use Section 1, which contains 74 problems requiring an understanding of quantifiers12.",
                    "sid": 228,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They do not require any knowledge of lexical semantics, meaning we can evaluate the formal component of our system in isolation.",
                    "sid": 229,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we use the same representations as in our previous experiment, even though the clusters provide no benefit on this task.",
                    "sid": 230,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 5 gives an example problem.",
                    "sid": 231,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The only previous work we are aware of on this dataset is by MacCartney and Manning (2007).",
                    "sid": 232,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach learns the monotonicity properties of words from a hand-built training set, and uses this to transform a sentence into a polarity annotated string.",
                    "sid": 233,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system then aims to transform the premise string into a hypothesis.",
                    "sid": 234,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Positively polarized words can be replaced with less specific ones (e.g. by deleting adjuncts), whereas negatively polarized words can be replaced with more specific ones (e.g. by adding adjuncts).",
                    "sid": 235,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whilst this is high- precision and often useful, this logic is unable to perform inferences with multiple premise sentences (in contrast to our first-order logic).",
                    "sid": 236,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Development consists of adding entries to our lexicon for quantifiers.",
                    "sid": 237,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For simplicity, we treat multi- word quantifiers like at least a few, as being multi- word expressions—although a more compositional analysis may be possible.",
                    "sid": 238,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following MacCartney and Manning (2007), we do not use held-out data— each problem is designed to test a different issue, so it is not possible to generalize from one subset of the suite to another.",
                    "sid": 239,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we are interested in evaluating the semantics, not the parser, we manually supply gold-standard lexical categories for sentences with parser errors (any syntactic mistake causes incorrect semantics).",
                    "sid": 240,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our derivations produce a distribution over logical forms—we license the inference if it holds in any interpretation with nonzero probability.",
                    "sid": 241,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the Prover9 (McCune, 2005) theorem prover for inference, returning yes if the premise implies the hypothesis, no if it implies the negation of the hypothesis, and unknown otherwise.Results are shown in Table 4.",
                    "sid": 242,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our system im 11We use the version converted to machine readable format by MacCartney and Manning (2007) 12Excluding 6 problems without a defined solution.",
                    "sid": 243,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Q ue sti o n A ns w er S en te nc e W ha t di d De lta m er ge wi th ? W ha t sp ok e wi th H u Ji nt ao ? W h a t a r r i v e d i n C o l o r a d o ? W h a t r a n f o r C o n g r e s s ? N ort h w es t O ba m a Za zi Yo un g Th e 74 7 fre ig ht er s ca m e wi th D elt a’s ac qu isit io n of N ort h w es t O b a m a c o n v e y e d h i s r e s p e c t f o r t h e D a l a i L a m a t o C h i n a ’ s p r e s i d e n t H u J i n t a o d u r i n g t h e i r f i r s t m e e t i n g . . .",
                    "sid": 244,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Za zi fle w ba ck to Co lor ad o. . . .",
                    "sid": 245,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yo un g wa s el ec te d to Co ng re ss in 19 72 Table 3: Example questions correctly answered by CCGDistributional.",
                    "sid": 246,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pr e mi se s: Ev er y Eu ro pe an ha s th e rig ht to liv e in E ur op e. Ev er y Eu ro pe an is a pe rs on . Ev er y pe rs on wh o ha s th e rig ht to liv e in Eu ro pe ca n tra vel fre ely wi thi n E ur op e. Hy po th es is: Ev er y Eu ro pe an ca n tra vel fre ely wi thi n E ur op e S ol ut io n: Ye s Figure 5: Example problem from the FraCaS suite.",
                    "sid": 247,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sy ste m Si n gl e Pr emi se M ult ipl e Pr emi ses Ma cC art ne y& Ma nni ng 07 Ma cC art ne y& Ma nni ng 08 C CG Di st (p ar se r sy nt ax ) C CG Di st (g ol d sy nt ax ) 8 4 % 9 8 % 7 0 % 8 9 % 5 0 % 8 0 % Table 4: Accuracy on Section 1 of the FraCaS suite.",
                    "sid": 248,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Problems are divided into those with one premise sentence (44) and those with multiple premises (30).",
                    "sid": 249,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "proves on previous work by making multi-sentence inferences.",
                    "sid": 250,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Causes of errors include missing a distinct lexical entry for plural the, only taking existential interpretations of bare plurals, failing to interpret mass-noun determiners such as a lot of, and not providing a good semantics for non-monotone determiners such as most.",
                    "sid": 251,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe these problems will be surmountable with more work.",
                    "sid": 252,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Almost all errors are due to incorrectly predicting unknown — the system makes just one error on yes or no predictions (with or without gold syntax).",
                    "sid": 253,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that making first-order logic inferences in applications will not harm precision.",
                    "sid": 254,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are less robust than MacCartney and Manning (2007) to syntax errors but, conversely, we are able to attempt more of the problems (i.e. those with multi-sentence premises).",
                    "sid": 255,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other approaches based on distributional semantics seem unable to tackle any of these problems, as they do not represent quantifiers or negation.",
                    "sid": 256,
                    "ssid": 89,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related. ",
            "number": "9",
            "sents": [
                {
                    "text": "Work Much work on semantics has taken place in a supervised setting—for example the GeoQuery (Zelle and Mooney, 1996) and ATIS (Dahl et al., 1994) semantic parsing tasks.",
                    "sid": 257,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach makes sense for generating queries for a specific database, but means the semantic representations do not generalize to other datasets.",
                    "sid": 258,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There have been several attempts to annotate larger corpora with semantics—such as Ontonotes (Hovy et al., 2006) or the Groningen Meaning Bank (Basile et al., 2012).",
                    "sid": 259,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These typically map words onto senses in ontologies such as Word- Net, VerbNet (Kipper et al., 2000) and FrameNet (Baker et al., 1998).",
                    "sid": 260,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, limitations of these ontologies mean that they do not support inferences such as X is the author of Y → X wrote Y. Given the difficulty of annotating large amounts of text with semantics, various approaches have attempted to learn meaning without annotated text.",
                    "sid": 261,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Distant Supervision approaches leverage existing knowledge bases, such as Freebase (Bollacker et al., 2008), to learn semantics (Mintz et al., 2009; Krishnamurthy and Mitchell, 2012).",
                    "sid": 262,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dependency-based Compositional Semantics (Liang et al., 2011) learns the meaning of questions by using their answers as denotations— but this appears to be specific to question parsing.",
                    "sid": 263,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such approaches can only learn the pre-specified relations in the knowledge base.",
                    "sid": 264,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approaches discussed so far in this section have all attempted to map language onto some pre specified set of relations.",
                    "sid": 265,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Various attempts have been made to instead induce relations from text by clustering predicates based on their arguments.",
                    "sid": 266,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Yao et al.",
                    "sid": 267,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011) propose a series of LDA- based models which cluster relations between entities based on a variety of lexical, syntactic and semantic features.",
                    "sid": 268,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unsupervised Semantic Parsing (Poon and Domingos, 2009) recursively clusters fragments of dependency trees based on their arguments.",
                    "sid": 269,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although USP is an elegant model, it is too computationally expensive to run on large corpora.",
                    "sid": 270,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also based on frame semantics, so does not cluster equivalent predicates with different frames.",
                    "sid": 271,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To our knowledge, our work is the first such approach to be integrated within a linguistic theory supporting formal semantics for logical operators.",
                    "sid": 272,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Vector space models represent words by vectors based on co-occurrence counts.",
                    "sid": 273,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recent work has tackled the problem of composing these matrices to build up the semantics of phrases or sentences (Mitchell and Lapata, 2008).",
                    "sid": 274,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another strand (Coecke et al., 2010; Grefenstette et al., 2011) has shown how to represent meanings as tensors, whose order depends on the syntactic category, allowing an elegant correspondence between syntactic and semantic types.",
                    "sid": 275,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Socher et al.",
                    "sid": 276,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2012) train a composition function using a neural network—however their method requires annotated data.",
                    "sid": 277,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also not obvious how to represent logical relations such as quantification in vector-space models.",
                    "sid": 278,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Baroni et al.",
                    "sid": 279,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2012) make progress towards this by learning a classifier that can recognise entailments such as all dogs =⇒ some dogs, but this remains some way from the power of first-order theorem proving of the kind required by the problem in Figure 5.",
                    "sid": 280,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An alternative strand of research has attempted to build computational models of linguistic theories based on formal compositional semantics, such as the CCG-based Boxer (Bos, 2008) and the LFG- based XLE (Bobrow et al., 2007).",
                    "sid": 281,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such approaches convert parser output into formal semantic representations, and have demonstrated some ability to model complex phenomena such as negation.",
                    "sid": 282,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For lexical semantics, they typically compile lexical resources such as VerbNet and WordNet into inference rules—but still achieve only low recall on open- domain tasks, such as RTE, mostly due to the low coverage of such resources.",
                    "sid": 283,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Garrette et al.",
                    "sid": 284,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011) use distributional statistics to determine the probability that a WordNet-derived inference rule is valid in a given context.",
                    "sid": 285,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach differs in that we learn inference rules not present in WordNet.",
                    "sid": 286,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our lexical semantics is integrated into the lexicon, rather than being implemented as additional inference rules, meaning that inference is more efficient, as equivalent statements have the same logical form.",
                    "sid": 287,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Natural Logic (MacCartney and Manning, 2007) offers an interesting alternative to symbolic logics, and has been shown to be able to capture complex logical inferences by simply identifying the scope of negation in text.",
                    "sid": 288,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach achieves similar precision and much higher recall than Boxer on the RTE task.",
                    "sid": 289,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their approach also suffers from such limitations as only being able to make inferences between two sentences.",
                    "sid": 290,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also sensitive to word order, so cannot make inferences such as Shakespeare wrote Macbeth =⇒ Macbeth was written by Shakespeare.",
                    "sid": 291,
                    "ssid": 35,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions and future work. ",
            "number": "10",
            "sents": [
                {
                    "text": "This is the first work we are aware of that combines a distributionally induced lexicon with formal semantics.",
                    "sid": 292,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experiments suggest our approach compares favourably with existing work in both areas.",
                    "sid": 293,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many potential areas for improvement remain.",
                    "sid": 294,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hierachical clustering would allow us to capture hypernym relations, rather than the synonyms captured by our flat clustering.",
                    "sid": 295,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is much potential for integrating existing hand-built resources, such as Ontonotes and WordNet, to improve the accuracy of clustering.",
                    "sid": 296,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are cases where the existing CCGBank grammar does not match the required predicate-argument structure—for example in the case of light verbs.",
                    "sid": 297,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It may be possible to re- bank CCGBank, in a way similar to Honnibal et al.",
                    "sid": 298,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010), to improve it on this point.",
                    "sid": 299,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "We thank Christos Christodoulopoulos, Tejaswini Deoskar, Mark GranrothWilding, Ewan Klein, Katrin Erk, Johan Bos and the anonymous reviewers for their helpful comments, and Limin Yao for sharing code.",
                    "sid": 300,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work was funded by ERC Advanced Fellowship 249520 GRAMPLUS and IP ECFP7 270273 Xperience.",
                    "sid": 301,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}