{
    "ID": "W01-1627",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Dialogue analysis is widely used in oncol­ogy for training health professionals in communication skills.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parameters and tagsets have been developed indepen­dently of work in natural language pro­cessing.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In relation to emergent stan­dards in NLP, syntactic tagging is mini­mal, semantics is domain-speci.c, prag­matics is comparable, and the analysis of cognitive a.ect is richly developed.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We suggest productive directions for conver­gence.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "motivation",
            "number": "1",
            "sents": [
                {
                    "text": "Dialogue analysis systems have been developed in oncology as a tool for assessing and improv­ing the communication skills of health profession­als.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rates of psychiatric morbidity (clinical anxi­ety and depression) in cancer patients are lowered when health professionals have adequate commu­nication skills to discover and address the patients’ concerns and worries.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Health professionals inter­viewing patients sometimes exhibit negative be­haviours, such as “blocking” a certain line of in­vestigation rather than encouraging the patient to describe his or her problem.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, a skilled interviewer uses active interven­tions to direct the progress of the interview, as well as more passive responses.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several oncology research groups have demonstrated that these pat­terns can be detected and quanti.ed through anal­ysis of conversations between health professionals and patients.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This in turn can form a basis for more e.ective training in communication skills.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Psychological Medicine Group at Manch­ester (PMG), funded by the Cancer Research Campaign (CRC), is a leading group in dialogue analysis in oncology.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper describes the parameters and tagsets (analogous to “Dialogue Act” tagging (Stolcke et al 2000)), which they and three other groups have developed for this highly specialised domain.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This domain o.ers an interesting contrast to the “instructional” or “service” dialogues commonly studied.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The health professional is the “expert” in the conventional sense, and at times conveys med­ical information to the less knowledgeable patient in a conventional way.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At other times, the patient should be seen as the “expert” with regard to his or her own perceived physical and mental condi­tion, and the task of the health professional is ef­fectively that of “knowledge elicitation” as under­stood in expert systems development.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This .exi­ble and dynamic shifting of participants’ roles in a dialogue poses an interesting challenge, compared to the clearly de.ned and static roles assumed in much work in dialogue analysis.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "parameters for dialogue tagging. ",
            "number": "2",
            "sents": [
                {
                    "text": "Complete and accurate tagging of dialogue must encode a number of independent aspects of each utterance.",
                    "sid": 17,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are represented as “layers” in the DAMSL system (Core & Allen 1997).",
                    "sid": 18,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Form-based tags (question, statement) are sup­plemented with diacritics indicating other types of information, such as task-management or communication-management.",
                    "sid": 19,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The four oncology dialogue tagging systems considered here all share this basic principle, al­though they di.er in the speci.cs.",
                    "sid": 20,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Butow et al (1995:1115) cite the recognition as early as 1983 of “layers of meaning ... such as the con­tent, the process, the emotion and the purpose”.",
                    "sid": 21,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their own CNLOGIT system encodes three “di­mensions”: “source” (who is speaking), “process” (questions, responses, initiated statements), and “content”.",
                    "sid": 22,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A complete dialogue can be mapped into a three-dimensional information space, and measures can be applied such as how much time was spent in each cell of the cube.",
                    "sid": 23,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ong et al (1998) use the Roter Interaction Analysis Sys­tem (RIAS).",
                    "sid": 24,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each utterance in a dialogue is cat­egorised, and also rated on .ve distinct “global a.ect” scales.",
                    "sid": 25,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Medical Interaction Process System (MIPS) of Ford et al (2000) also stresses the multidimensional nature of dialogue annota­tion, using .fteen “content codes” and eight “af­fective modes”.",
                    "sid": 26,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PMG (Maguire & Faulkner 1988; Maguire p.c.) have separate tagsets for Form, Function, Content, Level, Cue, Cue Management, Blocking, and Focus.",
                    "sid": 27,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One can see an implicit consensus here that (to use NLP terms) syntactic form, overt semantic content, pragmatic force, and cognitive a.ect are distinct and are all signi.cant.",
                    "sid": 28,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The di.ering de­grees of detail and prominence they receive in the di.erent systems are discussed under those head­ings in the next section.",
                    "sid": 29,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "dialogue tagsets. ",
            "number": "3",
            "sents": [
                {
                    "text": "Not surprisingly, the actual tagsets developed in oncology re.ect their domain more closely than the parameter sets do.",
                    "sid": 30,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In comparison with NLP work, syntactic classi.cation is minimal and func­tionally oriented, while communication manage­ment and psychological / emotional loading re­ceive prominent, .negrained analysis.",
                    "sid": 31,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Form.",
                    "sid": 32,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although all four oncology systems encode the form of an utterance in some way, the classi.ca­tions have a strong pragmatic bias.",
                    "sid": 33,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Questions are distinguished, not in traditional syntactic terms as yes-no or wh-, but according to their e.ect on the .ow of the dialogue.",
                    "sid": 34,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The simplest set is that of Butow et al: Open Question, Closed Question, Response to Question, Statement, Other.",
                    "sid": 35,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PMG add Directive Question (open), Directive Question (closed), Screening Question, Leading Question, Multiple Question.",
                    "sid": 36,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ford et al distinguish “modes” from “con­tent codes”, but even the modes encode coarse-grained content information as well as a.ective classi.cation.",
                    "sid": 37,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The form categories of Ong et al are “instrumental” (Directions, Question-asking, Information-giving, &c), and they specify that “if a decision must be made between categorizing an utterance in an instrumental or a.ect category, the a.ect category should be used” -quite rea­sonably, given the purpose of their analysis.",
                    "sid": 38,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even with a prior commitment to maintaining separate and independent levels of analysis, some leakage between levels can occur.",
                    "sid": 39,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(The set of forty-two Dialogue Act labels used by Stolcke et al (2000) shows some similar mixing of levels, includ­ing both purely syntactic tags (such as Declarative Yes-No Question) and a.ective tags (such as Ap­preciation).)",
                    "sid": 40,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Content.",
                    "sid": 41,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The content of an utterance is also encoded in all four systems, and the tagsets on this level are the most domain-speci.c. Butow et al cite seven con­tent categories: Treatment, Diagnosis, Prognosis, History, Other medical matters, Social matters.",
                    "sid": 42,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ford et al, with 15 content codes, and PMG, with 38, are the most fully developed.",
                    "sid": 43,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both include Medical (further distinguished by PMG, with four categories for diagnosis and two for prog­nosis), Treatment, Psychological, Social, Lifestyle, &c. PMG are particularly detailed in their cat­egories for psychological and emotional issues, shading into the a.ect level: Concerns, Feelings, Emotions, Religion, &c. Again, this is what one would expect, given that their reason for carry­ing out the analysis is to assess the health pro­fessional’s success in getting the patient to talk about exactly these issues.",
                    "sid": 44,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both Ford and PMG also include the opening and closing of the interview under this heading, where it sits oddly.",
                    "sid": 45,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A separate level of commu­nication management, as in DAMSL, would ac­commodate these and the open/ closed/ directive question distinction currently made in the Form tagsets, clarifying all three.",
                    "sid": 46,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Pragmatics.",
                    "sid": 47,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As noted above, the Form classes used in the four coding schemes express more pragmatic than syn­tactic information.",
                    "sid": 48,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ong et al’s “instrumental clus­ters and categories” (Directions, Question-ask­ing, Information-giving, Counselling) can be con­sidered pragmatic.",
                    "sid": 49,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So can PMG’s “Function” codes: eliciting, checking, acknowledgement (psy­chological, general, cognitions); reassurance, ne­gotiation, information giving.",
                    "sid": 50,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are similar to some of the Dialogue Act labels used in NLP work: Stolcke et al’s (2000) agreement, response acknowledgement, summarize, or VERBMOBIL’s suggest, con.rm, clarify (Jekat et al 1995).",
                    "sid": 51,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 A.ect Cognitive a.ect -the psychological force, for a patient, of an utterance or a complete dialogue ­is the focus of interest in oncology and thus the most highly developed area.",
                    "sid": 52,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ford et al pick out eight of their “modes” as a.ective, including the expression of irritation, gratitude, apology, and concern.",
                    "sid": 53,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ong et al rate both doctor and patient, by cod­ing their utterances, on .ve distinct “global a.ect” scales: Anger/ irritation, Anxiety/ nervousness, Dominance/ assertiveness, Interest/ engagement, Friendliness/ warmth.",
                    "sid": 54,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their “a.ective clusters and categories” comprise (with subheadings) so­cial behaviour, verbal attentiveness, showing con­cern, and negative talk.",
                    "sid": 55,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PMG do not represent a.ect as a separate pa­rameter, as such.",
                    "sid": 56,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their function codes include a.ective functions such as Empathy and Reassur­ance.",
                    "sid": 57,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many of their content codes can also repre­sent a.ect, as noted above.",
                    "sid": 58,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Topics such as Con­cerns, Feelings about health care, Religion / spiri­tual issues can be addressed at any level from sim­ply factual to deeply emotional, blurring the pic­ture: this would be clari.ed if the a.ect level were explicitly factored out.",
                    "sid": 59,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most direct represen­tation of a.ective level comes in the two codes Psychological explicit and Psychological implicit.",
                    "sid": 60,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each utterance in a dialogue can be given several content codes, commonly including one of these two, as seen in the sample dialogue below.",
                    "sid": 61,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cognitive a.ect has barely been touched on by NLP research in dialogue tagging.",
                    "sid": 62,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is clearly more subtle and di.cult than syntactic, seman­tic, or pragmatic analysis, and also less signi.cant in instructional or service dialogues than in the highly charged, life-critical domain of cancer care.",
                    "sid": 63,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is, however, an important aspect of dialogue and speaker modelling, and of the design of appropri­ate responses.",
                    "sid": 64,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this area, NLP could learn some valuable lessons from oncology.",
                    "sid": 65,
                    "ssid": 36,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "an example. ",
            "number": "4",
            "sents": [
                {
                    "text": "Here is a brief typical example from a PMG anno­tated dialogue.",
                    "sid": 66,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice the multiple and somewhat diverse content codes, and the classi.cation of cue management (somewhat counter-intuitively attached to the cue utterance itself, not the response).",
                    "sid": 67,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P26: I said there’s only another thing that I hope I never have to have and that’s selectron treatment.",
                    "sid": 68,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Content: 23 (Psychological implicit) 24 (Treatment) Level: 1 (Hint) Cue: 1 (Patient cue) Cue management: 4 (Cue explored) N27: Mmmm.",
                    "sid": 69,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Form: 02 (Response) Function: 06 (Acknowledgement -general) Content: 24 (Psychological implicit) P27: But I says ...",
                    "sid": 70,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "... if I have to I will do, I said whatever you say, I said.",
                    "sid": 71,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Content: 24 (Treatment) 14 (Information) N28: Now why did you say that about selectron?",
                    "sid": 72,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Form: 04 (Open directive question) Function: 04 (Clari.cation -general) Content: 24 (Treatment) P28: No it were me that said that.",
                    "sid": 73,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Content: 24 (Treatment) N29: Right, Form: 02 (Response) Function: 06 (Acknowledgement -general) Content: 24 (Treatment) have you had it before?",
                    "sid": 74,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Form: 05 (Directive question (closed) Function: 04 (Clari.cation -general) Content: 24 (Treatment) 13 (History) P29: I said, I, I don’t mind what you do but I hope I’ve never to have selectron treatment again, but I said if I have to, if it’s a necessity then I will.",
                    "sid": 75,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Content: 23 (Psychological implicit) 24 (Treatment) 33 (The future) Level: 1 (Hint) Cue: 1 (Patient cue) Cue management: 2 (Minimal acknowledgement) N30: Right.",
                    "sid": 76,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Form: 02 (Response) Function: 06 (Acknowledgement -general) Content: 24 (Treatment) 14 (Information) P30: But I hope I never have.",
                    "sid": 77,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Content: 23 (Psychological implicit) 24 (Treatment) 33 (The future) Level: 1 (Hint) Cue: 1 (Patient cue) Cue management: 4 (Cue explored) N31: And why was that, because you were isolated or what was it....?",
                    "sid": 78,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Form: 08 (Multiple question) Function: 03 (Clari.cation -psychological) Content: 23 (Psychological implicit) 24 (Treatment)",
                    "sid": 79,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "implementations. ",
            "number": "5",
            "sents": [
                {
                    "text": "All the dialogue tagging work in oncology has been done manually.",
                    "sid": 80,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A few primitive software tools have been developed to support the tagging pro­cess and to analyse the results.",
                    "sid": 81,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ong et al (1998) have developed a Turbo Pas­cal “computerized version” of the RIAS coding system.",
                    "sid": 82,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The advantages they claim for it give one some idea of average state of its .eld: “With this program, classi.cation of utterances can be done directly on computer.",
                    "sid": 83,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, the extra step of entering paper and pencil data into the computer is omitted.",
                    "sid": 84,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, sequential in­formation is kept.",
                    "sid": 85,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, because the ten last classi.cations are constantly visible on the screen there is direct feedback about the ongoing conver­sation.",
                    "sid": 86,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This provides an important memory aid with respect to which utterance has to be coded next.",
                    "sid": 87,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a consequence, the task becomes less at­tention demanding and therefore less error-prone.",
                    "sid": 88,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By giving the opportunity to save the content of the last coded utterance, an additional memory aid is provided for shorter and longer breaks.” (Ong et al 1998:400) Butow’s group have developed a “computer­based interaction analysis system” with three parts: “(i) micro level analysis coded in real time and retaining the sequence of events, (ii) event counts and (iii) macro level analysis of consulta­tion style and a.ect” (Butow et al 1995:1116).",
                    "sid": 89,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“At the micro level the aim is to break the consul­tation down into its components and to charac­terise, count and/or time them...",
                    "sid": 90,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the macro level, the aim is to characterise the consulta­tion in a more holistic way, such as patient­centred vs doctor-centred, authoritarian vs a.l­iative or friendly vs hostile.” (ibid:1115) All three forms of analysis depend on counting and timing utterance-events classi.ed according to the three-dimensional model described above, although Bu-tow et al stress that they also “retain the sequence of events”.",
                    "sid": 91,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“In future analyses we will explore se­quential information e.ects” (ibid:1120).",
                    "sid": 92,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is evidently a signi.cant innovation in its .eld.",
                    "sid": 93,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fundamental concept of a grammar of dialogue is simply missing from the oncology work.",
                    "sid": 94,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, their techniques for “macro-level” analysis of dialogues may well have something to o.er, especially in the subtle areas of modelling and adapting to speakers’ attitudes and underly­ing intentions.",
                    "sid": 95,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "prospects. ",
            "number": "6",
            "sents": [
                {
                    "text": "All this work has been developed with care, in the light of experience, to serve a speci.c and unusual purpose.",
                    "sid": 96,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it shows no awareness of dia­logue tagging work in NLP.",
                    "sid": 97,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both .elds can bene.t from collaboration.",
                    "sid": 98,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The author, together with Prof. Peter Maguire of PMG, has recently been granted support by CRC to develop practical software support for the PMG oncology dialogue annotators.",
                    "sid": 99,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper presents a preliminary analysis, part of a feasibility study for that project.",
                    "sid": 100,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An associated PhD studentship, awarded by the University of Manchester Department of Computer Science, ensures that the NLP perspective will be rep­resented and the theoretical issues addressed.",
                    "sid": 101,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We look forward to presenting more detailed analyses, and original proposals, in the future.",
                    "sid": 102,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "Prof. Peter Maguire and Ian Fletcher of PMG have been generous with their time and support in the research leading to this paper.",
                    "sid": 103,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also gratefully acknowledge the support of the Can­cer Research Campaign and of the Department of Computer Science, University of Manchester.",
                    "sid": 104,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}