{
    "ID": "W01-1407",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "In statistical machine translation, correspondences between the words in the source and the target language are learned from bilingual corpora on the basis of so called alignment models.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Existing statistical systems for MT often treat different derivatives of the same lemma as if they were independent of each other.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we argue that a better exploitation of the bilingual training data can be achieved by explicitly taking into account the in- terdependencies of the different derivatives.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do this along two directions: Usage of hierarchical lexicon models and the introduction of equivalence classes in order to ignore information not relevant for the translation task.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The improvement of the translation results is demonstrated on a GermanEnglish corpus.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The statistical approach to machine translation has become widely accepted in the last few years.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has been successfully applied to realistic tasks in various national and international research programs.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However in many applications only small amounts of bilingual training data are available for the desired domain and language pair, and it is highly desirable to avoid at least parts of the costly data collection process.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some recent publications have dealt with the problem of translation with scarce resources.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Brown et al., 1994) describe the use of dictionaries.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(AlOnaizan et al., 2000) report on an experiment of Tetun-to-English translation by different groups, including one using statistical machine translation.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They assume the absence of linguistic knowledge sources such as morphological analyzers and dictionaries.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, they found that human mind is very well capable of deriving dependencies such as morphology, cognates, proper names, spelling variations etc., and that this capability was finally at the basis of the better results produced by humans compared to corpus based machine translation.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The additional information results from complex reasoning and it is not directly accessible from the full word form representation of the data.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we take a different point of view: Even if full bilingual training data is scarce, monolingual knowledge sources like morphological analyzers and data for training the target language model as well as conventional dictionaries (one word and its translation per entry) may be available and of substantial usefulness for improving the performance of statistical translation systems.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is especially the case for highly inflected languages like German.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We address the question of how to achieve a better exploitation of the resources for training the parameters for statistical machine translation by taking into account explicit knowledge about the languages under consideration.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our approach we introduce equivalence classes in order to ignore information not relevant to the translation process.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We furthermore suggest the use of hierarchical lexicon models.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The paper is organized as follows.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After reviewing the statistical approach to machine translation, we first explain our motivation for examining the morphological characteristics of an inflected language like German.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then describe the chosen output representation after the analysis and present our approach for exploiting the information from morpho-syntactic analysis.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experimental results on the GermanEnglish Verbmobil Source Language Text morpho-syntactic Analysis Transformation f J 1 Global Search: maximize Pr( e I ) J | e I ) task are reported.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 Pr( f 1 1.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "statistical machine translation. ",
            "number": "2",
            "sents": [
                {
                    "text": "over e 1 Pr( e I ) Language Model The goal of the translation process in statistical machine translation can be formulated as follows: A source language string is to be translated into a target language string . In the experiments reported in this paper, the source language is German and the target language is English.",
                    "sid": 26,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Every English string is considered as a possible translation for the input.",
                    "sid": 27,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we assign a probability to each pair of strings , then according to Bayes’ decision rule, we have to choose the English string that maximizes the product of the English language model and the string translation model . Many existing systems for statistical machine translation (Wang and Waibel, 1997; Nießen et al., 1998; Och and Weber, 1998) make use of a special way of structuring the string translation model like proposed by (Brown et al., 1993): The correspondence between the words in the source and the target string is described by alignments which assign one target word position to each source word position.",
                    "sid": 28,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lexicon probability of a certain English word is assumed to depend basically only on the source word aligned to it.",
                    "sid": 29,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall architecture of the statistical translation approach is depicted in Figure 1.",
                    "sid": 30,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this figure we already anticipate the fact that we can transform the source strings in a certain manner.",
                    "sid": 31,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "basic considerations. ",
            "number": "3",
            "sents": [
                {
                    "text": "The parameters of the statistical knowledge sources mentioned above are trained on bilingual Transformation Target Language Text Figure 1: Architecture of the translation approach based on Bayes’ decision rule.",
                    "sid": 32,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "corpora.",
                    "sid": 33,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, the resulting probabilistic lexica contain all word forms occurring in this training corpora as separate entries, not taking into account whether or not they are derivatives of the same lemma.",
                    "sid": 34,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bearing in mind that 40% of the word forms have only been seen once in training (see Table 2), it is obvious that learning the correct translations is difficult for many words.",
                    "sid": 35,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides, new input sentences are expected to contain unknown word forms, for which no translation can be retrieved from the lexica.",
                    "sid": 36,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As Table 2 shows, this problem is especially relevant for highly inflected languages like German: Texts in German contain many more different word forms than their English translations.",
                    "sid": 37,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The table also reveals that these words are often derived from a much smaller set of base forms (“lemmata”), and when we look at the number of different lemmata and the respective number of lemmata, for which there is only one occurrence in the training data, German and English texts are more resembling.",
                    "sid": 38,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another aspect is the fact that conventional dictionaries are often available in an electronic form for the considered language pair.",
                    "sid": 39,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their usability for statistical machine translation is restricted because they are substantially different from full bilingual parallel corpora inasmuch the entries are often pairs of base forms that are translations of each other, whereas the corpora contain full sentences with inflected forms.",
                    "sid": 40,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To make the information taken from external dictionaries more useful for the translation of inflected language is an interesting objective.",
                    "sid": 41,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a consequence of these considerations, we aim at taking into account the interdependencies between the different derivatives of the same base form.",
                    "sid": 42,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "output representation after. ",
            "number": "4",
            "sents": [
                {
                    "text": "Morpho-syntactic Analysis We use GERCG, a constraint grammar parser for German for lexical analysis and morphological and syntactic disambiguation.",
                    "sid": 43,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a description of the Constraint Grammar approach we refer the reader to (Karlsson, 1990).",
                    "sid": 44,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 gives an example of the information provided by this tool.",
                    "sid": 45,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Input: Wir wollen nach dem Essen nach Essen aufbrechen \"<*wir>\" \"wir\" * PRON PERS PL1 NOM \"<wollen>\" \"wollen\" V IND PR¨AS PL1 \"<nach>\" \"nach\" pre PR¨AP Dat \"<dem>\" \"das\" ART DEF SG DAT NEUTR \"<*essen>\" \"*essen\" S NEUTR SG DAT \"<nach>\" \"nach\" pre PR¨AP Dat \"<*essen>\" \"*essen\" S EIGEN NEUTR SG DAT \"*esse\" S FEM PL DAT \"*essen\" S NEUTR PL DAT \"*essen\" S NEUTR SG DAT \"<aufbrechen>\" \"aufbrechen\" V INF Figure 2: Sample analysis of a German sentence A full word form is represented by the information provided by the morpho-syntactic analysis: From the interpretation “gehen-V-INDPR¨AS-SG1”, i.e. the lemma plus part of speech plus the other tags the word form “gehe” can be restored.",
                    "sid": 46,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From Figure 2 we see that the tool can quite reliably disambiguate between different readings: It infers for instance that the word “wollen” is a verb in the indicative present first person plural form.",
                    "sid": 47,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Without any context taken into account, “wollen” has other readings.",
                    "sid": 48,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can even be interpreted as derived not from a verb, but from an adjective with the meaning “made of wool”.",
                    "sid": 49,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this sense, the information inherent to the original word forms is augmented by the dis- ambiguating analyzer.",
                    "sid": 50,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be useful for deriving the correct translation of ambiguous words.",
                    "sid": 51,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the rare cases where the tools returned more than one reading, it is often possible to apply simple heuristics based on domain specific preference rules or to use a more general, non-ambiguous analysis.",
                    "sid": 52,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The new representation of the corpus where full word forms are replaced by lemma plus morphological and syntactic tags makes it possible to gradually reduce the information: For example we can consider certain instances of words as equivalent.",
                    "sid": 53,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have used this fact to better exploit the bilingual training data along two directions: Omitting unimportant information and using hierarchical translation models.",
                    "sid": 54,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "equivalence classes of words with. ",
            "number": "5",
            "sents": [
                {
                    "text": "similar Translations Inflected forms of words in the input language contain information that is not relevant for translation.",
                    "sid": 55,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is especially true for the task of translating from a highly inflected language like German into English for instance: In bilingual GermanEnglish corpora, the German part contains many more different word forms than the English part (see Table 2).",
                    "sid": 56,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is useful for the process of statistical machine translation to define equivalence classes of word forms which tend to be translated by the same target language word, because then, the resulting statistical translation lexica become smoother and the coverage is significantly improved.",
                    "sid": 57,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We construct these equivalence classes by omitting those informations from morpho-syntactic analysis, which are not relevant for the translation task.",
                    "sid": 58,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The representation of the corpus like it is provided by the analyzing tools helps to identify - and access - the unimportant information.",
                    "sid": 59,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The definition of relevant and unimportant information, respectively, depends on many factors like the involved languages, the translation direction and the choice of the models.",
                    "sid": 60,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Linguistic knowledge can provide information about which characteristics of an input sentence are crucial to the translation task and which can be ignored, but it is desirable to find a method for automating this decision process.",
                    "sid": 61,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found that the impact on the end result due to different choices of features to be ignored was not large enough to serve as reliable criterion.",
                    "sid": 62,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, we could think of defining a likelihood criterion on a held-out corpus for this purpose.",
                    "sid": 63,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another possibility is to assess the impact on the alignment quality after training, which can be evaluated automatically (Langlais et al., 1998; Och and Ney, 2000), but as we found that the alignment quality on the Verbmobil data is consistently very high, and extremely robust against manipulation of the training data, we abandoned this approach.",
                    "sid": 64,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We resorted to detecting candidates from the probabilistic lexica trained for translation from German to English.",
                    "sid": 65,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this, we focussed on those derivatives of the same base form, which resulted in the same translation.",
                    "sid": 66,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each set of tags, we counted how often an additional tag could be replaced by a certain other tag without effect on the translation.",
                    "sid": 67,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 gives some of the most frequently identified candidates to be ignored while translating: The gender of nouns is irrelevant for their translation (which is straightforward, because the gender is unambiguous for a certain noun) and the case, i.e. nominative, dative, accusative.",
                    "sid": 68,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the genitive forms, the translation in English differs.",
                    "sid": 69,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For verbs we found the candidates number and person.",
                    "sid": 70,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, the translation of the first person singular form of a verb is often the same as the translation of the third person plural form, for example.",
                    "sid": 71,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1: Candidates for equivalence classes.",
                    "sid": 72,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "which were most often identified as irrelevant for translation from German to English.",
                    "sid": 73,
                    "ssid": 19,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "hierarchical models. ",
            "number": "6",
            "sents": [
                {
                    "text": "One way of taking into account the interdependencies of different derivatives of the same base form is to introduce equivalence classes at various levels of abstraction starting with the inflected form and ending with the lemma.",
                    "sid": 74,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider, for example, the German verb form \"ankomme\", which is derived from the lemma \"ankommen\" and which can be translated into English by \"arrive\".",
                    "sid": 75,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hierarchy of equivalence classes is as follows: \"ankommen-V-INDPR¨AS-SG1\" \"ankommen-V-INDPR¨AS-SG\" \"ankommen-V-INDPR¨AS\" . \"ankommen\" is the maximal number of morpho-syntactic tags.",
                    "sid": 76,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "contains the forms \"ankomme\", \"ankommst\" and \"ankommt\"; in the number (SG or PL) is ignored and so on.",
                    "sid": 77,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The largest equivalence class contains all derivatives of the infinitive \"ankommen\".",
                    "sid": 78,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can now define the lexicon probability of a word to be translated by with respect to the level : (1) where is the representation of a word where the lemma and additional tags are taken into account.",
                    "sid": 79,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the example above, \"ankommen\", \"V\", and so on.",
                    "sid": 80,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is the probability of for a given . We make the assumption that this probability does not depend on . is always assumed to be 1.",
                    "sid": 81,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, the inflected form can non-.",
                    "sid": 82,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ambiguously be derived from the full interpretation.",
                    "sid": 83,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a consequence, we dropped those tags, is the probability of the translation for to belong to the equivalence class . The sum over amounts to summing up over all possible readings of .1 We combine the by means of linear interpolation: (2)",
                    "sid": 84,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "translation experiments. ",
            "number": "7",
            "sents": [
                {
                    "text": "Experiments were carried out on Verbmobil data, which consists of spontaneously spoken dialogs in the appointment scheduling domain (Wahlster, 1993).",
                    "sid": 85,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "German source sentences are translated into English.",
                    "sid": 86,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.1 Treatment of Ambiguity.",
                    "sid": 87,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Common bilingual corpora normally contain full sentences which provide enough context information for ruling out all but one reading for an inflected word form.",
                    "sid": 88,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To reduce the remaining uncertainty, we have implemented preference rules.",
                    "sid": 89,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, we assume that the corpus is correctly true-case-converted beforehand and as a consequence, we drop non-noun interpretations of uppercase words.",
                    "sid": 90,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides, we prefer indicative verb readings instead of subjunctive or imperative.",
                    "sid": 91,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the remaining ambiguities, we resort to the unambiguous parts of the readings, i.e. we drop all tags causing mixed interpretations.",
                    "sid": 92,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are some special problems with the analysis of external lexica, which do not provide enough context to enable efficient disambiguation.",
                    "sid": 93,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are currently implementing methods for handling this special situation.",
                    "sid": 94,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be argued that it would be more elegant to leave the decision between different readings, for instance, to the overall decision process in search.",
                    "sid": 95,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We plan this integration for the future.",
                    "sid": 96,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.2 Performance Measures.",
                    "sid": 97,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the following evaluation criteria (Nießen et al., 2000): SSER (subjective sentence error rate): Each translated sentence is judged by a human examiner according to an error scale from 0.0 (semantically and syntactically correct) to 1.0 (completely wrong).",
                    "sid": 98,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 The probability functions are defined to return zero for impossible interpretations of . ISER (information item semantic error rate): The test sentences are segmented into information items; for each of them, the translation candidates are assigned either “ok” or an error class.",
                    "sid": 99,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the intended information is conveyed, the error count is not increased, even if there are slight syntactical errors, which do not seriously deteriorate the intelligibility.",
                    "sid": 100,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.3 Translation Results.",
                    "sid": 101,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training set consists of 58 322 sentence pairs.",
                    "sid": 102,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 summarizes the characteristics of the training corpus used for training the parameters of Model 4 proposed in (Brown et al., 1993).",
                    "sid": 103,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Testing Table 2: Corpus statistics: Verbmobil training.",
                    "sid": 104,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Singletons are types occurring only once in training.",
                    "sid": 105,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "E n gl is h G er m an no . of ru nn in g w or ds 55 0 21 3 51 9 79 0 no . of w or d for ms n o . o f s i n g l e t o n s s i n g l e t o n s [ % ] 4 6 7 0 1 6 9 6 3 6 7 9 4 0 3 4 5 2 4 3 no . of le m m ata no . of sin gl et on s 3 8 7 5 1 3 2 2 3 4 7 6 1 4 5 7 was carried out on 200 sentences not contained in the training data.",
                    "sid": 106,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a detailed statistics see Table 3.",
                    "sid": 107,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3: Statistics of the Verbmobil test corpus for German-to-English translation.",
                    "sid": 108,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unknowns are word forms not contained in the training corpus.",
                    "sid": 109,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "no . of se nt en ce s 2 0 0 no . of ru nn in g w or ds 2 05 5 no . of w or d for ms no . of un kn o w n w or d for ms 3 8 5 2 5 We used a translation system called “single- word based approach” described in (Tillmann and Ney, 2000) and compared to other approaches in (Ney et al., 2000).",
                    "sid": 110,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.3.1 Lexicon Combination So far we have performed experiments with hierarchical lexica, where two levels are combined, i.e. in Equation (2) is set to 1.",
                    "sid": 111,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and are set to and is modeled as a uniform distribution over all derivations of the lemma occurring in the training data plus the base form itself, in case it is not contained.",
                    "sid": 112,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The process of lemmatization is unique in the majority of cases, and as a consequence, the sum in Equation (1) is not needed for a two-level lexicon combination of full word forms and lemmata.",
                    "sid": 113,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the results summarized in Table 4 show, the combined lexicon outperforms the conventional one-level lexicon.",
                    "sid": 114,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As expected, the quality gain achieved by smoothing the lexicon is larger if the training procedure can take advantage of an additional conventional dictionary to learn translation pairs, because these dictionaries typically only contain base forms of words, whereas translations of fully inflected forms are needed in the test situation.",
                    "sid": 115,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples taken from the test set are given in Figure 3.",
                    "sid": 116,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Smoothing the lexicon entries over the derivatives of the same lemma enables the translation of “sind” by “would” instead of “are”.",
                    "sid": 117,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The smoothed lexicon contains the translation “convenient” for any derivative of “bequem”.",
                    "sid": 118,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The comparative “more convenient” would be the completely correct translation.",
                    "sid": 119,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.3.2 Equivalence classes As already mentioned, we resorted to choosing one single reading for each word by applying some heuristics (see Section 7.1).",
                    "sid": 120,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the normal training corpora, unlike additional external dictionaries, this is not critical because they contain predominantly full sentences which provide enough context for an efficient disambiguation.",
                    "sid": 121,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Currently, we are working on the problem of analyzing the entries in conventional dictionaries, but for the time being, experiments for equivalence classes have been carried out using only bilingual corpora for estimating the model parameters.",
                    "sid": 122,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 shows the effect of the introduction of equivalence classes.",
                    "sid": 123,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The information from the morpho-syntactic analyzer (stems plus tags like described in Section 4) is reduced by dropping unimportant information like described in Section 5.",
                    "sid": 124,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both error metrics could be decreased in com-.",
                    "sid": 125,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "parison to the usage of the original corpus with inflected word forms.",
                    "sid": 126,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A reduction of 3.3% of the information item semantic error rate shows that more of the intended meaning could be found in the produced translations.",
                    "sid": 127,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5: Effect of the introduction of equivalence classes.",
                    "sid": 128,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the baseline we used the original inflected word forms.",
                    "sid": 129,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SS E R [% ] IS E R [% ] i n f l e c t e d w o r d s e q u i v a l e n c e c l a s s e s 3 7 . 4 3 5 . 9 2 6 . 8 2 3 . 5 The first two examples in Figure 4 demonstrate the effect of the disambiguating analyzer which identifies “Hotelzimmer” as singular on the basis of the context (the word itself can represent the plural form as well), and “das” as article in contrast to a pronoun.",
                    "sid": 130,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third example shows the advantage of grouping words in equivalence classes: The training data does not contain the word “billigeres”, but when generalizing over the gender and case information, a correct translation can be produced.",
                    "sid": 131,
                    "ssid": 47,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion and future work. ",
            "number": "8",
            "sents": [
                {
                    "text": "We have presented methods for a better exploitation of the bilingual training data for statistical machine translation by explicitly taking into account the interdependencies of the different derivatives of the same base form.",
                    "sid": 132,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We suggest the usage of hierarchical models as well as an alternative representation of the data in combination with the identification and omission of information not relevant for the translation task.",
                    "sid": 133,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First experiments prove their general applicability to realistic tasks such as spontaneously spoken dialogs.",
                    "sid": 134,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We expect the described methods to yield more improvement of the translation quality for cases where much smaller amounts of training data are available.",
                    "sid": 135,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As there is a large overlap between the modeled events in the combined probabilistic models, we assume that log-linear combination would result in more improvement of the translation quality than the combination by linear interpolation does.",
                    "sid": 136,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will investigate this in the future.",
                    "sid": 137,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also plan to integrate the decision regarding the choice of readings into the search process.",
                    "sid": 138,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4: Effect of two-level lexicon combination.",
                    "sid": 139,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the baseline we used the conventional one-level full form lexicon.",
                    "sid": 140,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "e x t . d i c t i o n a r y SS E R [% ] IS E R [% ] b a s e l i n e y e s c o m b i n e d y e s 3 5 . 7 3 3 . 8 2 3 . 9 2 2 . 3 b as el in e no c o m bi n e d no 3 7 . 4 3 6 . 9 2 6 . 8 2 5 . 8 in pu t sind Sie mit einem Doppelzimmer einverstanden?",
                    "sid": 141,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ba sel in e are you agree with a double room?",
                    "sid": 142,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "co m bi ne d le xi ca would you agree with a double room?",
                    "sid": 143,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "in pu t mit dem Zug ist es bequemer ba sel in e by train it is UNKNOWN-bequemer co m bi ne d le xi ca by train it is convenient Figure 3: Examples for the effect of the combined lexica.",
                    "sid": 144,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Acknowledgement.",
                    "sid": 145,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work was partly supported by the German Federal Ministry of Education, Science, Research and Technology under the Contract Number 01 IV 701 T4 (VER B MO B IL).",
                    "sid": 146,
                    "ssid": 15,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}