{
    "ID": "W04-0707",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Vieira and Poesio (2000) proposed an algorithm for definite description (D D) resolution that incorporates a number of heuristics for detecting discourse- new descriptions.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The inclusion of such detectors was motivated by the observation that more than 50% of definite descriptions (D Ds) in an average corpus are discourse new (Poesio and Vieira, 1998), but whereas the inclusion of detectors for non-anaphoric pronouns in algorithms such as Lap- pin and Leass’ (1994) leads to clear improvements in precision, the improvements in anaphoric D D resolution (as opposed to classification) brought about by the detectors were rather small.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, Ng and Cardie (2002a) challenged the motivation for the inclusion of such detectors, reporting no improvements, or even worse performance.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We reexamine the literature on the topic in detail, and propose a revised algorithm, taking advantage of the improved discourse-new detection techniques developed by Uryupina (2003).",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Although many theories of definiteness and many anaphora resolution algorithms are based on the assumption that definite descriptions are anaphoric, in fact in most corpora at least half of definite descriptions are D I S C O U R S E -N E W (Prince, 1992), as shown by the following examples, both of which are the first sentences of texts from the Penn Treebank.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) a. Toni Johnson pulls a tape measure across the front of what was once a stately Victorian home.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "b. The Federal Communications Commission allowed American Telephone & Telegraph Co. to continue offering discount phone services for large-business customers and said it would soon reexamine its Vieira and Poesio (2000) proposed an algorithm for definite description resolution that incorporates a number of heuristics for detecting discourse-new (henceforth: D N) descriptions.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But whereas the inclusion of detectors for non-anaphoric pronouns (e.g., It in It’s raining) in algorithms such as Lappin and Leass’ (1994) leads to clear improvements in precision, the improvements in anaphoric D D resolution (as opposed to classification) brought about by the detectors were rather small.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, Ng and Cardie (2002a) challenged the motivation for the inclusion of such detectors, reporting no improvements or even worse performance.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We reexamine the literature on the topic in detail, and propose a revised algorithm, taking advantage of the improved D N detection techniques developed by Uryupina (2003).",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "detecting discourse-new definite. ",
            "number": "2",
            "sents": [
                {
                    "text": "Descriptions 2.1 Vieira and Poesio.",
                    "sid": 11,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Poesio and Vieira (1998) carried out corpus studies indicating that in corpora like the Wall Street Journal portion of the Penn Treebank (Marcus et al., 1993), around 52% of D Ds are discourse-new (Prince, 1992), and another 15% or so are bridging references, for a total of about 6667% first- mention.",
                    "sid": 12,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results led Vieira and Poesio to propose a definite description resolution algorithm incorporating independent heuristic strategies for recognizing D N definite descriptions (Vieira, 1998; Vieira and Poesio, 2000).",
                    "sid": 13,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The heuristics proposed by Vieira and Poesio assumed a parsed input (the Penn Treebank) and aimed at identifying five categories of D Ds licensed to occur as first mention on semantic or pragmatic grounds on the basis of work on definiteness including Loebner’s account (1987): scriptions (Loebner, 1987).",
                    "sid": 14,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This class included descriptions with modifiers like first or best that turned a possibly sortal predicate into a function (as in the first person to cross the Pacific on a row boat); as well as descriptions with predicates like fact or belief followed by a that-clause with the function of specifying the fact or belief under question.",
                    "sid": 15,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both types of definites descriptions were recognized by consulting a hand-coded list of S P E C I A L P R E D I - C AT E S. 2.",
                    "sid": 16,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Descriptions serving as disguised P RO P E R. NA M E S, such as The Federal Communications Commission or the IranIraq war.",
                    "sid": 17,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The heuristics for recognizing these definite descriptions were primarily based on capitalization (of the head or the modifiers).",
                    "sid": 18,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "semantically functioning as predicates rather than as referring.",
                    "sid": 19,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These include descriptions occurring in appositive position (as in Glenn Cox, the president of Phillips Petroleum) and in certain copular constructions (as in the man most likely to gain custody of all this is a career politician named Dinkins).",
                    "sid": 20,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The heuristics used to recognize these cases examined the syntactic structure of the N P and the clause in which it appeared.",
                    "sid": 21,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 22,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Descriptions E S TA B L I S H E D (i.e., turned.",
                    "sid": 23,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "into functions in context) by restrictive modification, particularly by establishing relative clauses (Loebner, 1987) and prepositional phrases, as in The hotel where we stayed last night was pretty good.",
                    "sid": 24,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These heuristics, as well, examined the syntactic structure of the N P. 5.",
                    "sid": 25,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LA R G E R S I T UAT I O N definite descriptions.",
                    "sid": 26,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Hawkins, 1978), i.e., definite descriptions like the sun, the pope or the long distance market which denote uniquely on the grounds of shared knowledge about the situation (these are Loebner’s ‘situational functions’).",
                    "sid": 27,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Vieira and Poesio’s system had a small list of such defi- nites.",
                    "sid": 28,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These heuristics were included as tests both of a decision tree concerned only with the task of D N detection, and of decision trees determining the classification of D Ds as anaphoric, bridging or discourse new.",
                    "sid": 29,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In both cases, the D N detection tests were intertwined with attempts to identify an antecedent for lan, 1986)) were used for the task of two-way classification into discourse-new and anaphoric.",
                    "sid": 30,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Vieira and Poesio found only small differences in the order of tests in the two decision trees, and small differences in performance.",
                    "sid": 31,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hand-coded decision tree executes in the following order: 1.",
                    "sid": 32,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Try the D N heuristics with the highest accu-.",
                    "sid": 33,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "racy (recognition of some types of semantically functional D Ds using special predicates, and of potentially predicative D Ds occurring in appositions); 2.",
                    "sid": 34,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise, attempt to resolve the D D as direct.",
                    "sid": 35,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "anaphora;",
                    "sid": 36,
                    "ssid": 26,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "otherwise, attempt the remaining d n heuris-. ",
            "number": "3",
            "sents": [
                {
                    "text": "tics in the order: proper names, descriptions established by relatives and P Ps, proper name modification, predicative D Ds occurring in copular constructions.",
                    "sid": 37,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If none of these tests succeeds, the algorithm can either leave the D D unclassified, or classify it as D N. The automatically learned decision tree attempts direct anaphora resolution first.",
                    "sid": 38,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall results on the 195 D Ds on which the automatically trained decision tree was tested are shown in Table 1.",
                    "sid": 39,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline is the result achieved by classifying every D D as discourse-new–with 99 discourse-new D Ds out of 195, this means a precision of 50.8%.",
                    "sid": 40,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two results are shown for the hand-coded decision tree: in one version, the system doesn’t attempt to classify all D Ds; in the other, all unclassified D Ds are classified as discourse-new.",
                    "sid": 41,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Version of the System P R F Baseline 50.8 100 67.4 Discourse-new detection only 69 72 70 Hand-coded DT: partial Hand-coded DT: total 62 77 85 77 71.7 77 I D 3 75 75 75 Table 1: Overall results by Vieira and Poesio 2.2 Bean and Riloff.",
                    "sid": 42,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bean and Riloff (1999) developed a system for identifying discourse-new D Ds1 that incorporates, in addition to syntax-based heuristics aimed at recognizing predicative and established D Ds using postmodification heuristics similar to those used by Vieira and Poesio, additional techniques for mining from corpora unfamiliar D Ds including proper names, larger situation, and semantically functional.",
                    "sid": 43,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two such D Ds.",
                    "sid": 44,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both hand-coded decision trees and auto- of the techniques proposed by Bean and Riloff are particularly worth noticing.",
                    "sid": 45,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The S E N T E N C E -O N E (S 1) E X T R AC T I O N heuristic identifies as discourse- new every D D found in the first sentence of a text.",
                    "sid": 46,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More general patterns can then be extracted from the D Ds initially found by S 1-extraction, using the E X I S T E N T I A L H E A D PAT T E R N method which, e.g., would extract the N+ Government from the Salvadoran Government and the Guatemalan Government.",
                    "sid": 47,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The D E FI N I T E O N LY (D O) list contained N Ps like the National Guard or the FBI with a high D E FI N I T E P RO BA B I L I T Y, i.e., whose nominal complex has been encountered at least 5 times with the definite article, but never with the indefinite.",
                    "sid": 48,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "VAC - C I N E S were also developed that prevented the use of patterns identified by S 1-extraction or D O-list elements when the definite probability of the definite was too low.",
                    "sid": 49,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall, the algorithm proposed by Bean and Riloff is as follows: 1.",
                    "sid": 50,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the head noun of the D D appeared earlier in. the text, classify as anaphoric.",
                    "sid": 51,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 52,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise, if the D D occurs in the S1 list, clas-.",
                    "sid": 53,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sify as discourse-new unless stopped by vaccine.",
                    "sid": 54,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 55,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise, classify the D D as D N if one of the.",
                    "sid": 56,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "following tests applies: (a) it occurs in the D O list; (b) it matches one of the E H P patterns, and is not stopped by vaccine; (c) it matches one of the syntactic heuristics",
                    "sid": 57,
                    "ssid": 21,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "otherwise, classify the d d as anaphoric.. ",
            "number": "4",
            "sents": [
                {
                    "text": "(Note that as in the machine-learned version of the Vieira and Poesio decision tree, a (simplified) direct anaphora test is tried first, followed by D N detectors in decreasing order of accuracy.)",
                    "sid": 58,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bean and Riloff trained their system on 1600 articles from M U C-4, and tested it on 50 texts.",
                    "sid": 59,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The S 1 extraction methods produced 849 D Ds; the D O list contained 65 head nouns and 321 full N Ps.",
                    "sid": 60,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall results are shown in Table 2; the baseline are the results obtained when classifying all D Ds as discourse-new.",
                    "sid": 61,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the overall precision is not better than what obtained with the partial hand-coded decision tree used by Vieira and Poesio, recall is substantially improved.",
                    "sid": 62,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Ng and Cardie.",
                    "sid": 63,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ng and Cardie (2002a) directly investigate the question of whether employing a discourse-new pre M et ho d R P Ba sel ine 10 0 72.",
                    "sid": 64,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Sy nta cti c He uri sti cs 4 3 93.",
                    "sid": 65,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 Sy nt.",
                    "sid": 66,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He uri sti cs + S1 S y n t . H e u r i s t i c s + E H P S y n t . H e u r i s t i c s + D O 66.",
                    "sid": 67,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 60.",
                    "sid": 68,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 69.",
                    "sid": 69,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 84.",
                    "sid": 70,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 87.",
                    "sid": 71,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 83.",
                    "sid": 72,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 Sy nt.",
                    "sid": 73,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He uri sti cs + S1 + E HP + D O 81.",
                    "sid": 74,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 82.",
                    "sid": 75,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Sy nt.",
                    "sid": 76,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He uri sti cs + S1 + E HP + D O + V 79.",
                    "sid": 77,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 84.",
                    "sid": 78,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Table 2: Discourse-new prediction results by Bean and Riloff coreference resolution system (specifically, the system discussed in (Ng and Cardie, 2002b)).",
                    "sid": 79,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ng and Cardie’s work differs from the work discussed so far in that their system attempts to deal with all types of N Ps, not just definite descriptions.",
                    "sid": 80,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The discourse-new detectors proposed by Ng and Cardie are statistical classifiers taking as input 37 features and trained using either C 4.5 (Quinlan, 1993) or R I P P E R (Cohen, 1995).",
                    "sid": 81,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 37 features of a candidate anaphoric expression specify, in addition to much of the information proposed in previous work, a few new types of information about N Ps.",
                    "sid": 82,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• The four boolean so-called L E X I C A L features are actually string-level features: for example, str_match is Y if a preceding N P string-matches the anaphoric expression (except for the determiner), and head_match = Y if a preceding N P’s head string-matches the anaphoric expression’s. embedded=Y if the anaphoric expression is a prenominal modifier.",
                    "sid": 83,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• The second group of 11 (mostly boolean) features specifies the type of N P: e.g., pronoun is Y if the anaphoric expression is a pronoun, else N. • The third group of 7 features specifies syntactic properties of the anaphoric expression, including number, whether N Pj is the first of two N Ps in an appositive or predicative construction, whether N Pj is pre- or post-modified, whether it contains a proper noun, and whether it is modified by a superlative.",
                    "sid": 84,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• The next group of 8 features are mostly novel, and capture information not used by previous D N detectors about the exact composition of definite descriptions: e.g., the_2n=Y if the anaphoric expression starts with determiner the followed by exactly two common nouns, the_num_n=Y if the anaphoric ex by a cardinal and a common noun, and the_sing_n=Y if the anaphoric expression starts with determiner the followed by a singular N P not containing a proper noun.",
                    "sid": 85,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• The next group of features consists of 4 features capturing a variety of ‘semantic’ information, including whether a previous N P is an ‘alias’ of N Pj , or whether N Pj is the title of a person (the president).",
                    "sid": 86,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Finally, the last three features capture information about the position in the text in which N Pj occurs: the header, the first sentence, or the first paragraph.",
                    "sid": 87,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ng and Cardie’s discourse-new predictor was trained and tested over the M U C-6 and M U C-7 coreference data sets, achieving accuracies of 86.1% and 84%, respectively, against a baseline of 63.8% and 73.2%, respectively.",
                    "sid": 88,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inspection of the top parts of the decision tree produced with the M U C-6 suggests that head_match is the most important feature, followed by the features specifying N P type, the alias feature, and the features specifying the structure of definite descriptions.",
                    "sid": 89,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ng and Cardie discuss two architectures for the integration of a D N detector in a coreference system.",
                    "sid": 90,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first architecture, the D N detector is run first, and the coreference resolution algorithm is run only if the D N detector classifies that N P as anaphoric.",
                    "sid": 91,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second architecture, the system first computes str_match and alias, and runs the anaphoric resolver if any of them is Y; otherwise, it proceeds as in the first architecture.",
                    "sid": 92,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results obtained on the M U C-6 data with the baseline anaphoric resolver, the anaphoric resolver augmented by a D N detector as in the first architecture, and as in the second architecture (using C 4.5), are shown in Table 3.",
                    "sid": 93,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results for all N Ps, pronouns only, proper names only, and common nouns only are shown.2 As indicated in the Table, running the D N detector M U C 6 M U C 7 R P F R P F Bas elin e (no DN det ect or) P r o n o u n s P r o p e r n a m e s C o m m o n n o u n s 70.",
                    "sid": 94,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 17.",
                    "sid": 95,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 29.",
                    "sid": 96,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 25.",
                    "sid": 97,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 58.",
                    "sid": 98,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 66.",
                    "sid": 99,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 84.",
                    "sid": 100,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 40.",
                    "sid": 101,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 63.",
                    "sid": 102,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 28.",
                    "sid": 103,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 44.",
                    "sid": 104,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 31.",
                    "sid": 105,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 65.",
                    "sid": 106,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 10.",
                    "sid": 107,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 27.",
                    "sid": 108,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 26.",
                    "sid": 109,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 58.",
                    "sid": 110,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 62.",
                    "sid": 111,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 77.",
                    "sid": 112,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 45.",
                    "sid": 113,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 61.",
                    "sid": 114,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 17.",
                    "sid": 115,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 40.",
                    "sid": 116,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 33.",
                    "sid": 117,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 DN det ect or run s firs t P r o n o u n s P r o p e r n a m e s C o m m o n n o u n s 57.",
                    "sid": 118,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 17.",
                    "sid": 119,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 26.",
                    "sid": 120,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 15.",
                    "sid": 121,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 71.",
                    "sid": 122,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 67.",
                    "sid": 123,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 89.",
                    "sid": 124,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 56.",
                    "sid": 125,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 63.",
                    "sid": 126,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 28.",
                    "sid": 127,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 41.",
                    "sid": 128,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 24.",
                    "sid": 129,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 47.",
                    "sid": 130,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 10.",
                    "sid": 131,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 21.",
                    "sid": 132,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 13.",
                    "sid": 133,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 77.",
                    "sid": 134,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 62.",
                    "sid": 135,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 84.",
                    "sid": 136,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 77.",
                    "sid": 137,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 58.",
                    "sid": 138,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 17.",
                    "sid": 139,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 34.",
                    "sid": 140,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 23.",
                    "sid": 141,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 Sa me hea d run s firs t P r o n o u n s P r o p e r n a m e s C o m m o n n o u n s 63.",
                    "sid": 142,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 17.",
                    "sid": 143,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 27.",
                    "sid": 144,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 20.",
                    "sid": 145,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 68.",
                    "sid": 146,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 67.",
                    "sid": 147,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 88.",
                    "sid": 148,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 53.",
                    "sid": 149,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 65.",
                    "sid": 150,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 28.",
                    "sid": 151,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 41.",
                    "sid": 152,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 29.",
                    "sid": 153,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 59.",
                    "sid": 154,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 10.",
                    "sid": 155,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 26.",
                    "sid": 156,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 21.",
                    "sid": 157,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 69.",
                    "sid": 158,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 62.",
                    "sid": 159,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 84.",
                    "sid": 160,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 59.",
                    "sid": 161,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 64.",
                    "sid": 162,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 17.",
                    "sid": 163,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 40.",
                    "sid": 164,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 31.",
                    "sid": 165,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 Table 3: Evaluation of the three anaphoric resolvers discussed by Ng and Cardie.",
                    "sid": 166,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4 Uryupin a Uryupina (2003) trained two separate classifiers (using R I P P E R, (Cohen, 1995)): a D N detector and a U N I QU E N E S S D E T E C TO R, i.e., a classifier that determines whether an N P refers to a unique object.",
                    "sid": 167,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is useful to identify proper names (like 1998, or the United States of America), semantic definites (like the chairman of Microsoft) and larger situation definite descriptions (like the pope).",
                    "sid": 168,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both classifiers use the same set of 32 features.",
                    "sid": 169,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features of an N P encode, first, of all, string-level information: e.g., whether the N P contains capitalized words, digits, or special symbols.",
                    "sid": 170,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A second group of features specifies syntactic information: whether the N P is postmodified, and whether it contains an apposition.",
                    "sid": 171,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two types of appositions are distinguished, with and without commas.",
                    "sid": 172,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "C O N T E X T features specify the distance between the N P and the previous N P with the same head, if any.",
                    "sid": 173,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, Uryupina’s system computes four features specifying the N P’s definite probability.",
                    "sid": 174,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike the definite probability used by Bean and Riloff, these features are computed from the Web, using Altavista.",
                    "sid": 175,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From each N P, its head H and entire N P without determiner Y are determined, and four ratios are then computed: first leads to worse results–this is because the detector misclassifies a number of anaphoric N Ps as non- anaphoric.",
                    "sid": 176,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, looking first for a same-head #”the Y” #Y #”the H” #ff aH ff #”the Y” #ff aY ff #”the H” #H antecedent leads to a statistically significant improvement over the results of the baseline anaphoric resolver.",
                    "sid": 177,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This confirms the finding both of Vieira and Poesio and of Bean and Riloff that the direct anaphora should be called very early.",
                    "sid": 178,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 It’s not clear to us why the overall performance of the algorithm is much better than the performance on the three individual types of anaphoric expressions considered–i.e., which other anaphoric expressions are handled by the coreference resolver.",
                    "sid": 179,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classifiers were tested on 20 texts from M U C 7 (a subset of the second data set used by Ng and Cardie), parsed by Charniak’s parser.",
                    "sid": 180,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "19 texts were used for training and for tuning R I P P E R’s parameters, one for testing.",
                    "sid": 181,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results for the discourse new detection task are shown in Table 4, separating the results for all N Ps and definite N Ps only, and the results without definite probabilities and including them.",
                    "sid": 182,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results for uniqueness detection are shown in Table 4, in which the results obtained by prioritizing precision and recall are shown separately.",
                    "sid": 183,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fe at ur es P R F All NP s Str ing +S yn +C ont ext All 87.",
                    "sid": 184,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 88.",
                    "sid": 185,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 86.",
                    "sid": 186,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 84.",
                    "sid": 187,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 86.",
                    "sid": 188,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 86.",
                    "sid": 189,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 De f NP s Str ing +S yn +C ont ext All 82.",
                    "sid": 190,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 84.",
                    "sid": 191,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 79.",
                    "sid": 192,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 82.",
                    "sid": 193,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 80.",
                    "sid": 194,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 83.",
                    "sid": 195,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Table 4: Results of Uryupina’s discourse new classifier Fe at ur es P R F Be st Pr ec Str ing +S yn +C ont ext All 94.",
                    "sid": 196,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 95.",
                    "sid": 197,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 84.",
                    "sid": 198,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 83.",
                    "sid": 199,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 88.",
                    "sid": 200,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 88.",
                    "sid": 201,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 Be st Re c Str ing +S yn +C ont ext All 86.",
                    "sid": 202,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 87.",
                    "sid": 203,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 96.",
                    "sid": 204,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 97.",
                    "sid": 205,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 91.",
                    "sid": 206,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 91.",
                    "sid": 207,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 Table 5: Results of Uryupina’s uniqueness classifier The first result to note is that both of Uryupina’s classifiers work very well, particularly the uniqueness classifier.",
                    "sid": 208,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These tables also show that the definite probability helps somewhat the discourse new detector, but is especially useful for the uniqueness detector, as one would expect on the basis of Loebner’s discussion.",
                    "sid": 209,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.5 Summary.",
                    "sid": 210,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Quite a lot of consensus on many of the factors playing a role in D N detection for D Ds.",
                    "sid": 211,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of the algorithms discussed above incorporate methods for: • recognizing predicative D Ds; • recognizing discourse-new proper names; • identifying functional D Ds; • recognizing D Ds modified by establishing relatives (which may or may not be discourse- new).",
                    "sid": 212,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is also consensus on the fact that D N detection cannot be isolated from anaphoric resolution (witness the Ng and Cardie results).",
                    "sid": 213,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One problem with some of the machine learning approaches to coreference is that these systems do not achieve very good results on pronoun and definite description resolution in comparison with specialized algorithms: e.g., although Ng and Cardie’s best version achieves F=65.8 on all anaphoric expressions, it only achieves F=29.6 for definite descriptions (cfr.",
                    "sid": 214,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Vieira and Poesio’s best result of F=77), and F=28.2 for pronouns (as opposed to results as high as F=80 obtained by the pronoun resolution algorithms evaluated in (Tetreault, 2001)).",
                    "sid": 215,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clearly these systems can only be properly compared by evaluating them all on the same corpora and the same data, and discussion such as (Mitkov, 2000) suggest caution in interpreting some of the results discussed in the literature as pre- and post- processing often plays a crucial role, but we feel that evaluating D N detectors in conjunction with high- performing systems would give a better idea of the improvements that one may hope to achieve.",
                    "sid": 216,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 Do Discourse-New Detectors Help?.",
                    "sid": 217,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preliminary Evaluations Vieira and Poesio did not test their system without D N-detection, but Ng and Cardie’s results indicate that D N detection does improve results, if not dramatically, provided that the same_head test is run first–although their D N detector does not appear to improve results for pronouns, the one category for which detection of non-anaphoricity has been shown to be essential (Lappin and Leass, 1994).",
                    "sid": 218,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to evaluate how much improvement can we expect by just improving the D N detector, we did a few preliminary evaluations both with a reimplementation of Vieira and Poesio’s algorithm which does not include a discourse-new detector, running over treebank text as the original algorithm, and with a simple statistical coreference resolver attempting to resolve all anaphoric expressions and running over unparsed text, using Uryupina’s features for discourse-new detection, and over the same corpus used by Ng and Cardie (M U C-7).",
                    "sid": 219,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 How much does DN-detection help the.",
                    "sid": 220,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Vieira / Poesio algorithm?",
                    "sid": 221,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "G U I TA R (Poesio and AlexandrovKabadjov, 2004) is a general-purpose anaphoric resolver that includes an implementation of the Vieira / Poesio algorithm for definite descriptions and of Mitkov’s algorithm for pronoun resolution (Mitkov, 1998).",
                    "sid": 222,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is implemented in Java, takes its input in X M L format and returns as output its input augmented with the anaphoric relations it has discovered.",
                    "sid": 223,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": "G U I TA R has been implemented in such a way as to be fully modular, making it possible, for example, to replace the D D resolution method with alternative implementations.",
                    "sid": 224,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It includes a pre-processor incorporating a chunker so that it can run over both hand-parsed and raw text.",
                    "sid": 225,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A version of G U I TA R without the D N detection aspects of the Vieira / Poesio algorithm was evaluated on the G N O M E corpus (Poesio, 2000; Poesio et al., 2004), which contains 554 definite descriptions, of which 180 anaphoric, and 305 third-person pronouns, of which 217 anaphoric.",
                    "sid": 226,
                    "ssid": 169,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results for definite descriptions over hand-parsed text are shown in Table 6.",
                    "sid": 227,
                    "ssid": 170,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tot al Res Cor r N M W M SM R P F 18 0 182 12 1 4 3 1 6 45 67.",
                    "sid": 228,
                    "ssid": 171,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 66.",
                    "sid": 229,
                    "ssid": 172,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 66.",
                    "sid": 230,
                    "ssid": 173,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 Table 6: Evaluation of the G U I TA R system without D N detection over a hand-annotated treebank G U I TA R without a D N recognizer takes 182 D Ds (Res) as anaphoric, resolving 121 of them correctly (Corr); of the 182 D Ds it attempts to resolve, only 16 are incorrectly resolved (WM); almost three times that number (45) are Spurious Matches (SM), i.e., discourse-new D Ds incorrectly interpreted as anaphoric.",
                    "sid": 231,
                    "ssid": 174,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Res=Corr+WM+SM.)",
                    "sid": 232,
                    "ssid": 175,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system can’t find an antecedent for 43 of the 180 anaphoric D Ds.",
                    "sid": 233,
                    "ssid": 176,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When endowed with a perfect D N detector, G U I - TA R could achieve a precision P=88.3 which, assuming recall stays the same (R=67.2) would mean a F=76.3.",
                    "sid": 234,
                    "ssid": 177,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of course, these results are obtained assuming perfect parsing.",
                    "sid": 235,
                    "ssid": 178,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a fairer comparison with the results of Ng and Cardie, we report in Table 7 the results for both pronouns and definite descriptions obtained by running G U I TA R off raw text.",
                    "sid": 236,
                    "ssid": 179,
                    "kind_of_tag": "s"
                },
                {
                    "text": "R P F Pr on ou ns 65 .5 63 .0 64 .2 D Ds 56 .7 56 .1 56 .4 Table 7: Evaluation of the G U I TA R system without D N detection off raw text Notice that although these results are not particularly good, they are still better than the results reported by Ng and Cardie for pronouns and definite N Ps.",
                    "sid": 237,
                    "ssid": 180,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 How much might DN detection help a. simple statistical coreference resolver?",
                    "sid": 238,
                    "ssid": 181,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to have an even closer comparison with the results of Ng and Cardie, we implemented a simple statistical coreference system, that, like Ng and Cardie’s system, would resolve all types of anaphoric expressions, and would run over unparsed text, but without D N detection.",
                    "sid": 239,
                    "ssid": 182,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We ran the system over the M U C-7 data used by Ng and Cardie, and compared the results with those obtained by using perfect knowledge about discourse novelty.",
                    "sid": 240,
                    "ssid": 183,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are shown in Table 8.",
                    "sid": 241,
                    "ssid": 184,
                    "kind_of_tag": "s"
                },
                {
                    "text": "W ith ou t D N de te cti on R 4 4.",
                    "sid": 242,
                    "ssid": 185,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 P 5 4.",
                    "sid": 243,
                    "ssid": 186,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 F 4 9.",
                    "sid": 244,
                    "ssid": 187,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 W ith D N de te cti on 41 .4 80 .0 54 .6 Table 8: Using an oracle These results suggest that a D N detector could lead to substantial improvements for coreference resolution in general: D N detection might improve precision by more than 30%, which more than makes up for the slight deterioration in recall.",
                    "sid": 245,
                    "ssid": 188,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of course, this test alone doesn’t tell us how much improvement D N detection would bring to a higher- performance anaphoric resolver.",
                    "sid": 246,
                    "ssid": 189,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 A New Set of Features for Discourse-New Detection Next, we developed a new set of features for discourse new detection that takes into account the findings of the work on D N detection discussed in the previous sections.",
                    "sid": 247,
                    "ssid": 190,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This set of features will be input to an anaphoric resolver for D Ds working in two steps.",
                    "sid": 248,
                    "ssid": 191,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each D D, 1.",
                    "sid": 249,
                    "ssid": 192,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The direct anaphora resolution algorithm from.",
                    "sid": 250,
                    "ssid": 193,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Vieira and Poesio, 2000) is run, which attempts to find an head-matching antecedent within a given window and taking premodification into account.",
                    "sid": 251,
                    "ssid": 194,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of the algorithm (i.e., whether an antecedent was found) is used as one of the input features of the classifier in the next step.",
                    "sid": 252,
                    "ssid": 195,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, a number of features of the D D that may help recognizing the classes of D Ds discussed above are extracted from the input.",
                    "sid": 253,
                    "ssid": 196,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of these features are computed accessing the Web via the Google A P I. 2.",
                    "sid": 254,
                    "ssid": 197,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A decision tree classifier is used to classify the D D as anaphoric (in which case the antecedents identified at the first step are also returned) or discourse-new.",
                    "sid": 255,
                    "ssid": 198,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features input to the classifier can be categorized as follows: Anaphora A single feature, direct-anaphora, specifying the distance of the (same-head) antecedent from the D D, if any (values: none, zero, one, more) Predicative NPs Two boolean features: • apposition, if the D D occurs in appositive position; • copular, if the D D occurs in post-verbal position in a copular construction.",
                    "sid": 256,
                    "ssid": 199,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Proper Names Three boolean features: • c-head: whether the head is capitalized; • c-premod: whether one of the premodifiers is capitalized; • S1: whether the D D occurs in the first sentence of a Web page.",
                    "sid": 257,
                    "ssid": 200,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Functionality The four definite probabilities used by Uryupina (computed accessing the Web), plus a superlative feature specifying if one of the premodifiers is a superlative, extracted from the part of speech tags.",
                    "sid": 258,
                    "ssid": 201,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Establishing relative A single feature, specifying whether N P is postmodified, and by a relative clause or a prepositional phrase; Text Position Whether the D D occurs in the title, the first sentence, or the first paragraph.",
                    "sid": 259,
                    "ssid": 202,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are testing several classifiers included in the Weka 3.4 library (http://www.cs.waikato.ac.nz/˜ml/) including an implementation of C 4.5 and a multi-layer perceptron.",
                    "sid": 260,
                    "ssid": 203,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "evaluation. ",
            "number": "5",
            "sents": [
                {
                    "text": "Data We are using three corpora for the evaluation, including texts from different genres, in which all anaphoric relations between (all types of) N Ps are marked.",
                    "sid": 261,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The G N O M E corpus includes pharmaceutical leaflets and museum ’labels’ (i.e., descriptions of museum objects and of the artists that realized them).",
                    "sid": 262,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As said above, the corpus contains 554 definite descriptions.",
                    "sid": 263,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we are using the 14 texts from the Penn Treebank included in the corpus used by Vieira and Poesio.",
                    "sid": 264,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We transferred these texts to X M L format, and added anaphoric information for all types of N Ps according to the G N O M E scheme.",
                    "sid": 265,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we are testing the system on the M U C-7 data used by Ng and Cardie Methods We will compare three versions of the D D resolution component: 1.",
                    "sid": 266,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline algorithm without D N detection.",
                    "sid": 267,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "incorporated in G U I TA R described above (i.e., only the direct anaphora resolution part of (Vieira and Poesio, 2000)); 2.",
                    "sid": 268,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A complete implementation of the Vieira and Poesio algorithm, including also the D N detecting heuristics; 3.",
                    "sid": 269,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An algorithm using the statistical classifier dis-.",
                    "sid": 270,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "cussed above.",
                    "sid": 271,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results Regrettably, the system is still being tested.",
                    "sid": 272,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will report the results at the workshop.",
                    "sid": 273,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discussion and conclusions. ",
            "number": "6",
            "sents": [
                {
                    "text": "Discussions and conclusions will be based on the final results.",
                    "sid": 274,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "Mijail AlexandrovKabadjov is supported by Conacyt.",
                    "sid": 275,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Renata Vieira and Rodrigo Goulart are partially supported by CNPq.",
                    "sid": 276,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}