{
    "ID": "W06-1630",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "In this paper we investigate unsupervised name transliteration using comparable corpora, corpora where texts in the two languages deal in some of the same topics — and therefore share references to named entities — but are not translations of each other.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present two distinct methods for transliteration, one approach using an unsupervised phonetic transliteration method, and the other using the temporal distribution of candidate pairs.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each of these approaches works quite well, but by combining the approaches one can achieve even better results.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe that the novelty of our approach lies in the phonetic-based scoring method, which is based on a combination of carefully crafted phonetic features, and empirical results from the pronunciation errors of second-language learners of English.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike previous approaches to transliteration, this method can in principle work with any pair of languages in the absence of a training dictionary, provided one has an estimate of the pronunciation of words in text.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "As a part of a ongoing project on multilingual named entity identification, we investigate unsupervised methods for transliteration across languages that use different scripts.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Starting from paired comparable texts that are about the same topic, but are not in general translations of each other, we aim to find the transliteration correspondences of the paired languages.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if there were an English and Arabic newspaper on the same day, each of the newspapers would likely contain articles about the same important international events.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From these comparable articles across the two languages, the same named entities such as persons and locations would likely be found.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For at least some of the English named entities, we would therefore expect to find Arabic equivalents, many of which would in fact be transliterations.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The characteristics of transliteration differ according to the languages involved.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, the exact transliteration of say, an English name is highly dependent on the language since this will be influenced by the difference in the phonological systems of the language pairs.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to show the reliability of a multilingual transliteration model, it should be tested with a variety of different languages.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have tested our transliteration methods with three unrelated target languages — Arabic, Chinese and Hindi, and a common source language — English.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Transliteration from English to Arabic and Chinese is complicated (AlOnaizan and Knight, 2002).",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, while Arabic orthography has a conventional way of writing long vowels using selected consonant symbols — basically <w>, <y> and <?>, in ordinary text short vowels are rarely written.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When transliterating English names there is the option of representing the vowels as either short (i.e. unwritten) or long (i.e. written with one of the above three mentioned consonant symbols).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example London is transliterated as lndn, with no vowels; Washington often as wSnjTwn, with <w> representing the final <o>.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Transliterations in Chinese are very different from the original English pronunciation due to the limited syl lable structure and phoneme inventory of Chinese.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Chinese does not allow consonant clusters or coda consonants except [n, N], and this results in deletion, substitution of consonants or insertion of vowels.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus while a syllable initial /d/ may surface as in Baghdad bage-da, note that the syllable final /d/ is not represented.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "250 Proceedings of the 2006 Conference on Empirical Methods in Natural Language Processing (EMNLP 2006), pages 250–257, Sydney, July 2006.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2006 Association for Computational Linguistics Hindi transliteration is not well-studied, but it is in principle easier than Arabic and Chinese since Hindi phonotactics is much more similar to that of English.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "previous work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Named entity transliteration is the problem of producing, for a name in a source language, a set of one or more transliteration candidates in a target language.",
                    "sid": 24,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Previous work — e.g.",
                    "sid": 25,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Knight and Graehl, 1998; Meng et al., 2001; AlOnaizan and Knight, 2002; Gao et al., 2004) — has mostly assumed that one has a training lexicon of transliteration pairs, from which one can learn a model, often a source-channel or MaxEnt-based model.",
                    "sid": 26,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparable corpora have been studied extensively in the literature — e.g.,(Fung, 1995; Rapp, 1995; Tanaka and Iwasaki, 1996; Franz et al., 1998; Ballesteros and Croft, 1998; Masuichi et al., 2000; Sadat et al., 2004), but transliteration in the context of comparable corpora has not been well addressed.",
                    "sid": 27,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The general idea of exploiting time correlations to acquire word translations from comparable corpora has been explored in several previous studies — e.g., (Fung, 1995; Rapp, 1995; Tanaka and Iwasaki, 1996).",
                    "sid": 28,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently, a Pearson correlation method was proposed to mine word pairs from comparable corpora (Tao and Zhai, 2005); this idea is similar to the method used in (Kay and Roscheisen, 1993) for sentence alignment.",
                    "sid": 29,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our work, we adopt the method proposed in (Tao and Zhai, 2005) and apply it to the problem of transliteration; note that (Tao and Zhai, 2005) compares several different metrics for time correlation, as we also note below — and see (Sproat et al., 2006).",
                    "sid": 30,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "transliteration with comparable. ",
            "number": "3",
            "sents": [
                {
                    "text": "Corpora We start from comparable corpora, consisting of newspaper articles in English and the target languages for the same time period.",
                    "sid": 31,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, the target languages are Arabic, Chinese and Hindi.",
                    "sid": 32,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then extract named-entities in the English text using the named-entity recognizer described in (Li et al., 2004), which is based on the SNoW machine learning toolkit (Carlson et al., 1999).",
                    "sid": 33,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To perform transliteration, we use the following general approach: 1 Extract named entities from the English corpus for each day; 2 Extract candidates from the same day’s newspapers in the target language; 3 For each English named entity, score and rank the target-language candidates as potential transliterations.",
                    "sid": 34,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We apply two unsupervised methods — time correlation and pronunciation-based methods — independently, and in combination.",
                    "sid": 35,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Candidate scoring based on.",
                    "sid": 36,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "pronunciation Our phonetic transliteration score uses a standard string-alignment and alignment-scoring technique based on (Kruskal, 1999) in that the distance is determined by a combination of substitution, insertion and deletion costs.",
                    "sid": 37,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These costs are computed from a language-universal cost matrix based on phonological features and the degree of phonetic similarity.",
                    "sid": 38,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Our technique is thus similar to other work on phonetic similarity such as (Frisch, 1996) though details differ.)",
                    "sid": 39,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We construct a single cost matrix, and apply it to English and all target languages.",
                    "sid": 40,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This technique requires the knowledge of the phonetics and the sound change patterns of the language, but it does not require a transliteration- pair training dictionary.",
                    "sid": 41,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we assume the WorldBet transliteration system (Hieronymus, 1995), an ASCII-only version of the IPA.",
                    "sid": 42,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cost matrix is constructed in the following way.",
                    "sid": 43,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All phonemes are decomposed into standard phonological features.",
                    "sid": 44,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, phonological features alone are not enough to model the possible substution/insertion/deletion patterns of languages.",
                    "sid": 45,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, /h/ is more frequently deleted than other consonants, whereas no single phonological feature allows us to distinguish /h/ from other consonants.",
                    "sid": 46,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, stop and fricative consonants such as /p, t, k, b, d, g, s, z/ are frequently deleted when they appear in the coda position.",
                    "sid": 47,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This tendency is very salient when the target languages do not allow coda consonants or consonant clusters.",
                    "sid": 48,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, Chinese only allows [n, N] in coda position, and stop consonants in coda position are frequently lost; Stanford is transliterated as sitanfu, with the final /d/ lost.",
                    "sid": 49,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since phonological features do not consider the position in the syllable, this pattern cannot be captured by conventional phonological features alone.",
                    "sid": 50,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To capture this, an additional feature “deletion of stop/fricative consonant in the coda position” is added.",
                    "sid": 51,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We base these observations, and the concomitant pseudofeatures on pronunciation error data of learners of English as a second language, as reported in (Swan and Smith, 2002).",
                    "sid": 52,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Er rors in second language pronunciation are determined by the difference in the phonological system of learner’s first and second language.",
                    "sid": 53,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same substitution/deletion/insertion patterns in the second language learner’s errors appear also in the transliteration of foreign names.",
                    "sid": 54,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if the learner’s first language does not have a particular phoneme found in English, it is substituted by the most similar phoneme in their first language.",
                    "sid": 55,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since Chinese does not have /v/, it is frequently substituted by /w/ or /f/.",
                    "sid": 56,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This substitution occurs frequently in the transliteration of foreign names in Chinese.",
                    "sid": 57,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Swan & Smith’s study covers 25 languages, and includes Asian languages such as Thai, Korean, Chinese and Japanese, European languages such as German, Italian, French, and Polish and Middle Eastern languages such as Arabic and Farsi.",
                    "sid": 58,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Frequent substitution/insertion/deletion patterns of phonemes are collected from these data.",
                    "sid": 59,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some examples are presented in Table 1.",
                    "sid": 60,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Twenty phonological features and 14 pseudofeatures are used for the construction of the cost matrix.",
                    "sid": 61,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All features are classified into 5 classes.",
                    "sid": 62,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are 4 classes of consonantal features — place, manner, laryngeality and major (consonant, sonorant, syllabicity), and a separate class of vocalic features.",
                    "sid": 63,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The purpose of these classes is to define groups of features which share the same substitution/insertion/deletion costs.",
                    "sid": 64,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For mally, given a class C, and a cost CC , for eachfeature f ∈ C, CC defines the cost of substitut ing a different value for f than the one present in the source phoneme.",
                    "sid": 65,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among manner features, the feature continuous is classified separately, since the substitution between stop and fricative consonants is very frequent; but between, say, nasals and fricatives such substitution is much less common.",
                    "sid": 66,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cost for frequent sound change patterns should be low.",
                    "sid": 67,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on our intuitions, our pseudofeatures are classified into one or another of the above-mentioned five classes.",
                    "sid": 68,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The substitution/deletion/insertion cost for a pair of phonemes is the sum of the individual costs of the features which are different between the two phonemes.",
                    "sid": 69,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, /n/ and /p/ are different in sonorant, labial and coronal features.",
                    "sid": 70,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the substitution cost of /n/ for /p/ is the sum of the sonorant, labial and coronal cost (20+10+10 = 40).",
                    "sid": 71,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Features and associated costs are shown in Table 2.",
                    "sid": 72,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sample substitution, insertion, and deletion costs for /g/ are presented in Table 3.",
                    "sid": 73,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting cost matrix based on these principles is then used to calculate the edit distance between two phonetic strings.",
                    "sid": 74,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pronunciations for English words are obtained using the Festival text- to-speech system (Taylor et al., 1998), and the target language words are automatically converted into their phonemic level transcriptions by various language-dependent means.",
                    "sid": 75,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of Mandarin Chinese this is based on the standard pinyin transliteration system.",
                    "sid": 76,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Arabic this is based on the orthography, which works reasonably well given that (apart from the fact that short vowels are no represented) the script is fairly phonemic.",
                    "sid": 77,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, the pronunciation of Hindi can be reasonably well-approximated based on the standard Devanagari orthographic representation.",
                    "sid": 78,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The edit cost for the pair of strings is normalized by the number of phonemes.",
                    "sid": 79,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting score ranges from zero upwards; the score is used to rank candidate transliterations, with the candidate having the lowest cost being considered the most likely transliteration.",
                    "sid": 80,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some examples of English words and the top three ranking candidates among all of the potential target-language candidates are given in Table 4.1 Starred entries are correct.",
                    "sid": 81,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Candidate scoring based on time.",
                    "sid": 82,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "correlation Names of the same entity that occur in different languages often have correlated frequency patterns due to common triggers such as a major event.",
                    "sid": 83,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the 2004 tsunami disaster was covered in news articles in many different languages.",
                    "sid": 84,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would thus expect to see a peak of frequency of names such as Sri Lanka, India, and Indonesia in news articles published in multiple languages in the same time period.",
                    "sid": 85,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, we may expect topically related names in different languages to tend to co-occur together over time.",
                    "sid": 86,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus if we have comparable news articles over a sufficiently long time period, it is possible to exploit such correlations to learn the associations of names in different languages.",
                    "sid": 87,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idea of exploiting time correlation has been well studied.",
                    "sid": 88,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopt the method proposed in (Tao and Zhai, 2005) to represent the source name and each name candidate with a frequency vector and score each candidate by the similarity of the 1 We describe candidate selection for each of the target languages later.",
                    "sid": 89,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In pu t O ut p ut P o s i t i o n D T N p / t / k D , d , z T, t, s N , n, g d el et io n ev er y w he re e v er y w h er e e v er y w h er e c o d a Table 1: Substitution/insertion/deletion patterns for phonemes based on English second-language learner’s data reported in (Swan and Smith, 2002).",
                    "sid": 90,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each row shows an input phoneme class, possible output phonemes (including null), and the positions where the substitution (or deletion) is likely to occur.",
                    "sid": 91,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "C l a s s F e a t u r e Co st M aj or fe at ur es an d Co ns on an t De l c o n s o n a n t 2 0 s o n o r a n t c o n s o n a n t d e l e t i o n P l a c e f e a t u r e s a n d V o w e l D e l c o r o n a l 1 0 v o w e l d e l / i n s st op /fr ic ati ve co ns on an t de l at co da po sit io n h d e l / i n s M a n n e r f e a t u r e s n a s a l 5 d o r s a l f e a t u r e f o r p a l a t a l c o n s o n a n t s V o w e l f e a t u r e s a n d E x c e p t i o n s v o w e l h e i g h t 3 v o w e l p l a c e e x c e p t i o n a l M a n n e r / L a r y n g e a l f e a t u r e s c o n t i n u o u s 1.",
                    "sid": 92,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 v o i c i n g Table 2: Examples of features and associated costs.",
                    "sid": 93,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pseudofeatures are shown in boldface.",
                    "sid": 94,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Exceptional denotes a situation such as the semivowel [j] substituting for the affricate [dZ].",
                    "sid": 95,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Substitutions between these two sounds actually occur frequently in second-language error data.",
                    "sid": 96,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "two frequency vectors.",
                    "sid": 97,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is very similar to the case in information retrieval where a query and a document are often represented by a term vector and documents are ranked by the similarity between their vectors and the query vector (Salton and McGill, 1983).",
                    "sid": 98,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But the vectors are very different and should be constructed in quite different ways.",
                    "sid": 99,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following (Tao and Zhai, 2005), we also normalize the raw frequency vector so that it becomes a frequency distribution over all the time points.",
                    "sid": 100,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to compute the similarity between two distribution vectors x = (x1 , ..., xT ) and y = (y1, ..., yT ), the Pearson correlation coefficient was used in (Tao and Zhai, 2005).",
                    "sid": 101,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also consider two other commonly used measures – cosine (Salton and McGill, 1983), and JensenShannon divergence (Lin, 1991), though our results show that Pearson correlation coefficient performs better than these two other methods.",
                    "sid": 102,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the time correlation method and the phonetic cor respondence method exploit distinct resources, it makes sense to combine them.",
                    "sid": 103,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We explore two approaches to combining these two methods, namely score combination and rank combination.",
                    "sid": 104,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These will be defined below in Section 4.2.",
                    "sid": 105,
                    "ssid": 75,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "4",
            "sents": [
                {
                    "text": "We evaluate our algorithms on three comparable corpora: English/Arabic, English/Chinese, and English/Hindi.",
                    "sid": 106,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Data statistics are shown in Table 5.",
                    "sid": 107,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From each data set in Table 5, we picked out all news articles from seven randomly selected days.",
                    "sid": 108,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We identified about 6800 English names using the entity recognizer from (Carlson et al., 1999), and chose the most frequent 200 names as our English named entity candidates.",
                    "sid": 109,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that we chose the most frequent names because the reliability of the statistical correlation depends on the size of sample data.",
                    "sid": 110,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When a name is rare in a collection, So ur ce Ta rg et Co st Ta rg et Co st g g 0 r 40 .5 k h 2.",
                    "sid": 111,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 e 44 .5 c C h 5.",
                    "sid": 112,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 d e l 2 4 t s h 17 .5 i n s 2 0 N 26 .5 Table 3: Substitution/deletion/insertion costs for /g/.",
                    "sid": 113,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "E n g li s h C a n d i d a t e S c ri p t W o r l d b e t E ng lis h C a n d i d a t e Phi lip pin es 1 * 2 3 f l b y n f l b y n y t f l b y n a S c r i p t Ro m an iza tio n W o r l d b e t Be lgi u m *1 2 3 b e l j i y a m b e r a h a m p h o r a m b e l j i y a m b e 9 a h a m p h o 9 a m M eg aw ati * 1 2 3 m h a f t h m i j a w a t a m a k w z a Pa rag ua y 1 * 2 3 p a r i c a y p a i r a a g v e b h i r . e g i i p a 9 i c a y p a i 9 a g v e b h i r r e g i E n gl is h C a n d i d a t e S c ri p t P i n y i n W o r l d b e t A n g ol a * 1 1 2 a n g e l a a n g e l a a g e l a a n k & l a a n k & l a a k & l a Me ga wat i * 1 2 3 me jia wa ti m i j i e j i m a h a t i e r m & i c C j a w a t i m i c C j & u c C i m a x a t i & r Table 4: Examples of the three top candidates in the transliteration of English/Arabic, English/Hindi and English/Chinese.",
                    "sid": 114,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second column is the rank.",
                    "sid": 115,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "one can either only use the phonetic model, which does not depend on the sample size; or else one must expand the data set and hope for more occurrence.",
                    "sid": 116,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To generate the Hindi and Arabic candidates, all words from the same seven days were extracted.",
                    "sid": 117,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The words were stemmed all possible ways using simple hand-developed affix lists: for example, given a Hindi word c1 c2 c3 , if both c3 and c2 c3 are in our suffix and ending list, then this single word generates three possible candidates: c1 , c1 c2 , and c1c2 c3 . In contrast, Chinese candidates were extracted using a list of 495 characters that are frequently used for foreign names (Sproat et al., 1996).",
                    "sid": 118,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A sequence of three or more such characters from the list is taken as a possible name.",
                    "sid": 119,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of candidates for each target language is presented in the last column of Table 5.",
                    "sid": 120,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We measured the accuracy of transliteration by Mean Reciprocal Rank (MRR), a measure commonly used in information retrieval when there is precisely one correct answer (Kantor and Voorhees, 2000).",
                    "sid": 121,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We attempted to create a complete set of answers for 200 English names in our test set, but a small number of English names do not seem to have any standard transliteration in the target language according to the resources that we looked at, and these names we removed from the evaluation set.",
                    "sid": 122,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we ended up having a list of less than 200 English names, shown in the second column of Table 6 (All).",
                    "sid": 123,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore some correct transliterations are not found in our candidate list for the second language, for two reasons: (1) The answer does not occur at all in the target news articles; (Table 6 # Missing 1) (2) The answer is there, but our candidate generation method has missed it.",
                    "sid": 124,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Table 6 # Missing 2) Thus this results in an even smaller number of candidates to evaluate (Core); this smaller number is given in the fifth column of Table 6.",
                    "sid": 125,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compute MRRs on the two sets La ng uag es N e w s A g e n c y P e r i o d # da ys # W or ds # Ca nd.",
                    "sid": 126,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "En g/ Ar ab Xi nh ua /X in hu a 08/ 06/ 20 01 – 11/ 07/ 20 01 1 5 0 12 M/ 1.8 M 1 2 4 6 6 En g/ Ch in Xi nh ua /X in hu a 08/ 06/ 20 01 – 11/ 07/ 20 01 1 5 0 12 M/ 21 M 6 2 9 1 En g/ Hi nd Xi nh ua/ Na idu nia 08/ 01/ 19 97 – 08/ 03/ 19 98 3 8 0 24 M/ 5.5 M 1 0 1 6 9 Table 5: Language-pair datasets.",
                    "sid": 127,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "La ng ua ge # All # mis sin g 1 # mis sin g 2 # Co re A ra bi c 19 2 1 1 3 9 7 0 C hi ne se 18 6 8 3 1 8 2 H i n d i 14 7 8 2 0 6 2 Table 6: Number of evaluated English NEs.",
                    "sid": 128,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of candidates — those represented by the count in column 2, and the smaller set represented by the count in column 5; we term the former MRR “AllMRR” and the latter “CoreMRR”.2 It is worth noting that the major reason for not finding a candidate transliteration of an English name in the target language is almost always because it is really not there, rather than because our candidate generation method has missed it.",
                    "sid": 129,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Presumably this reflects the fact that the corpora are merely comparable, rather than parallel.",
                    "sid": 130,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But the important point is that the true performance of the system would be closer to what we report below for CoreMRR, if we were working with truly parallel data where virtually all source language names would have target-language equivalents.",
                    "sid": 131,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Performance of phonetic method and.",
                    "sid": 132,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "time correlation method The performance of the phonetic method and the time correlation method are reported in Table 7, top and middle panels, respectively.",
                    "sid": 133,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the MRR scores, we also report another metric — CorrRate, namely the proportion of times the first candidate is the correct one.",
                    "sid": 134,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each of the two methods has advantages and disadvantages.",
                    "sid": 135,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The time correlation method relies more on the quality of the comparable corpora.",
                    "sid": 136,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is perhaps not surprising that the time correlation method performs the best on English/Chinese, since these data come from the same source (Xinhua).",
                    "sid": 137,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because the English and Hindi corpora are from different new agencies (Xinhua and Naidunia), the method performs relatively poorly.",
                    "sid": 138,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, the phonetic method is less affected by corpus quality, but is sensitive to differ 2 We are aware that the resulting test set is very small, but we believe that it is large enough to demonstrate that the method is effective.",
                    "sid": 139,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ences between languages.",
                    "sid": 140,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As discussed in the introduction, Hindi is relatively easy, and so we see the best MRR scores there.",
                    "sid": 141,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance is worse on Chinese and Arabic.",
                    "sid": 142,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It makes sense then to consider combining the two methods.",
                    "sid": 143,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Method combination.",
                    "sid": 144,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we evaluate the performance of such a combination.",
                    "sid": 145,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first use the phonetic method to filter out unlikely candidates, and then apply both the phonetic method and the time correlation method to rank the candidates.",
                    "sid": 146,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We explore two combination methods: score combination and rank combination.",
                    "sid": 147,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In score combination, since the scores of two methods are not on the same scale, we first normalize them into the range [0,1] where the 1 is the best transliteration score and 0 the worst.",
                    "sid": 148,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a phonetic score p and a time correlation score t on the same transliteration pairs, the final combination score f would be: f = α × p + (1 − α) × t, where α ∈ [0, 1] is alinear combination parameter.",
                    "sid": 149,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the rank combi nation, we take the unnormalized rankings of each candidate pair by the two methods and combine as follows: rcombined = α × rp + (1 − α) × rt, where rp and rt are the phonetic and temporal rankings, respectively.",
                    "sid": 150,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bottom panel of Table 7 shows the CoreMRR scores for these combination methods.",
                    "sid": 151,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second and third column, we repeat the phonetic and time correlation scores for ease of comparison.",
                    "sid": 152,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fourth column and the sixth column represent the combination results with α = 0.5 for both combination methods.",
                    "sid": 153,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fifth column and the last column are the best MRR scores that we can achieve through tuning α’s. Score combination, in particular, significantly outperforms the individual phonetic and time correlation methods alone.",
                    "sid": 154,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 plots the performance for all three languages with a variety of α’s for the score combination method.",
                    "sid": 155,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that a higher α puts more weight on the phonetic model.",
                    "sid": 156,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we have noted above, favoring the phonetic model is an advantage in our English/Hindi evaluation where the La ng ua ge Al lM R R A L L Co rr Ra te Co re M R R Co re Co rr Ra te A r a b i c 0 . 2 2 6 0 . 1 2 0 0 . 5 9 9 0 . 3 2 0 C hi n e s e 0 . 2 8 1 0 . 2 0 3 0 . 6 3 7 0 . 4 6 2 H i n d i 0 . 3 0 9 0 . 2 5 9 0 . 7 2 7 0 . 6 1 0 La ng ua ge Al lM R R Al lC orr Ra te Co re M R R Co re Co rr Ra te A r a b i c 0 . 2 4 6 0 . 1 6 4 0 . 6 7 6 0 . 4 5 0 C hi n e s e 0 . 3 6 3 0 . 2 9 2 0 . 8 2 4 0 . 6 6 2 H i n d i 0 . 2 1 2 0 . 1 5 8 0 . 4 9 9 0 . 3 7 2 La ng ua ge Ph on eti c T i m e C or re la ti o n S co re C o m b α = 0 . 5 S co re C o m b b e s t α R an k C o m b α = 0 . 5 R an k C o m b b e s t α A r a b i c 0 . 5 9 9 0 . 6 7 6 0 . 7 3 3 0 . 7 8 8 0 . 7 3 3 0 . 7 5 4 C hi n e s e 0 . 6 3 7 0 . 8 2 4 0 . 8 6 4 0 . 8 7 5 0 . 8 1 1 0 . 8 4 3 H i n d i 0 . 7 2 7 0 . 4 9 9 0 . 7 4 9 0 . 7 6 1 0 . 6 8 9 0 . 7 6 5 Table 7: MRRs and CorrRate for the pronunciation method (top) and time correlation method (middle).",
                    "sid": 157,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bottom table shows the scores for the combination (CoreMRR).",
                    "sid": 158,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0.9 0.85 0.8 0.75 0.7 0.65 0.6 0.55 0.5 English/Ara bic English/Chin ese English/Hindi 5 C o n c l u s i o n s a n d F u t u r e W o r k In this paper we have discusse d the problem of name transliter ation as one compon ent of a system for finding matchin g names in compara ble corpora.",
                    "sid": 159,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have propose d two unsuper vised methods for transliter ation, one that is based on carefully designed measure s of phonetic correspo n- dence and the other that is based on the temporal distributi on of words.",
                    "sid": 160,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have shown that both methods yield good results, and that even better 0 0.2 0.4 0.6 0.8 1 results can be achieved by combining the methods.",
                    "sid": 161,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "alpha values Figure 1: CoreMRR scores with different α values using score combination.",
                    "sid": 162,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A higher α puts more weight on the phonetic model.",
                    "sid": 163,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "phonetic correspondence between the two languages is fairly close, but the data sources are quite different; whereas for Arabic and Chinese we observe the opposite tendency.",
                    "sid": 164,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that one can balance the α scores according to whether one trusts one’s data source versus whether one trusts in the similarity of the two languages’ phonotactics.3 3 A reviewer notes that we have not compared our method to state-of-the-art supervised transliteration models.",
                    "sid": 165,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is true, but in the absence of a common evaluation set for transliteration, such a comparison would be meaningless.",
                    "sid": 166,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Certainly there are no standard databases, so far as we know, for the three language pairs we have been considering.",
                    "sid": 167,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One particular area that we will continue to work on is phonetic distance.",
                    "sid": 168,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe our hand-assigned costs are a reasonable starting point if one knows nothing about the particular pair of languages in question.",
                    "sid": 169,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However one could also train such costs, either from an existing list of known transliterations, or as part of an iterative bootstrapping method as, for example, in Yarowsky and Wicentowski’s (2000) work on morphological induction.",
                    "sid": 170,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The work we report is ongoing and is part of a larger project on multilingual named entity recognition and transliteration.",
                    "sid": 171,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the goals of this project is to develop tools and resources for under- resourced languages.",
                    "sid": 172,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Insofar as the techniques we have proposed have been shown to work on three language pairs involving one source language (English) and three unrelated and quite different target languages, one can reasonably claim that the techniques are language-independent.",
                    "sid": 173,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, as the case of Hindi shows, even with data from completely different news agencies we are able to extract useful correspondences.",
                    "sid": 174,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 Acknowledgments.",
                    "sid": 175,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work was funded by Dept. of the Interior contract NBCHC040176 (REFLEX).",
                    "sid": 176,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thank three EMNLP reviewers for useful feedback.",
                    "sid": 177,
                    "ssid": 72,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}