{
    "ID": "W06-2709",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We present ANNIS, a linguistic database that aims at facilitating the process of exploiting richly annotated language data by naive users.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describe the role of the database in our research project and the project requirements, with a special focus on aspects of multilevel annotation.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then illustrate the usability of the database by illustrative examples.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also address current challenges and next steps.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Until recently, working with data that is annotated at multiple levels with different types of annotation required rather advanced computer skills, which cannot be expected from the majority of potentially interested users.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present ANNIS, a linguistic database that aims at providing the infrastructure for supporting linguists in their work on multilevel annotations.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describe and illustrate the current state of our work and sketch the next steps.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In sec.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2, we present the research scenario AN- NIS is developed for, show the role of the linguistic database therein, and sketch the major requirements it aims to fulfill.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then describe the architecture and current functionality, and discuss the way difficult aspects of multidimensional annotations are treated (sec.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In sec.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4, we illustrate the work with the database by three exemplary approaches.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we sketch our next steps.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "background. ",
            "number": "2",
            "sents": [
                {
                    "text": "Research Scenario The database ANNIS is being developed in theCollaborative Research Center SFB 632 on Infor mation Structure, which consists of 13 individual research projects from disciplines such as theoretical linguistics, psycholinguistics, first and second language acquisition, typology and historical lin guistics.1 In the research center, data of various languages is collected and annotated at the levels of phonology, morphology, syntax, semantics, and pragmatics—levels that contribute in ways yet to be determined to the information structural partitioning of discourse and utterances.",
                    "sid": 15,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For annotation, task-specific tools are being used, e.g. EXMARaLDA, annotate, RSTTool, and MMAX.2 Data is then converted into a standoff data interchange format, which is fed into the linguistic database ANNIS.",
                    "sid": 16,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ANNIS aims at providing functionalities for exploring and querying the data, offering suitable means for both visualization and export.",
                    "sid": 17,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "User Requirements Central requirements evolving out of the scenario sketched above and, as we believe, for multilevel annotation in general are Data heterogeneity, Data reuse, and Accessibility (cf.",
                    "sid": 18,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Dipper and Go¨ tze, 2005)).",
                    "sid": 19,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Data heterogeneity is a result of: (i) the language data to be annotated, varying with respect to size (single sentences vs. narrations), modal- ity (monologue vs. dialogue, text vs. speech) and language; (ii) the annotations, which use different 1 http://www.sfb632.unipotsdam.de/.",
                    "sid": 20,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For more information about ANNIS, see http://www.",
                    "sid": 21,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sfb632.unipotsdam.de/annis/ and (Dipper et al., 2004).",
                    "sid": 22,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 http://www.rrz.unihamburg.de/ exmaralda/ http://www.coli.unisaarland.de/ projects/sfb378/negra-corpus/ http://www.wagsoft.com/RSTTool http://mmax.eml-research.de/ data structures (attribute-value pairs, trees, pointers, etc.); and (iii) data formats that stem from different task-specific annotation tools.",
                    "sid": 23,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Data reuse must be supported, e.g. for further or re-annotation, statistical analyses, or reuse of the data in other tools.",
                    "sid": 24,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accessibility of both tools and data is an obvious prerequisite for data reuse.",
                    "sid": 25,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following section, we will address those aspects that are particularly relevant for these requirements and discuss their treatment in ANNIS.",
                    "sid": 26,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "annis. ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 Main Features.",
                    "sid": 27,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ANNIS is a Java servlet application that can be accessed via standard web browsers.",
                    "sid": 28,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In its current state, it is not database-backed; data is read into memory and exploited for querying and visualization in memory.3 Data format and interoperability The data model must be suffiently expressive for capturing the data heterogeneity sketched above, including the representation of overlapping segments, intersecting hierarchies, and alternative annotations (e.g., for ambiguous annotations).",
                    "sid": 29,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It should further facilitate the addition of new annotations.",
                    "sid": 30,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our approach, we use a flexible standoff XML format, the SFB-standard interchange format, as the interface format (Dipper, 2005).",
                    "sid": 31,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this format, primary data is stored in a file that optionally specifies a header, followed by a tag <body>, which contains the source text.",
                    "sid": 32,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The format makes use of generic XML elements to encode data structures and annotations: <mark> (markable) tags specify text positions or spans of text (or spans of other markables) that can be annotated by linguistic information.",
                    "sid": 33,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Trees and graphs are encoded by <struct> (structure) and <rel> (relation) elements, which specify local subtrees.",
                    "sid": 34,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "<feat> (feature) tags specify the information that is annotated to markables or structures, which are referred to by xlink attributes.",
                    "sid": 35,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each type of annotation is stored in a separate file, hence, competing or ambiguous annotations can be represented in a straightforward way: by distributing them over different files.",
                    "sid": 36,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our format allows us to represent different kinds of annotations in a uniform way.",
                    "sid": 37,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We pro 3 For a more elaborate discussion of the basic concepts of.",
                    "sid": 38,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ANNIS, see (Dipper et al., 2004).",
                    "sid": 39,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "vide importers for the export format of the annotation tools annotate, EXMARaLDA, RST Tool, and MMAX.",
                    "sid": 40,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our PCC corpus (see sec.",
                    "sid": 41,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4) imports and synchronizes the following annotations, which have been annotated by these tools: syntax, information structure, rhetorical structure, and coreference.",
                    "sid": 42,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Visualization Suitable means for visualizing information is crucial for exploring and interpreting linguistic data.",
                    "sid": 43,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the high degree of data heterogeneity, special attention has been paid to the support of visualizing various data structures.",
                    "sid": 44,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, annotations may refer to segments of different sizes, e.g. syntax vs. discourse structure.",
                    "sid": 45,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, richness of information in multilevel annotations has to be taken into account; this requires a certain degree of user-adaptivity, allowing the user to modify the way information of interest is displayed.",
                    "sid": 46,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In ANNIS, we start from a basic interactive tier- based view, which allows for a compact simultaneous representation of many annotation types and whose appearance can be modified by the user in a format file.",
                    "sid": 47,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, a discourse view helps the user to orient him/herself in the discourse.",
                    "sid": 48,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further views can be added.",
                    "sid": 49,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Query support Among the numerous requirements for a good query facility for multilevel annotation, expressiveness, efficiency, and user- friendly query-formulation appear to be the most relevant.",
                    "sid": 50,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even a very brief discussion of these issues would go beyond the limits of this paper, the reader is instead referred to (Heid et al., 2004).",
                    "sid": 51,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Currently, ANNIS uses a query language prototype which allows the user to query text and annotations, by means of regular expressions and wild- cards, and various common relational operators (e.g. for stating relations in tree structures, such as dominance or sibling relations).",
                    "sid": 52,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the set for querying sequential relations is not sufficiently expressive, and querying co-reference relations is not supported yet.",
                    "sid": 53,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, user support for formulating queries is rather poor.",
                    "sid": 54,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Open Issues.",
                    "sid": 55,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Data alignment Alignment of annotations created by different annotation tools appears to be most suitable at the level of tokens.",
                    "sid": 56,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, tools often come with their own tokenizers and mismatches do occur frequently.",
                    "sid": 57,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We currently use a Figure 1: The ANNIS user interface, displaying data from the PCC simple script that checks for text and token identity in the standoff files that we generate from the output of the individual tools.",
                    "sid": 58,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, all mismatches have to be corrected manually.",
                    "sid": 59,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At least for white-space differences, an automatic fixing procedure should be feasible (similar to the one implemented by (Witt et al., 2005)).",
                    "sid": 60,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Efficient Querying Current querying is restricted to rather small amounts of data, and complex queries may take some time until finishing the search.",
                    "sid": 61,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overlapping elements and intersecting hierarchies The query language does not yet support comfortable searching for overlapping elements.",
                    "sid": 62,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, exactly what kinds of queries on overlapping segments or intersecting relations should be supported is an open question.",
                    "sid": 63,
                    "ssid": 37,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "use cases. ",
            "number": "4",
            "sents": [
                {
                    "text": "We illustrate the use of ANNIS in linguistic research, exemplified with research questions from three different linguistic areas.",
                    "sid": 64,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Historical investigations The project B4: The role of information structure in the development of word order regularities in Germanic investigates the verb-second phenomenon, which occurred in certain Germanic languages only (e.g., it did in Modern German, but not in Modern English).",
                    "sid": 65,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of their findings is that verb placement in the Old High German translation of Tatian correlates with discourse relations: verb-initial sentences usually occur in narrative contexts and signal continuation of the story.",
                    "sid": 66,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, verb-second sentences indicate subordinative relations (Hinterho¨ lzl and Petrova, 2005).",
                    "sid": 67,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typological studies In the research project D2: Typology of Information Structure (cf., e.g., (Go¨ tze et al., To appear)), a typological questionnaire is designed, with which language data can be elicited using largely language independent methods.",
                    "sid": 68,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Currently, data from 13 different languages is elicited and annotated with information from various linguistic levels (morphosyntax, phonology, semantics, and information structure).",
                    "sid": 69,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An interesting query might look for nominal phrases (const=np) that are new in the discourse (given=new) and belong to the (information-) focus of a sentence (focus=ans), e.g. for investigating the phonological realization of these.",
                    "sid": 70,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The according query has the form: const=np & given=new & focus=ans & #1 = #2.4 Queries in ANNIS can be restricted to subsets of a corpus, by queries such as focus=ans & doc=*8111*, which searches for all answer foci in the data that has been elicited by means of the task 8111 in the questionnaire, yielding matching data from all languages in our database.",
                    "sid": 71,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discourse studies The Potsdam Commentary Corpus, PCC (Stede, 2004), consists of 173 newspaper commentaries, annotated for morphosyn- tax, coreference, discourse structure according to Rhetorical Structure Theory, and information structure.",
                    "sid": 72,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A question of interest here is the information- structural pattern of sentences introducing discourse segments that elaborate on another part of the discourse: elaboration & rel=satellite & (cat=vroot & aboutness-topic) & #1 > #2 & #2 = #3.",
                    "sid": 73,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another research issue is the relationship of coreference and discourse structure.",
                    "sid": 74,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, querying for coreference relations is not supported yet.",
                    "sid": 75,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "future work. ",
            "number": "5",
            "sents": [
                {
                    "text": "Currently we are working on integrating a native XML database into our system.",
                    "sid": 76,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To make processing more efficient, we are developing an internal inline representation of the standoff interchange format, encoding overlapping segments by means of milestones or fragments (Barnard et al., 1995).",
                    "sid": 77,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the query language will be extended to cover different kinds of queries on sequential relations as well as coreference relations.",
                    "sid": 78,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we will add basic statistical means to the query facility, which, e.g., can point to rare and, hence, potentially interesting feature combinations.",
                    "sid": 79,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "demo. ",
            "number": "6",
            "sents": [
                {
                    "text": "In our demonstration of ANNIS, we will show example data from the PCC, Old High German, and data elicited by the typological questionnaire.",
                    "sid": 80,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then illustrate by means of example queries how the researchers make use of our database in their daily work, as described above.",
                    "sid": 81,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This includes presenting the visualization and querying facilities of ANNIS.",
                    "sid": 82,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 The expression #n refers to the nth constraint stated in the query; the binary operator = requires extensional identity (Dipper et al., 2004).",
                    "sid": 83,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}