{
    "ID": "W06-2611",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This article describes a robust semantic parser that uses a broad knowledge base created by interconnecting three major resources: FrameNet, VerbNet and PropBank.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The FrameNet corpus contains the examples annotated with semantic roles whereas the VerbNet lexicon provides the knowledge about the syntactic behavior of the verbs.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We connect VerbNet and FrameNet by mapping the FrameNet frames to the VerbNet Intersective Levin classes.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The PropBank corpus, which is tightly connected to the VerbNet lexicon, is used to increase the verb coverage and also to test the effectiveness of our approach.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results indicate that our model is an interesting step towards the design of free-text semantic parsers.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "During the last years a noticeable effort has been devoted to the design of lexical resources that can provide the training ground for automatic semantic role labelers.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, most of the systems developed until now are confined to the scope of the resource that they use during the learning stage.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A very recent example in this sense was provided by the CONLL 2005 Shared Task on PropBank (Kingsbury and Palmer, 2002) role labeling (Carreras and Màrquez, 2005).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the best F-measure recorded on a test set selected from the training corpus (WSJ) was 80%, on the Brown corpus, the F-measure dropped below 70%.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most significant causes for this performance decay were highly ambiguous and unseen predicates (i.e. predicates that do not have training examples, unseen in the training set).",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the FrameNet (Johnson et al., 2003) role labeling task, the Senseval3 competition (Lit- kowski, 2004) registered similar results (~80%) by using the gold frame information as a given feature.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No tests were performed outside Frame- Net.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we show that when the frame feature is not used, the performance decay on different corpora reaches 30 points.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the context knowledge provided by the frame is very important and a free-text semantic parser using FrameNet roles depends on the accurate automatic detection of this information.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to test the feasibility of such a task, we have trained an SVM (Support Vector Machine) Tree Kernel model for the automatic acquisition of the frame information.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although FrameNet contains three types of predicates (nouns, adjectives and verbs), we concentrated on the verb predicates and the roles associated with them.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we considered only the frames that have at least one verb lexical unit.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our experiments show that given a FrameNet predicate-argument structure, the task of identifying the originating frame can be performed with very good results when the verb predicates have enough training examples, but becomes very challenging otherwise.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The predicates not yet included in FrameNet and the predicates belonging to new application domains (that require new frames) are especially problematic as for them there is no available training data.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have thus studied new means of capturing the semantic context, other than the frame, which can be easily annotated on FrameNet and are available on a larger scale (i.e. have a better coverage).",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A very good candidate seems to be the Intersective Levin classes (Dang et al., 1998) that can be found as well in other predicate resources like PropBank and VerbNet (Kipper et al., 2000).",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we have designed a semiautomatic algorithm for assigning an Intersective Levin class to each FrameNet verb predicate.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm creates a mapping between FrameNet frames and the Intersective Levin classes.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By doing that we could connect FrameNet to VerbNet and PropBank and obtain an increased training set for the Intersective Levin class.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This leads to better verb coverage and a more robust semantic parser.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The newly created knowledge base allows us to surpass the shortcomings that arise when FrameNet, VerbNet and PropBank are used separately while, at the same time, we benefit from the extensive research involving each of them (Pradhan et al., 2004; Gildea and Jurafsky, 2002; Moschitti, 2004).",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We mention that there are 3,672 distinct verb senses1 in PropBank and 2,351 distinct verb senses in FrameNet.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only 501 verb senses are in common between the two corpora which mean 13.64% of PropBank and 21.31% of FrameNet.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, by training an Intersective Levin class classifier on both PropBank and FrameNet we extend the number of available verb senses to 5,522.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the remainder of this paper, Section 2 summarizes previous work done on FrameNet automatic role detection.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also explains in more detail why models based exclusively on this corpus are not suitable for free-text parsing.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 focuses on VerbNet and PropBank and how they can enhance the robustness of our semantic parser.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 describes the mapping between frames and Intersective Levin classes whereas Section 5 presents the experiments that support our thesis.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, Section 6 summarizes the conclusions.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "automatic semantic role detection on. ",
            "number": "2",
            "sents": [
                {
                    "text": "FrameNet One of the goals of the FrameNet project is to design a linguistic ontology that can be used for automatic processing of semantic information.",
                    "sid": 35,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This hierarchy contains an extensive semantic analysis of verbs, nouns, adjectives and situations in which they are used, called frames.",
                    "sid": 36,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic assumption on which the frames are built is that each word evokes a particular situation with specific participants (Fillmore, 1968).",
                    "sid": 37,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The situations can be fairly simple depicting the entities involved and the roles they play or can be very complex and in this case they are called scenarios.",
                    "sid": 38,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word that evokes a particular frame is called target word or predicate and can be an 1 A verb sense is an Intersective Levin class in which the verb is listed.",
                    "sid": 39,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "adjective, noun or verb.",
                    "sid": 40,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The participant entities are defined using semantic roles and they are called frame elements.",
                    "sid": 41,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several models have been developed for the automatic detection of the frame elements based on the FrameNet corpus (Gildea and Jurafsky, 2002; Thompson et al., 2003; Litkowski, 2004).",
                    "sid": 42,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the algorithms used vary, almost all theprevious studies divide the task into 1) the identi fication of the verb arguments to be labeled and 2) the tagging of each argument with a role.",
                    "sid": 43,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, most of the models agree on the core fea tures as being: Predicate, Headword, Phrase Type, Governing Category, Position, Voice and Path.",
                    "sid": 44,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are the initial features adopted by Gildea and Jurafsky (2002) (henceforth G&J) for both frame element identification and role classification.",
                    "sid": 45,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A difference among the previous machine- learning models is whether the frame information was used as gold feature.",
                    "sid": 46,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of particular interest for us is the impact of the frame over unseen predicates and unseen words in general.",
                    "sid": 47,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results obtained by G&J are relevant in this sense; especially, the experiment that uses the frame to generalize from predicates seen in the training data to other predicates (i.e. when no data is available for a target word, G&J use data from the corresponding frame).",
                    "sid": 48,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The overall performance induced by the frame usage increased.",
                    "sid": 49,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other studies suggest that the frame is crucial when trying to eliminate the major sources of errors.",
                    "sid": 50,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In their error analysis, (Thompson et al., 2003) pinpoints that the verb arguments with headwords that are “rare” in a particular frame but not rare over the whole corpus are especially hard to classify.",
                    "sid": 51,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For these cases the frame is very important because it provides the context information needed to distinguish between different word senses.",
                    "sid": 52,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall, the experiments presented in G&J’s study correlated with the results obtained in theSenseval3 competition show that the frame fea ture increases the performance and decreases the amount of annotated examples needed in training (i.e. frame usage improves the generalization ability of the learning algorithm).",
                    "sid": 53,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand the results obtained without the frame information are very poor.",
                    "sid": 54,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This behavior suggests that predicates in the same frame behave similarly in terms of their argument structure and that they differ with respect to other frames.",
                    "sid": 55,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From this perspective, having a broader verb knowledge base becomes of major importance for free-text semantic parsing.",
                    "sid": 56,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, the 321 frames that contain at least one verb predicate cover only a small fraction of the English verb lexicon and of possible domains.",
                    "sid": 57,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also from these 321 frames only 100 were considered to have enough training data and were used in Senseval3 (see Litkowski, 2004 for more details).",
                    "sid": 58,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach for solving such problems involves the usage of a frame-like feature, namely the Intersective Levin class.",
                    "sid": 59,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that the Levin class is similar in many aspects to the frame and can replace it with almost no loss in performance.",
                    "sid": 60,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the same time, Levin class provides better coverage as it can be learned also from other corpora (i.e. PropBank).",
                    "sid": 61,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We annotate FrameNet with Intersective Levin classes by using a mapping algorithm that exploits current theories of linking.",
                    "sid": 62,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our extensive experimentation shows the validity of our technique and its effectiveness on corpora different from Frame- Net.",
                    "sid": 63,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The next section provides the theoretical support for the unified usage of FrameNet, VerbNet and PropBank, explaining why and how is possible to link them.",
                    "sid": 64,
                    "ssid": 30,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "linking framenet to verbnet and. ",
            "number": "3",
            "sents": [
                {
                    "text": "PropBank In general, predicates belonging to the same FrameNet frame have a coherent syntactic behavior that is also different from predicates pertaining to other frames (G&J).",
                    "sid": 65,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This finding is consistent with theories of linking that claim that the syntactic behavior of a verb can be predicted from its semantics (Levin 1993, Levin and Rap- paport Hovav, 1996).",
                    "sid": 66,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This insight determined us to study the impact of using a feature based on Intersective Levin classes instead of the frame feature when classifying FrameNet semantic roles.",
                    "sid": 67,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main advantage of using Levin classes comes from the fact that other resources like PropBank and the VerbNet lexicon contain this kind of information.",
                    "sid": 68,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we can train a Levin class classifier also on the PropBank corpus, considerably increasing the verb knowledge base at our disposal.",
                    "sid": 69,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another advantage derives from the syntactic criteria that were applied in defining the Levin clusters.",
                    "sid": 70,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown later in this article, the syntactic nature of these classes makes them easier to classify than frames, when using only syntactic and lexical features.",
                    "sid": 71,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More precisely, the Levin clusters are formed according to diathesis alternation criteria which are variations in the way verbal arguments are grammatically expressed when a specific se mantic phenomenon arises.",
                    "sid": 72,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, two different types of diathesis alternations are the following: (a) Middle Alternation [Subject, Agent The butcher] cuts [Direct Object, Patient the meat].",
                    "sid": 73,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[Subject, Patient The meat] cuts easily.",
                    "sid": 74,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(b) Causative/inchoative Alternation [Subject, Agent Janet] broke [Direct Object, Patient the cup].",
                    "sid": 75,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[Subject, Patient The cup] broke.",
                    "sid": 76,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In both cases, what is alternating is the grammatical function that the Patient role takes when changing from the transitive use of the verb to the intransitive one.",
                    "sid": 77,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The semantic phenomenon accompanying these types of alternations is the change of focus from the entity performing the action to the theme of the event.",
                    "sid": 78,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Levin documented 79 alternations which constitute the building blocks for the verb classes.",
                    "sid": 79,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although alternations are chosen as the primary means for identifying the classes, additional properties related to subcategorization, morphology and extended meanings of verbs are taken into account as well.",
                    "sid": 80,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, from a syntactic point of view, the verbs in one Levin class have a regular behavior, different from the verbs pertaining to other classes.",
                    "sid": 81,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, the classes are semantically coherent and all verbs belonging to one class share the same participant roles.",
                    "sid": 82,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This constraint of having the same semantic roles is further ensured inside the VerbNet lexi con that is constructed based on a more refined version of the Levin classification called Inter- sective Levin classes (Dang et al., 1998).",
                    "sid": 83,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lexicon provides a regular association between the syntactic and semantic properties of each of the described classes.",
                    "sid": 84,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also provides information about the syntactic frames (alternations) in which the verbs participate and the set of possible semantic roles.",
                    "sid": 85,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One corpus associated with the VerbNet lexicon is PropBank.",
                    "sid": 86,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The annotation scheme of PropBank ensures that the verbs belonging to the same Levin class share similarly labeled arguments.",
                    "sid": 87,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inside one Intersective Levin class, to one argument corresponds one semantic role numbered sequentially from Arg0 to Arg5.",
                    "sid": 88,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Higher numbered argument labels are less consistent and assigned per-verb basis.",
                    "sid": 89,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Levin classes were constructed based on regularities exhibited at grammatical level andthe resulting clusters were shown to be semanti cally coherent.",
                    "sid": 90,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As opposed, the FrameNet frames were build on semantic bases, by putting together verbs, nouns and adjectives that evoke the same situations.",
                    "sid": 91,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although different in conception, the FrameNet verb clusters and VerbNet verb clusters have common properties2: (1) Coherent syntactic behavior of verbs inside one cluster, (2) Different syntactic properties between any two distinct verb clusters, (3) Shared set of possible semantic roles for all verbs pertaining to the same cluster.",
                    "sid": 92,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Having these insights, we have assigned a correspondent VerbNet class not to each verb predicate but rather to each frame.",
                    "sid": 93,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In doing this we have applied the simplifying assumption that a frame has a unique corresponding Levin class.",
                    "sid": 94,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we have created a one-to-many mapping between the Intersective Levin classes and the frames.",
                    "sid": 95,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to create a pair 〈FrameNet frame, VerbNet class〉, our mapping algorithm checks both the syntactic and semantic consistency by comparing the role frequency distributions on different syntactic positions for the two to 3 elements then we form a pair 〈FrameNet frame, VerbNet class〉 that qualifies for the second step of the algorithm.",
                    "sid": 96,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only the frames that have more than three verb lexical units are candidates for this step (frames with less than 3 members cannot pass condition (II)).",
                    "sid": 97,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This excludes a number of 60 frames that will subsequently be mapped manually.",
                    "sid": 98,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "INPUT VN = {C | C is a VerbNet class} VN Class C = {v | v is a verb of C} FN = {F | F is a FrameNet frame} FN Frame F = {v | v is a verb of F} OUTPUT Pairs = {(F , C ) | F ∈ FN , C ∈ VN : F is mapped to C} COMPUTE PAIRS : Let Pairs = ∅ for each F ∈ FN candidates.",
                    "sid": 99,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm is described in detail (I ) compute C* = arg max C∈VN F ∩ C in the next section.",
                    "sid": 100,
                    "ssid": 36,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "mapping \tframenet\tframes\tto. ",
            "number": "4",
            "sents": [
                {
                    "text": "(II ) if F ∩ C* ≥ 3 then Pairs = Pairs ∪ (F , C* ) VerbNet classes The mapping algorithm consists of three steps: (a) we link the frames and Intersective Levin verb classes that have the largest number of verbs in common and we create a set of pairs 〈FrameNet frame, VerbNet class〉 (see Figure 1); (b) we refine the pairs obtained in the previous step based on diathesis alternation criteria, i.e. the verbs pertaining to the FrameNet frame have to undergo the same diathesis alternation that characterize the corresponding VerbNet class (see Figure 2) and (c) we manually check and correct the resulting mapping.",
                    "sid": 101,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the next sec tions we will explain in more detail each step of the mapping algorithm.",
                    "sid": 102,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Linking frames and Intersective Levin.",
                    "sid": 103,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "classes based on common verbs During the first phase of the algorithm, given a frame, we compute its intersection with each VerbNet class.",
                    "sid": 104,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We choose as candidate for the mapping the Intersective Levin class that has the largest number of verbs in common with the given frame (Figure 1, line (I)).",
                    "sid": 105,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the size of the intersection between the FrameNet frame and the candidate VerbNet class is bigger than or equal 2 For FrameNet, properties 1 and 2 are true for most.",
                    "sid": 106,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of the frames but not for all.",
                    "sid": 107,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "See section 4.4 for more details.",
                    "sid": 108,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1.",
                    "sid": 109,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Linking FrameNet frames and VerbNet classes 4.2 Refining the mapping based on verb.",
                    "sid": 110,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "alternations In order to assign a VerbNet class to a frame, we have to check that the verbs belonging to that frame respect the diathesis alternation criteria used to define the VerbNet class.",
                    "sid": 111,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the pairs 〈FrameNet frame, VerbNet class〉 formed in step (I) of the mapping algorithm have to undergo a validation step that verifies the similarity be tween the enclosed FrameNet frame and VerbNet class.",
                    "sid": 112,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This validation process has several sub steps.",
                    "sid": 113,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we make use of the property (3) of the Levin classes and FrameNet frames presented in the previous section.",
                    "sid": 114,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to this property, all verbs pertaining to one frame or Levin class have the same participant roles.",
                    "sid": 115,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, a first test of compatibility between a frame and a Levin class is that they share the same participant roles.",
                    "sid": 116,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As FrameNet is annotated with frame-specific semantic roles we manually mapped these roles into the VerbNet set of thematic roles.",
                    "sid": 117,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a frame, we assigned thematic roles to all frame elements that are associated with verbal predicates.",
                    "sid": 118,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example the roles Speaker, Addressee, Message and Topic from the Telling frame were respectively mapped into Agent, Recipient, Theme and Topic.",
                    "sid": 119,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, we build a frequency distribution of VerbNet thematic roles on different syntactic position.",
                    "sid": 120,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on our observation and previous studies (Merlo and Stevenson, 2001), we assume that each Levin class has a distinct frequency distribution of roles on different grammatical slots.",
                    "sid": 121,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we do not have matching grammatical function in FrameNet and VerbNet, we approximate that subjects and direct objects are more likely to appear on positions adjacent to the predicate, while indirect objects appear on more distant positions.",
                    "sid": 122,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same intuition is used successfully by G&J in the design of the Position feature.",
                    "sid": 123,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will acquire from the corpus, for each thematic role θi, the frequencies with which it appears on an adjacent (ADJ) or distant (DST) position in a given frame or VerbNet class (i.e. #(θi, class, position)).",
                    "sid": 124,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, for each frame and class, we obtain two vectors with thematic role frequencies corresponding respectively to the adjacent and distant positions (see Figure 2).",
                    "sid": 125,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compute a score for each pair 〈FrameNet frame, VerbNet class〉 using the normalized scalar product.",
                    "sid": 126,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We give a bigger weight to the adjacent dot product multiplying its score by 2/3 with respect to the distant dot product that is multiplied by 1/3.",
                    "sid": 127,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do this to minimize the impact that adjunct roles like Temporal and Location (that appear mostly on the distant positions) could have on the final outcome.",
                    "sid": 128,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TR = {θ : θ is the ith theta roel of theVerbNet theat role se}t over PropBank as they are general for all verb classes.",
                    "sid": 129,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The only exception is ARGMDIR that can correspond to Source, Goal or Path.",
                    "sid": 130,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We assign different roles to this adjunct based on the prepositions.",
                    "sid": 131,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We ignore some adjuncts like ARGMADV or ARGM-DIS because they cannot bear a thematic role.",
                    "sid": 132,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Mapping Results.",
                    "sid": 133,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found that only 133 VerbNet classes have correspondents among FrameNet frames.",
                    "sid": 134,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, from the frames mapped with an automatic score smaller than 0.5 points almost a half did not match any of the existing VerbNet classes3.",
                    "sid": 135,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A summary of the results is depicted in Table 1.",
                    "sid": 136,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first column contains the automatic score provided by the mapping algorithm when comparing frames with Intersective Levin classes.",
                    "sid": 137,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second column contains the number of frames for each score interval.",
                    "sid": 138,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third column contains the percentage of frames, per each score interval, that did not have a corresponding VerbNet class and finally the forth column contains the accuracy of the mapping algorithm.",
                    "sid": 139,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sco re N o. o f Fr a m es N o t m a p p e d C or re ct Ov er all Co rre ct [0, 0.5] 1 1 8 4 8.",
                    "sid": 140,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 % 8 2 . 5 % 8 9.",
                    "sid": 141,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 % (0.",
                    "sid": 142,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5,0 .75] 6 9 0 8 4 % (0.",
                    "sid": 143,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "75, 1] 7 2 0 1 0 0 % Table 1.",
                    "sid": 144,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results of the mapping algorithm 4.4 Discussion.",
                    "sid": 145,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the literature, other studies compared the Levin classes to the FrameNet frames (Baker and i i for each(F, C)∈ Pairs F Ruppenhofer, 2002).",
                    "sid": 146,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their findings suggest that although the two set of clusters are roughly ADJ F DST C ADJ C DST = (o1 ,..,on ), whereoi = # (θi , F, position=ad jacent) = (o1 ,..,on ), whereoi = # (θi , F, position=di stant) = (o1 ,..,on ), whereoi = # (θi , C, position=ad jacent) = (o1 ,..,on ), whereoi = # (θi , C, position=di stant) equiva lent there are also severa l types of mistm aches: 1) Levin classe s that are narro wer than the corres pondin g frames , 2) Levin classe s that are broade r that the corres pondin g frames and 3) overla pping groupi ngs.",
                    "sid": 147,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For our task, point ScoreF ,C = 2 × F ADJ C • ADJ + 1 × F DST C • DST 2 does not pose a problem.",
                    "sid": 148,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Points 1 and 3 F C || ADJ || × || ADJ || F C || DST || × || DST || however suggest that there are cases in which to one FrameNet frame corresponds more than one Figure 2.",
                    "sid": 149,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mapping algorithm – refining step The above frequency vectors are computed for FrameNet directly from the corpus of predicate-argument structure examples associated with each frame.",
                    "sid": 150,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The examples associated with the VerbNet lexicon are extracted from the PropBank corpus.",
                    "sid": 151,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to do this we apply a preprocessing step in which each label ARG0..N is replaced with its corresponding thematic role given the Intersective Levin class of the predicate.",
                    "sid": 152,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We assign the same roles to the adjuncts all Levin class.",
                    "sid": 153,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By investigating such cases we noted that the mapping algorithm consistently assigns scores below 75% to cases that match problem 1 (two Levin classes inside one frame) and below 50% to cases that match problem 3 (more than two Levin classes inside one frame).",
                    "sid": 154,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, in order to increase the accuracy of our results a first step should be to assign an 3 The automatic mapping can be improved by manu-.",
                    "sid": 155,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ally assigning the FrameNet frames of the pairs that receive a score lower than 0.5.",
                    "sid": 156,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intersective Levin class to each of the verbs pertaining to frames with score lower than 0.75.",
                    "sid": 157,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless the current results are encouraging as they show that the algorithm is achiving its purpose by successfully detecting syntactic incoherencies that can be subsequently corrected manually.",
                    "sid": 158,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, in the next section we will show that our current mapping achieves very good results, giving evidence for the effectivenes of the Levin class feature.",
                    "sid": 159,
                    "ssid": 59,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "5",
            "sents": [
                {
                    "text": "In the previous section we have presented the algorithm for annotating the verb predicates of FrameNet with Intersective Levin classes.",
                    "sid": 160,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to show the effectiveness of this annotation and of the Intersective Levin class in general we have performed several experiments.",
                    "sid": 161,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we trained (1) an ILC multiclassifier from FrameNet, (2) an ILC multiclassifier from PropBank and (3) a frame multiclassifier from FrameNet.",
                    "sid": 162,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compared the results obtained when trying to classify the VerbNet class with the results obtained when classifying frame.",
                    "sid": 163,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that Intersective Levin classes are easier to detect than FrameNet frames.",
                    "sid": 164,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our second set of experiments regards the automatic labeling of FrameNet semantic roles on FrameNet corpus when using as features: gold frame, gold Intersective Levin class, automatically detected frame and automatically detected Intersective Levin class.",
                    "sid": 165,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that in all situations in which the VerbNet class feature is used, the accuracy loss, compared to the usage of the frame feature, is negligible.",
                    "sid": 166,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thus show that the Intersective Levin class can successfully replace the frame feature for the task of semantic role labeling.",
                    "sid": 167,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another set of experiments regards the generalization property of the Intersective Levin class.",
                    "sid": 168,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show the impact of this feature when very few training data is available and its evolution when adding more and more training examples.",
                    "sid": 169,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We again perform the experiments for: gold frame, gold Intersective Levin class, automatically detected frame and automatically detected Intersective Levin class.",
                    "sid": 170,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we simulate the difficulty of free text by annotating PropBank with FrameNet semantic roles.",
                    "sid": 171,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use PropBank because it is dif ferent from FrameNet from a domain point of view.",
                    "sid": 172,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This characteristic makes PropBank a dif ficult test bed for semantic role models trained on FrameNet.",
                    "sid": 173,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following section we present the results obtained for each of the experiments mentioned above.",
                    "sid": 174,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Experimental setup.",
                    "sid": 175,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpora available for the experiments were PropBank and FrameNet.",
                    "sid": 176,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PropBank contains about 54,900 sentences and gold parse trees.",
                    "sid": 177,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used sections from 02 to 22 (52,172 sentences) to train the Intersective Levin class classifiers and section 23 (2,742 sentences) for testing purposes.",
                    "sid": 178,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the experiments on FrameNet corpus we extracted 58,384 sentences from the 319 frames that contain at least one verb annotation.",
                    "sid": 179,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are 128,339 argument instances of 454 semantic roles.",
                    "sid": 180,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only verbs are selected to be predicates in our evaluations.",
                    "sid": 181,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, as there is no fixed split between training and testing, we randomly selected 20% of sentences for testing and 80% for training.",
                    "sid": 182,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sentences were processed using Charniak’s parser (Charniak, 2000) to generate parse trees automatically.For classification, we used the SVM-light TK software available at http://ainlp.",
                    "sid": 183,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "info.uniroma2.it/moschitti which encodes tree kernels in the SVM-light software (Joachims, 1999).",
                    "sid": 184,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classification performance was evaluated using the F1 measure for the single-argument classifiers and the accuracy for the multiclassifiers.",
                    "sid": 185,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Automatic VerbNet vs. automatic Fra-.",
                    "sid": 186,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "meNet frame detection In these experiments we classify Intersective Levin classes (ILC) on PropBank (PB) and FrameNet (FN) and frame on FrameNet.",
                    "sid": 187,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the training stage we use SVMs with Tree Kernels.",
                    "sid": 188,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main idea of tree kernels is the modeling of a KT(T1,T2) function which computes the number of common substructures between two trees T1 and T2.",
                    "sid": 189,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we can train SVMs with structures drawn directly from the syntactic parse tree of the sentence.",
                    "sid": 190,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The kernel that we employed in our experiments is based on the SCF structure devised in (Moschitti, 2004).",
                    "sid": 191,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We slightly modified SCF by adding the headwords of the arguments, useful for representing the selectional preferences.",
                    "sid": 192,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For frame detection on FrameNet, we trained our classifier on 46,734 training instances and tested on 11,650 testing instances, obtaining an accuracy of 91.11%.",
                    "sid": 193,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For ILC detection the results are depicted in Table 2.",
                    "sid": 194,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first six columns report the F1 measure of some verb class classifiers whereas the last column shows the global multiclassifier accuracy.",
                    "sid": 195,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We note that ILC detection is performed better than frame detection on both FrameNet and PropBank.",
                    "sid": 196,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, the results obtained on ILC on PropBank are similar with the ones obtained on ILC on FrameNet.",
                    "sid": 197,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that the training corpus does not have a major influence.",
                    "sid": 198,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, the SCF-based tree kernel seems to be robust in what concerns the quality of the parse trees.",
                    "sid": 199,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance decay is very small on FrameNet that uses automatic parse trees with respect to PropBank that contains gold parse trees.",
                    "sid": 200,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These properties suggest that ILC are very suitable for free text.",
                    "sid": 201,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "run 51 .3.",
                    "sid": 202,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 co ok ing 4 5 . 3 ch ara cte rize 2 9 . 2 oth er_ cos 4 5 . 4 say 3 7.",
                    "sid": 203,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 cor res po nd 3 6 . 1 Mu ltic las sifi er PB #Tr ain Ins tan ces PB #T est Ins tan ces 2 6 2 5 6 5 2 , 9 4 5 1 3 4 2 , 2 0 7 1 4 9 9, 70 7 6 0 8 2 5 9 2 0 5 2 , 1 7 2 2 , 7 4 2 PB Re sul ts 7 5 3 3 . 3 3 9 6 . 3 9 7 . 2 4 1 0 0 8 8 . 8 9 9 2 . 9 6 FN #Tr ain Ins tan ces FN #T est Ins tan ces 5, 38 1 1, 34 3 1 3 8 3 5 7 6 5 4 0 7 2 1 1 8 4 1, 86 0 1, 34 3 5 5 7 1 1 1 4 6 , 7 3 4 1 1 , 6 5 0 FN Re sul ts 96 .3 6 7 2 . 7 3 9 5 . 7 3 9 2 . 4 3 94 .4 3 7 8 . 2 3 9 2 . 6 3 Table 2 . F1 and accuracy of the argument classifiers and the overall multiclassifier for Intersective Levin class 5.3 Automatic semantic role labeling on.",
                    "sid": 204,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "FrameNet In the experiments involving semantic role labelling, we used a SVM with a polynomial kernel.",
                    "sid": 205,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopted the standard features developed for semantic role detection by Gildea and Jurafsky (see Section 2).",
                    "sid": 206,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, we considered some of the features designed by (Pradhan et al., 2004): First and Last Word/POS in Constituent, Subcategorization, Head Word of Prepositional Phrases and the Syntactic Frame feature from (Xue and Palmer, 2004).",
                    "sid": 207,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the rest of the paper we will refer to these features as being literature features (LF).",
                    "sid": 208,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results obtained when using the literature features alone or in conjunction with the gold frame feature, gold ILC, automatically detected frame feature and automatically detected ILC are depicted in Table 3.",
                    "sid": 209,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first four columns report the F1 measure of some role classifiers whereas the last column shows the global multiclassifier accuracy.",
                    "sid": 210,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first row contains the number of training and testing instances and each of the other rows contains the performance obtained for different feature combinations.",
                    "sid": 211,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are reported for the labeling task as the argument- boundary detection task is not affected by the frame-like features (G&J).",
                    "sid": 212,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We note that automatic frame results are very similar to automatic ILC results suggesting that ILC feature is a very good candidate for replacing the frame feature.",
                    "sid": 213,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, both automatic features are very effective, decreasing the error rate of 20%.",
                    "sid": 214,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bo dy _p art C ri m e De gre e A ge nt M ul ti cl as si fi er FN #Tr ain Ins tan ces FN #T est Ins tan ces 1 , 5 1 1 3 5 6 3 9 5 7 6 5 1 8 7 6, 4 4 1 1, 6 4 3 1 0 2 , 7 2 4 2 5 , 6 1 5 LF +G old Fra me 9 0 . 9 1 8 8 . 8 9 70 .5 1 9 3.",
                    "sid": 215,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 7 9 0 . 8 LF +G old IL C 9 0 . 8 0 8 8 . 8 9 71 .5 2 9 2.",
                    "sid": 216,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "0 1 8 8 . 2 3 LF +A uto ma tic Fr am e 8 4 . 8 7 8 8 . 8 9 70 .1 0 8 7.",
                    "sid": 217,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 3 8 5 . 6 4 LF +A uto ma tic IL C 8 5 . 0 8 8 8 . 8 9 69 .6 2 8 7.",
                    "sid": 218,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 4 8 4 . 4 5 LF 7 9 . 7 6 7 5 . 0 0 64 .1 7 8 0.",
                    "sid": 219,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 2 8 0 . 9 9 Table 3.",
                    "sid": 220,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F1 and accuracy of the argument classifiers and the overall multiclassifier for FrameNet semantic roles 5.4 Semantic role learning curve when us-.",
                    "sid": 221,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ing Intersective Levin classes The next set of experiments show the impact of the ILC feature on semantic role labelling when few training data is available (Figure 3).",
                    "sid": 222,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As can be noted, the automatic ILC features (i.e. derived with classifers trained on FrameNet or PB) produce accuracy almost as good as the gold ILC one.",
                    "sid": 223,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another observation is that the SRL classifiers are not saturated and more training examples would improve their accuracy.",
                    "sid": 224,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "90 80 70 60 50 LF+ILC.",
                    "sid": 225,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LF 40 LF+Automatic ILC Trained on PB.",
                    "sid": 226,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LF+Automatic ILC Trained on FN 30 10 20 30 40 50 60 70 80 90 100 %Training Data Figure 3.",
                    "sid": 227,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantic Role learning curve 5.5 Annotating PropBank with FrameNet.",
                    "sid": 228,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "semantic roles To show that our approach can be suitable for semantic role free-text annotation, we have automatically classified PropBank sentences with the FrameNet semantic-role classifiers.",
                    "sid": 229,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to measure the quality of the annotation, we randomly selected 100 sentences and manually verified them.",
                    "sid": 230,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We measured the performance obtained with and without the automatic ILC feature.",
                    "sid": 231,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sentences contained 189 arguments from which 35 were incorrect when ILC was used compared to 72 incorrect in the absence of this feature.",
                    "sid": 232,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This corresponds to an accuracy of 81% with Intersective Levin class versus 62% without it.",
                    "sid": 233,
                    "ssid": 74,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}