{
    "ID": "W07-1525",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This document outlines minimal design principles underlying annotation of coreference relations in PoCoS, a scheme for cross-linguistic anaphoric annotation.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We identify language-independent principles for markable identification which are essential for comparability of annotations produced for different languages.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We further suggest a clear and motivated structure of annotation stages, the separation of a coarse-grained core and a family of more elaborate extended schemes, and strategies for the systematic treatment of ambiguity.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Explicit markup of ambiguities is a novel feature.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We implemented three instantiations of PoCoS for German, English and Russian applied to corpora of newspaper texts.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "scope here.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The MUC is still generally accepted as the most standard-like annotation scheme (Hirschman, 1997).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given its simplicity is its most important advantage, it has been criticized for its limited coverage and its contra-intuitive understanding of coreference.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the most well- known later approaches is MATE/GNOME (Poesio, 2004).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the author fairly notices, \"there can be no such thing as a general-purpose anaphoric annotation instructions\", due to the complexity of phenomena associated with the term of anaphora.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, its essential idea is combining a \"general- purporse markup scheme\" (MATE) with application-specific scheme instantiations (GNOME).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In PoCoS, we adapted and elaborated this idea, by suggesting the Core and Extended Schemes.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The PoCoS, the Potsdam Coreference Scheme, both adapts selected features of existing schemes and implements a set of innovative features.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We distinguish between the Core and Extended Scheme: the Core Scheme is general and reusable,",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Anaphoric annotation is notoriously problematic because of ambiguity and subjectivity issues.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One has to deal with them at two stages: 1) by designing annotation guidelines; 2) by performing annotation.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As for 1), it is a well-known problem that different schemes propose different annotation decisions.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As for 2), different annotators may have different judgments on coreference-related issues.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The current paper focuses on the general principles and strategies of annotating coreference - the theoretical core that should logically precede any annotation decisions or schemes, but has not been formulated explicitly by now.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of existing schemes released just in the last few years is overwhelming and is out of the 1 The research by Olga Krasavina was supported by Russian.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Foundation for the Humanities, grant 0504-04240а.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "while the Extended Scheme supports a wider range of specific extensions, see fig.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we are talking about English and German instantiations of the PoCoS Core Scheme.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "coreference annotation. ",
            "number": "2",
            "sents": [
                {
                    "text": "Coreference is a relation between textual elements, \"referring expressions\", which denote the same entity.",
                    "sid": 25,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Semantically, these expressions are proto- typical objects or \"(discourse) referents\" (Karttunen, 1976).",
                    "sid": 26,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a pair of two coreferring expressions, the preceding expression is termed antecedent, the subsequent one is termed anaphor.",
                    "sid": 27,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subject to annotation are \"markables\" defined as a cover-term for potential anaphors and their antecedents.",
                    "sid": 28,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Coreference annotation consists of assignment of relations pointing from an anaphor to an antecedent markable.",
                    "sid": 29,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whether two markables are co-referent, i.e. referring to the same discourse referent, can be determined by a substitution test.",
                    "sid": 30,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If 156 Proceedings of the Linguistic Annotation Workshop, pages 156–163, Prague, June 2007.",
                    "sid": 31,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2007 Association for Computational Linguistics the substitution of anaphor and antecedent yield the same interpretation of the text, these are deemed coreferential.",
                    "sid": 32,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactically, a markable is typically a phrase with a nominal or a pronominal head.",
                    "sid": 33,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to the referential properties a syntactic construction typically has, we distinguish between primary markables, i.e. potential anaphors, and secondary markables, expressions which can not serve as anaphors, but only as antecedents.",
                    "sid": 34,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "annotation principles. ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 A principled approach In order to develop an annotation scheme which is maximally consistent, we initially identified a set of axiomatic requirements: • CONSTITUENCY o a primary or secondary markable must be an independent syntactic constituent • COMPLETENESS o neither sub-tokens nor non-phrasal nominals are subject to annotation, only syntactic words (tokens) and phrases are • CONSISTENCY o corresponding features have to be analyzed in a corresponding way CONSTITUENCY and COMPLETENESS are necessary preconditions for an alignment between syntactic and anaphoric annotation, CONSISTENCY implies that annotation principles must be formulated in a way that allows for inter-subjective and cross- linguistically valid annotation decisions.",
                    "sid": 35,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While CONSTITUENCY and COMPLETENESS define constraints for markable identification, consistency also affects selection preferences among potential antecedents, and it motivates the explicit representation of anaphoric ambiguity in PoCoS.",
                    "sid": 36,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to these requirements, we add the preference for MAXIMAL ANALYSIS.",
                    "sid": 37,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It suggests longer anaphoric chains are preferred to the shorter ones by annotation.",
                    "sid": 38,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This defines preferences for coding decisions by ambiguity (see 4.1).",
                    "sid": 39,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the remainder of this section, annotation principles employed in the PoCoS scheme are shortly presented and discussed as to their relationship to these four requirements.",
                    "sid": 40,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Markable identification.",
                    "sid": 41,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cross-linguistically consistent markable identification strategies are a necessary precondition for a comparative evaluation of anaphor annotation and anaphor resolution across different languages.",
                    "sid": 42,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has been controversial, however, how to set mark- able boundaries.",
                    "sid": 43,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, for example, Ge et al.",
                    "sid": 44,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1998) and, MUC (Hirschman, 1997) propose a minimal string constraint motivated by evaluation considerations.",
                    "sid": 45,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This procedure leads to systematic violations of the CONSTITUENCY and COMPLETENESS principles, though, cf.",
                    "sid": 46,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the potential markables Denver and bankruptcy in ex.",
                    "sid": 47,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) (1) The [Denver]?-based concern, which emerged from ban- cruptcy ... its new, post- [bancruptcy]?",
                    "sid": 48,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "law structure ...\"",
                    "sid": 49,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(WSJ, 1328) We explicitly propose a maximum size principle as an alternative to the minimum string constraint (see Principle 1 below).",
                    "sid": 50,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, a markable consists of the head, usually a noun or a pronoun, and of all modifiers, attributes, relative clauses, appositions, and dislocated elements attached to the head.",
                    "sid": 51,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Principle 1 Maximum size One markable includes all modifications of its head.",
                    "sid": 52,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prepositions can be regarded as modifications of a noun as well, and following this line of argumentation, the seemingly clear-cut differentiation between NPs and PPs becomes questionable, cf.",
                    "sid": 53,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the unclear status of Japanese postpositions that can also be interpreted as morphological case markers (Giv6n 2001:115f).",
                    "sid": 54,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, in most European languages, functional elements such as prepositions and determiners tend to be fused.",
                    "sid": 55,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In combination with the COMPLETENESS constraint, a possible NP- preference for the selection of markables will result in the selection of either PPs or non-phrasal markables if preposition-determiner fusion occurs.",
                    "sid": 56,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to achieve a more consistent analysis, in which the syntactic status of a markable does not depend on surface phenomena such as the (optional) fusion of prepositions and determiner, function words are integrated into a markable if they modify it.",
                    "sid": 57,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a consequence, CONSISTENCY considerations call for the choice of PPs rather than NPs as markables where possible.",
                    "sid": 58,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Principle 2 Syntactic characterization If a referring expression is modified by function words, e.g. a determiner or an adposition, these are to be integrated into the markable.",
                    "sid": 59,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Like Principle 1, Principle 2 originates from CONSISTENCY and COMPLETENESS requirements applied both within one language and considering cross-linguistic validity, as the function of inflectional marking in one language and the function of prepositions in another language are exchangeable.",
                    "sid": 60,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a markable includes another markable, both are specified as markables in annotation.",
                    "sid": 61,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such treatment provides consistency across languages, (cf.",
                    "sid": 62,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the fragment of parallel text in ex.",
                    "sid": 63,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2), and has an additional advantage of representing the syntactic structure of a markable.",
                    "sid": 64,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2)[Dieses Recht]right kann nicht in Anspruch genommen werden [im Falle einer Strafverfolgung auf Grund von Handlungen, die [gegen die Ziele [der Vereinten Nationen]UN]purp verstoBen]prosec.",
                    "sid": 65,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[This right]right may not be invoked [in the case of prosecutions arising from acts contrary [to the purposes [of the United Nations]UN]purp]prosec.",
                    "sid": 66,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[Это право]right не может быть использовано [в случае преследования, основанного на совершении деяния, противоречащего [целям [Организации Объединенных Наций]UN]purp]prosec.",
                    "sid": 67,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(www.unhchr.ch/udhr, shortened) 3.3 Antecedent selection.",
                    "sid": 68,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For interconnecting co-referring expressions three basic strategies can be employed: (i) leave this decision to an annotator, (ii) connect all mentions to the first one, or (iii) connect each following mention to the immediately preceding one.",
                    "sid": 69,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In line with previous research and in order to enhance consistency, we opted for (iii), as Principle 3 states: Principle 3 Chain principle Mark the most recent mention of a referent as antecedent, so that all mentions of the same referent make up an ordered chain.",
                    "sid": 70,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Possessive pronouns can often be used at the beginning of a sentence, in case they are resolved in the same sentence as in (3) and (4).",
                    "sid": 71,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The chain principle suggests selecting a pronoun as the chain- initial element which is contra-intuitive in this case: a pronoun introduces no lexical material which serves for subsequent re-identification of a referent.",
                    "sid": 72,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to respect the inter-subjective intuition to identify the controller of the possessive as a markable, we posit an exception to the chain principle for the case of pronominal cataphora.",
                    "sid": 73,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to the CONSISTENCY requirement (see 3.1), any bound pronoun, no matter if its is chain- initial or not, has to be treated this way.",
                    "sid": 74,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Principle 4 Cataphora at sentence level If a pronoun which is typically used as a bound pronoun is bound by an intrasentential controller, annotate a pointing relation to the controller rather than to a candidate antecedent in previous discourse.",
                    "sid": 75,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the Core Scheme for German, English and Russian, Principle 4 applies to possessive pronouns only.",
                    "sid": 76,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) Through [his]a lawyers, [Mr. Antar]a has denied allegations in the SEC suit.(WSJ, 3) (4) [Die einstige FuBballWeltmacht]d zittert [vor einem Winzling]s. Mit [seinem]s Tor zum 1:0 [fur die Ukraine]u sturzte [der 1,62 Meter groBe Gennadi Subow]s [die deutsche Nationalelf]d vorubergehend in ein Trauma.",
                    "sid": 77,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(PCC, 10374) \"[The former football World Power]d is shivering [in the face of a mite]s. By [his]s goal that set the score to 1:0 [for Ukraine]u pitched [Gennadi Subow]s, 1.62 Meter tall, [the German National Eleven]d in a shock for a while.\"",
                    "sid": 78,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Identifying pointing relations.",
                    "sid": 79,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A special case for annotation is pronominal or nominal reference by plural or NPs or both to multiple concrete antecedents mentioned at different points in a text.",
                    "sid": 80,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, they cannot be regarded as single constituent.",
                    "sid": 81,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since a referent of a plural NP is not the same as the sum of its parts, we deal with multiple antecedents by introducing a separate annotation layer called groups.",
                    "sid": 82,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Group referents are linked to their anaphors by regular anaphoric relations, see (5).",
                    "sid": 83,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5) [Montedison]m now owns about 72% of [Erbamont's]e shares outstanding.",
                    "sid": 84,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[The companies]m+e said . a sale of all of [Erbamont's]e assets ...[to Montedison]m . [The compa nies]m+e said .",
                    "sid": 85,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(WSJ, 660) Special treatment of groups is important as they introduce an exception to the Chain Principle.",
                    "sid": 86,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Formally, the same group of people can be referred to at different points of time.",
                    "sid": 87,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, following the preference for MAXIMAL ANALYSIS (see 3.1), longer anaphoric chains are preferred, and thus, once a pre-established group reference exists, it is marked as an antecedent instead of establishing a new group referent.",
                    "sid": 88,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Accordingly, in ex.",
                    "sid": 89,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5), the preferred antecedent of the second companies is the previously established group reference The companies.",
                    "sid": 90,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More generally, this is formulated in Principle 5.",
                    "sid": 91,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Principle 5 Maximize anaphoric chains The annotation of anaphoric references is preferred over the annotation of alternative analyses.",
                    "sid": 92,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This principle is motivated by CONSISTENCY and coverage considerations.",
                    "sid": 93,
                    "ssid": 59,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "dealing with vagueness. ",
            "number": "4",
            "sents": [
                {
                    "text": "4.1 Ambiguity resolution strategies.",
                    "sid": 94,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The problem of identifying an appropriate pointing relation is especially acute in connection with anaphoric ambiguity.",
                    "sid": 95,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As opposed to general annotation strategies, however, the ambiguity strategies apply only in case of doubt, i.e. if the annotator perceives different readings as equally possible.",
                    "sid": 96,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider ex.",
                    "sid": 97,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(6) as a continuation of ex.",
                    "sid": 98,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4): (6) Je kleiner [die Kicker]u?/d? daherkommmen, desto groBer wird [der Gegner]d?/u? geredet.",
                    "sid": 99,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(PCC, 10374) ,The smaller [the kickers]u?/d? are, the greater [the rivals]d?/u? are rumoured to be.\"",
                    "sid": 100,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Antecedent of die Kicker \"kickers\" depends on the understanding of the \"size\" metaphor, it can be either the Ukrainian team (presented as having short players), or the German team (which has not been favored in the first match), or a generic description (which would mean that the sentence is not directly linked with the discourse).",
                    "sid": 101,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, also Principle 5 can be applied, since we are facing alternative readings, and accordingly, the generic reading in the example is excluded.",
                    "sid": 102,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This application of Principle 5 is reformulated in Principle 6.",
                    "sid": 103,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Principle 6 Primacy of anaphora In case of uncertainty between different readings prefer anaphoric interpretation to antecedentless one.",
                    "sid": 104,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, in the example under consideration, we still have the choice between two possible antecedents.",
                    "sid": 105,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The substitution test (see Sec.",
                    "sid": 106,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2) fails to determine a unique antecedent, as both possible substitutions are plausible, depending on whether \"size\" refers to physical size or anticipated defeat.",
                    "sid": 107,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the preference for MAXIMAL ANALYSIS, however, a more rigid version of Principle 5 can be motivated, cf.",
                    "sid": 108,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Principle 7.",
                    "sid": 109,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Principle 7 Avoid ambiguous antecedents In case of two possible antecedents, primary markable is preferred to secondary ones or to group referents.",
                    "sid": 110,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In case of two primary markables are possible antecedents, choose the one which leads to the longer anaphoric chain.",
                    "sid": 111,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In ex.",
                    "sid": 112,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(6), this results in a preference for the German team as the antecedent of die Kicker.",
                    "sid": 113,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, in order to narrow down the scope of ambiguity, another exception to the chain principle is necessary.",
                    "sid": 114,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Markables with ambiguous reference should be avoided as antecedents, but rather the last unambiguously coreferential expression.",
                    "sid": 115,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Principle 8 Primary markables as preferred antecedents Prefer antecedents which are unambiguous in their reference to antecedents which are am biguous.",
                    "sid": 116,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Annotation of ambiguities.",
                    "sid": 117,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to investigate the effect of ambiguity and to document its influence on inter-annotator- agreement, ambiguities are to be explicitly marked.",
                    "sid": 118,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this purpose, we classified ambiguities as follows.",
                    "sid": 119,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ambiguous antecedent ambiguity of antecedent of a markable, cf.",
                    "sid": 120,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(6).",
                    "sid": 121,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ambiguous relation ambiguity wrt relation between a markable and the context: (7) Weil [die Polizei]p das weiB, richten sich [die Beam- ten]?",
                    "sid": 122,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "auf viele Anzeigen ... ein.",
                    "sid": 123,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(PCC, 19442) \"As [the police]p knows this, [the officials]?",
                    "sid": 124,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "are expecting . a lot of statements.\"",
                    "sid": 125,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relation between “the police” and “the policemen” is either bridging (part-whole) or coreference.",
                    "sid": 126,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ambiguous idiomatic ambiguity wrt whether a markable could be either understood as coreferential or as a part of an idiom.",
                    "sid": 127,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (8), der Spatz in der Hand, a definite NP in German, can be generic, part of an idiom, or referring: (8) Lieber [der Spatz in der Hand] als [die Taube auf dem Dach] (PCC, 12666) ,A bird in the hand is worth two in the bush\" (Context: a mayor finds an investor for his town willing to make only minimal investments).",
                    "sid": 128,
                    "ssid": 35,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "pocos annotation scheme. ",
            "number": "5",
            "sents": [
                {
                    "text": "PoCoS disposes of three annotation levels: mark- ables, relations and attributes (5.1, 5.2.",
                    "sid": 129,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and 5.3).",
                    "sid": 130,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In what follows, we concentrate on the Core Scheme because of relevance and space considerations.",
                    "sid": 131,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Markables.",
                    "sid": 132,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Primary markables are all potential anaphors, i.e. referential forms which can be used to indicate subsequent mentions of a previously introduced referent in the discourse, such as definite NPs, pronouns, and proper names.",
                    "sid": 133,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondary markables are expressions that normally indicates non-reference (e.g. indefinites; in the Extended Scheme also clauses).",
                    "sid": 134,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondary markables are subject to annotation only if they serve as antecedents of a primary markable.",
                    "sid": 135,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic distinctive feature between primary and secondary markables is if they can refer to previously mentioned nominals or not.",
                    "sid": 136,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using the above-mentioned grammatical criteria, most probable referring expressions (i.e. primary markables) can be extracted automatically from syntactic annotation, which is an important advantage.",
                    "sid": 137,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, using this differentiation a more precise definition of the coreference annotation task can be given.",
                    "sid": 138,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Coreference annotation is complete, if all primary markables are classified as having an antecedent or not.",
                    "sid": 139,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Coreference Relations.",
                    "sid": 140,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We distinguish between two types of coreference: nominal and non-nominal.",
                    "sid": 141,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Core Scheme only deals with nominal coreference, which we define as reference of NPs to explicitly mentioned NPs establishing a relation of identity (cf.",
                    "sid": 142,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mitkov's (2002) \"identity-of-reference direct nominal anaphora\").",
                    "sid": 143,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a relation other than identity holds between a primary markable and an element from the preceding context, e.g. the bridging relation, the relation remains underspecified and can be assigned later, as part of Extended Scheme.",
                    "sid": 144,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Differently from MUC, we do not consider predicative nominals as coreferential with the subject in the sense of textual coreference defined above (for similar view, see van Deemter and Kibble, 1999), as the relationship with the hypothetical antecedent is expressed by syntactic means.",
                    "sid": 145,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.3 Annotation principles.",
                    "sid": 146,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In sec.",
                    "sid": 147,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 and 4, we outlined a small set of heuristics serving to guide annotators to more consistent annotation decisions.",
                    "sid": 148,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These principles are, however, not equal in their restrictive force, but rather they build the following preference hierarchy (cf.",
                    "sid": 149,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Carlson et al., 2003): obligatory principles > exception principles > default principles > ambiguity principles Principles 1 and 2 are obligatory and do not allow exceptions; 4, 5 and 8 are exceptions to the default, i.e. the Chain Principle (3).",
                    "sid": 150,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 and 7 are applied only if interpretation-dependent ambiguities occur, thus being no exceptions to default principles.",
                    "sid": 151,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1.",
                    "sid": 152,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PoCoS: Core Scheme, Extended Scheme and language-specific instantiations 5.4 Attributes.",
                    "sid": 153,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Markables and relations are enriched by a set of additional features.",
                    "sid": 154,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These features encode attributes of pointing relations (e.g. anaphora type) or specify parameters of anaphoricity (e.g. referential- ity, ambiguity).",
                    "sid": 155,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, certain grammatical features of markables are integrated which are of general interest when analyzing patterns of anaphora in corpora and can be extracted from other preexisting annotations.",
                    "sid": 156,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This way we gain a common minimal representation of grammatical features which can be extracted from different annotation schemes.",
                    "sid": 157,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This allows us to abstract from language , tool- or annotation-specific expressions of, say, grammatical roles.",
                    "sid": 158,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a consequence, the scheme is self-contained to a higher degree, and thus, the cross-linguistic validity of the assembled data is enhanced.",
                    "sid": 159,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.5.",
                    "sid": 160,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Annotation procedure.",
                    "sid": 161,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The scheme suggests structuring annotation into several annotation cycles performed manually or semi-automatically: I. Core Scheme Annotation 1.",
                    "sid": 162,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Identify primary markables.",
                    "sid": 163,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 164,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Connect markables with coreference links.",
                    "sid": 165,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a. assign to every primary markable a unique antecedent b. if antecedent is not a primary markable, annotate it is as secondary markable if necessary 3.",
                    "sid": 166,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Set attribute values.",
                    "sid": 167,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "II.",
                    "sid": 168,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extended Scheme: steps 1 to 3 accordingly These stages correspond to the 3 annotation levels within the Core and Extended Schemes respectively, because annotating at all levels at the same time has proved to be very labor-intensive and more time-consuming than one level at a time.",
                    "sid": 169,
                    "ssid": 41,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "application and evaluation. ",
            "number": "6",
            "sents": [
                {
                    "text": "The original annotation guidelines were drafted in 2004 by the authors for the annotation of the Potsdam Commentary Corpus of German newspaper commentaries (PCC) (Stede, 2004) and the RST Discourse Treebank of Wall Street Journal articles (WSJ) (Carlson et al., 2003).",
                    "sid": 170,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After a series of annotation experiments, the PoCoS Core Scheme was applied to the PCC by two instructed annotators, students of linguistics, whose portions had an overlap of 19 texts (11%).",
                    "sid": 171,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based upon these texts, inter-annotator agreement was calculated using different agreement scores along the methodology of PopescuBelis et al.",
                    "sid": 172,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004).",
                    "sid": 173,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, with respect to German, we achieved moderate to substantial agreement (full chains, κ=0.61 with union of markables; κ=0.77 with intersection of markables).",
                    "sid": 174,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Part of the WSJ corpus has been performed in cooperation with A.A. Kibrik, Moscow State University.",
                    "sid": 175,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fourteen instructed annotators, also students of linguistics, worked on the RST Discourse Treebank with pairwise overlapping portions.",
                    "sid": 176,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Regarding 8 texts from 6 annotators, we also found substantial agreement (κ=0.71 with union; κ=0.96 with intersection).",
                    "sid": 177,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results are reasonable in the light of κ values reported for an annotation experiment by Artstein and Poesio (2005, p.22) on English which yielded κ=0.48.",
                    "sid": 178,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, κ is affected by parameters of the text as a whole, and thus should be interpreted with certain reservations.",
                    "sid": 179,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The texts of the PCC are generally short, but very demanding in their interpretation.",
                    "sid": 180,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A detailed study of outliers revealed several sources of errors in both corpora.",
                    "sid": 181,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides ,soft errors\" such as inclusion of punctuation and conjunctions within markables, occasionally missed integration of function words into markables, or obviously missed anaphors, we found several ,hard\" errors on syntax (e.g. different assumptions about PP attachment), semantics (e.g. vagueness, exact relationship between abstract concepts in a given context), and pragmatics (e.g. differentiation between metonymy and bridging).",
                    "sid": 182,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Above, we sug gested the annotation of ambiguity as an attempt to capture typical semantic and pragmatic sources of disagreement (cf.",
                    "sid": 183,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sec.",
                    "sid": 184,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 for examples).",
                    "sid": 185,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to evaluate the impact of such ,hard errors\" in the German data, two instructed annotators corrected 13 texts from the overlapping part of the portions independently.",
                    "sid": 186,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a concequence, the original κ values increased by about 7%: original κ = 0.69 (union)/0.82 (intersection), and corrected κ =0.76 (union)/0.89 (intersection).",
                    "sid": 187,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results, however, still suffer from the special problems with the demanding - though, very interesting - type of texts assembled in the PCC as well.",
                    "sid": 188,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that in spite of these short remarks, this paper has focused on the presentation of the scheme principles rather than on its evaluation.",
                    "sid": 189,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Currently, the PCC is annotated with information structure and a more thorough evaluation addressing both information status and co-reference is in preparation.",
                    "sid": 190,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A corpus of Russian is currently under construction, which PoCoS is being applied to (cf.",
                    "sid": 191,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Krasavina et al. 2007).",
                    "sid": 192,
                    "ssid": 23,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discussion. ",
            "number": "7",
            "sents": [
                {
                    "text": "The majority of earlier coreference annotation experiences were dealing with English, including the standard-like MUC-scheme (Hirschman, 1997).",
                    "sid": 193,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MATE was an attempt to extend annotation to other languages than English (Poesio, 2004).",
                    "sid": 194,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For German, several annotation schemes appeared and were applied to annotation of corpora recently: for newspaper texts, such as the TiiBa-D/Z (Naumann, 2006) and for hypertexts, Holler et al.",
                    "sid": 195,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004).",
                    "sid": 196,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As for Slavic languages, the Prague Dependency Treebank has been recently enriched by coreference annotation, see Kučova and Hajičova (2004) . For Russian, though, we are aware of no similar experiences so far.",
                    "sid": 197,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The current approach is an advance on the existing work as it attempts at providing language-independent and systematic annotation principles, including a language-neutral repertoire of relations and a language-neutral apparatus for identification of markables.",
                    "sid": 198,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This makes the resulting annotation scheme extendable and applicable across languages.",
                    "sid": 199,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Core Scheme is comparable to MUC by Hirschman, 1997; DRAMA by Passonneau, 1996; MATE by Poesio, 2004.",
                    "sid": 200,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its specific instantiations formalized in a family of Extended Scheme(s) are comparable to Rocha, 1997, GNOME by Poesio, 2004.",
                    "sid": 201,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By distinguishing between fundamental (\"obligatory\"), project-specific (\"recommended\") and language-specific (\"optional\") levels of annotation (cf.",
                    "sid": 202,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Leech and Wilson, 1996), a compromise between a general character and a greater level of detail is achieved.",
                    "sid": 203,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A central innovation is the dichotomy of primary and secondary markables.",
                    "sid": 204,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As both are defined on the basis of their syntactic properties, we recommend identifying primary markables automatically, but annotate secondary markablesmanually and only if needed.",
                    "sid": 205,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The separation be tween both leads to a reduction of the number of possible attribute values subject to annotation, and thus to reduction of complexity.",
                    "sid": 206,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The definition of primary and secondary markables makes use of language-specifics such as existence of a definite determiner, etc. These specifications, although formulated here specifically for German and English, are subject to language-specific alternative instantiations of the PoCoS Scheme.",
                    "sid": 207,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that in Russian, the differentiation between primary and secondary markables is made on the basis of different linguistic cues, as definiteness is not explicitly marked.",
                    "sid": 208,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, in Russian, secondary markables are only certain quantified expressions.",
                    "sid": 209,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, the function of primary and secondary markables remains the same.",
                    "sid": 210,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, existence of a predetermined set of potential anaphors allows to verify if all primary markables are assigned a relation or have been explicitly marked as non-referring.",
                    "sid": 211,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another important novel aspect is the systematic treatment of ambiguity in the annotation of large corpora.",
                    "sid": 212,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This aspect has never been included in coreference annotation before (except for one experiment described by Poesio and Artstein, 2005) and thus defines the task of coreference annotation in a more precise way.",
                    "sid": 213,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, we specified a set of heuristic rules to guide an annotator to a specific decision in case of ambiguity or vagueness.",
                    "sid": 214,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These rules are ranked according to their priority.",
                    "sid": 215,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, Versley (2006) has recently argued that a \"lightweight theory\" of anaphoric ambiguity is due, in order to ensure consistent coding decisions.",
                    "sid": 216,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, splitting annotation procedure into stages allows explicit structuring of the process, in existing approaches presented no more than implicitly (cf.",
                    "sid": 217,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Naumann, 2006, see p. 12).",
                    "sid": 218,
                    "ssid": 26,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "8",
            "sents": [
                {
                    "text": "This paper has presented the general coreference annotation framework and the PoCoS Scheme for coreference annotation.",
                    "sid": 219,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an innovative feature for coreference annotation, it implements ambiguity resolution strategies and proposes annotation of ambiguities.",
                    "sid": 220,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, by introducing language-neutral criteria for identification of markables, it both reduces the notorious complexity of anaphoric annotation on the systematic basis and enables applicability of similar principles across languages.",
                    "sid": 221,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, it has a better portability and cross-language comparability as compared to the previous work.",
                    "sid": 222,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possible field of application of the scheme can be seen in its utilisation for the anaphoric annotation of parallel corpora, an idea which is currently explored by the authors.",
                    "sid": 223,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}