{
    "ID": "W08-0329",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Confusion network decoding has been the most successful approach in combining outputs from multiple machine translation (MT) systems in the recent DARPA GALE and NIST Open MT evaluations.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the varying word order between outputs from different MT systems, the hypothesis alignment presents the biggest challenge in confusion network decoding.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper describes an incremental alignment method to build confusion networks based on the translation edit rate (TER) algorithm.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This new algorithm yields significant BLEU score improvements over other recent alignment methods on the GALE test sets and was used in BBN’s submission to the WMT08 shared translation task.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Confusion network decoding has been applied in combining outputs from multiple machine translation systems.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The earliest approach in (Bangalore et al., 2001) used edit distance based multiple string alignment (MSA) (Durbin et al., 1988) to build the confusion networks.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The recent approaches used pairwise alignment algorithms based on symmetric alignments from a HMM alignment model (Matusov et al., 2006) or edit distance alignments allowing shifts (Rosti et al., 2007).",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The alignment method described in this paper extends the latter by incrementally aligning the hypotheses as in MSA but also allowing shifts as in the TER alignment.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The confusion networks are built around a “skeleton” hypothesis.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The skeleton hypothesis defines the word order of the decoding output.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Usually, the 1-best hypotheses from each system are considered as possible skeletons.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using the pairwise hypothesis alignment, the confusion networks are built in two steps.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, all hypotheses are aligned against the skeleton independently.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, the confusion networks are created from the union of these alignments.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The incremental hypothesis alignment algorithm combines these two steps.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All words from the previously aligned hypotheses are available, even if not present in the skeleton hypothesis, when aligning the following hypotheses.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in (Rosti et al., 2007), confusion networks built around all skeletons are joined into a lattice which is expanded and re- scored with language models.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "System weights and language model weights are tuned to optimize the quality of the decoding output on a development set.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper is organized as follows.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The incremental TER alignment algorithm is described in Section 2.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experimental evaluation comparing the incremental and pairwise alignment methods are presented in Section 3 along with results on the WMT08 Europarl test sets.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conclusions and future work are presented in Section 4.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "incremental ter alignment. ",
            "number": "2",
            "sents": [
                {
                    "text": "The incremental hypothesis alignment is based on an extension of the TER algorithm (Snover et al.,2006).",
                    "sid": 23,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extension allows using a confusion net work as the reference.",
                    "sid": 24,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the algorithm finds the minimum edit distance between the hypothesis and the reference network by considering all word arcs between two consecutive nodes in the reference network as possible matches for a hypothesis word at 183 Proceedings of the Third Workshop on Statistical Machine Translation, pages 183–186, Columbus, Ohio, USA, June 2008.",
                    "sid": 25,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2008 Association for Computational Linguistics NULL (2) balloons (2) NULL (2) NULL (2) NULL (1) balloons (2) I (3) like (3) I (3) like (3) 1 2 3 4 5 6 1 2 3 4 5 6 big blue (1) blue (1) kites (1) big (1) blue (2) kites (1) Figure 1: Network after pairwise TER alignment.",
                    "sid": 26,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "that position.",
                    "sid": 27,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, shifts of blocks of words that have an exact match somewhere else in the network are tried in order to find a new hypothesis word order with a lower TER.",
                    "sid": 28,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each shifted block is considered a single edit.",
                    "sid": 29,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These two steps are executed iteratively as a greedy search.",
                    "sid": 30,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final alignment between the reordered hypothesis and the reference network may include matches, substitutions, deletions, and insertions.",
                    "sid": 31,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The confusion networks are built by creating a simple confusion network from the skeleton hypothesis.",
                    "sid": 32,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the skeleton hypothesis has words, the initial network has arcs and nodes.",
                    "sid": 33,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each arc has a set of system specific confidence scores.",
                    "sid": 34,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The score for the skeleton system is set to and the confidences for other systems are set to zeros.",
                    "sid": 35,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each non-skeleton hypothesis, a TER alignment against the current network is executed as described above.",
                    "sid": 36,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each match found will increase the system specific word arc confidence by where Figure 2: Network after incremental TER alignment.",
                    "sid": 37,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "each set of two consecutive nodes.",
                    "sid": 38,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other scores for the word arc are set as in (Rosti et al., 2007).",
                    "sid": 39,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Benefits over PairWise TER Alignment.",
                    "sid": 40,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The incremental hypothesis alignment guarantees that insertions between a hypothesis and the current confusion network are always considered when aligning the following hypotheses.",
                    "sid": 41,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not the case in any pairwise hypothesis alignment algorithm.",
                    "sid": 42,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During the pairwise hypothesis alignment, an identical word in two hypotheses may be aligned as an insertion or a substitution in a different position with respect to the skeleton.",
                    "sid": 43,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This will result in undesirable repetition and lower confidence for that word in the final confusion network.",
                    "sid": 44,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, multiple insertions are not handled implicitly.",
                    "sid": 45,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, three hypotheses “I like balloons”, “I like big blue balloons”, and “I like blue kites” might be aligned by the pairwise alignment, assuming the first as the skeleton, as follows: is the rank of the hypothesis in that system’s -best list.",
                    "sid": 46,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each substitution will generate a new word arc at the corresponding position in the network.",
                    "sid": 47,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The word arc confidence for the system is set to and the confidences for other systems are set to zeros.",
                    "sid": 48,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each deletion will generate a new NULL word arc unless one exists at the corresponding position in the network.",
                    "sid": 49,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The NULL word arc confidences are adjusted as in the case of a match or a substitution depending on whether the NULL word arc exists or not.",
                    "sid": 50,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, each insertion will generate a new node and two word arcs at the corresponding position in the network.",
                    "sid": 51,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first word arc will have the inserted word with the confidence set as in the case of a substitution and the second word arc will have a NULL word with confidences set by assuming all previously aligned hypotheses and the skeleton generated the NULL word arc. After all hypotheses have been added into the confusion network, the system specific word arc confidences are scaled to sum to one over all arcs between I like NULL balloons NULL I like big blue balloons NULL I like NULL balloons NULL I like NULL blue kites which results in the confusion network shown in Figure 1.",
                    "sid": 52,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of hypotheses proposing each word is shown in parentheses.",
                    "sid": 53,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The alignment between the skeleton and the second hypothesis has two consecutive insertions “big blue” which are not available for matching when the third hypothesis is aligned against the skeleton.",
                    "sid": 54,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the word “blue” appears twice in the confusion network.",
                    "sid": 55,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If many hypotheses have multiple insertions at the same location with respect to the skeleton, they have to be treated as phrases or a secondary alignment process has to be applied.",
                    "sid": 56,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Assuming the same hypotheses as above, the incremental hypothesis alignment may yield the following alignment: Sy ste m T E R B L E U M T R Sy ste m T E R B L E U M T R w or st 53 .2 6 33 .0 0 63 .1 5 w or st 59 .0 9 20 .7 4 57 .2 4 be st 42 .3 0 48 .5 2 67 .7 1 be st 48 .1 8 31 .4 6 62 .6 1 sy sc o m b p w 39 .8 5 52 .0 0 68 .7 3 sy sc o m b p w 46 .3 1 33 .0 2 63 .1 8 sy sc o m b gi za 40 .0 1 52 .2 4 68 .6 8 sy sc o m b gi za 46 .0 3 33 .3 9 63 .2 1 sy sc o m b in c 39 .2 5 52 .7 3 68 .9 7 sy sc o m b in c 45 .4 5 33 .9 0 63 .4 5 or acl e 21 .6 8 64 .1 4 78 .1 8 or acl e 27 .5 3 49 .1 0 71 .8 1 Table 1: Results on the Arabic GALE Phase 2 system combination tuning set with four reference translations.",
                    "sid": 57,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I like NULL NULL balloons I like big blue balloons I like NULL blue kites which results in the confusion network shown in Figure 2.",
                    "sid": 58,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case the word “blue” is available for matching when the third hypothesis is aligned.",
                    "sid": 59,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It should be noted that the final confusion network depends on the order in which the hypotheses are added.",
                    "sid": 60,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments so far have indicated that different alignment order does not have a significant influence on the final combination results as measured by the automatic evaluation metrics.",
                    "sid": 61,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Usually, aligning the system outputs in the decreasing order of their TER scores on the development set yields the best scores.",
                    "sid": 62,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Confusion Network Oracle.",
                    "sid": 63,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extended TER algorithm can also be used to estimate an oracle TER in a confusion network by aligning the reference translations against the confusion network.",
                    "sid": 64,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The oracle hypotheses can be extracted by finding a path with the maximum number of matches.",
                    "sid": 65,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These hypotheses give a lower bound on the TER score for the hypotheses which can be generated from the confusion networks.",
                    "sid": 66,
                    "ssid": 44,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental evaluation. ",
            "number": "3",
            "sents": [
                {
                    "text": "The quality of the final combination output depends on many factors.",
                    "sid": 67,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Combining very similar outputs does not yield as good gains as combining outputs from diverse systems.",
                    "sid": 68,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also important that the development set used to tune the combination weights is as similar to the evaluation set as possible.",
                    "sid": 69,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This development set should be different from the one used to tune the individual systems to avoid bias toward any system that may be over-tuned.",
                    "sid": 70,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due Table 2: Results on the Arabic GALE Phase 2 evaluation set with one reference translation.",
                    "sid": 71,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "to the tight schedule for the WMT08, there was no time to experiment with many configurations.",
                    "sid": 72,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As more extensive experiments have been conducted in the context of the DARPA GALE program, results on the Arabic GALE Phase 2 evaluation setup are first presented.",
                    "sid": 73,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation quality is measured by three MT evaluation metrics: TER (Snover et al., 2006), BLEU (Papineni et al., 2002), and METEOR (Lavie and Agarwal, 2007).",
                    "sid": 74,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Results on Arabic GALE Outputs.",
                    "sid": 75,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the Arabic GALE Phase 2 evaluation, nine systems were combined.",
                    "sid": 76,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Five systems were phrase- based, two hierarchical, one syntax-based, and one rule-based.",
                    "sid": 77,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All statistical systems were trained on common parallel data, tuned on a common genre specific development set, and a common English to- kenization was used.",
                    "sid": 78,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The English bi-gram and 5- gram language models used in the system combination were trained on about 7 billion words of English text.",
                    "sid": 79,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Three iterations of bi-gram decoding weight tuning were performed followed by one iteration of 5-gram re-scoring weight tuning.",
                    "sid": 80,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All weights were tuned to minimize the sum of TER and 1BLEU.",
                    "sid": 81,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final 1-best outputs were true-cased and detokenized before scoring.",
                    "sid": 82,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results on the newswire system combination development set and the GALE Phase 2 evaluation set are shown in Tables 1 and 2.",
                    "sid": 83,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first two rows show the worst and best scores from the individual systems.",
                    "sid": 84,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The scores may be from different systems as the best performing system in terms of TER was not necessarily the best performing system in terms of the other metrics.",
                    "sid": 85,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following three rows show the scores of three combination outputs where the only difference was the hypothesis alignment method.",
                    "sid": 86,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first, syscomb pw, corresponds BLEU System deen fren worst 11.84 16.31 best 28.30 33.13 syscomb 29.05 33.63 Table 3: NIST BLEU scores on the GermanEnglish (deen) and French-English (fren) Europarl test2008 set.",
                    "sid": 87,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "to the pairwise TER alignment described in (Rosti et al., 2007).",
                    "sid": 88,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second, syscomb giza, corresponds to the pairwise symmetric HMM alignments from GIZA++ described in (Matusov et al., 2006).",
                    "sid": 89,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third, syscomb inc, corresponds to the incremental TER alignment presented in this paper.",
                    "sid": 90,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, oracle corresponds to an estimate of the lower bound on the translation quality obtained by extracting the TER oracle output from the confusion networks generated by the incremental TER alignment.",
                    "sid": 91,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is unlikely that there exists a set of weights that would yield the oracle output after decoding, though.",
                    "sid": 92,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The incremental TER alignment yields significant improvements over all individual systems and the combination outputs using the pairwise alignment methods.",
                    "sid": 93,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Results on WMT08 Europarl Outputs.",
                    "sid": 94,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the WMT08 shared translation task, translations for two language pairs and two tasks were provided for the system combination experiments.",
                    "sid": 95,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Twelve systems participated in the GermanEnglish and fourteen in the French-English translation tasks.",
                    "sid": 96,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translations of the Europarl test (test2008) were provided as the development set outputs and the translations of the News test (newstest2008) were provided as the evaluation set outputs.",
                    "sid": 97,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An English bi-gram, 4-gram, and true-caser language models were trained by using all English text available for the WMT08 shared task, including Europarl monolingual and news commentary parallel training sets.",
                    "sid": 98,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The outputs were tokenized and lower-cased before combination, and the final combination output was true-cased and detokenized.",
                    "sid": 99,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results on the Europarl test set for both language pairs are shown in table 3.",
                    "sid": 100,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first two rows have the NIST BLEU scores of the worst and the best individual systems.",
                    "sid": 101,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last row, syscomb, corresponds to the system combination using the in cremental TER alignment.",
                    "sid": 102,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The improvements in the NIST BLEU scores are fairly modest which is probably due to low diversity of the system outputs.",
                    "sid": 103,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also unlikely that these weights are optimal for the out-of-domain News test set outputs.",
                    "sid": 104,
                    "ssid": 38,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "4",
            "sents": [
                {
                    "text": "This paper describes a novel hypothesis alignment algorithm for building confusion networks from multiple machine translation system outputs.",
                    "sid": 105,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm yields significant improvements on the Arabic GALE evaluation set outputs and was used in BBN’s submission to the WMT08 shared translation task.",
                    "sid": 106,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hypothesis alignment may benefit from using stemming and synonymy in matching words.",
                    "sid": 107,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, special handling of punctuation may improve the alignment further.",
                    "sid": 108,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The future work will investigate the influence of better alignment to the final combination outputs.",
                    "sid": 109,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This work was supported by DARPA/IPTO Contract No.",
                    "sid": 110,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "HR001106-C-0022 under the GALE program.",
                    "sid": 111,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}