{
    "ID": "W08-0335",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Chinese word segmentation (CWS) is a necessary step in ChineseEnglish statistical machine translation (SMT) and its performance has an impact on the results of SMT.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, there are many settings involved in creating a CWS system such as various specifications and CWS methods.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper investigates the effect of these settings to SMT.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We tested dictionary- based and CRF-based approaches and found there was no significant difference between the two in the qualty of the resulting translations.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also found the correlation between the CWS F-score and SMT BLEU score was very weak.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper also proposes two methods of combining advantages of different specifications: a simple concatenation of training data and a feature interpolation approach in which the same types of features of translation models from various CWS schemes are linearly interpolated.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found these approaches were very effective in improving quality of translations.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Chinese word segmentation (CWS) is a necessary step in ChineseEnglish statistical machine translation (SMT).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The research on CWS independently from SMT has been conducted for decades.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an evidence, the CWS evaluation campaign, the Sighan Bakeoff (Emerson, 2005),1, has been held four times since 2004.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, works on relations between CWS and SMT are scarce.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generally, two factors need to be considered in constructing a CWS system.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first one is the specifications for CWS, i.e., the rules or guidelines for word segmentation, and the second one is the CWS methods.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are many CWS specifications used by different organizations.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, these organizations do not seem to have any intention of reaching a unified specification.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More than five or six specifications have been used in the four Sighan Bakeoffs.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is also significant disagreement on the specifications, although much of their contents is the same.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the aims of this work was therefore to establish whether inconsistencies in specifications significantly affect the quality of SMT.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second factor is CWS methods.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We grouped all of the CWS methods into two classes: the class without out-of-vocabulary (OOV) recognition and the class with OOV recognition, represented by the dictionary-based CWS and the CRF-based CWS, respectively.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Out-of-vocabulary recognition may have two-sided effects on SMT performance.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CRF- based CWS that supports OOV recognition produces word segmentations with a higher F-score, but a huge number of new words recognized correctly and incorrectly that can incur data sparseness in training the SMT models.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, the dictionary- based approach that does not support OOV recognition produced a lower F-score, but with a relatively weak data spareness problem.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Which approach pro 1 A CWS competition organized by the ACL special interest group on Chinese.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "216 Proceedings of the Third Workshop on Statistical Machine Translation, pages 216–223, Columbus, Ohio, USA, June 2008.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2008 Association for Computational Linguistics Table 1: Examples of disagreement in segmentation guidelines ChineseName EnglishName Time AS DENGXIAOPING GEORGE BUSH 1997YEAR 7MONTH 1DAY CITYU DENGXIAOPING GEORGEBUSH 1997 YEAR 7 MONTH 1 DAY.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MSR DENGXIAOPING GEORGEBUSH 1997YEAR7MONTH1DAY PKU DENG XIAOPING GEORGEBUSH 1997YEAR 7MONTH 1DAY Table 2: A second example of disagreement in segmentation guidelines Composite words Composite words AS FUJITSUCOMPANY EUROZONE CITYU FUJITSU COMPANY EUROZONE MSR FUJITSUCOMPANY EURO ZONE PKU FUJITSU COMPANY EUROZONE duces a better SMT result is our research interest in this work.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of CWS is usually measured by the F-score, while that of SMT is measured using the BLEU score.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Does a CWS with a higher F- score produce a better translation?",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we answer this question by comparing F-scores with BLEU scores.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, we also propose approaches to make use of all the Sighan training data regardless of the specifications.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two methods are proposed: (1) a simple combination of all the training data, and (2) implementing linear interpolation of multiple translation models.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Linear interpolation is widely used in language modeling for speech recognition.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We interpolated multiple translation models generated by the CWS schemes and found our approaches were very effective in improving the translations.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "cws specifications and corpora from. ",
            "number": "2",
            "sents": [
                {
                    "text": "the second Sighan Bakeoff A Chinese word is composed of one or more characters.",
                    "sid": 35,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are no spaces between the words.",
                    "sid": 36,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Automatic word segmentation is required for machine translation.",
                    "sid": 37,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Usually a specification is needed to carry out word segmentation.",
                    "sid": 38,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unfortunately, there are many different versions of specifications.",
                    "sid": 39,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different tasks give rise to different requirements and the CWS specifications must be adjusted accordingly.",
                    "sid": 40,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, shorter segmentation has been shown to be better for speech recognition.",
                    "sid": 41,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A composite word (numbers, dates, times, etc.) is split into characters even if it is one word defined by linguists.",
                    "sid": 42,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, longer segmentation is preferred for named entity recognition consisting of longer character sequences, such as the name of people, places, and organizations.",
                    "sid": 43,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work investigated four well-known specifications created by four different organizations: Academia Sinica (AS), City University of Hong Kong (CITYU), Microsoft Research (Beijing) (MSR), and Beijing University (PKU).",
                    "sid": 44,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These specs were used in the second Sighan Bakeoff (Emerson, 2005).",
                    "sid": 45,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When we compared the four specifications and the manual segmentations in the Sighan Bakeoff training data, we found there were many inconsistencies among the four specifications.",
                    "sid": 46,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some examples are shown in Table 1 and 2.",
                    "sid": 47,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the AS and PKU specifications are distinct in splitting both Chinese and English names.",
                    "sid": 48,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also found the MSR specification generated more composite words and grouped longer character sequences into a word.",
                    "sid": 49,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using this specification could generate tens of thousands of new words, which can cause data sparseness for SMT.",
                    "sid": 50,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to using the four specifications, we also downloaded the training and test corpora of the second Sighan Bakeoff.",
                    "sid": 51,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used each of the training corpora provided to create a CWS scheme and evaluated the performance of the schemes on our test data.",
                    "sid": 52,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This enabled us to examine the effect of CWS specifications on SMT.",
                    "sid": 53,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used a Chinese word segmentation tool, Achilles, to implement word segmentation.",
                    "sid": 54,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Part of the work using this tool was described by (Zhang et al., 2006).",
                    "sid": 55,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approach was reported to achieve the highest word segmentation accuracy using the data from the second Sighan Bakeoff.",
                    "sid": 56,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, this tool meets our need to test the effect of the two kinds of CWS approaches for SMT.",
                    "sid": 57,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can easily train a dictionary-based and a CRF-based CWS by using this tool.",
                    "sid": 58,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By turning the program’s option for the CRF model on and off, we can use the Achilles as a dictionary-based approach and as a CRF-based CWS.",
                    "sid": 59,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, the dictionary-based approach is the default approach for Achilles.",
                    "sid": 60,
                    "ssid": 26,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 SMT resources.",
                    "sid": 61,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We followed the instructions for the 2005 NIST MT evaluation campaign.",
                    "sid": 62,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training the translation models for our SMT system used the available LDC parallel data except the UN corpus.",
                    "sid": 63,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To train the language models for English, we used all the available English parallel data plus Xinhua News of the LDC Gigaword English corpus, LDC2005T12.",
                    "sid": 64,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In summary, we used 2.4 million parallel sentences for training the translation model.",
                    "sid": 65,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the test data defined in the NIST MT05 evaluation which is defined in the LDC corpus as LDC2006E38.",
                    "sid": 66,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the corpus, LDC2006E43, as the development data for loglinear model optimization.",
                    "sid": 67,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used a phrase-based SMT system that is based on a log-linear model incorporating multiple features.",
                    "sid": 68,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training and decoding system of our SMT used the publicly available Pharaoh (Koehn et al., 2003)2.",
                    "sid": 69,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "GIZA++ was used for word alignment.",
                    "sid": 70,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Pharaoh decoder was used exclusively in all the experiments.",
                    "sid": 71,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No additional features but the defaults defined by Pharaoh were used.",
                    "sid": 72,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The feature weights were optimized against the BLEU scores (Och, 2003).",
                    "sid": 73,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose automatic metrics to evaluate CWS and SMT.",
                    "sid": 74,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the F-score for CWS and BLEU for SMT.",
                    "sid": 75,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The BLEU is BLEU4, computed using the NIST-provided “mteval” script.",
                    "sid": 76,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 http://www.iccs.informatics.ed.ac.uk/˜pkoehn 3.2 Implementation of CWS schemes.",
                    "sid": 77,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To determine the effect of CWS on SMT, we created 14 CWS schemes which are shown in Table 3.",
                    "sid": 78,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Schemes 1 to 12 were implemented using the in-house tool, Achilles, and schemes 13 and 14 using off-the-shelf tools.",
                    "sid": 79,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CWS schemes are named according to the specifications (AS, CITYU, MSR, PKU), implementing methods (CRF-based or dictionary-based), and lexicon sources (Sighan or LDC corpus).",
                    "sid": 80,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The table also shows the results of segmentation on the SMT training and test data, i.e., number of total tokens, unique words, and OOV words.",
                    "sid": 81,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We divided the schemes into two groups for simplicity.",
                    "sid": 82,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first group includes schemes 1 to 12, which were trained using a specific Sighan corpus.",
                    "sid": 83,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, schemes 1 to 3 were trained using the AS corpus, schemes 4 to 6 using the CITYU corpus, and so on.",
                    "sid": 84,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The meaning of the name of the CWS scheme can be derived from the table – the name is defined by specifications, methods and lexicon sources.",
                    "sid": 85,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the CRF-AS scheme performs CRF-based segmentation; and its lexicon is from the AS corpus provided by the Sighan.",
                    "sid": 86,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CRF-AS segmenter can be easily trained, as described by Achilles.",
                    "sid": 87,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second group contains two schemes 13 and 14.",
                    "sid": 88,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ICTCLAS is a HHMM-based hierarchical.",
                    "sid": 89,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "HMM segmenter (Zhang et al., 2003) that uses the specifications of PKU.",
                    "sid": 90,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This segmenter incorporates parts-of-speech information in the probability models and generates multiple HMM models for solving segmentation ambiguities.",
                    "sid": 91,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The MSRSEG was developed by Gao et al.",
                    "sid": 92,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Gao et al., 2004).",
                    "sid": 93,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This segmenter is based on the MSR specifications.",
                    "sid": 94,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It uses a log-linear model that integrates multiple features.",
                    "sid": 95,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The segmenters of the first group, dict-AS and dictLDC-AS, are two dictionary-based CWS schemes.",
                    "sid": 96,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They differ in lexicon size and lexicon extracting source.",
                    "sid": 97,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The former used a lexicon extracted directly from the Sighan AS training data while the latter used a lexicon from LDC parallel corpora.",
                    "sid": 98,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It took some efforts to get the lexicon.",
                    "sid": 99,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we used the CRF-AS to segment the LDC corpora.",
                    "sid": 100,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We extracted a unique word list from the segmented data and sorted it in decreasing order according to word frequency.",
                    "sid": 101,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because OOV was recognized by Table 3: Analysis of results of segmentation on LDC training and test data for all CWS schemes N o. C W S s c h e m e s Sp eci fic ati on s M et ho ds Le xi co n T o k e n s U ni qu e w or ds O O Vs 1 C RF A S A S C R F Si g h a n 4 7 , 9 3 4 , 0 8 8 4 1 3 , 5 8 8 1, 1 9 3 2 dict A S A S D i c t Si g h a n 5 1 , 6 6 4 , 6 7 5 8 9 , 3 4 6 2 3 7 3 dict L DC A S A S D i c t L D C 4 8 , 6 6 5 , 3 6 4 1 0 2 , 9 1 9 2 7 3 4 C RF CI T Y U C I T Y U C R F Si g h a n 4 7 , 9 6 3 , 5 4 1 4 2 6 , 2 7 3 1, 1 5 5 5 dict CI T Y U C I T Y U D i c t Si g h a n 5 1 , 2 5 1 , 7 2 9 5 6 , 9 9 6 3 6 2 6 dict L DC CI T Y U C I T Y U D i c t L D C 4 8 , 7 8 7 , 1 5 4 1 0 2 , 7 5 4 2 1 7 7 C RF M S R M S R C R F Si g h a n 4 6 , 4 8 3 , 9 2 3 5 2 3 , 7 8 8 1, 2 9 7 8 dict M S R M S R D i c t Si g h a n 5 1 , 3 0 2 , 5 0 9 6 0 , 2 4 7 2 4 8 9 dict L DC M S R M S R D i c t L D C 4 7 , 4 6 9 , 2 7 1 1 0 2 , 3 9 0 2 1 7 1 0 C RF P K U P K U C R F Si g h a n 4 8 , 0 2 2 , 6 9 7 4 4 0 , 1 1 4 1, 1 3 6 1 1 dict P K U P K U D i c t Si g h a n 5 2 , 7 2 1 , 8 0 9 4 7 , 1 7 6 2 1 1 1 2 dict L DC P K U P K U D i c t L D C 4 8 , 7 2 1 , 7 9 5 1 0 2 , 2 1 3 2 5 6 1 3 IC T C L A S P K U H H M M 5 0 , 7 5 1 , 4 0 2 1 6 2 , 2 2 2 8 3 5 1 4 M S R S E G M S R 　 48 ,7 34 ,1 13 2 7 4 , 4 1 1 1, 4 4 3 the CRF-AS, a huge word list was generated(see Table 3).",
                    "sid": 102,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose the most frequent 100,000 words as the dictionary for the dictLDC-AS 3.",
                    "sid": 103,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The LM for the dict-AS was trained using the AS corpus while the LM for the dictLDC-AS was trained using the segmented SMT training corpus.",
                    "sid": 104,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the dictLDC-AS used a larger lexicon than the dict-AS.",
                    "sid": 105,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This lexicon contained the most frequent OOV words recognized by the CRF-AS.",
                    "sid": 106,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our aim was to investigate whether the dictLDC- AS, whose lexicon consisted of the lexicon of dict- AS and new words recognized by CRF-AS, could improve SMT.",
                    "sid": 107,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Table 3, using CRF-AS generated a huge number of unique words for the training data and OOV words for the test data.",
                    "sid": 108,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found that the CRF-AS generated three times more OOVs for the test data than the dictionary-based CWS,dict-AS (see OOVs in Table 3).",
                    "sid": 109,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other schemes in the first group were implemented similarly to the “AS”.",
                    "sid": 110,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 lists the segmentation statistics for the training and test data of all the tested CWS schemes, where “Tokens” indicates the total number of words in the training data.",
                    "sid": 111,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“Unique words” and “OOVs” 3 Only those words that appeared at least five times in the lexicon were considered.",
                    "sid": 112,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4: BLEU scores for CWS schemes C W S A S CI T Y U M S R P K U C R F 2 3.",
                    "sid": 113,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 0 2 3 . 5 5 22 .5 0 2 3 . 6 1 di ct 2 3.",
                    "sid": 114,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 6 2 3 . 7 2 23 .3 3 2 3 . 6 1 dict L D C 2 3.",
                    "sid": 115,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 2 2 3 . 3 6 23 .1 6 2 3 . 7 4 IC T C L A S 2 4 . 1 2 M S R S E G 19 .7 2 B E S T 2 3.",
                    "sid": 116,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 0 2 3 . 7 2 23 .3 3 23 .7 4 (2 4.",
                    "sid": 117,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "12 ) mean the lexicon size of the segmented training data and the unknown words in the test data, respectively.",
                    "sid": 118,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Effect of CWS specifications on.",
                    "sid": 119,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SMT Our first concern was the effect of CWS specifications on SMT.",
                    "sid": 120,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results in Table 4 show the relationships that were found.",
                    "sid": 121,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last row gives the best BLEU scores obtained for each of the CWS specifications.",
                    "sid": 122,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The scores for AS, CITYU, MSR and PKU were 23.70 (CRF-AS), 23.72 (dictCITYU),23.33 (dictMSR) and 23.74 (dictPKU LDC), respectively.",
                    "sid": 123,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found there were no observable differences between AS, CITYU, and PKU.",
                    "sid": 124,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the specification that produced the worst translations was the MSR.",
                    "sid": 125,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The MSR specification appears to have been designed for recognizing named entities (NE) (See the examples of segmentation in Table 1).",
                    "sid": 126,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many NEs are regarded as words by MSR, while they are more appropriately split into separate words by other specifications.",
                    "sid": 127,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the long word, “1997YEAR7MONTH1DAY” (“July 1, 1997”).",
                    "sid": 128,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, the CRFMSR generated 20% more words in the vocabulary than the other CWS schemes in segmenting the SMT training data.",
                    "sid": 129,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The larger vocabulary can trigger data sparseness problems and result in SMT degradation.",
                    "sid": 130,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The segmenter, MSRSEG, produced an even lower BLEU score (19.72) than the Achilles.",
                    "sid": 131,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results were verified by significance test (Zhang et al., 2004).",
                    "sid": 132,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found the systems with the BLEU scores higher than 23.70 were significantly better than those lower than 23.70.",
                    "sid": 133,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Correlation between BLEU score and.",
                    "sid": 134,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F-score The values of the F-scores and BLEU scores are listed in parallel in Table 5.",
                    "sid": 135,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We tied the F-scores and specifications together because comparing the value of the F-score across specs is meaningless.",
                    "sid": 136,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We separated the F-score and BLEU score for different corpus.",
                    "sid": 137,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The F-score was calculated using the Sighan test data.",
                    "sid": 138,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CRF-based approach usually gives a higher F-score, but its corresponding BLEU scores were not always higher.",
                    "sid": 139,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The F-score and BLEU score correlated well for ICTCLAS and CRF-AS but less well for CRFCITYU, CRFPKU and CRFMSR.",
                    "sid": 140,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obviously, there is no strong correlation between the F-score and BLEU score.",
                    "sid": 141,
                    "ssid": 81,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "effect of combining multiple cws. ",
            "number": "4",
            "sents": [
                {
                    "text": "schemes We used the Sighan Bakeoff corpora of different CWS specifications separately in the previous experiments.",
                    "sid": 142,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we propose two approaches to using all the resources combined.",
                    "sid": 143,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first approach is to concatenate all the training data of the Sighan Bakeoff, regardless of the specifications and training a new CWS for segmenting SMT training data.",
                    "sid": 144,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second approach involves linear integration of translation models.",
                    "sid": 145,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found that both approaches produced an improvement in translation quality.",
                    "sid": 146,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Effect of combining training data from.",
                    "sid": 147,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "multiple CWS specifications The CWS specifications are very different and the corresponding Sighan training data are segmented in different ways.",
                    "sid": 148,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used these data separately in the previous work as if they were incompatible.",
                    "sid": 149,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, creating data manually is laborious and costly.",
                    "sid": 150,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It would therefore be a significant advantage if all the data could be used, regardless of the different specifications.",
                    "sid": 151,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We therefore created a new CWS scheme, called “dict-hybrid”.",
                    "sid": 152,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This CWS was trained by concatenating all the Sighan Bakeoff corpora regardless of the different specifications.",
                    "sid": 153,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The “dict-hybrid” was trained using Achilles.",
                    "sid": 154,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It uses a dictionary-based approach, and its lexicon and language model were obtained as follows.",
                    "sid": 155,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we created a hybrid corpus by combining all the Sighan training corpora: AS, CITYU, MSR, PKU.",
                    "sid": 156,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The hybrid corpus was used to train a CRF- based CWS.",
                    "sid": 157,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This CWS was then used to segment the SMT training corpus and then we extracted a lexicon of 100,000 from the top frequent words of the segmented SMT corpus.",
                    "sid": 158,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This lexicon was used as the lexicon of the “dict-hybrid.” The LM of “dict- hybrid” was also trained on the segmented corpus.",
                    "sid": 159,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note a lexicon and a LM are the only needed resources for building a dictionary-based CWS, like the “dict-hybrid.” (Zhang et al., 2006) We used the “dict-hybrid” to segment the SMT training corpus and test data.",
                    "sid": 160,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This segmentation generated 49,546,231 tokens, 112,072 unique words for the training data and 693 OOVs for the test data.",
                    "sid": 161,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The segmentation data were used for training a new SMT model.",
                    "sid": 162,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We tested the model using the same approach and found the BLEU score obtained by this CWS scheme was 23.91.",
                    "sid": 163,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This score was better than those in Table 4 obtained by any of the Achilles CWS schemes except ICTCLAS.",
                    "sid": 164,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the CWS scheme “dict-hybrid” produced better translations than other schemes implemented using Achilles, indicating that using multiple CWS corpora can improve SMT even if their specifications are different.",
                    "sid": 165,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Significance testing also showed that the results for ICTCLAS and “dict-hybrid” were not significantly different.",
                    "sid": 166,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of “dict-hybrid” are significantly better than those in the Table 4 which have Table 5: Correlation between F-score and BLEU P K UF sc or e B L E U C R F 0 . 9 3 9 2 3.",
                    "sid": 167,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 1 d i c t 0 . 9 3 0 2 3.",
                    "sid": 168,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 1 di ct L D C 0 . 9 3 1 2 3.",
                    "sid": 169,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 4 IC T C L A S 0 . 9 4 8 2 4.",
                    "sid": 170,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 2 C I T Y UF sc or e B L E U C R F 0 . 9 2 0 2 3.",
                    "sid": 171,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 5 d i c t 0 . 8 7 3 2 3.",
                    "sid": 172,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 2 di ct L D C 0 . 8 8 6 2 3.",
                    "sid": 173,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 6 a BLEU score lower than 23.70.",
                    "sid": 174,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Effect of feature interpolation of.",
                    "sid": 175,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "translation models We investigated the effect of linearly integrating multiple features of the same type.",
                    "sid": 176,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We generated multiple translation models by using different word segmenters.",
                    "sid": 177,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each translation model corresponded to a word segmenter.",
                    "sid": 178,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same type of features as in the log-linear model were added linearly.",
                    "sid": 179,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the phrase translation model p(e| f ) can be lin by ICTCLAS.",
                    "sid": 180,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“tst-B” means the test data segmented by “dict-hybrid”, and so on.",
                    "sid": 181,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second line gives baseline results showing the original results without the use of feature integration.",
                    "sid": 182,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For different test data, the baseline is different.",
                    "sid": 183,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline of ICTCLAS was tested on “tst-A” only.",
                    "sid": 184,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline of “dict-hybrid” was tested on “tst-B” only.",
                    "sid": 185,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the third line we gradually added a translation model to the models used in the baseline.",
                    "sid": 186,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “A+B” integrates models made using ICTCLAS and “dict-hybrid.” Each integration models were tested early interpolated as, p(e| f ) = l..S αi pi(e| f ) where only on the test data participated in the integration.",
                    "sid": 187,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "pi(e| f ) is the phrase translation model corresponding to the i-th CWSs.",
                    "sid": 188,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "αi is the weight, and S is the Hence, some slots in Table 6 are blank.",
                    "sid": 189,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We did not carry out parameter optimization with total number of models.",
                    "sid": 190,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "l..S αi = 1.",
                    "sid": 191,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "regards to the αs. Instead, we used equal αs for all αs can be obtained by maximizing the likelihood or BLEU scores of the development data.",
                    "sid": 192,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Optimizing the α has been described elsewhere (Foster and Kuhn, 2007).",
                    "sid": 193,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "p(e| f ) is the phrase translation model generated.",
                    "sid": 194,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the phrase translation model, we used the same approach to integrate three other features: phrase inverse probability p( f |e), lexical probability lex(e| f , a), and lexical inverse probability lex( f |e, a).",
                    "sid": 195,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We integrated the CWS schemes ranked in the top five in Table 4: ICTCLAS, dict-hybrid, dictLDC-PKU, dictCITYU, and CRF-AS.",
                    "sid": 196,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We labeled the five schemes A, B, C, D, and E, respectively, as shown in Table 6.",
                    "sid": 197,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first line of Table 6 represents the test data segmented by the five CWS schemes.",
                    "sid": 198,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“tst-A” means the test data was segmented the features.",
                    "sid": 199,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, all αs equal 0.5 for A+B, and 0.25 for A+B+C+D. Each cell in Table 6 indicates the BLEU score of the integration in relation to the test data.",
                    "sid": 200,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found our approach improved the baseline results significantly.",
                    "sid": 201,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The more models integrated, the better the results.",
                    "sid": 202,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The improvement was positive for all of the test data.",
                    "sid": 203,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With regards to the integration, if a phrase pair exists in one model only, we suppose the values of probabilities are zero in other models.",
                    "sid": 204,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To better understand the effects of feature interpolation, we blended the features of the translation models, as shown in Table 7, by simply combining the phrase pairs without probability interpolation.",
                    "sid": 205,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When we merged two models, we defined one model as the master model and the other as the supplementary model.",
                    "sid": 206,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only phrase pairs that were in the supplementary models but not in the master model were appended to the master model.",
                    "sid": 207,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their feature probabilities were not changed.",
                    "sid": 208,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, the combined model was a blend of phrase pairs from the master model and supplementary model.",
                    "sid": 209,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There was no probability integration, that was significantly different from the feature interpolation approach.",
                    "sid": 210,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each set of test data in Table 7, the master model was the model using the same CWS as the test data.",
                    "sid": 211,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While there was one row for each type of combination, the cells in the row contained different models.",
                    "sid": 212,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “A+B” for test data “A” uses “A” as the master model and “B” as the supplementary model, while the opposite holds for test data “B”.",
                    "sid": 213,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparing Table 6 and 7 showed that feature interpolation outperformed feature blending.",
                    "sid": 214,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feature interpolation yielded surprisingly good results.",
                    "sid": 215,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance consistently improved when more models were integrated, but this was not the case for feature blending.",
                    "sid": 216,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This shows that probability integration is very effective.",
                    "sid": 217,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Increasing the size of phrase pairs, as feature blending does, is not as effective.",
                    "sid": 218,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used equal values for the αs. Optimal values may be obtained using the optimization approach of maximizing BLEU or the likelihood of development data as has been reported previously (Foster and Kuhn, 2007).",
                    "sid": 219,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, optimization is computationally expensive and the effect was not satisfactory.",
                    "sid": 220,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we decided not optimizing the αs in this work.",
                    "sid": 221,
                    "ssid": 80,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work and discussions. ",
            "number": "5",
            "sents": [
                {
                    "text": "CWS has been the subject of intensive research in recent years, as is evident from the last four international evaluations, the Sighan Bake- offs, and many approaches have been proposed over the past decade.",
                    "sid": 222,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Segmentation performance has been improved significantly, from the earliest maximal match (dictionary-based) approaches to CRF (Peng and McCallum, 2004) approach.",
                    "sid": 223,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used dictionary-based and CRF-based CWS approaches to demonstrate the effect of CWS on SMT, both without and with OOV recognition.",
                    "sid": 224,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SMT is a very complicated system to study.",
                    "sid": 225,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its response to CWS schemes is intractable and it is very hard to use one or two measures to describe the relationship between CWS and SMT, in a similar way to describing the relationship between the alignment error rate (AER) and SMT (Fraser and Marcu, 2007).",
                    "sid": 226,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CWS and SMT are related by a series of factors such as the specifications, OOVs, lexicons, and F-scores.",
                    "sid": 227,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "None of these factors can be directly related to the SMT.",
                    "sid": 228,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While we have completed many experiments, based on changing the CWS specifications and methods used, to determine the relationship between CWS and SMT, we have not established any overwhelming rules.",
                    "sid": 229,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we believe the following guidelines are appropriate in considering a CWS system for SMT.",
                    "sid": 230,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Firstly, the F-score is not a reliable guide to SMT quality.",
                    "sid": 231,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A very high F-score may produce the lowest quality translations, as was found for the MSRSEG.",
                    "sid": 232,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondly, it is better to design a specification with smaller word units to reduce data sparseness.",
                    "sid": 233,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifications like those for MSR will produce an inferior translation.",
                    "sid": 234,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thirdly, do not use a huge lexicon for word segmentation.",
                    "sid": 235,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A huge lexicon will result in data sparseness and segmentation complexity.",
                    "sid": 236,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And lastly, using multiple word segmentation results and approaches does work.",
                    "sid": 237,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used two approaches that combined multiple word segmentation - dict-hybrid and feature integration - and both improved the translations significantly.",
                    "sid": 238,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The BLEU scores in our experiments were relatively low in comparison with current state-of-the art results.",
                    "sid": 239,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, our system was very similar to the system (Koehn et al., 2005) that gave a BLEU score of 24.3, comparable to ours.",
                    "sid": 240,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The BLEU score can be raised if we do post-editing, use more data for language modeling and other methods.",
                    "sid": 241,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "6",
            "sents": [
                {
                    "text": "We investigated the effect of CWS on SMT from two points of view.",
                    "sid": 242,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Firstly, we analyzed multiple CWS specifications and built a CWS for each one to examine how they affected translations.",
                    "sid": 243,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondly, we investigated the advantages and disadvantages of various CWS approaches, both dictionary-based and CRF-based, and built CWSs using these approaches to examine their effect on translations.",
                    "sid": 244,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We proposed a new approach to linear interpolation of translation features.",
                    "sid": 245,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach produced a significant improvement in translation and Table 6: Feature interpolation of translation models: A=ICTCLAS, B=dict-hybrid, C=dictPKU-LDC, D=dictCITYU, E=CRF-AS M o d e l tst A tst B tst C tst D tst E B a s e l i n e 24 .1 2 23 .9 1 23 .7 4 23 .7 2 23 .7 0 A + B 24 .2 5 24 .2 0 A + B + C 24 .4 9 24 .3 1 23 .8 4 A + B + C + D 24 .6 0 24 .4 3 24 .0 5 24 .2 7 A + B + C + D + E 24 .6 1 24 .5 5 24 .1 6 24 .3 9 24 .1 7 Table 7: Feature blending of translation models M o d e l tst A tst B tst C tst D tst E B a s e l i n e 24 .1 2 23 .9 1 23 .7 4 23 .7 2 23 .7 0 A + B 24 .2 0 24 .2 4 A + B + C 24 .2 7 24 .1 4 23 .6 9 A + B + C + D 23 .9 2 24 .2 9 23 .6 1 24 .0 0 A + B + C + D + E 23 .8 6 24 .3 1 23 .6 9 24 .0 5 23 .7 6 achieved the best BLEU score of all the CWS schemes.",
                    "sid": 246,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have published a much more detailed paper (Zhang et al., 2008) to describe the relations between CWS and SMT.",
                    "sid": 247,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}