{
    "ID": "W08-2222",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Wide-Coverage Semantic Analysis with Boxer",
                    "sid": 0,
                    "ssid": null,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Boxer is an open-domain software component for semantic analysis of text, based on Combinatory Categorial Grammar (CCG) and Discourse Representation Theory (DRT).",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Used together with the C&C tools, Boxer reaches more than 95% coverage on newswire texts.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The semantic representations produced by Boxer, known as Discourse Representation Structures (DRSs), incorporate a neoDavidsonian representations for events, using the VerbNet inventory of thematic roles.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting DRSs can be translated to ordinary first-order logic formulas and be processing by standard theorem provers for first-order logic.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Boxer’s performance on the shared task for comparing semantic represtations was promising.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It was able to produce complete DRSs for all seven texts.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Manually inspecting the output revealed that: (a) the computed predicate argument structure was generally of high quality, in particular dealing with hard constructions involving control or coordination; (b) discourse structure triggered by conditionals, negation or discourse adverbs was overall correctly computed; (c) some measure and time expressions are correctly analysed, others aren’t; (d) several shallow analyses are given for lexical phrases that require deep analysis; (e) bridging references and pronouns are not resolved in most cases.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Boxer is distributed with the C&C tools and freely available for research purposes.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "277",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Boxer is an open-domain tool for computing and reasoning with semantic representations.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on Discourse Representation Theory (Kamp and Reyle, 1993), Boxer is able to construct Discourse Representation Structures (DRSs for short, informally called “boxes” because of the way they are graphically displayed) for English sentences and texts.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is a translation from DRSs to first-order formulas, which opens the way to perform inference by including automated reasoning tools such as theorem provers and model builders (Blackburn and Bos, 2005).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "theory. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Combinatory Categorial Grammar.",
                    "sid": 13,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a preliminary to semantics, we need syntax.",
                    "sid": 14,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Boxer implements a syntax-semantics interface based on Combinatory Categorial Grammar, CCG (Steedman, 2001).",
                    "sid": 15,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CCG lends itself extremely well for this task because it is lexically driven and has only few “grammar” rules, and not less because of its type-transparency principle, which says that each syntactic type (a CCG category) corresponds to a unique semantic type (a lambda-expression).",
                    "sid": 16,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because the syntax-semantics is clearly defined, the choice of logical form can be independent of the categorial framework underlying it.",
                    "sid": 17,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Steedman uses simple predicate argument structures expressed via the untyped lambda calculus to illustrate the construction of logical forms in CCG (Steedman, 2001).",
                    "sid": 18,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We instead opt for Discourse Representation Theory, a widely accepted sophisticated formal theory of natural language meaning dealing with a large variety of semantic phenomena.",
                    "sid": 19,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Discourse Representation Theory.",
                    "sid": 20,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DRT is a formal semantic theory originally designed by Kamp to cope with anaphoric pronouns and temporal relations (Kamp, 1981).",
                    "sid": 21,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DRT uses an explicit intermediate semantic representation, called DRS (Discourse Representation Structure), for dealing with anaphoric or other contextually sensitive linguistic phenomena such as ellipsis and presupposition.",
                    "sid": 22,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We choose DRT because it has established itself as a well- documented formal theory of meaning, covering a number of semantic phenomena ranging from pronouns, abstract anaphora, presupposition, tense and aspect, propositional attitudes, to plurals (Kamp and Reyle, 1993; Asher, 1993; Van der Sandt, 1992).In terms of expressive power, three different kinds of representations are distin guished in Boxer: 1.",
                    "sid": 23,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discourse Representation Structures (DRSs).",
                    "sid": 24,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 25,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Underspecified DRSs (DRSs + merge + alfa).",
                    "sid": 26,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 27,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "λ-DRSs (UDRSs + lambda + application) DRSs are the representations corresponding to natural language sentences or texts.",
                    "sid": 28,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is the core DRT language compatible with first-order logic.",
                    "sid": 29,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The DRS language employed by Boxer is a subset of the one found in Kamp and Reyle (1993).",
                    "sid": 30,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We define the syntax of DRSs below with the help of BackusNaur form, where non-terminal symbols are enclosed in angle brackets.",
                    "sid": 31,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The non-terminal <ref> denotes a discourse referent, and <symn> an n-place predicate symbol.",
                    "sid": 32,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "<expe > ::= <ref> <expt > ::= <drs> <ref>∗ <drs> ::= <condition>∗ <condition> ::= <basic> | <complex> <basic> ::= <sym1 >(<expe >) | <sym2 >(<expe >,<expe >) | <named>(<expe >,<nam>,<sort>) <complex> ::= <expt > | <expt >⇒<expt > | <expt >∨<expt > | <ref>:<expt > DRSs are structures comprising two parts: 1) a set of discourse referents; and 2) a set of conditions constraining the interpretation of the discourse referents.",
                    "sid": 33,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conditions can be simple properties of discourse referents, express relations between them, or be complex, introducing (recursively) subordinated DRSs.",
                    "sid": 34,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The standard version of DRT formulated in Kamp & Reyle incorporates a Davidsonian event semantics (Kamp and Reyle, 1993), where discourse referents can also stand for events and be referred to by anaphoric expressions or constrained by temporal relations.",
                    "sid": 35,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The neoDavidsonian system, as implemented in Boxer, uses the inventory of roles proposed by VerbNet (Kipper et al., 2008), and has some attractive formal properties (Dowty, 1989).",
                    "sid": 36,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is only one way to state that an individual is participating in an event—namely by relating it to the event using a binary relation expressing some thematic role.",
                    "sid": 37,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the approach clearly distinguishes the participants of an event by the semantic roles they bear.",
                    "sid": 38,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, it also allows us to characterize the meaning of thematic roles independently of the meaning of the verb that describes the event.",
                    "sid": 39,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We won’t show the standard translation from DRS to FOL here (Blackburn et al., 2001; Bos, 2004; Kamp and Reyle, 1993).",
                    "sid": 40,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intuitively, translating DRSs into first-order formulas proceeds as follows: each discourse referent is translated as a first-order quantifier, and all DRS-conditions are translated into a conjunctive formula of FOL.",
                    "sid": 41,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discourse referents usually are translated to existential quantifiers, with the exception of those declared in antecedents of implicational DRS-conditions, that are translated as universal quantifiers.",
                    "sid": 42,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Obviously, negated DRSs are translated as negated formulas, disjunctive DRSs as disjunctive formulas, and implicational DRSs as formulas with material implication.",
                    "sid": 43,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Boxer outputs either resolved semantic representations (in other words, completely disambiguated DRSs), or underspecified representations, where some ambiguities are left unresolved in the semantic representation.",
                    "sid": 44,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This level of representation is referred to as underspecified DRS, or UDRS for short.",
                    "sid": 45,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is a small extension of the DRS language given in the previous section and is defined as follows: <expt > ::= <udrs> <udrs> ::= <drs> | (<expt >;<expt >) | (<expt >α<expt >) Note here that expressions of type t are redefined as UDRSs.",
                    "sid": 46,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "UDRSs are either ordinarly DRSs, DRSs conjoined by the merge (for which we use the semicolon), or NP/N: A N/N: record N: date λq.λp.( x ;q@x;p@x) λp.λx.( y record(y) nn(y,x) ;p@x) λx. date(x) [fa] N: record date y λx.( record(y) nn(y,x) ; ) date(x) . . .",
                    "sid": 47,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[merge] y λx. record(y) nn(y,x) date(x) [fa] NP: A record date y λp.( x ; record(y) nn(y,x) date(x) ;p@x) . . .",
                    "sid": 48,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[merge] x y λp. record(y) nn(y,x) date(x) ;p@x Figure 1: Derivation with λ-DRSs, including β-conversion, for “A record date”.",
                    "sid": 49,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Combinatory rules are indicated by solid lines, semantic rules by dotted lines.",
                    "sid": 50,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DRS composed by the α-operator.",
                    "sid": 51,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The merge conjoins two DRSs into a larger DRS — semantically the merge is interpretated as (dynamic) logical conjunction.",
                    "sid": 52,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Merge- reduction is the process of eliminating the merge operation by forming a new DRS resulting from the union of the domains and conditions of the argument DRSso of a merge, respectively (obeying certain constraints).",
                    "sid": 53,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 illustrates the syntax- semantics interface (and merge-reduction) for a derivation of a simple noun phrase.",
                    "sid": 54,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Boxer adopts Van der Sandt’s view as presupposition as anaphora (Van der Sandt, 1992), in which presuppositional expressions are either resolved to previously established discourse entities or accommodated on a suitable level of discourse.",
                    "sid": 55,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Van der Sandt’s proposal is cast in DRT, and therefore relatively easy to integrate in Boxer’s semantic formalism.",
                    "sid": 56,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The α-operator indicates information that has to be resolved in the context, and is lexically introduced by anaphoric or presuppositional expressions.",
                    "sid": 57,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A DRS constructed with α resembles the protoDRS of Van der Sandt’s theory of presupposition (Van der Sandt, 1992) although they are syntactically defined in a slightly different way to overcome problems with free and bound variables, following Bos (2003).",
                    "sid": 58,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the difference between anaphora and presupposition collapses in Van der Sandt’s theory.",
                    "sid": 59,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The types are the ingredients of a typed lambda calculus that is employed to construct DRSs in a bottom-up fashion, compositional way.",
                    "sid": 60,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The language of lambda DRSs is an extension of the language of (U)DRS defined before: <expe > ::= <ref> | <vare > <expt > ::= <udrs> | <vart > <expα > ::= (<exp(β,α)> @ <varβ >) | <varα > <exp(α,β)> ::= λ<varα >.<expβ > | <var(α,β)> Hence we define discourse referents as expressions of type e, and DRSs as expressions of type t . We use @ to indicate function application, and the λ-operator to bind free variables over which we wish to abstract.",
                    "sid": 61,
                    "ssid": 49,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "practice. ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 Preprocessing.",
                    "sid": 62,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The input text needs to be tokenised with one sentence per line.",
                    "sid": 63,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the context of this paper, Boxer was put into action after using a combined processing pipeline of the C&C tools consisting of POS-tagging, named entity recognition, and parsing (Curran et al., 2007).",
                    "sid": 64,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The POS tags are used to specify the lexical semantics for ambiguous CCG categories (see below); the named entity tags are transferred to the level of DRSs as well and added as sorts to named discourse referents.",
                    "sid": 65,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of a CCG derivation is shown in Figure 2.",
                    "sid": 66,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "a virus --[lex] --[lex] by np:nb/n n ---------------------[lex] -----------[fa] Cervical cancer caused ((s:pss\\np)\\(s:pss\\np))/np np:nb ---[lex] --[lex] ---[lex] --------------------------------------[fa] n/n n is s:pss\\np (s:pss\\np)\\(s:pss\\np) ------------[fa] ----------------[lex] -----------------------------------------------[ba] n (s:dcl\\np)/(s:pss\\np) s:pss\\np ------------[tc] ---------------------------------------------------------------------[fa] np s:dcl\\np --------------------------------------------------------------------------------------[ba] s:dcl Figure 2: CCG derivation as generated by the C&C tools 3.2 Lexicon.",
                    "sid": 67,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In CCG, the syntactic lexicon comprises the set of lexical categories.",
                    "sid": 68,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CCGbank hosts more than a thousand different categories.",
                    "sid": 69,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The semantic lexicon defines a suitable mapping from categories to semantic representations.",
                    "sid": 70,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the context of Boxer, these semantic representations are defined in the shape of lambda-DRSs.",
                    "sid": 71,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Boxer implements almost all categories employed by the C&C parser, which is a subset of the ones found in CCGbank, leaving out extremely rare cases for the sake of efficiency.",
                    "sid": 72,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Defining the lexical semantics cannot always be done solely on the basis of the category, for one lexical category could give rise to several different semantic interpretations.",
                    "sid": 73,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So we need to take other resources into account, such as the assigned part of speech (PoS), and sometimes the wordform or named entity type associated with the category.",
                    "sid": 74,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the majority of categories, in particular those that correspond to open-class lexical items, we also need access to the morphological root of the word that triggered the lexical category.",
                    "sid": 75,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although there is a one-to-one mapping between the CCG categories and semantic types — and this must be the case to ensure the semantic composition process proceeds without type clashes — the actual instantiations of a semantic type can differ even within the scope of a single CCG category.",
                    "sid": 76,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the category n/n can correspond to an adjective, a cardinal expression, or even common nouns and proper names (in the compound expressions).",
                    "sid": 77,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the latter two cases the lexical entry introduces a new discourse referent, in the former two it does not.",
                    "sid": 78,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To account for this difference we also need to look at the part of speech that is assigned to a token.",
                    "sid": 79,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Resolution.",
                    "sid": 80,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Boxer implements various presupposition triggers introduced by noun phrases, including personal pronouns, possessive pronouns, reflexive pronouns, emphasising pronouns, demonstrative pronouns, proper names, other-anaphora, definite descriptions.",
                    "sid": 81,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, some aspects of tense are implemented as presupposition triggers, too.",
                    "sid": 82,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Anaphora and presupposition resolution takes place in a separate stage after building up the representation, following the resolution algorithm outlined in Bos (2003).",
                    "sid": 83,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The current implementation of Boxer aims at high precision in resolution: personal pronouns are only attempted to be resolved to named entities, definite descriptions and proper names are only linked to previous discourse referents if there is overlap in the DRS-conditions of the antencedent DRS and alpha-DRS.",
                    "sid": 84,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If no suitable antecedent can be found, global accommodation of the anaphoric discourse referent and conditions will take palce.",
                    "sid": 85,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because Boxer has the option to output unresolved DRSs too, it is possible to include external anaphora or coreference resolution components.",
                    "sid": 86,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Example Analysis.",
                    "sid": 87,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We illustrate the capabilities of Boxer with the following example text shown below (aka as Text 2 of the shared task).1 The text consists of three sentences, the second being a coordinated sentence.",
                    "sid": 88,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It contains a passive construction, three pronouns, relative clauses, control verbs, and a presupposition trigger other.",
                    "sid": 89,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Text 2 Cervical cancer is caused by a virus.",
                    "sid": 90,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That has been known for some time and it has led to a vaccine that seems to prevent it.",
                    "sid": 91,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Researchers have been looking for other cancers that may be caused by viruses.",
                    "sid": 92,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The output of Boxer for this text is shown in Figure 3.",
                    "sid": 93,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only the box format is shown here — Boxer is also able to output the DRSs in Prolog or XML encodings.",
                    "sid": 94,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It was run without analysing tense and aspect and without discourse segmentation (both of these are possible in Boxer, but still undergo development, and are therefore disregarded here).",
                    "sid": 95,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we can see from the example and Boxer’s analysis various things go right and various things go wrong.",
                    "sid": 96,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Boxer deals fine with the passive construction (assigned the 1 This text was taken from the Economist Volume 387 Number 8582, page 92.",
                    "sid": 97,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third sentence has been simplified.",
                    "sid": 98,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "appropriate semantic role), the relative clauses, and the control construction (vaccine is the agent of the prevent event).",
                    "sid": 99,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also handles the presupposition trigger anaphorically linking the mention of other cancers in the third sentence with the phrase cervical cancer in the first sentence, and asserting an inequality condition in the DRS.",
                    "sid": 100,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Boxer failed to resolve three pronouns correctly.",
                    "sid": 101,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are all accommodated at the global level of DRS, which is the DRS on the left-hand side in Figure 3.",
                    "sid": 102,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All of the pronouns have textual antecedents: the abstract pronoun that in the second sentence refers to the fact declared in the first sentence.",
                    "sid": 103,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first occurrence of it in the second sentence also seems to refer to this fact — the second occurrence of it refers to cervical cancer mentioned in the first sentence.",
                    "sid": 104,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "bin/boxer --input working/step/text2.ccg --semantics drs --box --resolve --roles verbnet --format no %%% %%% | x0 x1 x2 | | x3 x4 x5 | | x6 x7 | | x8 x9 x10 x11 | | x13 x14 x15 x16 x17 | %%% |------------| |--------------| |--------------| |------------------------| |---------------------| %%% (| thing(x0) |+(| cancer(x3) |+(| know(x6) |+(| lead(x8) |+| researcher(x13) |)))) %%% | neuter(x1) | | cervical(x3) | | time(x7) | | vaccine(x9) | | look(x14) | %%% | neuter(x2) | | cause(x4) | | event(x6) | | seem(x10) | | agent(x14,x13) | %%% | | | virus(x5) | | theme(x6,x0) | | proposition(x11) | | cancer(x15) | %%% | event(x4) | | for(x6,x7) | | event(x10) | | | %%% | theme(x4,x3) | | | | event(x8) | | | | | %%% | by(x4,x5) | | agent(x8,x1) | | |----------| | %%% | | | agent(x10,x9) | | | | x15 = x3 | | %%% | theme(x10,x11) | | | | | %%% | to(x8,x9) | | cause(x16) | %%% | | | virus(x17) | %%% | | x12 | | | event(x16) | %%% | x11:|---------------| | | theme(x16,x15) | %%% | | prevent(x12) | | | by(x16,x17) | %%% | | event(x12) | | | for(x14,x15) | %%% | | agent(x12,x9) | | | event(x14) | %%% | | theme(x12,x2) | | | | %%% | | | | %%% | | Attempted: 3.",
                    "sid": 105,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Completed: 3 (100.00%).",
                    "sid": 106,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3: Boxer output for Shared Task Text 2",
                    "sid": 107,
                    "ssid": 46,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "performance on shared task. ",
            "number": "4",
            "sents": [
                {
                    "text": "Here we discuss the output of Boxer on the Shared Task Texts (Bos, 2008).",
                    "sid": 108,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Boxer was able to produce semantic representation for all text without any further modifications to the software.",
                    "sid": 109,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each text we briefly say what was good and bad about Boxer’s analysis.",
                    "sid": 110,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(We won’t comment on the performance on the second text, as this is the text proposed by ourselves and already discussed in the previous section.)",
                    "sid": 111,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Text 1: An object is thrown with a horizontal speed ...",
                    "sid": 112,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Good: The resulting predicate argument structure was fine overall, including a difficult control construction (“how long does it take the object to fall ...”).",
                    "sid": 113,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The definite description “the object” was correctly resolved.",
                    "sid": 114,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The conditional got correctly anal- ysed.",
                    "sid": 115,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bad: The measure phrase “125 m high” got misinterpreted as noun-noun comn- pound.",
                    "sid": 116,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The definite description “the fall” was not linked to the falling event mentioned before.",
                    "sid": 117,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comments: Because there were two questions in this text we parsed it using the C&C parser with the model trained on questions.",
                    "sid": 118,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Text 3: John went into a restaurant ...",
                    "sid": 119,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Good: The pronouns were correctly resolved to the proper name “John” rather than “the waiter”, even though this is based on the simple strategy in Boxer to link third- person pronouns to named entities of type human.",
                    "sid": 120,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The coordination construction “warm and friendly” got correctly analysed (distributively), and the control construction “began to read his book” received a proper predicate argument structure.",
                    "sid": 121,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bad: Boxer doesn’t deal with bridging references introduced by relational nouns, so expressions like “the corner” were not linked to other discourse entities.",
                    "sid": 122,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Text 4: The first school for the training of leader dogs ...",
                    "sid": 123,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Good: The named entities were correctly recognised and classified (locations and proper names).",
                    "sid": 124,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The VP coordination in the first and later sentences was correctly analysed.",
                    "sid": 125,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The expression “this school” got correctly linked to the schhol mentioned earlier in the text.",
                    "sid": 126,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The time expression “1999” got the right interpretation.",
                    "sid": 127,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bad: The adjectives/determiners “first” and “several” didn’t receive a deep analysis.",
                    "sid": 128,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The complex NP “Joao Pedro Fonseca and Marta Gomes” was distributively interpreted, rather than collective.",
                    "sid": 129,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The pronoun “they” wasn’t resolved.",
                    "sid": 130,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The preposition “In” starting the second sentence was incorrectly analysed by the parser.",
                    "sid": 131,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Text 5: As the 3 guns of Turret 2 were being loaded ...",
                    "sid": 132,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Good: The discourse structures invoked by the sentence initial adverbs “As” and “When” was correctly computed.",
                    "sid": 133,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Predicate argument structure overall good, including treatment of the relative clauses.",
                    "sid": 134,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The expression “the propellant” was correctly resolved.",
                    "sid": 135,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Time expressions in the one but last sentence got a correct analysis.",
                    "sid": 136,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bad: The name “Turret 2” was incorrectly analysed (not as a compound).",
                    "sid": 137,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The adverbs “yet” and “then” got a shallow analysis.",
                    "sid": 138,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first-person pronoun “I” was not resolved to the crewman.",
                    "sid": 139,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comments: The quotes were removed in the tokenisation phase, because the C&C parser, being trained on a corpus without quotes, performs badly on texts containing quotes.",
                    "sid": 140,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Text 6: Amid the tightly packed row houses of North Philadelphia ...",
                    "sid": 141,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Good: The named entities were correctly recognised and classified as locations.",
                    "sid": 142,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The various cases of VP coordination all got properly analysed.",
                    "sid": 143,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The numerical and date expressions got correct representations.",
                    "sid": 144,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bad: The occurrences of the third-person neuter pronouns were not resolved.",
                    "sid": 145,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The preposition “Amid” was not correctly analysed.",
                    "sid": 146,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Text 7: Modern development of wind-energy technology and applications ...",
                    "sid": 147,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Good: Correct interpretation of time expressions “1930s” and “1970s”.",
                    "sid": 148,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Correct pred icate argument structure overall.",
                    "sid": 149,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bad: “Modern” was recognised as a proper name.",
                    "sid": 150,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The noun phrase “wind-energy technology and applications” was distributively analysed with “wind-energy” only applying to “technology”.",
                    "sid": 151,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sentence-initial adverb “Since” did not introduce proper discourse structure.",
                    "sid": 152,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The units of measurement in the last two sentences were not recognised as such.",
                    "sid": 153,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tricky time expression “mid-80’s” only got a shallow interpretation.",
                    "sid": 154,
                    "ssid": 47,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "5",
            "sents": [
                {
                    "text": "Boxer is a wide-coverage system for semantic interpretation.",
                    "sid": 155,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It takes as input a CCG derivation of a natural language expression, and produces formally interpretable semantic representations: either in the form of DRSs, or as formulas of first-order logic.",
                    "sid": 156,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The existence of CCGbank (Hockenmaier, 2003) and robust parsers trained on it (Clark and Curran, 2004; Bos et al., 2004) make Boxer a state-of-the-art open- domain tool for deep semantic analysis.",
                    "sid": 157,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Boxer’s performance on the shared task for comparing semantic represtations was promising.",
                    "sid": 158,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It was able to produce DRSs for all texts.",
                    "sid": 159,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can’t quantify the quality of Boxer’s output, as we don’t have gold standard representations at our disposal.",
                    "sid": 160,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Manually inspecting the output gives us the following impression: • computed predicate argument structure is generally of good quality, including hard constructions involving control or coordination; • discourse structure triggered by conditionals, negation or discourse adverbs is overall correctly computed; • some measure and time expressions are correctly analysed, others aren’t; • several shallow analyses are given for lexical phrases that require deep analysis; • bridging references and pronouns are not resolved in most cases; but when they are, they are mostly correctly resolved (high precision at the cost of recall).",
                    "sid": 161,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, a comment on availability of Boxer.",
                    "sid": 162,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All sources of Boxer are available for download and free of noncommercial use.",
                    "sid": 163,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is distributed with the C&C tools for natural language processing (Curran et al., 2007), which are hosted on this site: http://svn.ask.it.usyd.edu.au/trac/candc/wiki/boxer",
                    "sid": 164,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}