{
    "ID": "W09-0621",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "For developing a data-driven text rewriting algorithm for paraphrasing, it is essential to have a monolingual corpus of aligned paraphrased sentences.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "News article headlines are a rich source of paraphrases; they tend to describe the same event in various different ways, and can easily be obtained from the web.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compare two methods of aligning headlines to construct such an aligned corpus of paraphrases, one based on clustering, and the other on pairwise similarity-based matching.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We show that the latter performs best on the task of aligning paraphrastic headlines.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "In recent years, text-to-text generation has received increasing attention in the field of Natural Language Generation (NLG).",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast to traditional concept-to-text systems, text-to-text generation systems convert source text to target text, where typically the source and target text share the same meaning to some extent.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Applications of text-to-text generation include sum- marization (Knight and Marcu, 2002), question- answering (Lin and Pantel, 2001), and machine translation.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For text-to-text generation it is important to know which words and phrases are semantically close or exchangable in which contexts.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While there are various resources available that capture such knowledge at the word level (e.g., synset knowledge in WordNet), this kind of information is much harder to get by at the phrase level.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, paraphrase acquisition can be considered an important technology for producing resources for text-to-text generation.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paraphrase generation has already proven to be valuable for Question Answering (Lin and Pantel, 2001; Riezler et al., 2007), Machine Translation (CallisonBurch et al., 2006) and the evaluation thereof (RussoLassner et al., 2006; Kauchak and Barzilay, 2006; Zhou et al., 2006), but also for text simplification and explanation.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the study described in this paper, we make an effort to collect Dutch paraphrases from news article headlines in an unsupervised way to be used in future paraphrase generation.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "News article headlines are abundant on the web, and are already grouped by news aggregators such as Google News.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These services collect multiple articles covering the same event.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Crawling such news aggregators is an effective way of collecting related articles which can straightforwardly be used for the acquisition of paraphrases (Dolan et al., 2004; Nelken and Shieber, 2006).",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use this method to collect a large amount of aligned paraphrases in an automatic fashion.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "method. ",
            "number": "2",
            "sents": [
                {
                    "text": "We aim to build a high-quality paraphrase corpus.",
                    "sid": 17,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Considering the fact that this corpus will be the basic resource of a paraphrase generation system, we need it to be as free of errors as possible, because errors will propagate throughout the system.",
                    "sid": 18,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This implies that we focus on obtaining a high precision in the paraphrases collection process.",
                    "sid": 19,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Where previous work has focused on aligning news-items at the paragraph and sentence level (Barzilay and Elhadad, 2003), we choose to focus on aligning the headlines of news articles.",
                    "sid": 20,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We think this approach will enable us to harvest reliable training material for paraphrase generation quickly and efficiently, without having to worry too much about the problems that arise when trying to align complete news articles.",
                    "sid": 21,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the development of our system we use data which was obtained in the DAESO-project.",
                    "sid": 22,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This project is an ongoing effort to build a Parallel Monolingual Treebank for Dutch (Marsi Proceedings of the 12th European Workshop on Natural Language Generation, pages 122–125, Athens, Greece, 30 – 31 March 2009.",
                    "sid": 23,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2009 Association for Computational Linguistics document, and each original cluster as a collection of documents.",
                    "sid": 24,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each stemmed word i in sentence j, T Fi,j is a binary variable indicating if the word occurs in the sentence or not.",
                    "sid": 25,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The T F ∗I DF score is then: TF.IDFi = T Fi,j · log | Table 1: Part of a sample headline cluster, with sub-clusters and Krahmer, 2007) and will be made available through the Dutch HLT Agency.",
                    "sid": 26,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Part of the data in the DAESO-corpus consists of headline clusters crawled from Google News Netherlands in the period April–August 2006.",
                    "sid": 27,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each news article, the headline and the first 150 characters of the article were stored.",
                    "sid": 28,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Roughly 13,000 clusters were retrieved.",
                    "sid": 29,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 shows part of a (translated) cluster.",
                    "sid": 30,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is clear that although clusters deal roughly with one subject, the headlines can represent quite a different perspective on the content of the article.",
                    "sid": 31,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To obtain only paraphrase pairs, the clusters need to be more coherent.",
                    "sid": 32,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To that end 865 clusters were manually subdivided into sub-clusters of headlines that show clear semantic overlap.",
                    "sid": 33,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sub- clustering is no trivial task, however.",
                    "sid": 34,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some sentences are very clearly paraphrases, but consider for instance the last two sentences in the example.",
                    "sid": 35,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They do paraphrase each other to some extent, but their relation can only be understood properly with |{dj : ti ∈ dj }| |D| is the total number of sentences in the cluster and |{dj : ti ∈ dj }| is the number of sen tences that contain the term ti.",
                    "sid": 36,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These scores are used in a vector space representation.",
                    "sid": 37,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The similarity between headlines can be calculated by using a similarity function on the headline vectors, such as cosine similarity.",
                    "sid": 38,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Clustering.",
                    "sid": 39,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our first approach is to use a clustering algorithm to cluster similar headlines.",
                    "sid": 40,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The original Google News headline clusters are reclustered into finer grained sub-clusters.",
                    "sid": 41,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the k-means implementation in the CLUTO1 software package.",
                    "sid": 42,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The k-means algorithm is an algorithm that assigns k centers to represent the clustering of n points (k < n) in a vector space.",
                    "sid": 43,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The total intra-cluster variances is minimized by the function k V = (xj − µi)2 i=1 xj ∈Si where µi is the centroid of all the points xj ∈ Si.The PK1 cluster-stopping algorithm as pro posed by Pedersen and Kulkarni (2006) is used to find the optimal k for each sub-cluster: C r(k) − mean(C r[1...∆K ]) world knowledge.",
                    "sid": 44,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, there are numerous headlines that can not be sub-clustered, such as the first P K 1(k) = std(C r[1...∆K ]) three headlines shown in the example.",
                    "sid": 45,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use these annotated clusters as development and test data in developing a method to automatically obtain paraphrase pairs from headline clusters.",
                    "sid": 46,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We divide the annotated headline clusters in a development set of 40 clusters, while the remainder is used as test data.",
                    "sid": 47,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The headlines are stemmed using the porter stemmer for Dutch (Kraaij and Pohlmann, 1994).",
                    "sid": 48,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of a word overlap measure as used byHere, C r is a criterion function, which mea sures the ratio of withincluster similarity to betweencluster similarity.",
                    "sid": 49,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As soon as P K 1(k) ex ceeds a threshold, k − 1 is selected as the optimum number of clusters.",
                    "sid": 50,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To find the optimal threshold value for cluster- stopping, optimization is performed on the development data.",
                    "sid": 51,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our optimization function is an F - score: (1 + β2) · (precision · recall) Barzilay and Elhadad (2003), we use a modified Fβ = (β2 precision + recall) T F ∗I DF word score as was suggested by Nelken · and Shieber (2006).",
                    "sid": 52,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each sentence is viewed as a 1 http://glaros.dtc.umn.edu/gkhome/views/cluto/ We evaluate the number of aligments between possible paraphrases.",
                    "sid": 53,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, in a cluster of four sentences, 4) = 6 alignments can be made.",
                    "sid": 54,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our case, precision is the number of alignments retrieved from the clusters which are relevant, divided by the total number of retrieved alignments.",
                    "sid": 55,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recall is the number of relevant retrieved aligments divided by the total number of relevant alignments.",
                    "sid": 56,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use an Fβ -score with a β of 0.25 as we favour precision over recall.",
                    "sid": 57,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do not want to optimize on precision alone, because we still want to retrieve a fair amount of paraphrases and not only the ones that are very similar.",
                    "sid": 58,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Through optimization on our development set, we find an optimal threshold for the PK1 algorithm thpk1 = 1.",
                    "sid": 59,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each original cluster, k-means clustering is then performed using the k found by the cluster stopping function.",
                    "sid": 60,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In each newly obtained cluster all headlines can be aligned to each other.",
                    "sid": 61,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Pairwise similarity.",
                    "sid": 62,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our second approach is to calculate the similarity between pairs of headlines directly.",
                    "sid": 63,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the similarity exceeds a certain threshold, the pair is accepted as a paraphrase pair.",
                    "sid": 64,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If it is below the threshold, it is rejected.",
                    "sid": 65,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, as Barzilay and Elhadad (2003) have pointed out, sentence mapping in this way is only effective to a certain extent.",
                    "sid": 66,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Beyond that point, context is needed.",
                    "sid": 67,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With this in mind, we adopt two thresholds and the Cosine similarity function to calculate the similarity between two sentences: cos(θ) = V 1 · V 2 V 1 V 2 where V 1 and V 2 are the vectors of the two sentences being compared.",
                    "sid": 68,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the similarity is higher than the upper threshold, it is accepted.",
                    "sid": 69,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If it is lower than the lower theshold, it is rejected.",
                    "sid": 70,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the remaining case of a similarity between the two thresholds, similarity is calculated over the contexts of the two headlines, namely the text snippet that was retrieved with the headline.",
                    "sid": 71,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If this similarity exceeds the upper threshold, it is accepted.",
                    "sid": 72,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Threshold values as found by optimizing on the development data using again an F0.25-score, are T hlower = 0.2 and T hupper = 0.5.",
                    "sid": 73,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An optional final step is to add alignments that are implied by previous alignments.",
                    "sid": 74,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, if headline A is paired with headline B, and headline B is aligned to headline C , headline A can be aligned to C as Ty pe Precision Recallk m ea ns cl us ter in g 0.91 0.43 clu ste rs on lyk m ea ns cl us ter in g 0.66 0.44 all he ad lin es pa irw ise si mi lar ity 0.93 0.39 clu ste rs on ly pa irw ise si mi lar ity 0.76 0.41 all he ad lin es Table 2: Precision and Recall for both methods Pl ay st ati on 3 m or e ex pe nsi ve th an co m pe tit or P l a y s t a t i o n 3 w i l l b e c o m e m o r e e x p e n s i v e t h a n X b o x 3 6 0 So ny po stp on es Blu Ra y m ov ie s So ny po stp on es co mi ng of blu ra y dv ds Pri ce s Pl ay st ati on 3 kn ow n: fro m 49 9 eu ro s E3 20 06 : Pl ay st ati on 3 fro m 49 9 eu ro s So ny PS 3 wi th Blu R ay for sal e fro m No ve m be r 11 th PS 3 av ail abl e in Eu ro pe fro m No ve m be r 17 th Table 3: Examples of correct (above) and incorrect (below) alignments well.",
                    "sid": 75,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do not add these alignments, because in particular in large clusters when one wrong alignment is made, this process chains together a large amount of incorrect alignments.",
                    "sid": 76,
                    "ssid": 60,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results. ",
            "number": "3",
            "sents": [
                {
                    "text": "The 825 clusters in the test set contain 1,751 sub- clusters in total.",
                    "sid": 77,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In these sub-clusters, there are 6,685 clustered headlines.",
                    "sid": 78,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another 3,123 headlines remain unclustered.",
                    "sid": 79,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 displays the paraphrase detection precision and recall of our two approaches.",
                    "sid": 80,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is clear that k-means clustering performs well when all unclustered headlines are artificially ignored.",
                    "sid": 81,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the more realistic case when there are also items that cannot be clustered, the pairwise calculation of similarity with a back off strategy of using context performs better when we aim for higher precision.",
                    "sid": 82,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some examples of correct and incorrect alignments are given in Table 3.",
                    "sid": 83,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discussion. ",
            "number": "4",
            "sents": [
                {
                    "text": "Using headlines of news articles clustered by Google News, and finding good paraphrases within these clusters is an effective route for obtaining pairs of paraphrased sentences with reasonable precision.",
                    "sid": 84,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have shown that a cosine similarity function comparing headlines and using a back off strategy to compare context can be used to extract paraphrase pairs at a precision of 0.76.",
                    "sid": 85,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although we could aim for a higher precision by assigning higher values to the thresholds, we still want some recall and variation in our paraphrases.",
                    "sid": 86,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of course the coverage of our method is still somewhat limited: only paraphrases that have some words in common will be extracted.",
                    "sid": 87,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not a bad thing: we are particularly interested in extracting paraphrase patterns at the constituent level.",
                    "sid": 88,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These alignments can be made with existing alignment tools such as the GIZA++ toolkit.",
                    "sid": 89,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We measure the performance of our approaches by comparing to human annotation of sub- clusterings.",
                    "sid": 90,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The human task in itself is hard.",
                    "sid": 91,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, is we look at the incorrect examples in Table 3, the difficulty of distinguishing between paraphrases and non-paraphrases is apparent.",
                    "sid": 92,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In future research we would like to investigate the task of judging paraphrases.",
                    "sid": 93,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The next step we would like to take towards automatic paraphrase generation, is to identify the differences between paraphrases at the constituent level.",
                    "sid": 94,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This task has in fact been performed by human annotators in the DAESO-project.",
                    "sid": 95,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A logical next step would be to learn to align the different constituents on our extracted paraphrases in an unsupervised way.",
                    "sid": 96,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "Thanks are due to the Netherlands Organization for Scientific Research (NWO) and to the Dutch HLT Stevin programme.",
                    "sid": 97,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thanks also to Wauter Bosma for originally mining the headlines from Google News.",
                    "sid": 98,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For more information on DAESO, please visit daeso.uvt.nl.",
                    "sid": 99,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}