{
    "ID": "W09-0802",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Karamel is a system for finite-state morphology which is multi-tape and uses a typed Cartesian product to relate tapes in a structured way.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It implements statically compiled feature structures.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its language allows the use of regular expressions and Generalized Restriction rules to define multi-tape transducers.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both simultaneous and successive application of local constraints are possible.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This system is interesting for describing rich and structured morphologies such as the morphology of Semitic languages.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Karamel is a system for defining and executing multi-tape finite-state transducers where relationships between tapes are expressed using a tree structure.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This structure is obtained through embedded units, which are used to analyze a tuple of strings recognized by the transducer.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the units considered in an example may be affix, form and sentence.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system includes a language and an Integrated Development Environment.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The language uses extended regular expressions, computations and contextual rules.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The environment provides a graphical interface to write and execute finite-state descriptions.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Karamel has many applications.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Natural Language Processing, it may be used for morphological analysis, transliteration, parsing, etc. This paper is dedicated to the application of Karamel to the morphological analysis of Semitic languages, for which both multiple tapes and complex structures are useful.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some descriptions of the morphology of Semitic Languages use several tiers.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, (McCarthy, 1981) uses four tiers, one for prefixes, one for the root, one for the template (consonant- vowel pattern) and the last one for the vocalization.Such a multitiered description may be im plemented using a cascade of 2-tape machines (Beesley, 1998) or using a multi-tape transducer where each tier is described by a tape and the surface form by an additional tape.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is the approach of G. A. Kiraz for the Syriac language (Kiraz, 2000).",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Karamel is designed for the later solution.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The multi-tape feature is also interesting for describing related dialects, whenever a great part of the analysis may be shared.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A separate tape is dedicated to the surface form in each dialect.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Semitic Morphology is strongly structured by the roots.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basis of an analysis is the identification of the root.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, several layers of affixes may be distinguished around the core containing the roots: paradigmatic prefixes; affixes encoding the person, gender and number; clitics such as pronouns.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This structure is conveniently defined using Karamel’s units.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following section of the paper, we present Karamel’s language, its theoretical background and its syntax.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 describe the other aspects of the Karamel System: its development environment, its current state and future evolutions.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then comes an example of Semitic morphology written in Karamel, the description of Akkadian verbal flexion.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last section compares Karamel to some other systems.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the karamel language. ",
            "number": "2",
            "sents": [
                {
                    "text": "The language is based on a subclass of rational nary relations called multi-grain relations which is closed under intersection and difference (Barthe´lemy, 2007b).",
                    "sid": 28,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are defined using rational expressions extended with a typed Cartesian product.",
                    "sid": 29,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This operator implements the notion of unit used to give a tree-structure to tuples of the Proceedings of the EACL 2009 Workshop on Computational Approaches to Semitic Languages, pages 10–18, Athens, Greece, 31 March, 2009.",
                    "sid": 30,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2009 Association for Computational Linguistics relations.",
                    "sid": 31,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A unit is an inner-node of the structure.",
                    "sid": 32,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A project is a set of finite-state machine defined over the same universe: the same alphabet, the same tape set, the same units.",
                    "sid": 33,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A project begins with declarations defining this universe.",
                    "sid": 34,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It continues with an ordered sequence of machine definitions.",
                    "sid": 35,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The declaration section contains several clauses including classes, tapes and unit definitions.",
                    "sid": 36,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A class of symbols is a finite set of symbols.",
                    "sid": 37,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here are some examples of class definitions: class short_v is a, e, i, u; class long_v is aa, ee, ii, uu; class vow is a, e, i, u, long_v; A symbol may belong to several classes.",
                    "sid": 38,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the definition of a class, another class name may appear and is just an abbreviation for all its members.",
                    "sid": 39,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The class names are also used in regular expressions to denote the disjunction of their members.",
                    "sid": 40,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The symbols written using several letters and/or digits, when there is a risk of confusion with a string of symbols, must be written enclosed by < and >.",
                    "sid": 41,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the long a is written aa in the class definition (long_v) but in a regular expression, it must be written <aa> because aa denotes a string of two short vowels.",
                    "sid": 42,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bracketing with < and > is also used for special characters such as the space < >, punctuation marks (e.g. <,>) and the empty string <>.",
                    "sid": 43,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A tape is declared with its name and the alphabet of the symbols which may appear on it.",
                    "sid": 44,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tape dig: <digit>, fr, en: <letter>|< >|<->; The alphabet is defined using a regular expression made with symbols, classes and length-preserving operators such as the disjunction and the difference.",
                    "sid": 45,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Karamel unit is a typed Cartesian product.",
                    "sid": 46,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The type consists in i) a number of components and ii) the tapes contained by each component.",
                    "sid": 47,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the declaration, there is also a default value for each component.",
                    "sid": 48,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "unit seg is {d: dig = <digit>*; f: fr = <letter>*; e: en = <letter>*} unit num is {c: dig, fr, en={seg}+} The unit seg (for segment) contains three components, each using a single tape.",
                    "sid": 49,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The unit num (for number) has one component which contains three tapes (dig, fr and en).",
                    "sid": 50,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The default value is a nonempty sequence of units of type seg.",
                    "sid": 51,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cartesian products are written in regular expressions as tuples with the type name followed by the components: {seg: 2(0?),vingt,twenty}.",
                    "sid": 52,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Component names may be used instead of their position {seg:e=twenty,f=vingt,d=2(0?)}.",
                    "sid": 53,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When a component is omitted, the default value is implied.",
                    "sid": 54,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The notation {seg} (cf.",
                    "sid": 55,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the default value of the component c in num) is a unit seg with default values in all the components.",
                    "sid": 56,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Units may be embedded: {num:{seg:2,vingt,twenty } {seg:2,-deux,-two}} This example is a structured representation of the triplet (22,vingtdeux,twenty-two).",
                    "sid": 57,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Karamel, there are three ways of defining a finite-state transducer: by a regular expression, by a computation or by a contextual rule.",
                    "sid": 58,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Regular expressions use symbols, classes of symbols, rational operations and standard extensions (for instance, optionality written ?).",
                    "sid": 59,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, intersection, difference and negation are also available although these operations are usually not defined on transducers.",
                    "sid": 60,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Regular expressions are defined using the regexp construction: regexp zero is {seg: 0,z´ero,(zero|naught)}; {seg: <digit>*-0}; end A regexp contains a non empty sequence of regular expressions ended with a semicolon.",
                    "sid": 61,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It denotes the disjunction of these expressions.",
                    "sid": 62,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second way of defining a machine is by applying operators to already defined machines.",
                    "sid": 63,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the operators used in regular expressions may appear in such a computation, but there are some other operators as well.",
                    "sid": 64,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first one is the projection which removes one or several tapes from its operand.",
                    "sid": 65,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second one is the external product which combines a nary relation with a language on a given tape.",
                    "sid": 66,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is used to apply a transducer to a given input which is not split in units yet.",
                    "sid": 67,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All possible partitioning of the input in units is first computed, and then it is intersected with one tape of the transducer.",
                    "sid": 68,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The reverse operation is the external projection which extracts a language from a relation on a given tape by first applying the simple projection and then removing unit boundaries.",
                    "sid": 69,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These two operations are used to transduce a given possibly non-deterministic input into an output.",
                    "sid": 70,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "let segments= union(star(non_zero),zero); The let is followed by an expression in prefixed notation with the operators written with letters.",
                    "sid": 71,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The literals are the names of previously defined machine.",
                    "sid": 72,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our example, the expression uses the machines zero defined by the previous regexp and non_zero (not given here).",
                    "sid": 73,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last way for defining a machine consists inthe Generalized Restriction Rules defined in (Yli may lead to a combinatorial explosion.",
                    "sid": 74,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The feature structure compilation techniques come from (Barthe´lemy, 2007a).",
                    "sid": 75,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A type is defined as follows: fstruct Name is [gen=gender,num=1|2|3] where gender is a class and 1, 2, 3 are symbols.",
                    "sid": 76,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each feature is defined with its name and its domain of values, which is a finite set of symbols defined by a regular expression.",
                    "sid": 77,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A feature structure of this type is written as follows: [Name:gen=masc,num=2].",
                    "sid": 78,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As usual, it is possible to specify only part of the features and their order is not important.",
                    "sid": 79,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The type name at Jyra¨ and Kosk ennie mi, 2004) . Roughly speak-.",
                    "sid": 80,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "the begi nnin g is man dator y. Feat ure struc tures are ing, these rules are a modernized version of classical Two-Level Rules such as Context Restriction and Surface Coercion rules (Koskenniemi, 1983).",
                    "sid": 81,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They also are comparable to the rewrite rules of Xerox Finite-State Tools (Beesley and Karttunen, 2003), the difference being that rewrite rules are applied in cascades whereas GR rules may be simultaneous.",
                    "sid": 82,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Contextual rules are defined using three regular expressions: gr_rule rzero is {num} constraint {num:seg={seg}*{seg:#0}{seg}*} => {num:seg={seg:#0,z´ero}} end The first expression defines a universe.",
                    "sid": 83,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the expressions in the universe which match the pattern on the left of the arrow must also match the pattern on the right.",
                    "sid": 84,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sharp symbol is an auxiliary symbol used to make sure that the 0 on both sides is the same occurrence of this symbol.",
                    "sid": 85,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It identifies the center of the contextual rule.",
                    "sid": 86,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For more details about the semantics of Generalized Restriction rules, see (YliJyra¨ and Koskenniemi, 2004).",
                    "sid": 87,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Karamel implements non-recursive feature structures.",
                    "sid": 88,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feature values are ordinary symbols and feature structures are typed.",
                    "sid": 89,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The types must be declared in the declaration section of the description.",
                    "sid": 90,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feature Structures may appear anywhere in regular expressions.",
                    "sid": 91,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are usually put on one or several specific tapes.",
                    "sid": 92,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are statically compiled.",
                    "sid": 93,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feature Structures are to be used with caution, because they allow the expression of long-distance dependencies which are costly and compiled using auxiliary symbols which are not known by the user.",
                    "sid": 94,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The type name denotes a class of symbols containing all the symbols which may be used to compile a structure of this type, including auxiliary symbols.",
                    "sid": 95,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Regular expressions and contextual rules may use variables which take their values in finite set of symbols.",
                    "sid": 96,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An expression with such a variable stands for the disjunction of all the possible valuation of the variables.",
                    "sid": 97,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Variables are especially useful to express feature structure unification.",
                    "sid": 98,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The language offers macros called abbreviations.",
                    "sid": 99,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An abbreviation is a notation for an already declared unit where part of the components is defined in the declaration and another part is defined in the call.",
                    "sid": 100,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here is an example.",
                    "sid": 101,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "abbrev teen is {d: dig = <digit>; f: fr =<letter>*; e: en = <letter>*} for {seg: 1 @d, @f,@e teen} In an expression, {teen: 6, seize,six} is expanded in {seg: 16,seize,sixteen} before the compilation.",
                    "sid": 102,
                    "ssid": 75,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the karamel system. ",
            "number": "3",
            "sents": [
                {
                    "text": "The core of the system consists in a compiler written in Python which compiles Karamel descriptions into finite-state automata which are interpreted as transducers by the system.",
                    "sid": 103,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The compiler uses the FSM and Lextools toolkits by AT&T Research.",
                    "sid": 104,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Karamel regular expression is first compiled in the Lextools format, then the Lextools compiler is called to compile it in FSM binary format.",
                    "sid": 105,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some Karamel operations over transducers such as the intersection, the union, the concatenation are directly implemented by the corresponding FSM operation on automata.",
                    "sid": 106,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some other operations such as the two projections and the external product are performed by a script calling a sequence of FSM computations.",
                    "sid": 107,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The development environment uses a Graphical User Interface written in HTML, CSS and Javascript.",
                    "sid": 108,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are three main subparts: project management (creation, deletion, import, export, duplication); project development: creation, deletion, renaming, reordering, checking, compilation of a machine; machine execution, with optional introduction of run-time input, filtering of the result, projection on one or several tapes.",
                    "sid": 109,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A dependency graph is maintained in order to ensure that a change in one machine is taken into account in all the machines which depend on it.",
                    "sid": 110,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance if there is the following definition: let m3=union(m1,m2);, any change in m1 implies a recompilation of m3.",
                    "sid": 111,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This recompilation is not necessarily immediate.",
                    "sid": 112,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A status is associated to each machine.",
                    "sid": 113,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The change in m1 results in a change in the statuses of m1 and m3.",
                    "sid": 114,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the moment, the execution of a machine is possible only through the GUI, using a browser.",
                    "sid": 115,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The development of a C++ or Python function to interpret the FSM machine with the Karamel semantics is not a difficult task, but it is still to be done.",
                    "sid": 116,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another weakness of the current version of the system is the type-checking which is not fully implemented.",
                    "sid": 117,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The type system is simple and the language is strongly typed, so every type error should be found at compile time.",
                    "sid": 118,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not the case yet.",
                    "sid": 119,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Karamel will be distributed to a few kind beta- testers in a near future.",
                    "sid": 120,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We plan to add some test facilities to the environment.",
                    "sid": 121,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At medium term, a migration from FSM to openFST (Allauzen et al., 2007) and a distribution under the LGPL license are envisaged.",
                    "sid": 122,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So far, Karamel has been used for morphology.",
                    "sid": 123,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A morphological analyzer for the Akkadian verb is presented in the next section.",
                    "sid": 124,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is a medium size grammar.",
                    "sid": 125,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another project describes the French morphology.",
                    "sid": 126,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is the translation in Karamel of a grammar developed for the MMORPH system (Petitpierre and Russel, 1995).",
                    "sid": 127,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The grammar has a large coverage.",
                    "sid": 128,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has been tested with a toy lexicon only.",
                    "sid": 129,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other domain of application explored so far is the transliteration domain.",
                    "sid": 130,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is a multilingual description of numbers that relates the notation with digits to a written form in several languages (French, English, Finnish).",
                    "sid": 131,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A tape is devoted to each language, a tape to the digits and several tapes for feature structures, some of which are language specific.",
                    "sid": 132,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another project transliterates Egyptian hieroglyphs into the Latin alphabet, using an intermediate representation on a third tape.",
                    "sid": 133,
                    "ssid": 31,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "an example: the akkadian verb. ",
            "number": "4",
            "sents": [
                {
                    "text": "In this section, we present an application of Karamel to Semitic morphology, namely a description of Akkadian verbal forms.",
                    "sid": 134,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Akkadian is the language of the ancient Mesopotamia.",
                    "sid": 135,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It was written in cuneiform, from around 2500 B.C. up to the first century B.C. It is the main representative of the eastern branch of Semitic languages.",
                    "sid": 136,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is divided in seven main dialects with many local variations.",
                    "sid": 137,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its verbal morphology is a typical semitic one, with a great number of triliteral roots, some stems with usual flex- ion (prefixation, reduplication, infixation, vocalization).",
                    "sid": 138,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are two infixes, t and tn.",
                    "sid": 139,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their presence is almost orthogonal with the presence of a stem prefix and the reduplication of the second radical.",
                    "sid": 140,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The description of the morphology in Karamel is based on a two-level structure.",
                    "sid": 141,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first level separates verbal forms in three layers: • a core, which contains the root, its vocalization, and also the prefixes which depend on the stem and/or aspect, infixes and gemination.",
                    "sid": 142,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• personal affixes (prefixes and suffixes), which encode the person, the number, the gender and the case (when relevant).",
                    "sid": 143,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• the clitics: enclitic pronoun and proclitic particles.",
                    "sid": 144,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following, these units will be called big grains.",
                    "sid": 145,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second level is used for the core only, which is divided in smaller parts using the two following criteria: firstly, a unit must be significant in the analysis; secondly, it is determined by a set of features in such a way that no smaller part is uniquely determined by a subset of these features and no greater part is determined by the same set of features.",
                    "sid": 146,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such a component is invariable for a given value of its features, except some surface transformations.",
                    "sid": 147,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following the proposition of (MalbranLabat, 2001), three kinds of vowels are distinguished.",
                    "sid": 148,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first kind of vowel depends on the stem and the aspect.",
                    "sid": 149,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are called aspectual vowels.",
                    "sid": 150,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second kind, called lexical vowel depends on the stem, the aspect and a lexical category attached to the root.",
                    "sid": 151,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third kind of vowels, the support vowels are not related to morphological features.",
                    "sid": 152,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are necessary to pronounce and/or write1 the form.",
                    "sid": 153,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first two kinds of vowels are systematically preserved in weak forms whereas support vowels disappear in weak consonant neighborhood.",
                    "sid": 154,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Support vowel are member of the small grain containing the preceding consonant whereas lexical and aspectual vowels constitute small grains.",
                    "sid": 155,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The different subparts of the core and their features are given in figure 1.",
                    "sid": 156,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They will be called small grains.",
                    "sid": 157,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The figure 2 gives some extracts of the project.",
                    "sid": 158,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It begins with the declaration section.",
                    "sid": 159,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is a class of all letters, subclasses of consonants, weak consonants, strong consonants, vowels, long vowels, short vowels.",
                    "sid": 160,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is also a class for each feature domain.",
                    "sid": 161,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several types of feature structures are defined: one for each kind of big grain (core, personal affix, pronoun, enclitic particle); a unique type for all the kinds of small grains.",
                    "sid": 162,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The description has five tapes.",
                    "sid": 163,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first tape contains the feature structures associated with big grains, the second tape contains the feature structures covering small grains.",
                    "sid": 164,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third tape contains a canonical form of each grain.",
                    "sid": 165,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It correspond to the lexical form of traditional Two-Level grammars.",
                    "sid": 166,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last two tapes contain the surface forms respectively in the Babylonian and the Assyrian dialects, which are slightly different, mostly in their vocalization.",
                    "sid": 167,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here is an example of structured analysis of the form iptarasu¯ . pers pref core pers suff rad 1 stem infix rad 2 lex vowel rad 3 i p ta r a s u¯The tape scheme does not correspond to a multi 1 The cuneiform writing is syllabic.",
                    "sid": 168,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is impossible to write a consonant without a vowel immediately before or after it.",
                    "sid": 169,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tiered analysis.",
                    "sid": 170,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are several reasons for this.",
                    "sid": 171,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first one comes from the Akkadian language.",
                    "sid": 172,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The stems and aspects are not described by patterns but divided in smaller analysis units, in particular stem analysis uses the two orthogonal dimensions called here stem1 and stem2: the first one notes stem gemination and prefixation and the later, infixation.",
                    "sid": 173,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A stem is a pair (stem1,stem2).",
                    "sid": 174,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The vocalization does not require patterns of two vowels separated by the middle radical, but in most cases a pattern of only one vowel.",
                    "sid": 175,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another reason comes from the Karamel language: the information usually encoded in tiers appears in the unit types.",
                    "sid": 176,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance the information about the root tier appears in small grains of type radical.",
                    "sid": 177,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, the vocalization appears in the small grains of types aspect vowel and lexical vowel.",
                    "sid": 178,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rich tree structure is sufficient to express clearly the analysis.",
                    "sid": 179,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The morphotactics of the language is described as the sum of local constraints.",
                    "sid": 180,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It involves only the first three tapes.",
                    "sid": 181,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The elementary units, namely small grains and all the big grains but the core, are described separately.",
                    "sid": 182,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the machine aspect_infix (cf.",
                    "sid": 183,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "figure 2) distinguishes two cases: if the feature aspect has perfect as value, then there is a small grain of type ifx_parf containing the infix ta; if the feature aspect has another value, then there is no grain of type ifx_parf in the core.",
                    "sid": 184,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two cases are given using two different regular expressions.",
                    "sid": 185,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For more complex small grains, more cases are to be described, up to 13 for the lexical vowels which have different colors and length depending on 4 features.",
                    "sid": 186,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two finite-state machines describe the order of respectively small and big grains.",
                    "sid": 187,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The one for small grains called core_morphotactics is sketched in the figure.",
                    "sid": 188,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lexicon is given using a macro called lexent.",
                    "sid": 189,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A lexent (for lexical entry) tuple looks like a usual lexicon entry, with only lexical information, although it is a regular expression denoting a complete core, with its prefix, infixes, vowels, etc. The lexicon finite state machine may be directly intersected with the sg_order machine previously defined and all the other constraints in order to obtain a machine describing all the possible cores build on the roots given in the lexicon.",
                    "sid": 190,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The computation of the two surface forms for subpart stem1 stem2 aspect class root example aspect prefix stem prefix radical core infix stem1 gemination aspect gemination aspect vowel lexical vowel X X X X X X X X X X X X X X X X X muparrisu sˇuprusu iprus iptaras uparras iparras uparris iprus Figure 1: Subparts and features the two dialects is performed by a set of constraints written using regular expressions and contextual rules.",
                    "sid": 191,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They relate the lexical form and one or both surface forms.",
                    "sid": 192,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features are used in some of them.",
                    "sid": 193,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rules are used for phenomena which may occur several times in a given form.",
                    "sid": 194,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the deletion of support vowels before another vowel may appear in several places: before lexical and aspectual vowels, but also when a weak consonant disappears or changes to a vowel.",
                    "sid": 195,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In many cases however, surface transformation occur only in one given place of a form and the use of a rule is not necessary.",
                    "sid": 196,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tree structure helps in characterizing this place.",
                    "sid": 197,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The example given in the figure is the coloration of the first vowel in some stems (II and III).",
                    "sid": 198,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The grammar presently covers strong forms, 1- weak verbs and part of 2-weak and 3-weak verbs.",
                    "sid": 199,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verbs with two or three weak consonants2 and quadriliteral roots are not covered at all.",
                    "sid": 200,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The description uses 27 regexp clauses, 22 let and 6 rules.",
                    "sid": 201,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Comparisons with other systems.",
                    "sid": 202,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are many systems for writing finite-state machines.",
                    "sid": 203,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section we compare Karamel with some of them which are specialized in morphological descriptions.",
                    "sid": 204,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most popular system is probably the Xerox Finite State Tool (Beesley and Karttunen, 2003).",
                    "sid": 205,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has been used, among others, for the description of Arabic morphology (Beesley, 1998).",
                    "sid": 206,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The interdigitation is handled using a compile-replace process using the replace operator (Karttunen and Beesley, 2000) (Karttunen, 1995).",
                    "sid": 207,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The computational model is a sequential one, where two-tape transducers are merged using the 2 There is a Akkadian verb with 3 weak consonants as root..",
                    "sid": 208,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "composition operation.",
                    "sid": 209,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The descriptions are oriented, with an input and an output, but the transduction has not to be deterministic and the machines are invertible.",
                    "sid": 210,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The strings are not structured, but some structure may be marked using auxiliary symbols inserted when necessary by the user.",
                    "sid": 211,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to fulfill the constraints that there are only two tapes, grammars often put heterogeneous data on a tape.",
                    "sid": 212,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the features and the lexical representations are put together on the input tape.",
                    "sid": 213,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intermediate forms in the cascade often contain a mix of lexical and surface representations.",
                    "sid": 214,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are no feature structures in XFST, but features written as ordinary symbols.",
                    "sid": 215,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The scope and the unifications are written by the user.",
                    "sid": 216,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Karamel is more declarative than XFST.",
                    "sid": 217,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Information of different natures are put on different tapes.",
                    "sid": 218,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Abstract feature structures are available.",
                    "sid": 219,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their compilation and the unifications are automated.",
                    "sid": 220,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, XFST is more efficient.",
                    "sid": 221,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The structure information is put only where necessary.",
                    "sid": 222,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "XFST is distributed under a commercial license.",
                    "sid": 223,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system MAGEAD is another system of finite-state morphology developed for Arabic dialects (Habash and Rambow, 2006).",
                    "sid": 224,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It follows the multi-tape approach proposed by George Anton Kiraz for the Syriac language (Kiraz, 2000).",
                    "sid": 225,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It has a rule-based language following the principles of (GrimleyEvans et al., 1996) in which a notion of partition splits forms in a sequence of units comparable to Karamel’s units.",
                    "sid": 226,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But in this approach, there is only one kind of unit which relates all the tapes.",
                    "sid": 227,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Like Karamel, MAGEAD is a layer above Lextools and FSM.",
                    "sid": 228,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system is not distributed and its description in published papers is not very detailed.",
                    "sid": 229,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Declarations class vowel is a, e, i, u, aa, ee, ii, uu; class cons is b, d, g, h, ... class num is sing, dual, plur; class aspect is present, preterit, perfect, ...",
                    "sid": 230,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "... fstruct fspers is [asp=aspect,pers=pers,num=num,gen=gen] fstruct fscore is [stem1=stem1,stem2=stem2,asp=aspect,lex=lex] ... tape lex: letter, bab: letter, assy: letter, sg: fssg, bg : fspers|fscore|fsclit; unit sgrain is {sg: sg = [fssg]; lex: lex = <letter>*, bab: bab =<letter>*, assy: assy = <letter>*} unit core is {bg: bg = [fscore]; smallg: sg, lex, bab, assy = {sgrain}* } ... abbrev sgi is {r1: bg = [fscore]; r2: sg = [fssg]; r3: lex = <letter>*} for {core: @r1, {sgrain}* {sgrain: @r2, @r3} {sgrain}* } abbrev lexent is {cfs: bg = [fscore]; fst: lex = <cons>; snd: lex = <cons>; thd: lex = <cons>} for {core: @cfs, {sgrain: [fssg:typ=typrad]}* {sgrain: [fssg:typ=rad], @fst} {sgrain: [fssg:typ=typrad]}* {sgrain: [fssg:typ=rad], @snd} {sgrain: [fssg:typ=typrad]}* {sgrain: [fssg:typ=rad], @thd} } regexp aspect_infix is Small grains morphotactics {sgi: [fscore:asp=perfect],[fssg:typ=ifx_parf], ta}; {core: [fscore:asp=aspect-perfect], {sgrain: [fssg:typ=typifx_parf]}* }; end ... regexp small_grain_order is {core: smallg= {sgrain: [fssg:typ=asp_pref]}?",
                    "sid": 231,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "{sgrain: [fssg:typ=rad]} {sgrain: [fssg:typ=ifx_parf]}?",
                    "sid": 232,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "{sgrain: [fssg:typ=ifx_parf]}?",
                    "sid": 233,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "... let core_morphotactics=intersect(aspect_infix,stem_gemination, ...,small_grain_order); regexp lexicon is {lexent: [fscore:lex=a_u,stem1=I|II|IV],p,r,s}; {lexent: [fscore:lex=a,stem1=I|III],s.,b,t}; ... let actual_cores=intersect(core_morphotactics,lexicon); Figure 2: extracts from the Akkadian project Surface transformations gr_rule delete_support_vowels is {core} constraint {core: smallg= {sgrain}* #{sgrain: lex=<letter>+<vowel>,bab=<letter><cons>} {sgrain}* } => {core: smallg= {sgrain}* #{sgrain} {sgrain: bab=<>}?",
                    "sid": 234,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "{sgrain: lex=<vowel>} {sgrain}*} end regexp color_u is {core: [fscore:stem1=II|III], {sgrain:lex=<cons>?<vowel>,bab=<cons>?u}{sgrain}*}; {core: [fscore:stem1=I|IV], {sgrain:lex=<cons>?<vowel>,bab=<cons>?(<vowel>-u)} {sgrain}*}; end Figure 3: extracts from the Akkadian project The main difference is that MAGEAD has only one level of structure using only one type of Cartesian Products.",
                    "sid": 235,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another difference is that the two systems use different kinds of contextual rules.",
                    "sid": 236,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rules differ both by their syntax and their semantics.",
                    "sid": 237,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, contextual rules are the main syntactic construction in MAGEAD whereas Karamel uses also regular expressions.",
                    "sid": 238,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MMORPH is another system of partition-based morphology based on the work by Pulman and Hepple (Pulman and Hepple, 1993).",
                    "sid": 239,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are two parts in a description: first, the morphotactics is described using a Unification Grammar where the terminals are lexical affixes and the non-terminals are feature structures; transformation rules relate the lexical and surface levels.",
                    "sid": 240,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The features are flat.",
                    "sid": 241,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Feature structures are evaluated dynamically by a unification machine.",
                    "sid": 242,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Karamel statically compiles Feature Structures and their unification into finite-state transducers.",
                    "sid": 243,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is efficient and part of the structures are shared.",
                    "sid": 244,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, the grammar of feature structures must be regular and there is a risk of combinatorial explosion.",
                    "sid": 245,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MMORPH uses two kinds of units: one relates affixes to Feature Structures, the other relates small parts of lexical and surface forms (typically, substrings of length 0 to 2).",
                    "sid": 246,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Karamel uses a richer and more flexible structuration.",
                    "sid": 247,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the number of tapes is fixed in MMORPH and user defined in Karamel.",
                    "sid": 248,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MMORPH is distributed under the GPL license.",
                    "sid": 249,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not maintained any more.",
                    "sid": 250,
                    "ssid": 117,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "5",
            "sents": [
                {
                    "text": "In this paper, we have emphasized the application of Karamel to morphological descriptions.",
                    "sid": 251,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The multiplicity of tapes is useful at all the levels of the analysis.",
                    "sid": 252,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The abstract representation typically uses feature structures.",
                    "sid": 253,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several tapes are to be used if different kinds of feature structures have different spans with respect to the surface form.",
                    "sid": 254,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the intermediate level, several tapes may be used by a multitiered analysis.",
                    "sid": 255,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not the case in our example, but Karamel is compatible with an approach where each tier is put on a different tape (Kiraz, 2000).",
                    "sid": 256,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The surface level may also use several tapes.",
                    "sid": 257,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our example, two tapes are used for two different dialects.",
                    "sid": 258,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is also possible to use several tapes for several writings of the surface forms, for instance, a standard written form, a phonetic representation using the International Phonetic Alphabet (IPA) and a transcription in Latin alphabet.",
                    "sid": 259,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other main feature of Karamel is to use embedded units to relate the different tapes.",
                    "sid": 260,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is useful to define the scope of feature structure and to distinguish several parts in the forms.",
                    "sid": 261,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}