{
    "ID": "W10-1012",
    "sections": [
        {
            "text": "introduction*. ",
            "number": "1",
            "sents": [
                {
                    "text": "Online discussion boards have become a popular and important medium for distance education.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Students use discussion forums to collaborate, to exchange information, and to seek answers to problems from their instructors and classmates.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Making use of the dialog to assess student understanding is an open research problem.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the class size increases and online interaction becomes heavier, automatic tools for analyzing student discussions are highly desirable for providing better assistance and promoting discussion participation.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we present an approach for automatically identifying discussions that have unresolved issues or unanswered questions.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting dis * cussions can be reported to instructors for further assistance.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present a two-phase machine learning approach where the first phase identifies high level dialogue features (speech acts such as question, issue raising, answer, and acknowledgement) that are appropriate for assessing student interactions.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second phase uses speech acts as features in creating thread classifiers that identify discussions with unanswered questions or unresolved issues.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also describe an approach where thread classifiers are created directly from the features in discussion messages.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The preliminary results indicate that although the direct learning approach can identify threads with unanswered questions well, SA based learning provide a little better results in identifying threads with issues and threads with unresolved issues.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "modeling student discussions. ",
            "number": "2",
            "sents": [
                {
                    "text": "Our study takes place in the context of an undergraduate course discussion board that is an integral component of an Operating Systems course in the Computer Science Department at the University of Southern California.",
                    "sid": 11,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We obtain our data from an existing online discussion board that hosts student technical discussions.",
                    "sid": 12,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Total 291 discussion threads (219 for training and 72 for test) with 1135 messages (848 for training and 287 for test) from two semesters’ discussions were used for this study.",
                    "sid": 13,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "168 students participated in the discussions.",
                    "sid": 14,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Discussion Threads.",
                    "sid": 15,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike prototypical collaborative argumentation where a limited number of members take part in the conversation with a strong focus on solving specific problems, student online discussions have much looser conversational structure, possibly involving multiple anonymous discussants.",
                    "sid": 16,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Student 84 discussions are very informal and noisy with respect to grammar, syntax and punctuation.",
                    "sid": 17,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is a lot of variance in the way that students present similar information.",
                    "sid": 18,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Messages about programming assignments include various forms of references to programming code.",
                    "sid": 19,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 shows an example discussion thread that is relatively technical and formal.",
                    "sid": 20,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The raw data include humorous messages and personal announcements as well as technical questions and answers.",
                    "sid": 21,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1.",
                    "sid": 22,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example discussion thread The average number of messages per discussion thread in our undergraduate course is 3.9, and many discussion threads contain only two or three messages.",
                    "sid": 23,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discussions often start with a question from a student on a project or an assignment.",
                    "sid": 24,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In some cases, the discussion ends with an answer that follows the question.",
                    "sid": 25,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In some other cases, the original poster may raise additional issues or ask questions about the answer.",
                    "sid": 26,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The discussion can continue with the following answer from another student as in Figure 1.",
                    "sid": 27,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, sometimes the discussion ends with hanging issues or questions without an answer.",
                    "sid": 28,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Speech Acts in messages: Identifying roles.",
                    "sid": 29,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "that a message plays For conversation analysis, we adopted the theory of Speech Acts (SAs) to capture relations between messages (Austin, 1962; Searle, 1969).",
                    "sid": 30,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each message within a discussion thread may play a different role.",
                    "sid": 31,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A message could include a question for a particular problem, or it could contain an answer or suggestion with respect to a previous question in the thread.",
                    "sid": 32,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Messages can include question, answer, acknowledgement, and objection.",
                    "sid": 33,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since SAs are useful in understanding contributions made by students in discussions, and are natural indicators for unanswered questions or unresolved issues, we use SAs as features for classifying discussion threads in a two phase learning as described below.",
                    "sid": 34,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1.",
                    "sid": 35,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Speech Act Categories and Kappa values SA CategoryDescription kappaQUES A question about a problem, in cluding question about a previous message 0.94 ANS A simple or complex answer to a previous question.",
                    "sid": 36,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suggestion or advice0.72ISSUE Report misunderstanding, unclear concepts or issues in solving prob lems 0.88 PosAckAn acknowledgement, compliment or support in response to a prev.",
                    "sid": 37,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "message 0.87 NegAckA correction or objection (or complaint) to/on a previous message 0.85 We divide message roles into several SA categories, extending the approaches presented in (Kim et al., 2006; Kim and Ravi 2007).",
                    "sid": 38,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We focus on the categories that are relevant to the problem of identifying discussion threads with unanswered question or unresolved issues.",
                    "sid": 39,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The message might contain a question about a particular problem (QUES) or report a misunderstanding, unclear concepts or issues in solving a problem (ISSUE).",
                    "sid": 40,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It might propose an answer or suggestion with respect to a previous question in the thread (ANS).",
                    "sid": 41,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, a message might acknowledge the previous message with support Message1: QUES Message2: ANS Poster1: I am still confused.",
                    "sid": 42,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I understand it is in thesame address space as the parent process, where do weallocate the 8 pages of mem for it?",
                    "sid": 43,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And how do wekeep track of .....?",
                    "sid": 44,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I am sure it is a simple concept thatI am just missing.",
                    "sid": 45,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Poster2: Have you read the student documentation forthe Fork syscall?",
                    "sid": 46,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "É Poster1: The Professor gave us 2 methods for forkingthreads from the main program.",
                    "sid": 47,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One was .......",
                    "sid": 48,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Theother was to .........",
                    "sid": 49,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When you fork a thread where doesit get created and take its 8 pages from?",
                    "sid": 50,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Do you have tocalculate ......?",
                    "sid": 51,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If so how?",
                    "sid": 52,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Where does it store itsPCReg .......?",
                    "sid": 53,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Any suggestions would be helpfule.",
                    "sid": 54,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Poster3: If you use the first implementation....,then you'll have a hard limit on the number ofthreads....If you use the second implementation,you need to....",
                    "sid": 55,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Either way, you'll need to implement theAddrSpace::NewStack() function and make surethat there is memory available.",
                    "sid": 56,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "… Message3: ISSUE, QUES Message4: ANS 85 (PosAck) or show disagreement or objection (NegAck).",
                    "sid": 57,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SAs relate a pair of messages that has a ‘reply-to’ relation.",
                    "sid": 58,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A pair of messages can be labeled with multiple SAs, and a message can have multiple SAs with more than one messages.",
                    "sid": 59,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This allows us to capture various relations among messages.",
                    "sid": 60,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 describes the categories we are focusing on and the kappa values from two annotators.",
                    "sid": 61,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 shows SA relations between message pairs.",
                    "sid": 62,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During annotation of the corpus, the annotators marked the cues that are relevant to a particular SA category as well as the SA categories themselves.",
                    "sid": 63,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such information provides hints on the kinds of features that are useful.",
                    "sid": 64,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also interviewed the annotators to capture additional cues or indicators that they used during the annotation.",
                    "sid": 65,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We iterated with several different annotation approaches until we reach enough agreement among the annotators on a new dataset that was not seen by the annota-tors before.",
                    "sid": 66,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows the distribution statistics of each SA category among the whole training and test corpus.",
                    "sid": 67,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since a message may have more than one SA, the percentage sum of all SAs doesn’t equal to 1.",
                    "sid": 68,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we can see, PosAck and NegAck are experiencing lacking data problem which is one of the challenges we are facing for SA classification.",
                    "sid": 69,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2.",
                    "sid": 70,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Statistics for each Speech Act Category Training set Test set SA Category # of msgs Percentage # of msgs Percentage QUES 469 55.31% 146 50.87% ANS 508 59.91% 176 61.32% ISSUE 136 16.03% 46 16.03% PosAck 78 9.20% 30 10.45% NegAck 23 2.71% 8 2.79%",
                    "sid": 71,
                    "ssid": 61,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "message speech act classifiers. ",
            "number": "3",
            "sents": [
                {
                    "text": "In this section, we first describe how raw discussion data is processed and show the features generated from the data, and we then present the current SA classifiers.",
                    "sid": 72,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Discussion Data Pre-processing.",
                    "sid": 73,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides typical data preprocessing steps, such as stemming and filtering, which are taken by most NLP systems, our system performs additional steps to reduce noise and variance (Ravi and Kim 2007).",
                    "sid": 74,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first remove the text from previous messages that is automatically inserted by the discussion board system starting with righ angle braket (>) when the user clicks on a “Reply to” button.",
                    "sid": 75,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also apply a simple stemming algorithm that removes “s” and “es” for plurals.",
                    "sid": 76,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Apostrophes are also converted to their original forms.",
                    "sid": 77,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "E.g., “I’m” is converted to “I am”.",
                    "sid": 78,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For discussions on programming assignment, the discussion included programming code fragments.",
                    "sid": 79,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each section of programming code or code fragment is replaced with a single term called code.",
                    "sid": 80,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar substitution patterns were used for a number of categories like filetype extensions (“.html”, “.c”, “.c++”, “.doc”), URL links and others.",
                    "sid": 81,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Students also tend to use informal words (e.g. “ya”, “yeah”, “yup”).We substitute some of such words with one form (“yes”).",
                    "sid": 82,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For words like “which”, ”where”, ”when”, ”who” and ”how”, we used the term categ_wh.",
                    "sid": 83,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do not replace pronouns (“I”, “we”, “they”,) since they may be useful for identifying some SAs.",
                    "sid": 84,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “You can” may be a cue for ANS but “I can” may not.",
                    "sid": 85,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also apply a simple sentence divider with simple cues (punctuation and white spaces such as newline) in order to captures the locations of the features in the message, such as cue words in the first sentence vs. cues in the last sentence.",
                    "sid": 86,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Features for Speech Act Classification.",
                    "sid": 87,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have used six different types of features based on input from the annotators.",
                    "sid": 88,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F1: cue phases and their positions: In addition to SAs (e.g. QUES), the human annotators marked the parts within the message (cue phrases or sentences), which helped them identify the SAs in the message.",
                    "sid": 89,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to overcome data sparseness, we generate features from the marked phrases.",
                    "sid": 90,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, from each phrase, we extract all the unigrams, bi-grams, trigrams (sequence of 1/2/3 words) and add them to the feature set.",
                    "sid": 91,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also added two separate unigrams, three separate unigrams and a unigram and a bigram combinations since the annotations in the training data indicated that they could be a useful pattern.",
                    "sid": 92,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the cues including separate cues such as two unigrams are captured and used for a single sentence.",
                    "sid": 93,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Positions of the cues are included since in longer messages the cues in the beginning 86 sentences and the ones in the end sentences can indicate different SAs.",
                    "sid": 94,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, THANK in the beginning indicates a positive answer but THANK in latter part of the message usually means politeness (thank in advance).",
                    "sid": 95,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F2: Message Position: Position of current message within the discussion thread (e.g. the first message, the last message, or middle in the thread).",
                    "sid": 96,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F3: Previous Message Information: SAs in the previous message that the current message is replying to.",
                    "sid": 97,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F4: Poster Class: Student or Instructor.",
                    "sid": 98,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F5: Poster Change: Was the current message posted by the same person who posted the message that the current message is replying to?",
                    "sid": 99,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F6: Message Length: Values include Short(15words), Medium(630 words), and Long(>30 words).",
                    "sid": 100,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F1 is a required feature since the annotators indicated cues as useful feature in most cases.",
                    "sid": 101,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the others are optional.",
                    "sid": 102,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Speech Act Classifiers.",
                    "sid": 103,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We applied SVM in creating binary classifiers for each SA category using Chang and Lin (2001).",
                    "sid": 104,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, Transformation-based Learning (TBL) was applied as it has been successfully used in spoken dialogue act classification (Samuel 2000; Brill 1995).",
                    "sid": 105,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It starts with the unlabeled corpus and learns the best sequence of admissible “transformation rules” that must be applied to the training corpus to minimize the error for the task.",
                    "sid": 106,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The generated rules are easy to understand and useful for debugging the features used.",
                    "sid": 107,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TBL results are also used in generating dependencies among SA categories for F3, i.e. which SAs tend to follow which other SAs1, as describe below.",
                    "sid": 108,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SA Classification with TBL Each rule iRule is composed of two parts - (1) iRuleLHS - A combination of features that should be checked for applicability to the current message (2)iRuleTAGSA tag to apply, if the feature com bination is applicable to the current message.",
                    "sid": 109,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 It is possible to collect related clues from SVM with distribution of feature values and information gain although dependencies can be easily recognized in TBL rules.",
                    "sid": 110,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "iii RuleTAGRuleLHSRule !\":: Whereii XRuleLHS ! )654321(; FFFFFFXXX i #####$% The iRuleLHS component can be instantiated from all the combination of the features F1, …,F6.",
                    "sid": 111,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "iRuleTAG is any SA (single SA) chosen from a list of all the SA categories.",
                    "sid": 112,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example rule used in Speech Act learning is shown below: Rule1 :: IF cue-phrase = {“not”, “work”} & poster-info = Student & post-length = Long => ISSUE Rule1 means if the post contains two unigrams “not” and “work”, the poster is a student, and the post length is long, then the Speech Act for the post is ISSUE.",
                    "sid": 113,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We apply each rule in the potential rule set on all the posts in the training corpus and transform the post label if the post is applicable.",
                    "sid": 114,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rule with highest improvement by F score is selected into the optimal rule set and moved from the potential rule set.",
                    "sid": 115,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The iteration continues until there is no significant improvement with any rule.",
                    "sid": 116,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training corpus was divided into 3 parts for 3-fold cross validation.",
                    "sid": 117,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rules from 3 rule sets are merged and sorted by weighted Mean Reciprocal Rank (MRR) (Voorhees, 2001).",
                    "sid": 118,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if we have 5 rules among 3 rule sets as follows, Rule set 1 (0.85 on test): R1 R2 R3 Rule set 2 (0.88 on test): R2 R1 R4 Rule set 3 (0.79 on test): R1 R4 R5 For R1, we calculate the weighted MRR as (0.85*1 + 0.88*(1/2) + 0.79*1) / 3.",
                    "sid": 119,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After sorting, we get top N rules from the merged rule set.",
                    "sid": 120,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows some of the rules learned.",
                    "sid": 121,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3.",
                    "sid": 122,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "TBL rule examples IF cue-phrase = {“?”} => QUES IF cue-phrase = {“yes you can”} & poster-info = Instructor & post-length = Medium => ANS IF cue-phrase = {“yes”} & cue-position = CP_BEGIN & prevSA = QUES => ANS IF cue-phrase = {“not know”} 87 & poster-info = student & poster-change = YES => ISSUE Based on the rules generated from TBL, we analyze dependencies among the SA categories for F3 (previous message SAs).",
                    "sid": 123,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In TBL rules, ANS depends on ISSUE and QUES, i.e. some ANS rules have QUES and ISSUE for F3.",
                    "sid": 124,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also PosAck and NegAck tend to follow ANS.",
                    "sid": 125,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both SVM and TBL classifiers use this information during testing.",
                    "sid": 126,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, we apply independent classifiers first and then use dependent classifiers according to the dependency order as following: Currently there is no loop in the selected rules but we plan to address potential issues with loops in SA dependencies.",
                    "sid": 127,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SA Classification with SVM Table 4.",
                    "sid": 128,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of the top selected features by Infor mation Gain SA Category Top features QUES “?” POST_POSITION “_category_wh_ … ?” PREV_SA_FIRST_NONE “to … ?” ANS POST_POSITION PREV_SA_QUESTION “?” POSTER_INFO ISSUE POSTER_INFO “not … sure” POST_POSITION FEATURE_LENGTH “error” PosAck PREV_SA_ANSWER POST_POSITION PREV_SA_FIRST_NONE “thanks” & cue-position = CP_BEGIN “ok” & cue-position = CP_BEGIN NegAck “yes, ” “, but” POST_POSITION “, but” “are … wrong”?",
                    "sid": 129,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given all the combination of the features F1,…, F6, we use Information Gain (Yang and Pederson 1997) for pruning the feature space and selecting features.",
                    "sid": 130,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each Speech Act, we sort all the features (lexical and non-lexical) by Information Gain and use the top N (=200) features.",
                    "sid": 131,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 shows the top features selected by Information Gain.",
                    "sid": 132,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting features are used in representing a message in a vector format.",
                    "sid": 133,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We did 5-fold cross validation in the training.",
                    "sid": 134,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "RBF (Radial Basis Function) is used as the kernel function.",
                    "sid": 135,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We performed grid search to get the best parameter (C and gamma) in training and applied them to the test corpus.",
                    "sid": 136,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5.",
                    "sid": 137,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SA classification results SVM TBL SA Cat egory Prec.Re call F score Prec.",
                    "sid": 138,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Re call F score QUES 0.95 0.90 0.94 0.96 0.91 0.95 ANS 0.87 0.80 0.85 0.83 0.64 0.78 ISSUE 0.65 0.54 0.62 0.46 0.76 0.50 PosAck 0.57 0.44 0.54 0.58 0.56 0.57 NegAck 0 0 0 0.5 0.38 0.47 Table 5 shows the current classification accuracies with SVM and TBL.",
                    "sid": 139,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main reason that ISSUE, PosAck and NegAck show low scores is that they have relatively small number of examples (see statistics in Table 2).",
                    "sid": 140,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We plan to add more examples as we collect more discussion annotations.",
                    "sid": 141,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For thread classification described below, we use features with QUES, ANS, ISSUE and Pos_Ack only.",
                    "sid": 142,
                    "ssid": 71,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "identifying discussions with unan-. ",
            "number": "4",
            "sents": [
                {
                    "text": "swered or Unresolved Questions: Thread Classification Figure 2 shows typical patterns of interactions in our corpus.",
                    "sid": 143,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many threads follow pattern (a) where the first message includes a question and the subsequent message provides an answer.",
                    "sid": 144,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In (b), after an answer, the student presents an additional question or misunderstanding (ISSUE), which is followed by another answer.",
                    "sid": 145,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Often students provide positive acknowledgement when an answer is sat ISSUE ANS QUES PosAck NegAck 88 isfying.",
                    "sid": 146,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pattern (c) covers cases for when the question is unanswered.",
                    "sid": 147,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2.",
                    "sid": 148,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example patterns in student discussion threads We are interested in the following assessment questions.",
                    "sid": 149,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Q1) Were all questions answered?",
                    "sid": 150,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Y/N) (Q2) Were there any issues or confusion?",
                    "sid": 151,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Y/N) (Q3) Were those issues or confusions resolved?",
                    "sid": 152,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Y/N) There can be multiple questions, and Q1 is false if there is any question that does not have a corresponding answer.",
                    "sid": 153,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, even when some questions were resolved, it could still be False (not resolved) if some were not resolved.",
                    "sid": 154,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If Q2 is False (i.e. there is no issue or question), then Q3 is also False.",
                    "sid": 155,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These questions are useful for distinguishing different interaction patterns, including threads with unanswered questions.",
                    "sid": 156,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second phase of learning, we use SA-based features.",
                    "sid": 157,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our initial analysis of student interactions as above indicates that the following simple features can be useful in answering such questions: (T-F1) Whether there was an [SA] in the thread (T-F2) Whether the last message in the thread in cluded [SA] We used TBL rules for PosAck and SVM classifiers for other SA categories because of relatively higher score of PosAck from TBL and other categories from SVM.",
                    "sid": 158,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use 8 (2 x 4) features created from T-F1 and T-F2.",
                    "sid": 159,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SVM settings are similar to the ones used in the SA classification.",
                    "sid": 160,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6 shows the thread classification results.",
                    "sid": 161,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We checked SVM classification results with human annotated SAs since they can show how useful SA-based features are (T-F1 and T-F2 in particular) in answering Q1—Q3.",
                    "sid": 162,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results shown in Table 6-(a) indicate that the features (T-F1 and T-F2) are in fact useful for the questions.",
                    "sid": 163,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When we used the SA classifiers and SVM in a pipeline, the system shows precisions (recalls) of 83%(84%), 77%(74%) and 68%(69%) for Q1, Q2, and Q3 respectively.",
                    "sid": 164,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6.",
                    "sid": 165,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thread Classification Results Precision Recall F score Q1 0.93 0.93 0.93 Q2 0.93 0.93 0.93 Q3 0.89 0.89 0.89 (a) Classification results with human annotated SAs Precision Recall F score Q1 0.83 0.84 0.83 Q2 0.77 0.74 0.76 Q3 0.68 0.69 0.68 (b) SVM classification results with system generated SAs The results with system generated SAs provide an average F score of 0.76.",
                    "sid": 166,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the ISSUE classifier has F score of 0.62, the score for Q2 is 0.76.",
                    "sid": 167,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Q2 checks one or more occurrences of ISSUE rather than identifying existence of ISSUE in a message, and it may become an easier problem when there are multiple occurrences of ISSUEs.",
                    "sid": 168,
                    "ssid": 26,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "direct thread classification without. ",
            "number": "5",
            "sents": [
                {
                    "text": "SAs As an alternative to the SA-based two-phase learning, we crated thread classifiers directly from the features in discussion messages.",
                    "sid": 169,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used SVM with the following features that we can capture directly from a discussion thread.",
                    "sid": 170,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "F1’: cue phases and their positions in the thread: we use the same cue features in F1 but we use an optional thread level cue position: Last_message and Dont_Care.",
                    "sid": 171,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, for a given cue “ok”, if it appears in the the last message of the thread, we generate two features, \"ok\"_Last_message and \"ok\"_Dont_Care.",
                    "sid": 172,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a set of candidate features, we use Information Gain to select the top N (=200) features.",
                    "sid": 173,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting features are used in creating vectors as described inS 3.3.",
                    "sid": 174,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar cross-validation and SVM settings are applied.",
                    "sid": 175,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "89 Table 7.",
                    "sid": 176,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results from Direct Thread Classification Precision Recall F score Q1 0.86 0.86 0.86 Q2 0.81 0.62 0.70 Q3 0.75 0.33 0.46 Table 7 shows the classification results.",
                    "sid": 177,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the direct learning approach can identify threads with unanswered questions well, SA based learning provides a little better results in identifying threads with issues (Q2) and unresolved issues (Q3).",
                    "sid": 178,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It seems that SA-based features may help performing more difficult tasks (e.g. assessment for ISSUEs in discussions) We need further investigation on different types of assessment tasks.",
                    "sid": 179,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "6",
            "sents": [
                {
                    "text": "Rhetorical Structure Theory (Mann and Thomson, 1988) based discourse processing has attracted much attention with successful applications in sentence compression and summarization.",
                    "sid": 180,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of the current work on discourse processing focuses on sentence-level text organization (Soricut and Marcu, 2003) or the intermediate step (Sporleder and Lapata, 2005).",
                    "sid": 181,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Analyzing and utilizing discourse information at a higher level, e.g., at the paragraph level, still remains a challenge to the natural language community.",
                    "sid": 182,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our work, we utilize the discourse information at a message level.",
                    "sid": 183,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There has been prior work on dialogue act analysis and associated surface cue words (Samuel 2000; Hirschberg and Litman 1993).",
                    "sid": 184,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There have also been Dialogue Acts modeling approaches for automatic tagging and recognition of conversational speech (Stolcke et al., 2000) and related work in corpus linguistics where machine learning techniques have been used to find conversational patterns in spoken transcripts of dialogue corpus (Shawar and Atwell, 2005).",
                    "sid": 185,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although spoken dialogue is different from message-based conversation in online discussion boards, they are closely related to our thread analysis work, and we plan to investigate potential use of conversation patterns in spoken dialogue in threaded discussions.",
                    "sid": 186,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Carvalho and Cohen (2005) present a dependency-network based collective classification method to classify email speech acts.",
                    "sid": 187,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, estimated speech act labeling between messages is not sufficient for assessing contributor roles or identifying help needed by the participants.",
                    "sid": 188,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We included other features like participant profiles.",
                    "sid": 189,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also our corpus consists of less informal student discussions rather than messages among project participants, which tend to be more technically coherent.",
                    "sid": 190,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Requests and commitments of email exchange are analyzed in (Lampert et al., 2008).",
                    "sid": 191,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in their analysis, we have a higher kappa value for questions than answers, and some sources of ambiguity in human annotations such as different forms of answers also appear in our data.",
                    "sid": 192,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, student discussions tend to focus on problem solving rather than task request and commitment as in project management applications, and their data show different types of ambiguity due to different nature of participant interests.",
                    "sid": 193,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There also has been work on non-traditional, qualitative assessment of instructional discourse (Graesser et al., 2005; McLaren et al., 2007; Boyer et al., 2008).",
                    "sid": 194,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The assessment results can be used in finding features for student thinking skills or level of understanding.",
                    "sid": 195,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the existing work has not been fully used for discussion thread analysis, we are investigating opportunities for using such features to cover additional discourse analysis capabilities.",
                    "sid": 196,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar approaches for classifying speech acts were investigated (Kim and Ravi 2007).",
                    "sid": 197,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work captures more features that are relevant to analyzing noisy student discussion threads and support a full automatic analysis of student discussions instead of manual generation of thread analysis rules.",
                    "sid": 198,
                    "ssid": 19,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "summary and future work. ",
            "number": "7",
            "sents": [
                {
                    "text": "We have presented an approach for automatically classifying student discussions to identify discussions that have unanswered questions and need instructor attention.",
                    "sid": 199,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We applied a multi-phase learning approach, where the first phase classifies individual messages with SAs and the second phase classifies discussion threads with SA-based features.",
                    "sid": 200,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also created thread classifiers directly from features in discussion messages.",
                    "sid": 201,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The preliminary results indicate that SA-based features may help difficult classification tasks.",
                    "sid": 202,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We plan to perform more analysis on different types of thread classification tasks.",
                    "sid": 203,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We found that automatic classification of undergraduate student discussions is very challenging 90 due to incoherence and noise in the data.",
                    "sid": 204,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Especially messages that contain long sentences, informal statements with uncommon words, answers in form of question, are difficult to classify.",
                    "sid": 205,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to use other SA categories such as NegAck and analyze various types of student interactions, we plan to use more annotated discussion data.",
                    "sid": 206,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A deeper assessment of online discussions requires a combination with other information such as discussion topics (Feng et al., 2006).",
                    "sid": 207,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, classification of discussion topics can be used in identifying topics that participants have more confusion about.",
                    "sid": 208,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, such information can also be used in profiling participants such as identifying mentors or help seekers on a particular topic as in (Kim and Shaw 2009).",
                    "sid": 209,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are investigating several extensions in order to generate more useful instructional tools.",
                    "sid": 210,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This work was supported by National Science Foundation, CCLI Phase II grant (#0618859).",
                    "sid": 211,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}