{
    "ID": "W10-1750",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper describes the joint submission of Universitat Polite`cnica de Catalunya and Universitat de Barcelona to the Metrics MaTr 2010 evaluation challenge, in collaboration with ELDA/ELRA.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work is aimed at widening the scope of current automatic evaluation measures from sentence to document level.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preliminary experiments, based on an extension of the metrics by Gime´nez and Ma`rquez (2009) operating over discourse representations, are presented.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Current automatic similarity measures for Machine Translation (MT) evaluation operate all, without exception, at the segment level.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Translations are analyzed on a segment-by-segment1 fashion, ignoring the text structure.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Document and system scores are obtained using aggregate statistics over individual segments.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This strategy presents the main disadvantage of ignoring cross- sentential/discursive phenomena.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work we suggest widening the scope of evaluation methods.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have defined genuine document-level measures which are able to exploit the structure of text to provide more informed evaluation scores.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For that purpose we take advantage of two coincidental facts.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, test beds employed in recent MT evaluation campaigns include a document structure grouping sentences related to the same event, story or topic (Przybocki et al., 2008; Przybocki et al., 2009; CallisonBurch et al., 2009).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, we count on automatic linguistic processors which provide very detailed discourse- level representations of text (Curran et al., 2007).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discourse representations allow us to focus on relevant pieces of information, such as the agent 1 A segment typically consists of one or two sentences.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(who), location (where), time (when), and theme (what), which may be spread all over the text.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Counting on a means of discerning the events, the individuals taking part in each of them, and their role, is crucial to determine the semantic equivalence between a reference document and a candidate translation.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, the discourse analysis of a document is not a mere concatenation of the analyses of its individual sentences.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are some phenomena which may go beyond the scope of a sentence and can only be explained within the context of the whole document.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, in a newspaper article, facts and entities are progressively added to the discourse and then referred to anaphorically later on.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following extract from the development set illustrates the importance of such a phenomenon in the discourse analysis: ‘Among the current or underlying crises in the Middle East, Rod Larsen mentioned the ArabIsraeli conflict and the Iranian nuclear portfolio, as well as the crisis between Lebanon and Syria.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He stated: “All this leads us back to crucial values and opinions, which render the situation prone at any moment to getting out of control, more so than it was in past days.”’.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The subject pronoun “he” works as an anaphoric pronoun whose antecedent is the proper noun “Rod Larson”.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The anaphoric relation established between these two elements can only be identified by analyzing the text as a whole, thus considering the gender agreement between the third person singular masculine subject pronoun “he” and the masculine proper noun “Rod Larson”.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, if the two sentences were analyzed separately, the identification of this anaphoric relation would not be feasible due to the lack of connection between the two elements.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discourse representations allow us to trace links across sentences between the different facts and entities appearing in them.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, providing an approach to the text more similar to that of a human, which implies taking into account the whole text structure instead of considering each sentence separately.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of the paper is organized as follows.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2 describes our evaluation methods and the linguistic theory upon which they are based.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experimental results are reported and discussed in Section 3.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 presents the metric submitted to the evaluation challenge.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Future work is outlined in Section 5.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As an additional result, document-level metrics generated in this study have been incorporated to the IQMT package for automatic MT evaluation2 .",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "metric description. ",
            "number": "2",
            "sents": [
                {
                    "text": "This section provides a brief description of our approach.",
                    "sid": 32,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, in Section 2.1, we describe the underlying theory and give examples on its capabilities.",
                    "sid": 33,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, in Section 2.2, we describe the associated similarity measures.",
                    "sid": 34,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Discourse Representations.",
                    "sid": 35,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As previously mentioned in Section 1, a document has some features which need to be analyzed considering it as a whole instead of dividing it up into sentences.",
                    "sid": 36,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The anaphoric relation between a subject pronoun and a proper noun has already been exemplified.",
                    "sid": 37,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, this is not the only anaphoric relation which can be found inside a text, there are some others which are worth mentioning: • the connection between a possessive adjective and a proper noun or a subject pronoun, as exemplified in the sentences “Maria bought a new sweater.",
                    "sid": 38,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Her new sweater is blue.”, where the possessive feminine adjective “her” refers to the proper noun “Maria”.",
                    "sid": 39,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• the link between a demonstrative pronoun and its referent, which is exemplified in the sentences “He developed a new theory on grammar.",
                    "sid": 40,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, this is not the only theory he developed”.",
                    "sid": 41,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second sentence, the demonstrative pronoun ”this” refers back to the noun phrase “new theory on grammar” which occurs in the previous sentence.",
                    "sid": 42,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• the relation between a main verb and an auxiliary verb in certain contexts, as illustrated in the following pair of sentences “Would you 2 http://www.lsi.upc.edu/˜nlp/IQMT like more sugar?",
                    "sid": 43,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yes, I would”.",
                    "sid": 44,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this example, the auxiliary verb “would” used in the short answer substitutes the verb phrase “would like”.",
                    "sid": 45,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to anaphoric relations, other features need to be highlighted, such as the use of discourse markers which help to give cohesion to the text, link parts of a discourse and show the relations established between them.",
                    "sid": 46,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Below, some examples are given: • “Moreover”, “Furthermore”, “In addition” indicate that the upcoming sentence adds more information.",
                    "sid": 47,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• “However”, “Nonetheless”, “Nevertheless” show contrast with previous ideas.",
                    "sid": 48,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• “Therefore”, “As a result”, “Consequently” show a cause and effect relation.",
                    "sid": 49,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• “For instance”, “For example” clarify or illustrate the previous idea.",
                    "sid": 50,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is worth noticing that anaphora, as well as discourse markers, are key features in the interface between syntax, semantics and pragmatics.",
                    "sid": 51,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, when dealing with these phenomena at a text level we are not just looking separately at the different language levels, but we are trying to give a complete representation of both the surface and the deep structures of a text.",
                    "sid": 52,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Definition of Similarity Measures.",
                    "sid": 53,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, as a first proposal, instead of elaborating on novel similarity measures, we have borrowed and extended the Discourse Representation (DR) metrics defined by Gime´nez and Ma`rquez (2009).",
                    "sid": 54,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These metrics analyze similarities between automatic and reference translations by comparing their respective discourse representations over individual sentences.",
                    "sid": 55,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the discursive analysis of texts, DR metrics rely on the C&C Tools (Curran et al., 2007), specifically on the Boxer component (Bos, 2008).",
                    "sid": 56,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This software is based on the Discourse Representation Theory (DRT) by Kamp and Reyle (1993).",
                    "sid": 57,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DRT is a theoretical framework offering a representation language for the examination of con- textually dependent meaning in discourse.",
                    "sid": 58,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A discourse is represented in a discourse representation structure (DRS), which is essentially a variation of first-order predicate calculus —its forms are pairs of first-order formulae and the free variables that occur in them.",
                    "sid": 59,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DRSs are viewed as semantic trees, built through the application of two types of DRS conditions: basic conditions: one-place properties (predicates), two-place properties (relations), named entities, time-expressions, cardinal expressions and equalities.",
                    "sid": 60,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "complex conditions: disjunction, implication, negation, question, and propositional attitude operations.",
                    "sid": 61,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the DRS representation for the sentence “Every man loves Mary.” is as follows: ∃y named(y, mary, per) ∧ (∀x man(x) → ∃z love(z) ∧ event(z) ∧ agent(z, x) ∧ patient(z, y)).",
                    "sid": 62,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DR integrates three different kinds of metrics: DRSTM These metrics are similar to the Syntactic Tree Matching metric defined by Liu and Gildea (2005), in this case applied to DRSs instead of constituent trees.",
                    "sid": 63,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All semantic sub- paths in the candidate and reference trees are retrieved.",
                    "sid": 64,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fraction of matching subpaths of a given length (l=4 in our experiments) is computed.",
                    "sid": 65,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DR-Or (⋆) Average lexical overlap between discourse representation structures of the same type.",
                    "sid": 66,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overlap is measured according to the formulae and definitions by Gime´nez and Ma`rquez (2007).",
                    "sid": 67,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DROrp(⋆) Average morphosyntactic overlap, i.e., between grammatical categories –parts- of-speech– associated to lexical items, between discourse representation structures of the same type.",
                    "sid": 68,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have extended these metrics to operate at document level.",
                    "sid": 69,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For that purpose, instead of running the C&C Tools in a sentence-by-sentence fashion, we run them document by document.",
                    "sid": 70,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is as simple as introducing a “<META>” tag at the beginning of each document to denote document boundaries3 . 3 Details on the advanced use of Boxer are available at http://svn.ask.it.usyd.edu.au/trac/ candc/wiki/BoxerComplex.",
                    "sid": 71,
                    "ssid": 40,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental work. ",
            "number": "3",
            "sents": [
                {
                    "text": "In this section, we analyze the behavior of the new DR metrics operating at document level with respect to their sentence-level counterparts.",
                    "sid": 72,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Settings.",
                    "sid": 73,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have used the ‘mt06’ part of the development set provided by the Metrics MaTr 2010 organization, which corresponds to a subset of 25 documents from the NIST 2006 Open MT Evaluation Campaign Arabic-to-English translation.",
                    "sid": 74,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The total number of segments is 249.",
                    "sid": 75,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The average number of segments per document is, thus, 9.96.",
                    "sid": 76,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of segments per document varies between 2 and 30.",
                    "sid": 77,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the purpose of automatic evaluation, 4 human reference translations and automatic outputs by 8 different MT systems are available.",
                    "sid": 78,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we count on the results of a process of manual evaluation.",
                    "sid": 79,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each translation segment was assessed by two judges.",
                    "sid": 80,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After independently and completely assessing the entire set, the judges reviewed their individual assessments together and settled on a single final score.",
                    "sid": 81,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Average system adequacy is 5.38.",
                    "sid": 82,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, metrics are evaluated in terms of their correlation with human assessments.",
                    "sid": 83,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have computed Pearson, Spearman and Kendall correlation coefficients between metric scores and adequacy assessments.",
                    "sid": 84,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Document- level and system-level assessments have been obtained by averaging over segment-level assessments.",
                    "sid": 85,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have computed correlation coefficients and confidence intervals applying bootstrap re- sampling at a 99% statistical significance (Efron and Tibshirani, 1986; Koehn, 2004).",
                    "sid": 86,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the cost of exhaustive resampling was prohibitive, we have limited to 1,000 resamplings.",
                    "sid": 87,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Confidence intervals, not shown in the tables, are in all cases lower than 10−3 . 3.2 Metric Performance.",
                    "sid": 88,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 shows correlation coefficients at the document level for several DR metric representatives, and their document-level counterparts (DRdoc).",
                    "sid": 89,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the sake of comparison, the performance of the METEOR metric is also reported4 . Contrary to our expectations, DRdoc variants obtain lower levels of correlation than their DR 4 We have used METEOR version 1.0 with default parameters optimized by its developers over adequacy and fluency assessments.",
                    "sid": 90,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The METEOR metric is publicly available at http://www.cs.cmu.edu/˜alavie/METEOR/ Metric Table 1: Meta-evaluation results at document level Metric Table 2: Meta-evaluation results at system level counterparts.",
                    "sid": 91,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are three different factors which could provide a possible explanation for this negative result.",
                    "sid": 92,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the C&C Tools, like any other automatic linguistic processor are not perfect.",
                    "sid": 93,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Parsing errors could be causing the metric to confer less informed scores.",
                    "sid": 94,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is especially relevant taking into account that candidate translations are not always well-formed.",
                    "sid": 95,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondly, we argue that the way in which we have obtained document-level quality assessments, as an average of segment-level assessments, may be biasing the correlation.",
                    "sid": 96,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thirdly, perhaps the similarity measures employed are not able to take advantage of the document-level features provided by the discourse analysis.",
                    "sid": 97,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following subsection we show some error analysis we have conducted by inspecting particular cases.",
                    "sid": 98,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows correlation coefficients at system level.",
                    "sid": 99,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of DR and DRdoc metrics, system scores are computed by simple average over individual documents.",
                    "sid": 100,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Interestingly, in this case DRdoc variants seem to obtain higher correlation than their DR counterparts.",
                    "sid": 101,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The improvement is especially substantial in terms of Spearman and Kendall coefficients, which do not consider absolute values but ranking positions.",
                    "sid": 102,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it could be the case that it was just an average ef fect.",
                    "sid": 103,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While DR metrics compute system scores as an average of segment scores, DRdoc metrics average directly document scores.",
                    "sid": 104,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to clarify this result, we have modified DR metrics so as to compute system scores as an average of document scores (DR′ variants, the last three rows in the table).",
                    "sid": 105,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be observed that DR’ variants outperform their DRdoc counterparts, thus confirming our suspicion about the averaging effect.",
                    "sid": 106,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Analysis.",
                    "sid": 107,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is worth noting that DRdoc metrics are able to detect and deal with several linguistic phenomena related to both syntax and semantics at sentence and document level.",
                    "sid": 108,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Below, several examples illustrating the potential of this metric are presented.",
                    "sid": 109,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Control structures.",
                    "sid": 110,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Control structures (either subject or object control) are always a difficult issue as they mix both syntactic and semantic knowledge.",
                    "sid": 111,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Example 1 a couple of control structures must be identified and DRdoc metrics deal correctly with the argument structure of all the verbs involved.",
                    "sid": 112,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, in the first part of the sentence, a subject control verb can be identified being “the minister” the agent of both verb forms “go” and “say”.",
                    "sid": 113,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, in the quoted question, the verb “invite” works as an object control verb because its patient “Chechen representatives” is also the agent of the verb visit.",
                    "sid": 114,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example 1: The minister went on to say, “What would Moscow say if we were to invite Chechen representatives to visit Jerusalem?” Anaphora and pronoun resolution.",
                    "sid": 115,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whenever there is a pronoun whose antecedent is a named entity (NE), the metric identifies correctly its antecedent.",
                    "sid": 116,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This feature is highly valuable because a relationship between syntax and semantics is established.",
                    "sid": 117,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, when dealing with Semantic Roles the roles of Agent or Patient are given to the antecedents instead of the pronouns.",
                    "sid": 118,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, in Example 2 the antecedent of the relative pronoun “who” is the NE “Putin” and the patient of the verb “classified” is also the NE “Putin” instead of the relative pronoun “who”.",
                    "sid": 119,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example 2: Putin, who was not classified as his country Hamas as “terrorist organizations”, recently said that the European Union is “a big mistake” if it decided to suspend financial aid to the Palestinians.",
                    "sid": 120,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, although Boxer was expected to deal with long-distance anaphoric relations beyond the sentence, after analyzing several cases, results show that it did not succeed in capturing this type of relations as shown in Example 3.",
                    "sid": 121,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this example, the antecedent of the pronoun “he” in the second sentence is the NE “Roberto Calderoli” which appears in the first sentence.",
                    "sid": 122,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DRdoc metrics should be capable of showing this connection.",
                    "sid": 123,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, although the proper noun “Roberto Calderoli” is identified as a NE, it does not share the same reference as the third person singular pronoun “he”.",
                    "sid": 124,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Example 3: Roberto Calderoli does not intend to apologize.",
                    "sid": 125,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The newspaper Corriere Della Sera reported today, Saturday, that he said “I don’t feel responsible for those deaths.”",
                    "sid": 126,
                    "ssid": 55,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "our submission. ",
            "number": "4",
            "sents": [
                {
                    "text": "Instead of participating with individual metrics, we have combined them by averaging their scores as described in (Gime´nez and Ma`rquez, 2008).",
                    "sid": 127,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This strategy has proven as an effective means of combining the scores conferred by different metrics (CallisonBurch et al., 2008; CallisonBurch et al., 2009).",
                    "sid": 128,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Metrics submitted are: DRdoc an arithmetic mean over a heuristically- defined set of DRdoc metric variants, respectively computing lexical overlap, morphosyn- tactic overlap, and semantic tree matching (M = {‘DRdoc-Or (⋆)’, ‘DRdocOrp (⋆)’, ‘DRdoc STM4 ’}).",
                    "sid": 129,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since DRdoc metrics do not operate over individual segments, we have assigned each segment the score of the document in which it is contained.",
                    "sid": 130,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DR a measure analog to DRdoc but using the default version of DR metrics operating at the segment level (M = {‘DR-Or (⋆)’, ‘DROrp (⋆)’, ‘DRSTM4 ’}).",
                    "sid": 131,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ULCh an arithmetic mean over a heuristically- defined set of metrics operating at different linguistic levels, including lexical metrics, and measures of overlap between constituent parses, dependency parses, seman tic roles, and discourse representations (M = {‘ROUGEW ’, ‘METEOR’, ‘DPHWCr ’, ‘DPOc (⋆)’, ‘DPOl (⋆)’, ‘DP-Or (⋆)’, ‘CPSTM4 ’, ‘SR-Or (⋆)’,‘SROrv ’, ‘DROrp(⋆)’}).",
                    "sid": 132,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This metric corre sponds exactly to the metric submitted in our previous participation.",
                    "sid": 133,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of these metrics at the document and system levels is shown in Table 3.",
                    "sid": 134,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions and future work. ",
            "number": "5",
            "sents": [
                {
                    "text": "We have presented a modified version of the DR metrics by Gime´nez and Ma`rquez (2009) which, instead of limiting their scope to the segment level, are able to capture and exploit document-level features.",
                    "sid": 135,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, results in terms of correlation with human assessments have not reported any improvement of these metrics over their sentence- level counterparts as document and system quality predictors.",
                    "sid": 136,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It must be clarified whether the problem is on the side of the linguistic tools, in the similarity measure, or in the way in which we have built document-level human assessments.",
                    "sid": 137,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For future work, we plan to continue the error analysis to clarify why DRdoc metrics do not outperform their DR counterparts at the document level, and how to improve their behavior.",
                    "sid": 138,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This Metric Table 3: Meta-evaluation results at document and system level for submitted metrics may imply defining new metrics possibly using alternative linguistic processors.",
                    "sid": 139,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we plan to work on the identification and analysis of discourse markers.",
                    "sid": 140,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we plan to repeat this experiment over other test beds with document structure, such as those from the 2009 Workshop on Statistical Machine Translation shared task (CallisonBurch et al., 2009) and the 2009 NIST MT Evaluation Campaign (Przybocki et al., 2009).",
                    "sid": 141,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case that document-level assessments are not provided, we will also explore the possibility of producing them ourselves.",
                    "sid": 142,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This work has been partially funded by the Spanish Government (projects OpenMT2, TIN200914675-C03, and KNOW, TIN-2009 14715C0403) and the European Community’s Seventh Framework Programme (FP7/20072013) under grant agreement numbers 247762 (FAUST project, FP7ICT-20094-247762) and 247914 (MOLTO project, FP7ICT-20094-247914).",
                    "sid": 143,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are also thankful to anonymous reviewers for their comments and suggestions.",
                    "sid": 144,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}