{
    "ID": "W10-3708",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Most word segmentation methods employed in Chinese Information Retrieval systems are based on a static dictionary or a model trained against a manually segmented corpus.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These general segmentation approaches may not be optimal because they disregard information within semantic units.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose a novel method for improving word-based Chinese IR, which performs segmentation according to the tightness of phrases.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to evaluate the effectiveness of our method, we employ a new test collection of 203 queries, which include a broad distribution of phrases with different tightness values.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of our experiments indicate that our method improves IR performance as compared with a general word segmentation approach.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments also demonstrate the need for the development of better evaluation corpora.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "What distinguishes Chinese Information Retrieval from information retrieval (IR) in other languages is the challenge of segmenting the queries and the documents, created by the lack of word delimiters.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, there are two categories of segmenters: character-based methods and word-based methods.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Despite the superior performance of bigram segmenters (Nie et al., 2000; Huang et al., 2000; Foo and Li, 2004), word-based approaches continue to be investigated because of their applica tion in sophisticated IR tasks such as cross language IR, and within techniques such as query expansion (Nie et al., 2000; Peng et al., 2002a).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most word-based segmenters in Chinese IR are either rule-based models, which rely on a lexicon, or statistical-based models, which are trained on manually segmented corpora (Zhang et al., 2003).",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the relationship between the accuracy of Chinese word segmentation and the performance of Chinese IR is non-monotonic.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Peng et al.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2002b) reported that segmentation methods achieving segmentation accuracy higher than 90% according to a manual segmentation standard yield no improvement in IR performance.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They further argued that IR often benefits from splitting compound words that are annotated as single units by manual segmentation.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The essence of the problem is that there is no clear definition of word in Chinese.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experiments have shown only about 75% agreement among native speakers regarding the correct word segmentation (Sproat et al., 1996).",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While units such as “ ” (peanut) and “ ” (match maker) should clearly be considered as a single term in Chinese IR, compounds such as “JLRq:>J” (machine learning) are more controversial.1 Xu et al.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009) proposed a “continuum hypothesis” that rejects a clean binary classification of Chinese semantic units as either compositional or non-compositional.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, they introduced the notion of a tightness measure, which quantifies the degree of compositionality.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On this tightness continuum, at one extreme are non 1 This issue is also present to a certain degree in languages that do use explicit delimiters, including English (Halpern, 2000; McCarthy et al., 2003; Guenthner and Blanco, 2004).",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "55 Proceedings of the Multiword Expressions: From Theory to Applications (MWE 2010), pages 55–63, Beijing, August 2010 compositional semantic units, such as “ ” (match maker), and at the other end are sequences of consecutive words with no dependency relationship, such as “J&illi'f” (Shanghai where).",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the middle of the spectrum are compositional compounds such as “JL R q: >J” (machine learning) and phrases such as “iE31[ A” (legitimate income).",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we propose a method to apply the concept of semantic tightness to Chinese IR, which refines the output of a general Chinese word segmenter using tightness information.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first phase, we recombine multiple units that are considered semantically tight into single terms.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the second phase, we break single units that are not sufficiently tight.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments involving two different IR systems demonstrate that the new method improves IR performance as compared to the general segmenter.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most Chinese IR systems are evaluated on the data from the TREC 5 and TREC 6 competitions (Huang et al., 2000; Huang et al., 2003; Nie et al., 2000; Peng et al., 2002a; Peng et al., 2002b; Shi and Nie, 2009).",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That data contains only 54 queries, which are linked to relevancy- judged documents.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During our experiments, we found the TREC query data is ill-suited for analyzing the effects of compound segmentation on Chinese IR.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this reason, we created an additional set of queries based on the TREC corpus, which includes a wide variety of semantic compounds.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper is organized as follows.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After summarizing related work on Chinese IR and word segmentation studies, we introduce the measure of semantic tightness.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 describes the integration of the semantic tightness measure into an IR system.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 5 discusses the available data for Chinese IR evaluation, as well as an approach to acquire new data.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 6 presents the results of our method on word segmentation and IR.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A short conclusion wraps up and gives directions for future work.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "The impact of different Chinese word segmentation methods on IR has received extensive attention in the literature (Nie et al., 2000; Peng et al., 2002a; Peng et al., 2002b; Huang et al., 2000; Huang et al., 2003; Liu et al., 2008; Shi and Nie, 2009).",
                    "sid": 37,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Foo and Li (2004) tested the effects of manual segmentation and various character-based segmentations.",
                    "sid": 38,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast with most related work that only reports the overall performance, they provide an in-depth analysis of query results.",
                    "sid": 39,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They note that a small test collection diminishes the significance of the results.",
                    "sid": 40,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a series of papers on Chinese IR, Peng and Huang compared various segmentation methods in IR, and proposed a new segmentation method (Peng et al., 2002a; Peng et al., 2002b; Huang et al., 2000; Huang et al., 2003).",
                    "sid": 41,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their experiments suggest that the relationship between segmentation accuracy and retrieval performance is non-monotonic, ranging from 44%-95%.",
                    "sid": 42,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They hypothesize that weak word segmenters are able to improve the accuracy of Chinese IR by breaking compound words into smaller constituents.",
                    "sid": 43,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Shi and Nie (2009) proposed a probability- based IR score function that combines a unigram score with a word score according to “phrase inseparability.” Candidates for words in the query are selected by a standard segmentation program.",
                    "sid": 44,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their results show a small improvement in comparison with a static combination of unigram and word methods.",
                    "sid": 45,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Liu et al.",
                    "sid": 46,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) is the research most similar to our proposed method.",
                    "sid": 47,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They point out that current segmentation methods which treat segmentation as a classification problem are not suitable for Chinese IR.",
                    "sid": 48,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They propose a ranking support vector machine (SVM) model to predict the internal association strength (IAS) between characters, which is similar to our concept of tightness.",
                    "sid": 49,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, they do not analyze their segmentation accuracy with respect to a standard corpus, such as Chinese Treebank.",
                    "sid": 50,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their method does not reliably segment function words, mistakenly identifying “\"J ” (’s people) as tight, for example.",
                    "sid": 51,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Unlike their approach, our segmentation method tackles the problem by combining the tightness measure with a general segmentation method.",
                    "sid": 52,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chinese word segmentation is closely related to multiword expression extraction.",
                    "sid": 53,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "McCarthy et al.",
                    "sid": 54,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2003) investigate various statistical measures of compositionality of candidate multiword verbs.",
                    "sid": 55,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Silva et al.",
                    "sid": 56,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1999) propose a new compositionality measure based on statistical information.",
                    "sid": 57,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main difference with Xu et al.’s measure is that the latter is focused on word sense disambiguation.",
                    "sid": 58,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In terms of multiword expressions in IR, Vechtomova (2001) propose several approaches, such as query expansion, to incorporating English multiword expressions in IR.",
                    "sid": 59,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Braschler and Rip- plinger (2004) analyze the effect of stemming and decompounding on German text retrieval.",
                    "sid": 60,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, Chinese compound segmentation in IR is a thorny issue and needs more investigation for the reasons mentioned earlier.",
                    "sid": 61,
                    "ssid": 25,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "semantic tightness continuum. ",
            "number": "3",
            "sents": [
                {
                    "text": "We adopt the method developed by (Xu et al., 2009) for Chinese semantic unit tightness measure, which was shown to outperform the point- wise mutual information method.",
                    "sid": 62,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the sake of completeness we briefly describe the basic approach here.",
                    "sid": 63,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The input of the measure is the probability distribution of a unit’s segmentation patterns, i.e., potential segmentation candidates.",
                    "sid": 64,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The output is a tightness value; the greater the value, the tighter the unit.",
                    "sid": 65,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we focus on 4- gram sequences because 4-character compounds are the most prominent in Chinese.",
                    "sid": 66,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are eight possible segmentations of any 4-character sequence: “ABCD,” “A|BCD,” “A|B|CD,” etc.For a sequence of n characters, there are 2n−1 po tential segmentations.",
                    "sid": 67,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Equation 1 below defines the tightness measure.",
                    "sid": 68,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "application to chinese ir. ",
            "number": "4",
            "sents": [
                {
                    "text": "We propose a novel approach to segmentation for Chinese IR which is based on the tightness measure.",
                    "sid": 69,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our segmenter revises the output of a general segmenter according to the tightness of units.",
                    "sid": 70,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The intuition behind our method is that segmentation based on tightness of units will lead to better IR performance.",
                    "sid": 71,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, keeping “Bi til O �” (Pinatubo) as a unit should lead to better results than segmenting it into “Bi(skin)|til(include)|O(picture)|�(large)”.",
                    "sid": 72,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, segmenting the compositional phrase “4m�00” (Kuwait country) into “4m �(Kuwait)|00(country)” can improve recall.",
                    "sid": 73,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We revise an initial segmentation in two steps: first, we combine components that should not have been separated, such as “BitilO�” (Pinatubo); second, we split units which are compositional, such as “4m�00” (Kuwait country).",
                    "sid": 74,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to combine components, we first extract 4-gram non-compositional compounds whose tightness values are greater than a threshold σ1 in a reference corpus, and then revise a general segmenter by combining two separated words if their combination is in the list.",
                    "sid": 75,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach is similar to the popular longest match first method (LMF), but with segmentation chunks instead of characters, and with the compound list serving as the lexicon.",
                    "sid": 76,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, consider a sequence “ABCDEFGHIGK,” which a general segmenter annotates as “ABC|D|E|F|G|HI|GK.”  ♯P t(s) If our compound list constructed according to the  max(♯P t(s1 |s2 ))+ 1 tightness measure contains “DEFG”, the re ratio = if ♯P t(s) > σ { }  undef otherwise (1) vised segmentation will be “ABC|DEFG|HI|GK.” Units of length less than 4 are segmented by using the LMF rule against a dictionary.",
                    "sid": 77,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Equation 1, ♯P t(s) stands for frequencies of segmentation patterns of a potential semantic unit s; P t(s1|s2) is a pattern which segments the unit s into two parts: s1 and s2; σ is a threshold to exclude rare patterns; and N is a smoothing factor which is set as the number of documents.",
                    "sid": 78,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that when the first part of the denominator is zero, the ratio of the unit will be very high.",
                    "sid": 79,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Intuitively, the lack of certain separating patterns in the data is evidence for the tightness of the units.",
                    "sid": 80,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to split a compositional unit, we set the additional thresholds σ2, σ3, and σ4, and employ the segmentation rules in Equation 2.",
                    "sid": 81,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The intuition comes from the pattern lattice of a unit (Figure 1).",
                    "sid": 82,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the patterns on the same level, the most frequent pattern suggests the most reasonable segmentation.",
                    "sid": 83,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the patterns on different levels, the frequency of each level indicates the tightness of the unit.",
                    "sid": 84,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1.",
                    "sid": 85,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Lattice of the 8 Patterns.",
                    "sid": 86,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "if “B” is inserted, but the delimiter between “B” and “C” depends on the confidence values of the first two segmentation patterns.",
                    "sid": 87,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the delimiter between “C” and “D” depends on the result of voting among the three 4-gram segmentations.",
                    "sid": 88,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two steps of combining and splitting can either be applied in succession or separately.",
                    "sid": 89,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the former case, σ1 must be greater or equal to σ2.",
                    "sid": 90,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the remainder of this paper, we refer to the first step as “Tight Combine,” and to the second step applied after the first step as “Tight Split.” Note that the second method can be used to segment sentences directly instead of revising the output of a general segmenter.",
                    "sid": 91,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method, which we refer to as “Online Tight,” has the same shortcoming as the method of Liu et al.",
                    "sid": 92,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008), namely it frequently fails to segment function words.",
                    "sid": 93,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For ex ample, it erroneously identifies “\"J ” (’s people) v1 = ♯P t(ABCD) max(♯P t(A|BCD),♯P t(AB|CD),♯P t(ABC|D))+ 1 > σ2 as tight.",
                    "sid": 94,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we do not attempt to embed it then “ABCD” is one unit; else if max(♯P t(A|BCD),♯P t(AB|CD),♯P t(ABC|D))+ 1 max(♯P t(A|B|CD),♯P t(A|BC|D),♯P t(AB|C|D))+ 1 into the IR systems discussed in Section 6.",
                    "sid": 95,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "test collection. ",
            "number": "5",
            "sents": [
                {
                    "text": "v2 = then “ABCD” is segmented into two parts; else if N > σ3 N We analyzed the currently available Chinese test v3 = max(♯P t(A|B|CD ),♯P t(A|BC|D ),♯P t(AB|C|D ))+ 1 ♯ P t ( A | B | C | D ) + 1 > σ4 collect ion of TREC, and found it unsuit able for N then “ABCD” is segmented into three parts; else “ABCD” is segmented into four parts; (2) evaluating different strategies of compound seg mentation.",
                    "sid": 96,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One problem with the TREC data is that the Chinese queries (topic titles) have too many keywords.",
                    "sid": 97,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to the output of ICTWe apply the rules in Equation 2 to the se quence of 4-grams, with simple voting for selecting the segmentation pattern.",
                    "sid": 98,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, within the sequence “ABCDEF,” three 4-gram patterns are considered: “ABCD,” “BCDE,” and “CDEF.” If only one of the 4-grams contains a segmentation delimiter, the insertion of the delimiter depends only upon that 4-gram.",
                    "sid": 99,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If two 4-grams contain the same delimiter, the insertion of the delimiter depends upon the two 4-grams.",
                    "sid": 100,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the two 4-grams disagree on the segmentation, a confidence value is calculated as in Equation 3, confidence = vi − σi+1, (3) where i ∈ [1, 2, 3].",
                    "sid": 101,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If three 4-grams contain the same delimiter, voting is employed to decide the segmentation.",
                    "sid": 102,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Returning to our example, suppose that the first 4-gram is segmented as “A|B|C|D,” the second as “BC|DE,” and the third as “C|DE|F.” Then the segmentation delimiter between “A” and CLAS, a general segmenter, the average length of Chinese queries is 12.2 words; in contrast, the average length of English ad-hoc queries in TREC 5 and 6 (English topics 251350) is 4.7.",
                    "sid": 103,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even if we use English translation of the Chinese queries instead, the average length is still more than 7 words.",
                    "sid": 104,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The problem with long queries is that they introduce complicating effects that interact in ways difficult to understand.",
                    "sid": 105,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example is the co-occurrence between different keywords in the base corpus.",
                    "sid": 106,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sometimes a completely correct segmentation causes a decrease in IR performance because the score function assigns a higher score to less important terms in a topic.",
                    "sid": 107,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, for query 47 (Trec6 dataset), “$1f�,BitilO � ;)( Ll , ;)( Ll 1i , !;6 1< , -l £” (Philippines, Mount Pinatubo, volcanic ash, magma, eruption), preserving the unit Pinatubo makes the average precision drop from 0.76 to 0.62 as compared to the segmentation “Bi|til|O|�”.",
                    "sid": 108,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The score of the unit is lower than that the sum of its components, which results in a relatively low ranking for some relevant documents.",
                    "sid": 109,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another problem with the TREC Chinese test collection is the small number of queries (54).",
                    "sid": 110,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of of queries containing non-compositional words is smaller still.",
                    "sid": 111,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, the other available corpus, NTCIR, comprises only 50 queries.",
                    "sid": 112,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to be confident of our results, we would like to have a more substantial number of queries containing units of varying tightness.",
                    "sid": 113,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of the shortcomings of available data sets, we created our own test collection.",
                    "sid": 114,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are three components that define an IR test collection: a query set, a corpus from which relevant documents are retrieved, and relevance judgements for each query.",
                    "sid": 115,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our criteria for gathering these components are as follows.",
                    "sid": 116,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the set of queries should contain both tight queries and loose queries.",
                    "sid": 117,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, there should be tight queries such as “ ” (match maker), loose queries such as “J&&:fr” (Shanghai customs), and queries with tightness values in between, such as “JLRq:>J” (machine learning).",
                    "sid": 118,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the queries should be realistic, rather than constructed by introspection.",
                    "sid": 119,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to meet these requirements we randomly chose 4-gram noun phrases (tagged by ICTCLAS) from the TREC corpus.",
                    "sid": 120,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "51 queries are from a real data set, the Sogou query logs2.",
                    "sid": 121,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining 152 queries, which are selected manually based on the initial 51 queries, represent queries that IR system users are likely to enter.",
                    "sid": 122,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, queries of locations and organizations are more likely than queries such as “how are you.” Finally, the queries should not be too general (i.e., resulting in too many relevant documents found), nor too specific (no relevant documents).",
                    "sid": 123,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we selected the 4-grams which had the corresponding document frequency in the TREC corpus between 30 and 300.",
                    "sid": 124,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second set of criteria concerns the relevance judgements of documents.",
                    "sid": 125,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As our retrieval corpus, we adopted the TREC Mandarin corpus, which contains 24,959 documents.",
                    "sid": 126,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of resource limitation, we used the Minimum Test Col 2 Sogou query logs 2007 can be downloaded at http://www.sogou.com/labs/dl/q.html.",
                    "sid": 127,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "lection (MTC) method (Carterette et al., 2006).",
                    "sid": 128,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The method pools documents in such a way that the documents which are best for discriminating between different IR systems are judged first.",
                    "sid": 129,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We applied this method on a document set that contains all of the top 100 results of 8 IR systems (two score functions, tf*idf and BM25, 4 indexing methods, unigram, bigram, ICTCLAS segmentation, and our Tight Combine segmentation).",
                    "sid": 130,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The systems were implemented with the Lucene framework (http://lucene.apache.org/).",
                    "sid": 131,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last criterion determines which document is relevant to a query.",
                    "sid": 132,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Annotators’ opinions vary about whether a document is relevant to a topic.",
                    "sid": 133,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Is having the query in a document enough to be the criterion of relevance?",
                    "sid": 134,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the query “Beijing airport,” should the document that contains the sentence “Chairman Mao arrived at the Beijing airport yesterday,” be classified as relevant?",
                    "sid": 135,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since our goal is to analyze the relationship between Chinese word segmentation, and IR, we use weak relevant judgements.",
                    "sid": 136,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is more related to score functions to distinguish weak relevance from strong relevance, that is, whether the query is the topic of the document.",
                    "sid": 137,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means the above document is judged as relevant for the query “Beijing airport.” In summary, our own test collection has about 200 queries, and at least 100 judged documents per query with the TREC corpus as our base corpus3.",
                    "sid": 138,
                    "ssid": 43,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "6",
            "sents": [
                {
                    "text": "We conducted a series of experiments in word- based Chinese information retrieval, with the aim of establishing which segmenter is best for CIR, while pursuing the best segmentation performance in terms of segmented corpus is not the main crux.",
                    "sid": 139,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we first present the accuracy of different segmentation methods, and then discuss the results of IR systems.",
                    "sid": 140,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1 Chinese Word Segmentation.",
                    "sid": 141,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ICTCLAS is a Chinese segmentation tool built by the Institute of Computing Technology, Chinese Academy of Sciences.",
                    "sid": 142,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its segmentation model is a 3 The query set and relevance judgements are available at http://www.cs.ualberta.ca/˜yx2/research.html class-based hidden Markov model (HMM) model (Zhang et al., 2003).",
                    "sid": 143,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The segmenter is trained from manually segmented corpus, which makes it ignore both the tightness of units and unknown words such as “BitilO�” (Pinatubo), which are difficult to identify.",
                    "sid": 144,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this experiment, we segmented the Chinese Treebank using ICTCLAS and our three methods that employ the tightness measure.",
                    "sid": 145,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The evaluation is based on the manual segmentation of the corpus.",
                    "sid": 146,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluated the methods on the entire Treebank corpus, employing 10-cross validation for result significance verification.",
                    "sid": 147,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to measure the tightness of Chinese semantic units, pattern distributions of every 4- gram were extracted from the Chinese Gigaword corpus.",
                    "sid": 148,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tight Combine is the ICTCLAS refined segmentation that employs the non-compositional compound list from the Chinese Gigaword corpus.",
                    "sid": 149,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The threshold for non-compositional compound σ1 is set to 11.",
                    "sid": 150,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tight Split is the refined segmentation of Tight Combine using Equation 2.",
                    "sid": 151,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Online Tight is the segmentation using Equation 2 directly.",
                    "sid": 152,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Tight Split and Online Tight, we employed a lexicon which contains 41,245 words, and set the thresholds σ2, σ3, and σ4 to 11, 0.01, and 0.01, respectively.",
                    "sid": 153,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parameters σ1 and σ2 are set according to the observation that the percentage of non-compositional units is high when the tightness is greater than 11 for all the 4-grams in the Chinese Gigaword corpus.",
                    "sid": 154,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other two parameters were established after experimenting with several parameter pairs, such as (1,1), (0.1, IC T C L A S 88 .8 % Ti gh t C o m bi ne 89 .0 % Ti gh t S pli t 89 .1 % O nli ne Ti gh t 80 .5 % Table 1.",
                    "sid": 155,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Segmentation accuracy of different segmenters.",
                    "sid": 156,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "words.",
                    "sid": 157,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since it is based on ICTCLAS, Tight Split does a good job in segmenting function words such as verbal particles which represent past tense “T” and the nominalizer “\"J.” Online Tight tends to combine these words with the consecutive one.",
                    "sid": 158,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, considering “;::�T” (cumulated), the Treebank and Tight Split segment itinto “;:: �|T” (cumulate + particle); while On line Tight leaves it unsegmented.",
                    "sid": 159,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.2 IR Experiment Setup.",
                    "sid": 160,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We conducted our information retrieval experiments using the Lucene package (Hatcher and Gospodnetic, 2004).",
                    "sid": 161,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The documents and queries were segmented by our three approaches before indexing and searching process.",
                    "sid": 162,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to analyze the performance of our segmentation methods with different retrieval systems, we employed two score functions: the BM25 function (Peng et al., 2002b) 4; and BM25Beta (Function 4), which prefers documents with more query terms.",
                    "sid": 163,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Score(Q, D) = { T ∑T 0.1), and (0.1, 0.01).",
                    "sid": 164,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose the one with the best segmentation accuracy according to the stan (1+β)∗N i=0 score(ti , D) if T < N i=0 score(ti , D) if T = N (4) dard corpus.",
                    "sid": 165,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 shows the mean accuracy result over the 10 folders.",
                    "sid": 166,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The accuracy is the ratio of the number of correctly segmented intervals to the number of all intervals.",
                    "sid": 167,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result shows that our method improves over the ICTCLAS segmentation result, but the improvement is not statistically significant (measured by t-test).",
                    "sid": 168,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The only significant result is that Online tight is worse than other methods.",
                    "sid": 169,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Surprisingly, there is a large gap between Tight Split and Online Tight, although they employ the same parameters.",
                    "sid": 170,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It turns out the major difference lies in the segmentation of function In the above equation, score(ti, D) is the score of the term ti in the document D. Although we used BM25 as our base score function for score(ti, D), it can be replaced by other score functions, such as tf*idf, or a probability language model.",
                    "sid": 171,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "β is a parameter to control a penalty component for those documents that do not contain all the query terms; T is the number of distinctive query terms in the document; and N is the number of query terms.",
                    "sid": 172,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The function penalizes documents that do not contain all the query terms, 4 An implementation of BM25 into Lucene can be downloaded at http://arxiv.org/abs/0911.5046 B M 2 5 B M 25 B et a IC T C L A S 62 .7 8 % 7 0 . 7 9 % Ti gh t C o m bi ne 65 .9 2 % 7 1 . 1 9 % Ti gh t S pli t 63 .4 0 % 7 0 . 9 5 % Table 2.",
                    "sid": 173,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MAP of different IR systems with different segmenters.",
                    "sid": 174,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "which is an indirect way of incorporating proximity distance 5.",
                    "sid": 175,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.3 IR Experiment Results.",
                    "sid": 176,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows the comparison of our two segmenters to ICTCLAS on the IR task.",
                    "sid": 177,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of IR systems was measured by mean average precision (MAP) of the query set.",
                    "sid": 178,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results show that Tight Combine is better than the ICTCLAS segmentation, especially when using BM25.",
                    "sid": 179,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relationship between Tight Split and ICTCLAS is not clear.",
                    "sid": 180,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to give a more in-depth analysis of the word segmentation methods with respect to the targeted phenomenon of semantic units, we classified the 200 queries into three categories according to their tightness as measured by function 1.",
                    "sid": 181,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The three classes are queries with tight ness in ranges [+∞, 10), [10, 1), and [1, 0), which contain 54, 41, and 108 queries respectively.",
                    "sid": 182,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Queries in the range [+∞, 10) are tight queries, such as “�E�.il” (Virginia).",
                    "sid": 183,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Queries in the range [1, 0) are loose queries, such as “) -B0RJ” (advertising company).",
                    "sid": 184,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other queries are those compounds which have ambiguous segmentations, such as “�JJ&M” (chain reaction).",
                    "sid": 185,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because the classification was based on the tightness measure, there are some errors.",
                    "sid": 186,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “ B!Jcq:” (Renmin University) was classified as a loose query although it should at least be in the middle range.",
                    "sid": 187,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The three classes cover the whole tightness continuum, i.e. the whole possible query set.",
                    "sid": 188,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows the MAP with respect to these classes for the word segmentation methods.",
                    "sid": 189,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For queries with tightness less than 10, the results of ICTCLAS and Tight Combine are approximately equal, which is not surprising since with few ex 5 We also experimented with replacing β with the tightness value, but the results were not substantially different.",
                    "sid": 190,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3.",
                    "sid": 191,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results on three query categories.",
                    "sid": 192,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ceptions they have the same segmentation for both queries and documents.",
                    "sid": 193,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the interesting case of segmentation of tight units, i.e. queries in the range [+∞, 10), the results show clear superiority for IR systems based on our segmentation methods.",
                    "sid": 194,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When using BM25, MAP is 86.44% for Tight Combine, as compared to 74.48% for standard word segmentation . The advantage of Tight Combine over ICTCLAS is that it combines units such as “Sf iJ JlJi” (plate glass) as the term is tight, while ICTCLAS segments that unit into “SfiJ” (plate) and “Jl Ji” (glass).",
                    "sid": 195,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is evidence that word segmentation models based on the tight measure are better than models trained on a human annotated corpus which ignored tightness information.",
                    "sid": 196,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Interestingly, Tight Split is superior in the range [+∞, 10), although the segmentation for these queries is the same as with Tight Combine.",
                    "sid": 197,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When we analyzed the instances, we found it improved IR results of proper nouns.",
                    "sid": 198,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possible explanation is that splitting of proper nouns such as “�E�.ilj” (Virginia state) in documents improved the recall even when the segmentation of the queries remained the same.",
                    "sid": 199,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, for query “� E � .il” (Virginia), documents which contain “�E�.ilj” (Virginia state) should be retrieved.",
                    "sid": 200,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, since ICTCLAS treats “�E �.ilj” as a word, those documents are missed.",
                    "sid": 201,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, Tight Split segments the sequence into “�E �.il|j,” which results in the retrieval of those documents.",
                    "sid": 202,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the range of [10, 1), the result is mixed.",
                    "sid": 203,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For some instances, Tight Split is worse than Tight Combine and ICTCLAS, as it segments queries such as “� JJ & M” (chain reaction).",
                    "sid": 204,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, in other instances, it is better than Tight Combine and ICTCLAS since it segments queries such as “00Wt!ttlt” (international chess).",
                    "sid": 205,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The result suggests that the setting of the threshold for non-compositional terms should be below 10.",
                    "sid": 206,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the range of [1, 0), the result is also mixed.",
                    "sid": 207,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One reason for the low performance of Tight Split is that the tightness measure is not precise for those queries, which affects the segmentation.",
                    "sid": 208,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, splitting the queries “I )E}J” (labor movement) and “9=LlJcq:” (Zhongshan University) decreases the IR performance dramatically.",
                    "sid": 209,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In future work, we would like to investigate this problem by segmenting queries manually according to their tightness.",
                    "sid": 210,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the manual segmentation is superior, it would provided evidence for the hypothesis that segmentation based on tightness is superior.",
                    "sid": 211,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The difference between BM25 and BM25 Beta in the range [10, 1) suggests that for Chinese IR, it is better to segment text in a more fine- grained way, and combine terms through a score function.",
                    "sid": 212,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, for queries such as “� JJ&M” (chain reaction), for which splitting the unit is worse, BM25 Beta decreases the negative effect of splitting dramatically.",
                    "sid": 213,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the query “ t,f{:fr” (life insurance), when using BM25, Tight Split is worse than ICTCLAS (average precision 0.59 vs. 0.66); but when using BM25 Beta, it is better than ICTCLAS (average precision 0.72 vs. 0.66).",
                    "sid": 214,
                    "ssid": 76,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "7",
            "sents": [
                {
                    "text": "helps the in-depth analysis for the performance of different IR systems on different queries.",
                    "sid": 215,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also plan to gather more queries and more judged documents in order to further analyze the influence of the proper treatment of semantic units in Chinese information retrieval.",
                    "sid": 216,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A large query set could also make it possible to employ machine learning models for IR (Song et al., 2009).",
                    "sid": 217,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}