{
    "ID": "W11-1104",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Word Sense Induction (WSI) is an unsupervised approach for learning the multiple senses of a word.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Graph-based approaches to WSI frequently represent word co-occurrence as a graph and use the statistical properties of the graph to identify the senses.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We reinterpret graph-based WSI as community detection, a well studied problem in network science.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relations in the co-occurrence graph give rise to word communities, which distinguish senses.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our results show competitive performance on the SemEval2010 WSI Task.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Many words have several distinct meanings.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “law” may refer to legislation, a rule, or police depending on the context.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word Sense Induction (WSI) discovers the different senses of a word, such as “law,” by examining its contextual uses.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By deriving the senses of a word directly from a corpus, WSI is able to identify specialized, topical meanings in domains such as medicine or law, which predefined sense inventories may not include.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "aWe consider graph-based approaches to WSI, which typically construct a graph from word occurrences or collocations.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The core problem is how to identify sense-specific information within the graph in order to perform sense induction.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Current approaches have used clustering (Dorow and Widdows, 2003; Klapaftis and Manandhar, 2008) or statistical graph models (Klapaftis and Manandhar, 2010) to identify sense-specific subgraphs.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We reinterpret the challenge of identifying sense- specific information in a co-occurrence graph as one of community detection, where a community is de fined as a group of connected nodes that are more connected to each other than to the rest of the graph (Fortunato, 2010).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Within the co occurrence graph, we hypothesize that communities identify sense- specific contexts for each of the terms.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Community detection identifies groups of contextual cues that constrain each of the words in a community to a single sense.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To test our hypothesis, we require a community detection algorithm with two key properties: (1) a word may belong to multiple, overlapping communities, which is necessary for discovering multiple senses, and (2) the community detection may be hierarchically tuned, which corresponds to sense granularity.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we adapt a recent, state of the art approach, Link Clustering (Ahn et al., 2010).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our initial study suggests that community detection offers competitive performance and sense quality.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "word sense induction. ",
            "number": "2",
            "sents": [
                {
                    "text": "A co-occurrence graph is fundamental to our approach; terms are represented as nodes and an edge between two nodes indicates the terms’ co- occurrence, with a weight proportional to frequency.",
                    "sid": 19,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While prior work has focused on clustering the nodes to induce senses, using Link Clustering (Ahn et al., 2010), we cluster the edges, which is equivalent to grouping the word collocations to identify sense-specific contexts.",
                    "sid": 20,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We summarize our approach as four steps: (1) selecting the contextual cues, (2) building a co occurrence graph, (3) performing community detection on the graph, and (4) sense labeling new contexts using the discovered communities.",
                    "sid": 21,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Context Refinement Representing the co- occurrence graph for all terms in a context is 24 Proceedings of the TextGraphs6 Workshop, pages 24–28, Portland, Oregon, USA, 1924 June 2011.",
                    "sid": 22,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2011 Association for Computational Linguistics prohibitively expensive.",
                    "sid": 23,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, often only a subset of the terms in a context constrain the sense of an ambiguous word.",
                    "sid": 24,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we refine a word’s context to include only a subset of the terms present.",
                    "sid": 25,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following previous work (Ve´ronis, 2004), we select only nouns in the context.",
                    "sid": 26,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Early experiments indicated that including infrequent terms in the co-occurrence graph yielded poor performance, which we attribute to having too few connecting edges to identify meaningful community structure.",
                    "sid": 27,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we include only those nouns occurring in the most frequent 5000 tokens, which are likely to be representative the largest communities in which a term takes part.",
                    "sid": 28,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Last, we include all the nouns and verbs used in the SemEval 2010 WSI Task (Manandhar et al., 2010), which are used in our evaluation.",
                    "sid": 29,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The selected context terms are then stemmed using the Porter stemmer.",
                    "sid": 30,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Building the Co-occurrence Graph The graph is iteratively constructed by adding edges between the terms from a context.",
                    "sid": 31,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each pairwise combination of terms, an edge is added and its weight is increased by 1.",
                    "sid": 32,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This step effectively embeds a clique if it did not exist before, connecting all of the context’s words within the graph.",
                    "sid": 33,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once all contexts have been seen, the graph is then pruned to remove all edges with weight below a threshold τ = 25.",
                    "sid": 34,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This step removes edges form infrequent collo-.",
                    "sid": 35,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "cations, which may not contribute sufficient graph structure for community detection, and as a practical consideration, greatly speeds up the community Figure 1: A portion of the local co-occurrence graph for “mouse” from the SemEval2010 Task 14 corpus ties we selected the approach of Ahn et al.",
                    "sid": 36,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010), summarized next, which performs well for overlapping community structure.",
                    "sid": 37,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the edges are clustered using an unweighted similarity function based on the neighbors of two edges, ei,j and ei,k: sim(ei,j, ei,k) = nj∩nk , where ∪ni denotes the node i and its neighbors.",
                    "sid": 38,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This similarity reflects the percentage of terms that co occur in common with the term for nodes j and k, independent of the terms that co-occur with the shared term for i. For example, in Figure 1, the similarity for the edges connecting “mouse” with “user” and “software,” 2 , measures the overlap in the neighbors detection process.",
                    "sid": 39,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we note that parameter 5 of “user” and“software” independent of the neigh was largely unoptimized and future work may see a benefit from accounting for edge weight.",
                    "sid": 40,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Community Detection Within the co-occurrence graph, communities may have partial overlap.",
                    "sid": 41,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Figure 1 illustrates a part of the local graph for “mouse.” Two clear senses emerge from the neighbors: one for the input device and another for the animal.",
                    "sid": 42,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, the terms that correspond to one sense also co-occur with terms corresponding to the other sense, e.g., “information,” which hinders finding communities directly from disconnected components in the local neighborhood.",
                    "sid": 43,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finding sense-specific communities requires recognizing bors for “mouse,” such as “cell” and “size.” Using this similarity function, the edges are agglomeratively clustered into a dendrogram.",
                    "sid": 44,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the single-link criteria which iteratively merges the two clusters connected by the edge pair with the highest similarity.",
                    "sid": 45,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The dendrogram may then be cut at different levels to reveal different cluster granularities; cuts near the bottom of the dendrogram create a larger number of small groups of collocations, whereas cuts near the top create fewer, larger groups of collocations.",
                    "sid": 46,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To select the specific partitioning of the dendrogram into clusters, we select the solution that maximizes the partition density, which Ahnthat the co-occurring terms may be shared by mul et al.",
                    "sid": 47,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) define as D = 2 ), m mc−(nc−1) c− c−tiple communities.",
                    "sid": 48,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, to identify communi- where M is the number of edges in the graph, c de notes a specific cluster, and nc and mc are the number of nodes and edges in cluster c, respectively.",
                    "sid": 49,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final set of communities is derived from these partitions: a node is a member of each community in which one of its edges occurs.",
                    "sid": 50,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Last, we remove all communities of size 3 and below, which we interpret as having too few semantic constraints to reliably disambiguate each of its terms.",
                    "sid": 51,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sense Induction from Communities Each term in a community is treated as having a specific sense, with one sense per community.",
                    "sid": 52,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To label a contextual usage, we identify the community that best maps to the context.",
                    "sid": 53,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a given context, made of the set of SPD FScore 61.1 (3) V-Meas.",
                    "sid": 54,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.6 (18) S80/20 57.64 (18) S60/40 57.64 (16) SV 56.16 (9) 8.7 (6) 57.90 (18) 57.36 (17) SF 63.4 (1) 0 (26) 56.18 (21) 56.20 (21) BestF 63.3 (1) 0 (26) 58.69 (14) 58.24 (13) BestV 26.7 (25) 16.2 (1) 58.34 (16) 57.27 (17) BestS 49.8 (15) 15.7 (2) 62.44 (1) 61.96 (1) MFS 63.4 0 58.67 58.95 Table 1: Performance results on the SemEval2010 WSI Task, with rank shown in parentheses.",
                    "sid": 55,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reference scores of the best submitted systems are shown in the bottom.",
                    "sid": 56,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "words W , we score each community i, consisting of words C, using the Jaccard index weighted by community size: score(C , W ) = C |Ci∩W | . This |Ci∪W | similarity function favors mapping contexts to larger communities, which we interpret as having more semantic constraints.",
                    "sid": 57,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final sense labeling consists of the scores for all overlapping communities.",
                    "sid": 58,
                    "ssid": 40,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "evaluation. ",
            "number": "3",
            "sents": [
                {
                    "text": "We use the SemEval2 Task 14 evaluation (Manand 120 90 60 30 0 1.00 0.80 0.60 0.40 0.20 0.00 375 300 225 150 75 0 0.09 0.08 0.07 0.06 0.05 0.04 0.03 0.02 0.01 0.00 har et al., 2010) to measure the quality of induced senses.",
                    "sid": 59,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We summarize the evaluation as follows.",
                    "sid": 60,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Systems are provided with an unlabeled training corpus consisting of 879,807 multi-sentence contexts for 100 polysemous words, comprised of 50 nouns and 50 verbs.",
                    "sid": 61,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Systems induce sense representations for target words from the training corpus and then use those representations to label the senses of the target words in unseen contexts from a test corpus.",
                    "sid": 62,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the entire multi-sentence context for building the co-occurrence graph.",
                    "sid": 63,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The induced sense labeling is scored using two unsupervised and one supervised methods.",
                    "sid": 64,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The unsupervised scores consists of two contrasting measures: the paired FScore (Artiles et al., 2009) and the V-Measure (Rosenberg and Hirschberg, 2007).",
                    "sid": 65,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Briefly, the V-Measure rates the homogeneity and completeness of a clustering solution.",
                    "sid": 66,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Solutions that have word clusters formed from one gold-standard sense are homogeneous; completeness measures the degree to which a gold-standard sense’s instances are assigned to a single cluster.",
                    "sid": 67,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The paired FScore reflects the overlap of the solution and the gold standard in cluster assignments for all pairwise combi Merge Steps Prior to Cutting the Dendrogram (in thousands) Figure 2: V-Measure and paired FScore results for different partitionings of the dendrogram.",
                    "sid": 68,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The dashed vertical line indicates SP D nation of instances.",
                    "sid": 69,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The supervised evaluation transforms the induced sense clusters of a portion of the corpus into a word sense classifier, which is then tested on the remaining corpus.",
                    "sid": 70,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An 80/20 train-test split, S80/20, and 60/40 split, S60/40, are both used.",
                    "sid": 71,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results As a first measure of the quality of the induced senses, we evaluated both the solution that maximized the partition density, referred to as SP D, and an additional 5,000 solutions, evenly distributed among the possible dendrogram partitionings.",
                    "sid": 72,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows the score distribution for V Measure and paired FScore.",
                    "sid": 73,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 lists the scores and rank for SP D and the solutions that optimize the V-Measure, SV , and FScore, SF , among the 26 participating Task-14 systems.",
                    "sid": 74,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For comparison, we include the highest performing systems on each measure and the Most Frequent Sense (MFS) baseline.",
                    "sid": 75,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discussion Optimizing the partition density results in high performance only for the FScore; however, optimizing for the V-Measure yields competitive performance on both measures.",
                    "sid": 76,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The behavior is encouraging as most approaches submitted to Task 14 favor only one measure.",
                    "sid": 77,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 indicates a relationship between the V- Measure and community memberships.",
                    "sid": 78,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, using SV , we calculated the Pearson correlation between a term’s scores and the number of community memberships within a single solution.",
                    "sid": 79,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The correlation with the paired FScore, r = -0.167, was not statistically significant at p < .05, while correlation with the V-Measure, r = 0.417 is significant with p < 1.6e5.",
                    "sid": 80,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that at a specific community granularity, additional communities enable the WSI mapping process to make better sense distinctions between contexts.",
                    "sid": 81,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, we note that V-Measure begins to drop as the average community membership increases in solutions after SV , as shown in Figure 2.",
                    "sid": 82,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We suspect that as the agglomerative merge process continues, communities representing different senses become merged, leading to a loss of purity.",
                    "sid": 83,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lower performance of SP D and the impact of community memberships raises the important question of how to best select the communities.",
                    "sid": 84,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While co-occurrence graphs have been shown to exhibit small-world network patterns (Ve´ronis, 2004), optimizing for the general criterion of partition density that has performed well on such networks does not result in communities that map well to sense-specific contexts.",
                    "sid": 85,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe that this behavior is due to impact of the sense inventory; selecting a community solution purely based on the graph’s structure may not capture the correct sense distinctions, either having communities with too few members to distinguish between senses or too many members, which conflates senses.",
                    "sid": 86,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, a promising future direction is to examine whether the there exist features of the graph structure that would allow for recognizing the specific community solutions that correspond directly to different sense granularities without the need for an external evaluation metric.",
                    "sid": 87,
                    "ssid": 29,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "4",
            "sents": [
                {
                    "text": "We highlight those related works with connections to community detection.",
                    "sid": 88,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ve´ronis (2004) demon strated that word co-occurrence graphs follow a small-world network pattern.",
                    "sid": 89,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In his scheme, word senses are discovered by iteratively deleting the more connected portions of the subgraph to reveal the different senses’ network structure.",
                    "sid": 90,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our work capitalizes on this intuition of discovering sense- related subgraphs, but leverages formalized methods for community detection to identify them.",
                    "sid": 91,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dorow and Widdows (2003) identify sense- related subgraphs in a similar method to community detection for local region of the co occurrence graph.",
                    "sid": 92,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They use a random walk approach to identify regions of the graph that are sense-specific.",
                    "sid": 93,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Though not identical, we note that the random walk model has been successfully applied to community detection (Rosvall et al., 2009).",
                    "sid": 94,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, Dorow and Widdows (2003) performs graph clustering on a per- word basis; in contrast, the proposed approach identifies communities for the entire graph, effectively performing an all-word WSI.",
                    "sid": 95,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Klapaftis and Manandhar (2010) capture hierarchical relations between collocations using a Hierarchical Random Graph model where nodes are collocations and edges indicate their co occurrence, which improved performance over non-hierarchical models.",
                    "sid": 96,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our community detection approach also captures the hierarchical structure of the collocation graph, but uses a much simpler graphical representa tion that for n terms requires O(n) nodes and O(n2) edges, compared to O(n2) nodes and O(n3) edges for the above approach, which allows it to build the collocation graph from a larger set of terms.",
                    "sid": 97,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "5",
            "sents": [
                {
                    "text": "We have proposed a new graph-based method for WSI based on finding sense-specific word communities within a co-occurrence graph, which are then identify distinguish senses in new contexts.",
                    "sid": 98,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An initial analysis using the SemEval 2010 WSI task demonstrates competitive.",
                    "sid": 99,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "performance.",
                    "sid": 100,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Future research will address two potential avenues: (1) the impact of word frequency on community size and memberships and (2) identifying both graph properties and semantic relations within hierarchical communities that distinguish between sense granulari- ties.",
                    "sid": 101,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Software for the WSI model and for Link Clustering is available as a part of the S-Space Package (Jurgens and Stevens, 2010).",
                    "sid": 102,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}