{
    "ID": "W11-0311",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Subjectivity word sense disambiguation (SWSD) is automatically determining which word instances in a corpus are being used with subjective senses, and which are being used with objective senses.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SWSD has been shown to improve the performance of contextual opinion analysis, but only on a small scale and using manually developed integration rules.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we scale up the integration of SWSD into contextual opinion analysis and still obtain improvements in performance, by successfully gathering data annotated by non-expert annotators.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, by improving the method for integrating SWSD into contextual opinion analysis, even greater benefits from SWSD are achieved than in previous work.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thus more firmly demonstrate the potential of SWSD to improve contextual opinion analysis.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Often, methods for opinion, sentiment, and subjectivity analysis rely on lexicons of subjective (opinion-carrying) words (e.g., (Turney, 2002; Whitelaw et al., 2005; Riloff and Wiebe, 2003; Yu and Hatzivassiloglou, 2003; Kim and Hovy, 2004; Bloom et al., 2007; Andreevskaia and Bergler, 2008; Agarwal et al., 2009)).",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples of such words are the following (in bold): (1) He is a disease to every team he has gone to.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Converting to SMF is a headache.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The concert left me cold.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That guy is such a pain.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, even manually developed subjectivity lexicons have significant degrees of subjectivity sense ambiguity (Su and Markert, 2008; Gyamfi et al., 2009).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, many clues in these lexicons have both subjective and objective senses.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This ambiguity leads to errors in opinion and sentiment analysis, because objective instances represent false hits of subjectivity clues.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the following sentence contains the keywords from (1) used with objective senses: (2) Early symptoms of the disease include severe headaches, red eyes, fevers and cold chills, body pain, and vomiting.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently, in (Akkaya et al., 2009), we introduced the task of subjectivity word sense disambiguation (SWSD), which is to automatically determine which word instances in a corpus are being used with subjective senses, and which are being used with objective senses.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We developed a supervised system for SWSD, and exploited the SWSD output to improve the performance of multiple contextual opinion analysis tasks.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the reported results are promising, there are three obvious shortcomings.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we were able to apply SWSD to contextual opinion analysis only on a very small scale, due to a shortage of annotated data.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the experiments show that SWSD improves contextual opinion analysis, this was only on the small amount of opinion-annotated data that was in the coverage of our system.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two questions arise: is it feasible to obtain greater amounts of the needed data, and do SWSD performance improvements on contextual opinion analysis hold on a 87 Proceedings of the Fifteenth Conference on Computational Natural Language Learning, pages 87–96, Portland, Oregon, USA, 23–24 June 2011.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2011 Association for Computational Linguistics larger scale.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, the annotations in (Akkaya et al., 2009) are piggybacked on SENSEVAL sense- tagged data, which are fine-grained word sense annotations created by trained annotators.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A concern is that SWSD performance improvements on contextual opinion analysis can only be achieved using such fine-grained expert annotations, the availability of which is limited.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Third, (Akkaya et al., 2009) uses manual rules to apply SWSD to contextual opinion analysis.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although these rules have the advantage that they transparently show the effects of SWSD, they are somewhat ad hoc.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Likely, they are not optimal and are holding back the potential of SWSD to improve contextual opinion analysis.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To address these shortcomings, in this paper, we investigate (1) the feasibility of obtaining a substantial amount of annotated data, (2) whether performance improvements on contextual opinion analysis can be realized on a larger scale, and (3) whether those improvements can be realized with subjectivity sense tagged data that is not built on expert full- inventory sense annotations.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we explore better methods for applying SWSD to contextual opinion analysis.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "subjectivity word sense disambiguation. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Annotation Tasks.",
                    "sid": 29,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopt the definitions of subjective (S) and objective (O) from (Wiebe et al., 2005; Wiebe and Mi- halcea, 2006; Wilson, 2007).",
                    "sid": 30,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subjective expressions are words and phrases being used to express mental and emotional states, such as speculations, evaluations, sentiments, and beliefs.",
                    "sid": 31,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A general covering term for such states is private state (Quirk et al., 1985), an internal state that cannot be directly observed or verified by others.",
                    "sid": 32,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Objective expressions instead are words and phrases that lack subjectivity.",
                    "sid": 33,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The contextual opinion analysis experiments described in Section 3 include both S/O and polarity (positive,negative, neutral) classifications.",
                    "sid": 34,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The opinion-annotated data used in those experiments is from the MPQA Corpus (Wiebe et al., 2005; Wilson, 2007),1 which consists of news articles annotated for subjective expressions, including polarity.",
                    "sid": 35,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 Available at http://www.cs.pitt.edu/mpqa.",
                    "sid": 36,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.1 Subjectivity Sense Labeling For SWSD, we need the notions of subjective and objective senses of words in a dictionary.",
                    "sid": 37,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopt the definitions from (Wiebe and Mihalcea, 2006), who describe the annotation scheme as follows.",
                    "sid": 38,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Classifying a sense as S means that, when the sense is used in a text or conversation, one expects it to express subjectivity, and also that the phrase or sentence containing it expresses subjectivity.",
                    "sid": 39,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As noted in (Wiebe and Mihalcea, 2006), sentences containing objective senses may not be objective.",
                    "sid": 40,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, objective senses are defined as follows: Classifying a sense as O means that, when the sense is used in a text or conversation, one does not expect it to express subjectivity and, if the phrase or sentence containing it is subjective, the subjectivity is due to something else.",
                    "sid": 41,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both (Wiebe and Mihalcea, 2006) and (Su and Markert, 2008) performed agreement studies of the scheme and report that good agreement can be achieved between human annotators labeling the subjectivity of senses (κ values of 0.74 and 0.79, respectively).",
                    "sid": 42,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Akkaya et al., 2009) followed the same annotation scheme to annotate the senses of the words used in the experiments.",
                    "sid": 43,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this paper, we again use the same scheme and annotate WordNet senses of 90 new words (the process of selecting the words is described in Section 2.4).",
                    "sid": 44,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1.2 Subjectivity Sense Tagging The training and test data for SWSD consists of word instances in a corpus labeled as S or O, indicating whether they are used with a subjective or objective sense.",
                    "sid": 45,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because there was no such tagged data at the time, (Akkaya et al., 2009) created a data set by combining two types of sense annotations: (1) labels of senses within a dictionary as S or O (i.e., the subjectivity sense labels of the previous section), and (2) sense tags of word instances in a corpus (i.e., SENSEVAL sense-tagged data).2 The subjectivity sense labels were used to collapse the sense labels in the sense-tagged data into the two new senses, S and O. The target words (Akkaya et al., 2009) chose are the words tagged in SENSEVAL that are also members 2 Please see the paper for details on the SENSEVAL data used in the experiments.",
                    "sid": 46,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sense Set1 (Subjective) { attack, round, assail, lash out, snipe, assault } – attack in speech or writing; ”The editors attacked the House Speaker” { assail, assault, set on, attack } – attack someone emotionally; ”Nightmares assailed him regularly” S ense Set2 (Objective) { attack } – begin to injure; ”The cancer cells are attacking his l iver”; ”Rust is attacking the metal” { attack, aggress } – take the initiative and go on the offensive; ”The visiting team started to attack” Figure 1: Sense sets for target word “attack” (abridged).",
                    "sid": 47,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of the subjectivity lexicon of (Wilson et al., 2005; Wilson, 2007).3 There are 39 such words.",
                    "sid": 48,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Akkaya et al., 2009) chose words from a subjectivity lexicon because such words are known to have subjective usages.",
                    "sid": 49,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this paper, subjectivity sense-tagged data was obtained from the MTurk workers using the annotation scheme of (Akkaya et al., 2010).",
                    "sid": 50,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A goal is to keep the annotation task as simple as possible.",
                    "sid": 51,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the workers are not directly asked if the instance of a target word has a subjective or an objective sense, because the concept of subjectivity would be difficult to explain in this setting.",
                    "sid": 52,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead the workers are shown two sets of senses – one subjective set and one objective set – for a specific target word and a text passage in which the target word appears.",
                    "sid": 53,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their job is to select the set that best reflects the meaning of the target word in the text passage.",
                    "sid": 54,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The set they choose gives us the subjectivity label of the instance.",
                    "sid": 55,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A sample annotation task is shown below.",
                    "sid": 56,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An MTurk worker has access to two sense sets of the target word “attack” as seen in Figure 1.",
                    "sid": 57,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The S and O labels appear here only for the purpose of this paper; the workers do not see them.",
                    "sid": 58,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The worker is presented with the following text passage holding the target word “attack”: Ivkovic had been a target of intra-party feuding that has shaken the party.",
                    "sid": 59,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He was attacked by Milosevic for attempting to carve out a new party from the Socialists.",
                    "sid": 60,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this passage, the use of “attack” is most similar to the first entry in sense set one; thus, the correct answer for this problem is Sense Set-1.",
                    "sid": 61,
                    "ssid": 33,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "available at http://www.cs.pitt.edu/mpqa. ",
            "number": "3",
            "sents": [
                {
                    "text": "(Akkaya et al., 2010) carried out a pilot study where a subjectivity sense-tagged dataset was created for eight SENSEVAL words through MTurk.",
                    "sid": 62,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Akkaya et al., 2010) evaluated the non-expert label quality against gold-standard expert labels which were obtained from (Akkaya et al., 2009) relying on SENSEVAL.",
                    "sid": 63,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The non-expert annotations are reliable, achieving κ scores around 0.74 with the expert annotations.",
                    "sid": 64,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For some words, there may not be a clean split between the subjective and objective senses.",
                    "sid": 65,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For these, we opted for another strategy for obtaining MTurk annotations.",
                    "sid": 66,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rather than presenting the workers with WordNet senses, we show them a set of objective usages, a set of subjective usages, and a text passage in which the target word appears.",
                    "sid": 67,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The workers’ job is to judge which set of usages the target instance is most similar to.",
                    "sid": 68,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 SWSD System.",
                    "sid": 69,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We follow the same approach as in (Akkaya et al., 2009) to build our SWSD system.",
                    "sid": 70,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We train a different supervised SWSD classifier for each target word separately.",
                    "sid": 71,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This means the overall SWSD system consists of as many SWSD classifiers as there are target words.",
                    "sid": 72,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We utilize the same machine learning features as in (Akkaya et al., 2009), which are commonly used in Word Sense Disambiguation (WSD).",
                    "sid": 73,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Expert SWSD vs. Non-expert SWSD.",
                    "sid": 74,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Before creating a large subjectivity sense-tagged corpus via MTurk, we want to make sure that non- expert annotations are good enough to train reliable SWSD classifiers.",
                    "sid": 75,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we decided to compare the performance of a SWSD system trained on non- expert annotations and on expert annotations.",
                    "sid": 76,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this purpose, we need a subjectivity sense-tagged corpus where word instances are tagged both by expert and non-expert annotations.",
                    "sid": 77,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fortunately, we have such a corpus.",
                    "sid": 78,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As discussed in Section 3, (Akkaya et al., 2009) created a subjecvitivity sense- tagged corpus piggybacked on SENSEVAL.",
                    "sid": 79,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This gives us a gold-standard corpus tagged by experts.",
                    "sid": 80,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is also a small subjectivity sense-tagged corpus consisting of eight target words obtained from non-expert annotators in (Akkaya et al., 2010).",
                    "sid": 81,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This corpus is a subset of the gold-standard corpus from (Akkaya et al., 2009) and it consists of 60 tagged Acc p-value SWSDGOLD 79.2 SWSDMJL 78.4 0.542 SWSDMJC 78.8 0.754 Table 1: Comparison of SWSD systems instances for each target word.",
                    "sid": 82,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Actually, (Akkaya et al., 2010) gathered three labels for each instance.",
                    "sid": 83,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This gives us two options to train the non-expert SWSD system: (1) training the system on the majority vote labels (SWSDMJL) (2) training three systems on the three separate label sets and taking the majority vote prediction (SWSDMJC).",
                    "sid": 84,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, we train an expert SWSD system (SWSDGOLD) – a system trained on gold standard expert annotations.",
                    "sid": 85,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All these systems are trained on 60 instances of the eight target words for which we have both non-expert and expert annotations and are evaluated on the remaining instances of the gold-standard corpus.",
                    "sid": 86,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This makes a total of 923 test instances for the eight target words with a majority class baseline of 61.8.",
                    "sid": 87,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 reports micro-average accuracy of each system and the two-tailed p-value between the expert SWSD system and the two non-expert SWSD systems.",
                    "sid": 88,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The p-value is calculated with McNemar’s test.",
                    "sid": 89,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It shows that there is no statistically significant difference between classifiers trained on expert gold-standard annotations and non-expert annotations.",
                    "sid": 90,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adopt SWSDMJL in all our following experiments, because it is more efficient.",
                    "sid": 91,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4 Corpus Creation.",
                    "sid": 92,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For our experiments, we have multiple goals, which effect our decisions on how to create the subjectivity sense-tagged corpus via MTurk.",
                    "sid": 93,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we want to be able to disambiguate more target words than (Akkaya et al., 2009).",
                    "sid": 94,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This way, SWSD will be able to disambiguate a larger portion of the MPQA Corpus allowing us to evaluate the effect of SWSD on contextual opinion analysis on a larger scale.",
                    "sid": 95,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This will also allow us to investigate additional integration methods of SWSD into contextual opinion analysis rather than simple ad hoc manual rules utilized in (Akkaya et al., 2009).",
                    "sid": 96,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, we want to show that we can rely on non-expert annotations instead of expert annotations, which will make an annotation effort on a larger-scale both practical and feasible, timewise and costwise.",
                    "sid": 97,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Optimally, we could have annotated via MTurk the same subjectivity sense- tagged corpus from (Akkaya et al., 2009) in order to compare the effect of a non-expert SWSD system on contextual opinion analysis directly with the results reported for an expert SWSD system in (Akkaya et al., 2009).",
                    "sid": 98,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But, this would have diverted our resources to reproduce the same corpus and contradict our goal to extend the subjectivity sense-tagged corpus to new target words.",
                    "sid": 99,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, we have already shown in Section 2.3 that non-expert annotations can be utilized to train reliable SWSD classifiers.",
                    "sid": 100,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is reasonable to believe that similar performance on the SWSD task will reflect to similar improvements on contextual opinion analysis.",
                    "sid": 101,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we decided to prioritize creating a subjectivity sense-tagged corpus for a totally new set of words.",
                    "sid": 102,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We aim to show that the favourable results reported in (Akkaya et al., 2009) will still hold on new target words relying on non-expert annotations.",
                    "sid": 103,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose our target words from the subjectivity lexicon of (Wilson et al., 2005), because we know they have subjective usages.",
                    "sid": 104,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The contextual opinion systems we want to improve rely on this lexicon.",
                    "sid": 105,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We call the words in the lexicon subjectivity clues.",
                    "sid": 106,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At this stage, we want to concentrate on the frequent and ambiguous subjectivity clues.",
                    "sid": 107,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose frequent ones, because they will have larger coverage in the MPQA Corpus.",
                    "sid": 108,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose ambiguous ones, because these clues are the ones that are most important for SWSD.",
                    "sid": 109,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Choosing most frequent and ambiguous subjectivity clues guarantees that we utilize our limited resources in the most efficient way.",
                    "sid": 110,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We judge a clue to be ambiguous if it appears more than 25% and less than 75% of the times in a subjective expression.",
                    "sid": 111,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We get these statistics by simply counting occurrences in the MPQA Corpus inside and outside of subjective expressions.",
                    "sid": 112,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are 680 subjectivity clues that appear in the MPQA Corpus and are ambiguous.",
                    "sid": 113,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Out of those, we selected the 90 most frequent that have to some extent distinct objective and subjective senses in Word- Net, as judged by the coauthors.",
                    "sid": 114,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The coauthors annotated the WordNet senses of those 90 target words.",
                    "sid": 115,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each target word, we selected approximately 120 instances randomly from the GIGAWORD Corpus.",
                    "sid": 116,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a first phase, we collected three sets of MTurk an notations for the selected instances.",
                    "sid": 117,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this phase, MTurk workers base their judgements on two sense sets they observe.",
                    "sid": 118,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This way, we get training data to build SWSD classifiers for these 90 target words.",
                    "sid": 119,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The quality of these classifiers is important, because we will exploit them for contextual opinion analysis.",
                    "sid": 120,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, we evaluate them by 10-fold cross- validation.",
                    "sid": 121,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We split the target words into three groups.",
                    "sid": 122,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the majority class baseline of a word is higher than 90%, it is considered as skewed (skewed words have a performance at least as good as the majority class baseline).",
                    "sid": 123,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a target word improves over its majority class baseline by 25% in accuracy, it is considered as good.",
                    "sid": 124,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Otherwise, it is considered as mediocre.",
                    "sid": 125,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This way, we end up with 24 skewed, 35 good, and 31 mediocre words.",
                    "sid": 126,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are many possible reasons for the less reliable performance for the mediocre group.",
                    "sid": 127,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We hypothesize that a major problem is the similarity between the objective and subjective sense sets of a word, thus leading to poor annotation quality.",
                    "sid": 128,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To check this, we calculate the agreement between three annotation sets and report averages.",
                    "sid": 129,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The agreement in the mediocre group is 78.68%, with a κ value of 0.57, whereas the average agreement in the good group is 87.51%, with a κ value of 0.75.",
                    "sid": 130,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These findings support our hypothesis.",
                    "sid": 131,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the coauthors created usage inventories for the words in the mediocre group as described in Section 2.1.1.",
                    "sid": 132,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We initiated a second phase of MTurk annotations.",
                    "sid": 133,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We collect for the mediocre group another three sets of MTurk annotations for 120 instances, this time utilizing usage inventories.",
                    "sid": 134,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 10-fold cross-validation experiments show that nine of the 31 words in the mediocre group shift to the good group.",
                    "sid": 135,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only for these nine words, we accept the annotations collected via usage inventories.",
                    "sid": 136,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For all other words, we use the annotations collected via sense inventories.",
                    "sid": 137,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From now on, we will refer to this non-expert subjectivity sense-tagged corpus consisting of the tagged data for all 90 target words as the MTurkSWSD Corpus (agreement on the entire MTurkSWSD corpus is 85.54%, κ:0.71).",
                    "sid": 138,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 SWSD Integration.",
                    "sid": 139,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now that we have the MTurkSWSD Corpus, we are ready to evaluate the effect of SWSD on contextual opinion analysis.",
                    "sid": 140,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we apply our SWSD system trained on MTurkSWSD to both expression-level classifiers from (Akkaya et al., 2009): (1) the subjective/objective (S/O) classifier and (2) the contextual polarity classifier.",
                    "sid": 141,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both classifiers are introduced in Section 3.1 Our SWSD system can disambiguate 90 target words, which have 3737 instances in the MPQA Corpus.",
                    "sid": 142,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We refer to this subset of the MPQA Corpus as MTurkMPQA.",
                    "sid": 143,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This subset makes up the coverage of our SWSD system.",
                    "sid": 144,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that MTurkMPQA is 5.2 times larger than the covered MPQA subset in (Akkaya et al., 2009) referred as senMPQA.",
                    "sid": 145,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We try different strategies to integrate SWSD into the contextual classifiers.",
                    "sid": 146,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 3.2, we follow the same rule-based strategy as in (Akkaya et al., 2009) for completeness.",
                    "sid": 147,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 3.3, we introduce two new learning strategies for SWSD integration outperforming existing rule-based strategy.",
                    "sid": 148,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluate the improvement gained by SWSD on MTurkMPQA.",
                    "sid": 149,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Contextual Classifiers.",
                    "sid": 150,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The original contextual polarity classifier is introduced in (Wilson et al., 2005).",
                    "sid": 151,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the same implementation as in (Akkaya et al., 2009).",
                    "sid": 152,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This classifier labels clue instances in text as contextually negative/positive/neutral.",
                    "sid": 153,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The gold standard is defined on the MPQA Corpus as follows.",
                    "sid": 154,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a clue instance appears in a positive expression, it is contextually positive (Ps).",
                    "sid": 155,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If it appears in a negative expression, it is contextually negative (Ng).",
                    "sid": 156,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If it is in an objective expression or in a neutral subjective expression, it is contextually neutral (N).",
                    "sid": 157,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The contextual polarity classifier consists of two separate steps.",
                    "sid": 158,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first step is an expression-level neutral/polar (N/P) classifier.",
                    "sid": 159,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second step classifies only polar instances further into positive and negative classes.",
                    "sid": 160,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This way, the overall system performs a three-way classification (Ng/Ps/N).",
                    "sid": 161,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The subjective/objective classifier is introduced in (Akkaya et al., 2009).",
                    "sid": 162,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It relies on the same machine learning features as the N/P classifier (i.e. the first step of the contextual polarity classifier).",
                    "sid": 163,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The only difference is that the classes are S/O instead of N/P. The gold standard is defined on the MPQA Corpus in the following way.",
                    "sid": 164,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a clue instance appears in a subjective expression, it is contextually S. If it appears in an objective expression, it is contextually O. Both contextual classifiers are supervised.",
                    "sid": 165,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Baseline Acc OF SF MTurkMPQA 52.4% (O) OS/O R1R2 67.1 71.1 68.9 72.7 65.0 69.2 senMPQA 63.1% (O) OS/O R1R2 75.4 81.3 65.4 75.9 80.9 84.8 Table 2: S/O classifier with and without SWSD.",
                    "sid": 166,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Rule-Based SWSD Integration.",
                    "sid": 167,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Akkaya et al., 2009) integrates SWSD into a contextual classifier by simple rules.",
                    "sid": 168,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rules flip the output of the contextual classifier if some conditions hold.",
                    "sid": 169,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They make use of following information: (1) SWSD output, (2) the contextual classifier’s confidence and (3) the presence of another subjectivity clue – any clue from the subjectivity lexicon – in the same expression.",
                    "sid": 170,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the contextual S/O classifier, (Akkaya et al., 2009) defines two rules: one flipping the S/O classifier’s output from O to S (R1) and one flipping from S to O (R2).",
                    "sid": 171,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "R1 is defined as follows : if the contextual classifier decides a target word instance is contextually O and SWSD decides that it is used in a S sense, then SWSD overrules the contextual S/O classifier’s output and flips it from O to S, because an instance in a S sense will make the surrounding expression subjective.",
                    "sid": 172,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "R2 is a little bit more complex.",
                    "sid": 173,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is defined as follows: If the contextual classifier labels a clue instance as S but (1) SWSD decides that it is used in an O sense, (2) the contextual classifier’s confidence is low, and (3) there is no other subjectivity clue in the same expression, then R2 flips the contextual classifier’s output from S to O. The rationale behind R2 is that even if the target word instance has an O sense, there might be another reason (e.g. the presence of another subjectivity clue in the same expression) for the expression enclosing it to be subjective.",
                    "sid": 174,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the exact same rules and adopt the same confidence threshold.",
                    "sid": 175,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 holds the comparison of the original contextual classifier and the classifier with SWSD support on senMPQA as reported in (Akkaya et al., 2009) and on MTurkMPQA.",
                    "sid": 176,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "OS/O is the original S/O classifier; R1R2 is the system with SWSD support utilizing both rules.",
                    "sid": 177,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We report only R1R2, since (Akkaya et al., 2009) gets highest improvement utilizing both rules.",
                    "sid": 178,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3: N/P classifier with and without SWSD In Table 2 we see that R1R2 achieves 4% percentage points improvement in accuracy over OS/O on MTurkMPQA.",
                    "sid": 179,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The improvement is statistically significant at the p < .01 level with McNemar’s test.",
                    "sid": 180,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is accompanied with improvements both in subjective F-measure (SF) and objective F-measure (OF).",
                    "sid": 181,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not possible to directly compare improvements on senMPQA and MTurkMPQA since they are different subsets of the MPQA Corpus.",
                    "sid": 182,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SWSD support brings 24% error reduction on senMPQA over the original S/O classifier.",
                    "sid": 183,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In comparison, on MTurkMPQA, the error reduction is 12%.",
                    "sid": 184,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see that the improvements on the large MTurkMPQA set still hold, but not as strong as in (Akkaya et al., 2009).",
                    "sid": 185,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Akkaya et al., 2009) uses a similar rule to make the contextual polarity classifier sense-aware.",
                    "sid": 186,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, the rule is applied to the output of the first step (N/P classifier).",
                    "sid": 187,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rule, R4, flips P to N and is analogous to R2.",
                    "sid": 188,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the contextual classifier labels a clue instance as P but (1) SWSD decides that it is used in an O sense, (2) the contextual classifier’s confidence is low, and (3) there is no other clue instance in the same expression, then R4 flips the contextual classifier’s output from P to N. Table 3 holds the comparison of the original N/P classifier with and without SWSD support on senMPQA as reported in (Akkaya et al., 2009) and on MTurkMPQA.",
                    "sid": 189,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ON/P is the original N/P classifier; R4 is the system with SWSD support utilizing rule R4.",
                    "sid": 190,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since our main focus is not rule-based integration, we did not run the second step of the polarity classifier.",
                    "sid": 191,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We report the second step result below for the learning-based SWSD integration in section 3.4.",
                    "sid": 192,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Table 3, we see that R4 achieves 2.2 percentage points improvement in accuracy over ON/P on MTurkMPQA.",
                    "sid": 193,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The improvement is statistically significant at the p < .01 level with McNemar’s test.",
                    "sid": 194,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is accompanied with improvement only in objective F-measure (OF).",
                    "sid": 195,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SWSD support brings 12.4% error reduction on senMPQA (Akkaya et al., 2009).",
                    "sid": 196,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On MTurkMPQA, the error reduction is 8%.",
                    "sid": 197,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see that the rule-based SWSD integration still improves both contextual classifiers on MTurkMPQA, but the gain is not as large as on senMPQA.",
                    "sid": 198,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This might be due to the brittleness of the rule-based integration.",
                    "sid": 199,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Learning SWSD Integration.",
                    "sid": 200,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now that we can disambiguate a larger portion of the MPQA Corpus than in (Akkaya et al., 2009), we can investigate machine learning methods for SWSD integration to deal with the brittleness of the rule-based integration.",
                    "sid": 201,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we introduce two learning methods to apply SWSD to the contextual classifiers.",
                    "sid": 202,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the learning methods, we rely on exactly the same information as the rule-based integration: (1) SWSD output, (2) the contextual classifier’s output, (3) the contextual classifier’s confidence, and (4) the presence of another clue instance in the same expression.",
                    "sid": 203,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rationale is the same as for the rule-based integration, namely to relate sense subjectivity and contextual subjectivity.",
                    "sid": 204,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3.1 Method1 In the first method, we extend the machine learning features of the underlying contextual classifiers by adding (1) and (4) from above.",
                    "sid": 205,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We evaluate the extended contextual classifiers on MTurkMPQA via 10-fold cross-validation.",
                    "sid": 206,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tables 4 and 5 hold the comparison of Method1 (EXTS/O, EXTN/P) to the original contextual classifiers (OS/O, ON/P) and to the rule-based SWSD integration (R1R2, R4).",
                    "sid": 207,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We see substantial improvement for Method1.",
                    "sid": 208,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It achieves 39% error reduction over OS/O and 25% error reduction over ON/P. For both classifiers, the improvement in accuracy over the rule-based integration is statistically significant at the p < .01 level with McNemar’s test.",
                    "sid": 209,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3.2 Method2 This method defines a third classifier that accepts as input the contextual classifier’s output and the SWSD output and predicts what the contextual classifier’s output should have been.",
                    "sid": 210,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can think of this third classifier as the learning counterpart of the manual rules from Section 3.2, since it actually learns when to flip the contextual classifier’s output considering SWSD evidence.",
                    "sid": 211,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, this merger classifier relies on four machine learning features (1), (2), (3), (4) from above (the ex Acc OF SF OS/O 67.1 68.9 65.0 R1R2 71.1 72.7 69.2 EXTS/O 80.0 81.4 78.3 MERGERS/O 78.2 80.3 75.5 Table 4: S/O classifier with learned SWSD integration Acc NF PF ON/P 72.3 82.0 39.8 R4 74.5 84.0 37.8 EXTN/P 79.1 85.7 61.1 MERGERN/P 80.4 86.7 62.8 Table 5: N/P classifier with learned SWSD integration act same information used in rule-based integration).",
                    "sid": 212,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because it is a supervised classifier, we need training data where we have clue instances with corresponding contextual classifier and SWSD predictions.",
                    "sid": 213,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fortunately, we can use senMPQA for this purpose.",
                    "sid": 214,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We train our merger classifier on senMPQA (we get contextual classifier predictions via 10- fold cross-validation on the MPQA Corpus) and apply it to MTurkMPQA.",
                    "sid": 215,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use SVM classifier from the Weka package (Witten and Frank., 2005) with its default settings.",
                    "sid": 216,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tables 4 and 5 hold the comparison of Method2 (MERGERS/O, MERGERN/P) to the original contextual classifiers (Oo/s, ON/P) and the rule-based SWSD integration (R1R2, R4).",
                    "sid": 217,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It achieves 29% error reduction over OS/O and 29% error reduction over ON/P. The improvement on the rule-based integration is statistically significant at the p < .01 level with McNemar’s test.",
                    "sid": 218,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Method2 performs better (statistically significant at the p < .05 level) than Method1 for the N/P classifier but worse (statistically significant at the p < .01 level) for the S/O classifier.",
                    "sid": 219,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Improving Contextual Polarity.",
                    "sid": 220,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Classification We have seen that Method2 is the best method to improve the N/P classifier, which is the first step of the contextual polarity classifier.",
                    "sid": 221,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To assess the overall improvement in polarity classification, we run the second step of the contextual polarity classifier after correcting the first step with Method2.",
                    "sid": 222,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6 summarizes the improvement propagated to Acc NF NgF PsF MTurkMPQA OPs/Ng/N MERGERN/P 72.1 77.8 83.0 87.4 34.2 53.0 15.0 27.7 senMPQA OPs/Ng/N R4 77.6 80.6 87.2 89.1 39.5 43.2 40.0 44.0 Table 6: Polarity classifier with and without SWSD.",
                    "sid": 223,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ps/Ng/N classification.",
                    "sid": 224,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For comparison, we also include results from (Akkaya et al., 2009) on senMPQA.",
                    "sid": 225,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Method2 results in 20% error reduction in accuracy over OPs/Ng/N (R4 achieves 13.4% error reduction on senMPQA).",
                    "sid": 226,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The improvement on the rule-based integration is statistically significant at the p < .01 level with McNemar’s test.",
                    "sid": 227,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More importantly, the F-measure for all the labels improves.",
                    "sid": 228,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This indicates that non-expert MTurk annotations can replace expert annotations for our end-goal – improving contextual opinion analysis – while reducing time and cost requirements by a large margin.",
                    "sid": 229,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, we see that the improvements in (Akkaya et al., 2009) scale up to new subjectivity clues.",
                    "sid": 230,
                    "ssid": 169,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "4",
            "sents": [
                {
                    "text": "One related line of research is to automatically assign subjectivity and/or polarity labels to word senses in a dictionary (Valitutti et al., 2004; An- dreevskaia and Bergler, 2006; Wiebe and Mihalcea, 2006; Esuli and Sebastiani, 2007; Su and Markert, 2009).",
                    "sid": 231,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, the task in our paper is to automatically assign labels to word instances in a corpus.",
                    "sid": 232,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently, some researchers have exploited full word sense disambiguation in methods for opinion- related tasks.",
                    "sid": 233,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, (Mart´ın-Wanton et al., 2010) exploit WSD for recognizing quotation polarities, and (Rentoumi et al., 2009; Mart´ın-Wanton et al., 2010) exploit WSD for recognizing headline polarities.",
                    "sid": 234,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "None of this previous work investigates performing a coarse-grained variation of WSD such as SWSD to improve their application results, as we do in this work.",
                    "sid": 235,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A notable exception is (Su and Markert, 2010), who exploit SWSD to improve the performance on a contextual NLP task, as we do.",
                    "sid": 236,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the task in our paper is subjectivity and sentiment analysis, their task is EnglishChinese lexical substitution.",
                    "sid": 237,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As (Akkaya et al., 2009) did, they anno tated word senses, and exploited SENSEVAL data as training data for SWSD.",
                    "sid": 238,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They did not directly annotate words in context with S/O labels, as we do in our work.",
                    "sid": 239,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, they did not separately evaluate a SWSD system component.",
                    "sid": 240,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many researchers work on reducing the granularity of sense inventories for WSD (e.g., (Palmer et al., 2004; Navigli, 2006; Snow et al., 2007; Hovy et al., 2006)).",
                    "sid": 241,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their criteria for grouping senses are syntactic and semantic similarities, while the groupings in work on SWSD are driven by the goals to improve contextual subjectivity and sentiment analysis.",
                    "sid": 242,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions and future work. ",
            "number": "5",
            "sents": [
                {
                    "text": "In this paper, we utilized a large pool of non-expert annotators (MTurk) to collect subjectivity sense- tagged data for SWSD.",
                    "sid": 243,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We showed that non-expert annotations are as good as expert annotations for training SWSD classifiers.",
                    "sid": 244,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, we demonstrated that SWSD classifiers trained on non-expert annotations can be exploited to improve contextual opinion analysis.",
                    "sid": 245,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The additional subjectivity sense-tagged data enabled us to evaluate the benefits of SWSD on contextual opinion analysis on a corpus of opinion- annotated data that is five times larger.",
                    "sid": 246,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using the same rule-based integration strategies as in (Akkaya et al., 2009), we found that contextual opinion analysis is improved by SWSD on the larger datasets.",
                    "sid": 247,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also experimented with new learning strategies for integrating SWSD into contextual opinion analysis.",
                    "sid": 248,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the learning strategies, we achieved greater benefits from SWSD than the rule-based integration strategies on all of the contextual opinion analysis tasks.",
                    "sid": 249,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall, we more firmly demonstrated the potential of SWSD to improve contextual opinion analysis.",
                    "sid": 250,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We will continue to gather subjectivity sense- tagged data, using sense inventories for words that are well represented in WordNet for our purposes, and with usage inventories for those that are not.",
                    "sid": 251,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments. ",
            "number": "6",
            "sents": [
                {
                    "text": "This material is based in part upon work supported by National Science Foundation awards #0917170 and #0916046.",
                    "sid": 252,
                    "ssid": 1,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}