{
    "ID": "W11-2408",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Reasoning about ordinary human situations and activities requires the availability of diverse types of knowledge, including expectations about the probable results of actions and the lexical entailments for many predicates.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describe initial work to acquire such a collection of conditional (if–then) knowledge by exploiting presuppositional discourse patterns (such as ones involving ‘but’, ‘yet’, and ‘hoping to’) and abstracting the matched material into general rules.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "We are interested, ultimately, in enabling an inference system to reason forward from facts as well as backward from goals, using lexical knowledge together with world knowledge.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Creating appropriate collections of general world knowledge to support reasoning has long been a goal of researchers in Artificial Intelligence.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Efforts in information extraction, e.g., Banko et al.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007), have focused on learning base facts about specific entities (such as that Barack Obama is president), and work in knowledge extraction, e.g., Van Durme and Schubert (2008), has found generalizations (such as that a president may make a speech).",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the latter provides a basis for possibilistic forward inference (Barack Obama probably makes a speech at least occasionally) when its meaning is sharpened (Gordon and Schubert, 2010), these resources don’t provide a basis for saying what we might expect to happen if, for instance, someone crashes their car.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That the driver in a car crash might be injured and the car damaged is a matter of common sense, and, as such, is rarely stated directly.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it can be found in sentences where this expectation is disconfirmed: ‘Sally crashed her car into a tree, but she wasn’t hurt.’ We have been exploring the use of lexico-syntactic discourse patterns indicating disconfirmed expectations, as well as people’s goals (‘Joe apologized repeatedly, hoping to be forgiven’).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting rules, expressed at this point in natural language, are a first step toward obtaining classes of general conditional knowledge typically not obtained by other methods.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "One well-known approach to conditional knowledge acquisition is that of Lin and Pantel (2001), where inference rules are learned using distributional similarity between dependency tree paths.",
                    "sid": 11,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results include entailment rules like ‘x is the author of y ⇔ x wrote y’ (which is true provided x is a literary work) and less dependable ones like ‘x caused y ⇔ y is blamed on x’.",
                    "sid": 12,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work was refined by Pantel et al.",
                    "sid": 13,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) by assigning the x and y terms semantic types (inferential selectional preferences – I S P) based on lexical abstraction from empirically observed argument types.",
                    "sid": 14,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A limitation of the approach is that the conditional rules obtained are largely limited to ones expressing some rough synonymy or similarity relation.",
                    "sid": 15,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pekar (2006) developed related methods for learning the implications of an event based on the regular co-occurrence of two verbs within “locally coherent text”, acquiring rules like ‘x was appointed as y’ suggests that ‘x became y’, but, as in D I RT, we lack information about the types of x and y, and only acquire binary relations.",
                    "sid": 16,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Girju (2003) applied Hearst’s (1998) procedure for finding lexico-syntactic patterns to discover causal relations between nouns, as in ‘Earthquakes generate tsunami’.",
                    "sid": 17,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chklovski and Pantel (2004) used pat 59 Proceedings of the TextInfer 2011 Workshop on Textual Entailment, EMNLP 2011, pages 59–63, Edinburgh, Scotland, UK, July 30, 2011.",
                    "sid": 18,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2011 Association for Computational Linguistics (S < (N P $.",
                    "sid": 19,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(V P < (/,/ $.",
                    "sid": 20,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(S < (V P < (V B G < hoping) < (S < (V P < TO)))))))) (S < (N P $.",
                    "sid": 21,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(V P < ((C C < but) $..",
                    "sid": 22,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(V P < (AU X < did) < (R B < /n[’o]t/)))))) (S < (N P $.",
                    "sid": 23,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(V P < (AU X $.",
                    "sid": 24,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(A D J P < (J J $.",
                    "sid": 25,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "((C C < /(but|yet)/) $.",
                    "sid": 26,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "J J))))))) (S < (N P $.",
                    "sid": 27,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(V P < (/,/ $.",
                    "sid": 28,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(S < (V P < ((V B G < expecting) $.",
                    "sid": 29,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(S < (V P < TO))))))))) Figure 1: Examples of TGrep2 patterns for finding parse tree fragments that might be abstracted to inference rules.",
                    "sid": 30,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "See Rohde (2001) for an explanation of the syntax.",
                    "sid": 31,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "terns like ‘x-ed by y-ing’ (‘obtained by borrowing’) to get co-occurrence data on candidate pairs from the Web.",
                    "sid": 32,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They used these co-occurrence counts to obtain a measure of mutual information between pairs of verbs, and hence to assess the strengths of the relations.",
                    "sid": 33,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A shortcoming of rules obtained in this way is their lack of detailed predicative structure.",
                    "sid": 34,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For inference purposes, it would be insufficient to know that ‘crashes cause injuries’ without having any idea of what is crashing and who or what is being injured.",
                    "sid": 35,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Schoenmackers et al.",
                    "sid": 36,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) derived first-order Horn clauses from the tuple relations found by TEXT- RUNNER (Banko et al., 2007).",
                    "sid": 37,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their system produces rules like ‘IsHeadquarteredIn(Company, State) :- Is BasedIn(Company, City) ∧ IsLocatedIn(City, State)’,which are intended to improve inference for question answering.",
                    "sid": 38,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A limitation of this approach is that, operating on the facts discovered by an information extraction system, it largely obtains relations among simple attributes like locations or roles rather than consequences or reasons.",
                    "sid": 39,
                    "ssid": 29,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "method. ",
            "number": "3",
            "sents": [
                {
                    "text": "Our method first uses TGrep2 (Rohde, 2001) to find parse trees matching hand-authored lexico-syntactic patterns, centered around certain pragmatically significant cue words such as ‘hoping to’ or ‘but didn’t’.",
                    "sid": 40,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of the search patterns are in Figure 1.",
                    "sid": 41,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While we currently use eight query patterns, future work may add rules to cover more constructions.",
                    "sid": 42,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The matched parse trees are filtered to remove those unlikely to produce reasonable results, such as those containing parentheses or quoted utterances, and the trees are preprocessed in a top-down traversal to rewrite or remove constituents that are usually extraneous.",
                    "sid": 43,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, the parse tree for The next day he and another Bengali boy who lives near by [sic] chose another way home, hoping to escape the attackers.",
                    "sid": 44,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is preprocessed to People chose another way home, hoping to escape the attackers.",
                    "sid": 45,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples of the preprocessing rules include removing interjections (I N T J) and some prepositional phrases, heuristically turning long expressions into keywords like ‘a proposition’, abstracting named entities, and reordering some sentences to be easier to process.",
                    "sid": 46,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "E.g., ‘Fourteen inches from the floor it’s supposed to be’ is turned to ‘It’s supposed to be fourteen inches from the floor’.",
                    "sid": 47,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The trees are then rewritten as conditional expressions based on which semantic pattern they match, as outlined in the following subsections.",
                    "sid": 48,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sample sentences are from the Brown Corpus (Kucˇera and Francis, 1967) and the British National Corpus (BNC Consortium, 2001), and the rules are those derived by our current system.",
                    "sid": 49,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Disconfirmed Expectations.",
                    "sid": 50,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are sentences where ‘but’ or ‘yet’ is used to indicate that the expected inference people would make does not hold.",
                    "sid": 51,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In such cases, we want to flip the polarity of the conclusion (adding or removing ‘not’ from the output) so that the expectation is confirmed.",
                    "sid": 52,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, from The ship weighed anchor and ran out her big guns, but did not fire a shot.",
                    "sid": 53,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "we get that the normal case is the opposite: If a ship weighs anchor and runs out her big guns, then it may fire a shot.",
                    "sid": 54,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Or for two adjectives, ‘She was poor but proud’: If a female is poor, then she may not be proud.",
                    "sid": 55,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Contrasting Good and Bad.",
                    "sid": 56,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A different use of ‘but’ and ‘yet’ is to contrast something considered good with something considered bad, as in ‘He is very clever but eccentric’: If a male is very clever, then he may be eccentric.",
                    "sid": 57,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we were to treat this as a case of disconfirmed expectation as above, we would have claimed that ‘If a male is very clever, then he may not be eccentric’.",
                    "sid": 58,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To identify this special use of ‘but’, we consult a lexicon of sentiment annotations, SentiWordNet (Baccianella et al., 2010).",
                    "sid": 59,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finding that ‘clever’ is positive while ‘eccentric’ is negative, we retain the surface polarity in this case.",
                    "sid": 60,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For sentences with full sentential complements for ‘but’, recognizing good and bad items is quite difficult, more often depending on pragmatic information.",
                    "sid": 61,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, in Central government knew this would happen but did not want to admit to it in its plans.",
                    "sid": 62,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "knowing something is generally good while being unwilling to admit something is bad.",
                    "sid": 63,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At present, we don’t deal with these cases.",
                    "sid": 64,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Expected Outcomes.",
                    "sid": 65,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other sentences give us a participant’s intent, and we just want to abstract sufficiently to form a general rule: He stood before her in the doorway, evidently expecting to be invited in.",
                    "sid": 66,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a male stands before a female in the doorway, then he may expect to be invited in.",
                    "sid": 67,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When we abstract from named entities (using a variety of hand-built gazetteers), we aim low in the hierarchy: Elisabeth smiled, hoping to lighten the conversational tone and distract the Colonel from his purpose.",
                    "sid": 68,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a female smiles, then she may hope to lighten the conversational tone.",
                    "sid": 69,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While most general rules about ‘a male’ or ‘a female’ could instead be about ‘a person’, there are ones that can’t, such as those about giving birth.",
                    "sid": 70,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We leave the raising of terms for later work, following Van Durme et al.",
                    "sid": 71,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009).",
                    "sid": 72,
                    "ssid": 33,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "evaluation. ",
            "number": "4",
            "sents": [
                {
                    "text": "Development was based on examples from the (hand- parsed) Brown Corpus and the (machine-parsed) British National Corpus, as alluded to above.",
                    "sid": 73,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These corpora were chosen for their broad coverage of everyday situations and edited writing.",
                    "sid": 74,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the examples in the preceding subsections indicate, rules extracted by our method often describe complex consequences or reasons, and subtle relations among adjectival attributes, that appear to be quite different from the kinds of rules targeted in previous work (as discussed earlier, or at venues such as that of (Sekine, 2008)).",
                    "sid": 75,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While we would like to evaluate the discovered rules by looking at inferences made with them, that must wait until logical forms are automatically created; here we judge the rules themselves.",
                    "sid": 76,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The statement above is a reasonably clear, entirely plausible, generic claim and seems neither too specific nor too general or vague to be useful: 1.",
                    "sid": 77,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I agree.",
                    "sid": 78,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 79,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I lean towards agreement.",
                    "sid": 80,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 81,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I’m not sure.",
                    "sid": 82,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.",
                    "sid": 83,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I lean towards disagreement.",
                    "sid": 84,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "i disagree.",
            "number": "5",
            "sents": [
                {
                    "text": "Figure 2: Instructions for judging of unsharpened factoids.",
                    "sid": 85,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Judge 1 Judge 2 Correlation 1.84 2.45 0.55 Table 1: Average ratings and Pearson correlation for rules from the personal stories corpus.",
                    "sid": 86,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lower ratings are better; see Fig.",
                    "sid": 87,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 88,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For evaluation, we used a corpus of personal stories from weblogs (Gordon and Swanson, 2009), parsed with a statistical parser (Charniak, 2000).",
                    "sid": 89,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We sampled 100 output rules and rated them on a scale of 1–5 (1 being best) based on the criteria in Fig.",
                    "sid": 90,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 91,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To decide if a rule meets the criteria, it is helpful to imagine a dialogue with a computer agent.",
                    "sid": 92,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Told an instantiated form of the antecedent, the agent asks for confirmation of a potential conclusion.",
                    "sid": 93,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "E.g., for If attacks are brief, then they may not be intense, the dialogue would go: “The attacks (on Baghdad) were brief.” “So I suppose they weren’t intense, were they?” If this is a reasonable follow-up, then the rule is probably good, although we also disprefer very unlikely antecedents – rules that are vacuously true.",
                    "sid": 94,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the results in Table 1 and Fig.",
                    "sid": 95,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 indicate, the overall quality of the rules learned is good but there is room for improvement.",
                    "sid": 96,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also see a rather low correlation between the ratings of the two judges, indicating the difficulty of evaluating the quality of the rules, especially since their expression in natural language (NL) makes it tempting to “fill in the blanks” of what we understand them to mean.",
                    "sid": 97,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We hypothesize that the agreement between judges will be higher for rules in logical form, where malformed output is more readily identified – for instance, there is no guessing about coreference or attachment.",
                    "sid": 98,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rules that both judges rated favorably (1) include: If a pain is great, it may not be manageable.",
                    "sid": 99,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a person texts a male, then he-or-she may get a reply.",
                    "sid": 100,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "80 60 40 20 0 1 2 3 4 5 Rating Figure 3: Counts for how many rules were assigned each rating by judges.",
                    "sid": 101,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lower ratings are better; see Fig.",
                    "sid": 102,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 103,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a male looks around, then he may hope to see someone.",
                    "sid": 104,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a person doesn’t like some particular store, then he-or-she may not keep going to it.",
                    "sid": 105,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While some bad rules come from parsing or processing mistakes, these are less of a problem than the heavy tail of difficult constructions.",
                    "sid": 106,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, there are idioms that we want to filter out (e.g., ‘I’m embarrassed but.",
                    "sid": 107,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "’) and other bad outputs show context-dependent rather than general relations: If a girl sits down in a common room, then she may hope to avoid some pointless conversations.",
                    "sid": 108,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sitting-down may not have been because she wanted to avoid conversation but because of something prior.",
                    "sid": 109,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It’s difficult to compare our results to other systems because of the differences of representation, types of rules, and evaluation methods.",
                    "sid": 110,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ISP’s best performing method (I S P.J I M) achieves 0.88 specificity (defined as a filter’s probability of rejecting incorrect inferences) and 0.53 accuracy.",
                    "sid": 111,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While describing their SHERLOCK system, Schoenmackers et al.",
                    "sid": 112,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) argue that “the notion of ‘rule quality’ is vague except in the context of an application” and thus they evaluate the Horn clauses they learn in the context of the HOLMES inference-based QA system, finding that at precision 0.8 their rules allow the system to find twice as many correct facts.",
                    "sid": 113,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, our weak rater agreement shows the difficulty of judging rules on their own, and future work aims to evaluate rules extrinsically.",
                    "sid": 114,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Conclusion and Future Work.",
                    "sid": 115,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Enabling an inference system to reason about common situations and activities requires more types of general world knowledge and lexical knowledge than are currently available or have been targeted by previous work.",
                    "sid": 116,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We’ve suggested an initial approach to acquiring rules describing complex consequences or reasons and subtle relations among adjectival attributes: We find possible rules by looking at interesting discourse patterns and rewriting them as conditional expressions based on semantic patterns.",
                    "sid": 117,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A natural question is why we don’t use the machine-learning/bootstrapping techniques that are common in other work on acquiring rules.",
                    "sid": 118,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These techniques are particularly successful when (a) they are aimed at finding fixed types of relationships, such as hyponymy, near-synonymy, part-of, or causal relations between pairs of lexical items (often nominals or verbs); and (b) the fixed type of relationship between the lexical items is hinted at sufficiently often either by their co-occurrence in certain local lexico- syntactic patterns, or by their occurrences in similar sentential environments (distributional similarity).",
                    "sid": 119,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But in our case, (a) we are looking for a broad range of (more or less strong) consequence relationships, and (b) the relationships are between entire clauses, not lexical items.",
                    "sid": 120,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are simply not likely to find multiple occurrences of the same pair of clauses in a variety of syntactic configurations, all indicating a consequence relation – you’re unlikely to find multiple redundant patterns relating clauses, as in ‘Went up to the door but didn’t knock on it’.",
                    "sid": 121,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is more work to be done to arrive at a reliable, inference-ready knowledge base of such rules.",
                    "sid": 122,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The primary desideratum is to produce a logical representation for the rules such that they can be used in the EPILOG reasoner (Schubert and Hwang, 2000).",
                    "sid": 123,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Computing logical forms (as, e.g., in Bos (2008)) and then deriving logically formulated rules from these rather than deriving sentential forms directly from text should also allow us to be more precise about dropping modifiers, reshaping into generic present tense from other tenses, and other issues that affect the quality of the statements.",
                    "sid": 124,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have a preliminary version of a logical form generator that derives LFs from TreeBank parses that can support this direction.",
                    "sid": 125,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further filtering techniques (based both on the surface form and the logical form) should keep the desired inference rules while improving quality.",
                    "sid": 126,
                    "ssid": 42,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "This work was supported by NSF grants IIS 1016735 and IIS0916599, and ONR STTR subcontract N0001410-M-0297.",
                    "sid": 127,
                    "ssid": 43,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}