{
    "ID": "w11-1604",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Paraphrase generation can be regarded as machine translation where source and target language are the same.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the Moses statistical machine translation toolkit for paraphrasing, comparing phrase-based to syntax-based approaches.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Data is derived from a recently released, large scale (2.1M tokens) paraphrase corpus for Dutch.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Preliminary results indicate that the phrase-based approach performs better in terms of NIST scores and produces paraphrases at a greater distance from the source.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "One of the challenging properties of natural language is that the same semantic content can typically be expressed by many different surface forms.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the ability to deal with paraphrases holds great potential for improving the coverage of NLP systems, a substantial body of research addressing recognition, extraction and generation of paraphrases has emerged (Androutsopoulos and Malakasiotis, 2010; Madnani and Dorr, 2010).",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Paraphrase Generation can be regarded as a translation task in which source and target language are the same.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both Paraphrase Generation and Machine Translation (MT) are instances of Text-To-Text Generation, which involves transforming one text into another, obeying certain restrictions.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here these restrictions are that the generated text must be grammatically well-formed and semantically/translationally equivalent to the source text.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Addionally Paraphrase Generation requires that the output should differ from the input to a certain degree.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The similarity between Paraphrase Generation and MT suggests that methods and tools originally developed for MT could be exploited for Paraphrase Generation.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One popular approach – arguably the most successful so far – is Statistical Phrase based Machine Translation (PBMT), which learns phrase translation rules from aligned bilingual text corpora (Och et al., 1999; Vogel et al., 2000; Zens et al., 2002; Koehn et al., 2003).",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Prior work has explored the use of PBMT for paraphrase generation (Quirk et al., 2004; Bannard and CallisonBurch, 2005; Mad- nani et al., 2007; CallisonBurch, 2008; Zhao et al., 2009; Wubben et al., 2010) However, since many researchers believe that PBMT has reached a performance ceiling, ongoing research looks into more structural approaches to statistical MT (Marcu and Wong, 2002; Och and Ney, 2004; Khalilov and Fonollosa, 2009).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntax- based MT attempts to extract translation rules in terms of syntactic constituents or subtrees rather than arbitrary phrases, presupposing syntactic structures for source, target or both languages.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic information might lead to better results in the area of grammatical well-formedness, and unlike phrase- based MT that uses contiguous n-grams, syntax enables the modeling of long-distance translation patterns.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the verdict on whether or not this approach leads to any significant performance gain is still out, a similar line of reasoning would suggest that syntax-based paraphrasing may offer similar advantages over phrase-based paraphrasing.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Considering the fact that the success of PBMT can partly be attributed to the abundance of large parallel corpora, 27 Workshop on Monolingual Text-To-Text Generation, pages 27–33, Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics, pages 27–33, Portland, Oregon, 24 June 2011.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Oc 2011 Association for Computational Linguistics and that sufficiently large parallel corpora are still lacking for paraphrase generation, using more linguistically motivated methods might prove beneficial for paraphrase generation.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the same time, automatic syntactic analysis introduces errors in the parse trees, as no syntactic parser is perfect.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Likewise, automatic alignment of syntactic phrases may be prone to errors.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main contribution of this paper is a systematic comparison between phrase-based and syntax-based paraphrase generation using an off-the-shelf statistical machine translation (SMT) decoder, namely Moses (Koehn et al., 2007) and the word-alignment tool GIZA++ (Och and Ney, 2003).",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Training data derives from a new, large scale (2.1M tokens) paraphrase corpus for Dutch, which has been recently released.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The paper is organized as follows.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2 reviews the paraphrase corpus from which provides training and test data.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, Section 3 describes the paraphrase generation methods and the experimental setup.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results are presented in Section 4.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Section 5 we discuss our findings and formulate our conclusions.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "corpus. ",
            "number": "2",
            "sents": [
                {
                    "text": "The main bottleneck in building SMT systems is the need for a substantial amount of parallel aligned text.",
                    "sid": 28,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Likewise, exploiting SMT for paraphrasing requires large amounts of monolingual parallel text.",
                    "sid": 29,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, paraphrase corpora are scarce; the situation is more dire than in MT, and this has caused some studies to focus on the automatic harvesting of paraphrase corpora.",
                    "sid": 30,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of monolingual parallel text corpora was first suggested by Barzilay and McKeown (2001), who built their corpus using various alternative human-produced translations of literary texts and then applied machine learning or multi-sequence alignment for extracting paraphrases.",
                    "sid": 31,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a similar vein, Pang et al.",
                    "sid": 32,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2003) used a corpus of alternative English translations of Chinese news stories in combination with a syntax-based algorithm that automatically builds word lattices, in which paraphrases can be identified.",
                    "sid": 33,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So-called comparable monolingual corpora, for instance independently written news reports describing the same event, in which some pairs of sentences exhibit partial semantic overlap have also been investigated (Shinyama et al., 2002; Barzilay and Lee, 2003; Shen et al., 2006; Wubben et al., 2009) The first manually collected paraphrase corpus is the Microsoft Research Paraphrase (MSRP) Corpus (Dolan et al., 2004), consisting of 5,801 sentence pairs, sampled from a larger corpus of news articles.",
                    "sid": 34,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, it is rather small and contains no sub- sentential allignments.",
                    "sid": 35,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cohn et al.",
                    "sid": 36,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) developed a parallel monolingual corpus of 900 sentence pairs annotated at the word and phrase level.",
                    "sid": 37,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, all of these corpora are small from an SMT perspective.",
                    "sid": 38,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently a new large-scale paraphrase corpus for Dutch, the DAESO corpus, was released.",
                    "sid": 39,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus contains both samples of parallel and comparable text in which similar sentences, phrases and words are aligned.",
                    "sid": 40,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One part of the corpus is manually aligned, whereas another part is automatically aligned using a data-driven aligner trained on the first part.",
                    "sid": 41,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The DAESO corpus is extensively described in (Marsi and Krahmer, 2011); the summary here is limited to aspects relevant to the work at hand.",
                    "sid": 42,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus contains the following types of text: (1) alternative translations in Dutch of three literary works of fiction; (2) autocue text from televion broadcast news as read by the news reader, and the corresponding subtitles; (3) headlines from similar news articles obtained from Google News Dutch; (4) press releases about the same news topic from two different press agencies; (5) similar answers retrieved from a document collection in the medical domain, originally created for evaluating question- answering systems.",
                    "sid": 43,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a first step, similar sentences were automatically aligned, after which alignments were manually corrected.",
                    "sid": 44,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of the parallel book texts, aligned sentences are (approximate) paraphrases.",
                    "sid": 45,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To a lesser degree, this is also true for the news headlines.",
                    "sid": 46,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The autocue-subtitle pairs are mostly examples of sentence compression, as the subtitle tends to be a compressed version of the read autocue text.",
                    "sid": 47,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, the press releases and the QA answers, are characterized by a great deal of one-to-many sentence alignments, as well as sentences left un- aligned, as is to be expected in comparable text.",
                    "sid": 48,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most sentences in these types of text tend to have only partial overlap in meaning.",
                    "sid": 49,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1: Properties of the manually aligned corpus Autosub Books Headlines News QA Overall aligned trees 18 338 6 362 32 627 11 052 118 68 497 tokens 217 959 115 893 179 629 162 361 2 230 678 072 tokens/sent 11.89 18.22 5.51 14.69 18.90 9.90 nodes 365 157 191 636 318 399 271 192 3734 1 150 118 nodes/tree 19.91 30.12 9.76 24.54 31.64 16.79 uniquely aligned trees (%) 92.93 92.49 84.57 63.61 50.00 84.10 aligned nodes (%) 73.53 66.83 73.58 53.62 38.62 67.62 Next, aligned sentences were tokenized and parsed with the Alpino parser for Dutch (Bouma et al., 2001).",
                    "sid": 50,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parser provides a relatively theory- neutral syntactic analysis which is a blend of phrase structure analysis and dependency analysis, with a backbone of phrasal constituents and arcs labeled with syntactic function/dependency labels.",
                    "sid": 51,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The alignments not only concern paraphrases in the strict sense, i.e., expressions that are semantically equivalent, but extend to expressions that are semantically similar in less strict ways, for instance, where one phrase is either more specific or more general than the related phrase.",
                    "sid": 52,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this reason, alignments are also labeled according to a limited set of semantic similarity relations.",
                    "sid": 53,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since these relations were not used in the current study, we will not discuss them further here.",
                    "sid": 54,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus comprises over 2.1 million tokens, 678 thousand of which are manually annotated and 1,511 thousand are automatically processed.",
                    "sid": 55,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To give a more complete overview of the sizes of different corpus segments, some properties of the manually aligned corpus are listed in Table 1.",
                    "sid": 56,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Properties of the automatically aligned part are similar, except for the fact that it only contains text of the news and QA type.",
                    "sid": 57,
                    "ssid": 30,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "paraphrase generation. ",
            "number": "3",
            "sents": [
                {
                    "text": "Phrase-based MT models consider translation as a mapping of small text chunks, with possible reordering (Och and Ney, 2004).",
                    "sid": 58,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Operations such as insertion, deletion and many-to-one, one-to-many or many-to-many translation are all covered in the structure of the phrase table.",
                    "sid": 59,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Phrase-based models have been used most prominently in the past decade, as they have shown to outperform other approaches (CallisonBurch et al., 2009).",
                    "sid": 60,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One issue with the phrase-based approach is that recursion is not handled explicitly.",
                    "sid": 61,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is generally acknowledged that language contains recursive structures up to certain depths.",
                    "sid": 62,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So-called hierarchical models have introduced the inclusion of non- terminals in the mapping rules, to allow for recursion (Chiang et al., 2005).",
                    "sid": 63,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, using a generic non-terminal X can introduce many substitutions in translations that do not make sense.",
                    "sid": 64,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By making the non-terminals explicit, using syntactic categories such as N P s and V P s, this phenomenon is constrained, resulting in syntax-based translation.",
                    "sid": 65,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of phrase translations, translation rules in terms of syntactic constituents or subtrees are extracted, presupposing the availability of syntactic structures for source, target, or both languages.",
                    "sid": 66,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Incorporating syntax can guide the translation process and unlike phrase-based MT syntax it enables the modeling of long-distance translation patterns.",
                    "sid": 67,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntax-based systems may parse the data on the target side (string-to-tree), source side (tree-to- string), or both (tree-to-tree).",
                    "sid": 68,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments we use tree-to-tree syntax- based MT. We also experiment with relaxing the parses by a method proposed under the label of syntax-augmented machine translation (SAMT), described in (Zollmann and Venugopal, 2006).",
                    "sid": 69,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method combines any neighboring nodes and labels previously unlabeled nodes, removing the syntactic constraint on the grammar1.",
                    "sid": 70,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We train all systems on the DAESO data (218,102 lines of aligned sentences) and test on a held-out set consisting of manually aligned headlines that ap 1 This method is implemented in the Moses package in the program relax-parse as option SAMT 4 Table 2: Examples of output of the phrase-based and syntax-based systems Source Phrase-based Syntax-based jongen ( 7 ) zwaargewond na aanrijding 7jarige gewond na botsing jongen ( 7 ) zwaar gewond na aanrijding boy (7) severely-injured after crash 7-year-old injured after collision boy (7) severely injured after crash Source jeugdwerkloosheid daalt vooral bij voldoende opleiding youth-unemployment drops especially with adequate training Phrase-based werkloosheid jongeren daalt , vooral bij voldoende studie unemployment youths drops, especially with sufficient study Syntax-based * jeugdwerkloosheid daalt vooral in voldoende opleiding youth-unemployment drops especially in adequate training Source kritiek op boetebeleid ns criticism of fining-policy ns Phrase-based * kritiek op de omstreden boetebeleid en criticism of the controversial and Syntax-based kritiek op omstreden boetebeleid nederlandse spoorwegen criticism of controversial fining-policy dutch railways Source weer bestuurders radboud weg again directors radboud [hospital] leaving Phrase-based * weer de weg ziekenhuis again the leaving hospital Syntax-based alweer bestuurders ziekenhuis weg yet-again directors hospital leaving peared in May 2006.2 We test on 773 headlines that have three or more aligned paraphrasing reference headlines.",
                    "sid": 71,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use an SRILM (Stolcke, 2002) language model trained on the Twente news corpus3.",
                    "sid": 72,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To investigate the effect of the amount of training data on results, we also train a phrase-based model on more data by adding more aligned headlines originating from data crawled in 2010 and aligned using (i i=LD(1..8) ∗ Ni ∗ N I STi)tf.idf scores over headline clusters and Cosine sim ilarity as described in (Wubben et al., 2009), resulting in an extra 612,158 aligned headlines.",
                    "sid": 73,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation is based on the assumption that a good paraphrase is well-formed and semantically similar but structurally different from the source sentence.",
                    "sid": 74,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We therefore score the generated paraphrases not only by an MT metric (we use NIST scores), but also factor in the edit distance between the input sentence and the output sentence.",
                    "sid": 75,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We take the 10- best generated paraphrases and select from these the one most dissimilar from the source sentence in term of Levenshtein distance on tokens.",
                    "sid": 76,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then weigh NIST scores according to their corresponding sentence Levenshtein Distance, to calculate a weighted average score.",
                    "sid": 77,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This implies that we penalize systems that provide output at Levenshtein distance 0, which are essentially copies of the input, and not paraphrases.",
                    "sid": 78,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Formally, the score is computed as follows: N I STweightedLD = α i=LD(1..8) (i ∗ Ni) 2 Syntactic trees were converted to the XML format used by Moses for syntax-based MT. A minor complication is that the word order in the tree is different from the word order in the corresponding sentence in about half of the cases.",
                    "sid": 79,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The technical reason is that Alpino internally produces dependency structures that can be non-projective.",
                    "sid": 80,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Conversion to a phrase structure tree therefore necessitates moving some words to a different position in the tree.",
                    "sid": 81,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We performed a subsequent reordering of the trees, moving terminals to make the word order match the surface word order.",
                    "sid": 82,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 http://www.vf.utwente.nl/˜druid/TwNC/ TwNC-main.html where α is the percentage of output phrases that have a sentence Levenshtein Distance higher than 0.",
                    "sid": 83,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of NIST scores, other MT evaluation scores can be plugged into this formula, such as METEOR (Lavie and Agarwal, 2007) for languages for which paraphrase data is available.",
                    "sid": 84,
                    "ssid": 27,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results. ",
            "number": "4",
            "sents": [
                {
                    "text": "Figure 1 shows NIST scores per Levenshtein Distance.",
                    "sid": 85,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be observed that overall the NIST score decreases as the distance to the input increases, indicating that more distant paraphrases are of less quality.",
                    "sid": 86,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The relaxed syntax-based approach (SAMT) performs mildly better than the standard syntax- based approach, but performs worse than the phrase- based approach.",
                    "sid": 87,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The distribution of generated paraphrases per Levenshtein Distance is shown in Figure 2.",
                    "sid": 88,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It reveals that the Syntax-based approaches tend to stay closer to the source than the phrase- based approaches.",
                    "sid": 89,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Table 2 a few examples of output from both Phrase- and Syntax-based systems are given.",
                    "sid": 90,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 10 Phrase.",
                    "sid": 91,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Phrase extra data Syntax 8 Syntax relaxed.",
                    "sid": 92,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "300 Phrase Phrase extra data Syntax Syntax relaxed 6 200 4 100 2 2 4 6 8 10 LevenshteinDistance 0 0 2 4 6 8 10 LevenshteinDist ance Figure 1: NIST scores per Levenshtein distance top two examples show sentences where the phrase- based approach scores better, and the bottom two show examples where the syntax-based approach scores better.",
                    "sid": 93,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, we observe that the phrase-based approach is often more drastic with its changes, as shown also in Figure 2.",
                    "sid": 94,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The syntax- based approach is less risky, and reverts more to single-word substitution.",
                    "sid": 95,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The weighted NIST score for the phrase-based approach is 7.14 versus 6.75 for the syntax-based approach.",
                    "sid": 96,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adding extra data does not improve the phrase-based approach, as it yields a score of 6.47, but the relaxed method does improve the syntax- based approach (7.04).",
                    "sid": 97,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "discussion and conclusion. ",
            "number": "5",
            "sents": [
                {
                    "text": "We have compared a phrase-based MT approach to paraphrasing with a syntax-based MT approach.",
                    "sid": 98,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Phrase-based approach performs better in terms of NIST score weighted by edit distance of the output.",
                    "sid": 99,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, the phrase-based MT system performs more edits and these edits seem to be more reliable than the edits done by the Syntax-based approach.",
                    "sid": 100,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A relaxed Syntax-based approach performs better, while adding more data to the Phrase-based approach does not yield better results.",
                    "sid": 101,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To gain a better understanding of the quality of the output generated by the different approaches, it would be desirable to present the output of the different systems to human judges.",
                    "sid": 102,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In future work, we intend to compare the effects of using manual word alignments from the DAESO corpus instead of the automatic alignments produced by GIZA++.",
                    "sid": 103,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also wish to Figure 2: Distribution of generated paraphrases per Levenshtein distance further explore the effect of the nature of the data that we train on: the DAESO corpus consists of various data sources from different domains.",
                    "sid": 104,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our aim is also to incorporate the notion of dissimilarity into the paraphrase model, by adding dissimilarity scores to the model.",
                    "sid": 105,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}