{
    "ID": "W11-1215",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper introduces a new task of crosslingual slot ﬁlling which aims to discover attributes for entity queries from crosslingual comparable corpora and then present answers in a desired language.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is a very challenging task which suﬀers from both information extraction and machine translation errors.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we analyze the types of errors produced by ﬁve diﬀerent baseline approaches, and present a novel supervised rescoring based validation approach to incorporate global evidence from very large bilingual comparable corpora.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Without using any additional labeled data this new approach obtained 38.5% relative improvement in Precision and 86.7% relative improvement in Recall over several state-of-the-art approaches.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ultimate system outperformed monolingual slot ﬁlling pipelines built on much larger monolingual corpora.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The slot ﬁlling task at NIST TAC Knowledge Base Population (KBP) track (Ji et al., 2010) is a relatively new and popular task with the goal of automatically building proﬁles of entities from large amounts of unstructured data, and using these proﬁles to populate an existing knowledge base.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These proﬁles consist of numerous slots such as “title”, “parents” for persons and “top-employees” for organizations.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A variety of approaches have been proposed to address both tasks with considerable success; nevertheless, all of the KBP tasks so far have been limited to monolingual processing.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, as the shrinking fraction of the world’s Web pages are written in English, many slot ﬁlls can only be discovered from comparable documents in foreign languages.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By comparable corpora we mean texts that are about similar topics, but are not in general translations of each other.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These corpora are naturally available, for example, many news agencies release multilingual news articles on the same day.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we propose a new and more challenging crosslingual slot ﬁlling task, to ﬁnd information for any English query from crosslingual comparable corpora, and then present its proﬁle in English.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We developed complementary baseline approaches which combine two diﬃcult problems: information extraction (IE) and machine translation (MT).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we conduct detailed error analysis to understand how we can exploit comparable corpora to construct more complete and accurate proﬁles.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many correct answers extracted from our baselines will be reported multiple times in any external large collection of comparable documents.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can thus take advantage of such information redundancy to rescore candidate answers.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To choose the best answers we consult large comparable corpora and corresponding IE results.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We prefer those answers which frequently appear together with the query in certain IE contexts, including co-occurring names, coreference links, relations and events.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, we prefer “South Korea” instead of “New York Stock Exchange” as the “per:employee of ” answer for “Roh Moo-hyun” using global evidence from employment relation extraction.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such global knowledge from comparable corpora 110 Proceedings of the 4th Workshop on Building and Using Comparable Corpora, pages 110–119, 49th Annual Meeting of the Association for Computational Linguistics, Portland, Oregon, 24 June 2011.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2011 Association for Computational Linguistics provides substantial improvement over each individual baseline system and even state-of-the- art monolingual slot ﬁlling systems.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared to previous methods of exploiting comparable corpora, our approach is novel in multiple aspects because it exploits knowledge from: (1) both local and global statistics; (2) both languages; and (3) both shallow and deep analysis.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Sudo et al.",
                    "sid": 23,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) found that for a crosslingual single-document IE task, source language extraction and fact translation performed notably better than machine translation and target language extraction.",
                    "sid": 24,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We observed the same results.",
                    "sid": 25,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition we also demonstrate that these two approaches are complementary and can be used to boost each other’s results in a statistical rescoring model with global evidence from large comparable corpora.",
                    "sid": 26,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "HakkaniTur et al.",
                    "sid": 27,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) described a ﬁltering mechanism using two crosslingual IE systems for improving crosslingual document retrieval.",
                    "sid": 28,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many previous validation methods for crosslingual QA, such as those organized by Cross Language Evaluation Forum (Vallin et al., 2005), focused on local information which involves only the query and answer (e.g.",
                    "sid": 29,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Kwork and Deng, 2006)), keyword translation (e.g.",
                    "sid": 30,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Mitamura et al., 2006)) and surface patterns (e.g.",
                    "sid": 31,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Soubbotin and Soubbotin, 2001)).",
                    "sid": 32,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some global validation approaches considered information redundancy based on shallow statistics including co- occurrence, density score and mutual information (Clarke et al., 2001; Magnini et al., 2001; Lee et al., 2008), deeper knowledge from dependency parsing (e.g.",
                    "sid": 33,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Shen et al., 2006)) or logic reasoning (e.g.",
                    "sid": 34,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Harabagiu et al., 2005)).",
                    "sid": 35,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, all of these approaches made limited eﬀorts at disambiguating entities in queries and limited use of fact extraction in answer search and validation.",
                    "sid": 36,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several recent IE studies have stressed the beneﬁts of using information redundancy on estimating the correctness of the IE output (Downey et al., 2005; Yangarber, 2006; Patwardhan and Riloﬀ, 2009; Ji and Grish man, 2008).",
                    "sid": 37,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some recent research used comparable corpora to re-score name transliterations (Sproat et al., 2006; Klementiev and Roth, 2006) or mine new word translations (Fung and Yee, 1998; Rapp, 1999; Shao and Ng, 2004; Tao and Zhai, 2005; Hassan et al., 2007; Udupa et al., 2009; Ji, 2009).",
                    "sid": 38,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To the best of our knowledge, this is the ﬁrst work on mining facts from comparable corpora for answer validation in a new crosslingual entity proﬁling task.",
                    "sid": 39,
                    "ssid": 17,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experimental setup. ",
            "number": "3",
            "sents": [
                {
                    "text": "3.1 Task Deﬁnition.",
                    "sid": 40,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The goal of the KBP slot ﬁlling task is to extract facts from a large source corpus regarding certain attributes (“slots”) of an entity, which may be a person or organization, and use these facts to augment an existing knowledge base (KB).",
                    "sid": 41,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Along with each slot answer, the system must provide the ID of a document which supports the correctness of this answer.",
                    "sid": 42,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "KBP 2010 (Ji et al., 2010) deﬁnes 26 types of attributes for persons (such as the age, birthplace, spouse, children, job title, and employing organization) and 16 types of attributes for organizations (such as the top employees, the founder, the year founded, the headquarters location, and the subsidiaries).",
                    "sid": 43,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The new problem we deﬁne in this paper is an extension of this task to a crosslingual paradigm.",
                    "sid": 44,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a query in a target language t and a collection of documents in a source language s, a system must extract slot answers about the query and present the answers in t. In this paper we examine a speciﬁc setting of s=Chinese and t=English.",
                    "sid": 45,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To score crosslingual slot ﬁlling, we pool all the system responses and group equivalent answers into equivalence classes.",
                    "sid": 46,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each system response is rated as correct, wrong, inexact or redundant.",
                    "sid": 47,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given these judgments, we calculate the precision, recall and F-measure of each system, crediting only correct answers.",
                    "sid": 48,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Data and Query Selection.",
                    "sid": 49,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the comparable corpora of English TDT5 (278,358 documents) and Chinese TDT5 (56,424 documents) as our source collection.",
                    "sid": 50,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For query selection, we collected all the entities from the entire source collection and counted their frequencies.",
                    "sid": 51,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then selected 50 informative entities (25 persons and 25 organizations) which were located in the middle range of frequency counts.",
                    "sid": 52,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among the 25 person queries, half are Chinesespeciﬁc names, and half are non-Chinese names.",
                    "sid": 53,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 25 organizations follow a representative distribution according to the entity subtypes deﬁned in NIST Automatic Content Extraction (ACE) program1.",
                    "sid": 54,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Baseline Pipelines.",
                    "sid": 55,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3.1 Overview We employ the following two types of baseline crosslingual slot ﬁlling pipelines to process Chinese documents.",
                    "sid": 56,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 and Table 1 shows the ﬁve system pipelines we have used to conduct our experiments.",
                    "sid": 57,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Type A Translate Chinese texts into English, and apply English slot ﬁlling systems to the translations.",
                    "sid": 58,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Type B Translate English queries into Chinese, apply Chinese slot ﬁlling systems to Chinese texts, and translate answers back to English.",
                    "sid": 59,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pip elin e Labe l C o m p o n e n t s D a t a M o n o - li n g u a l ( 1 ) E n g li s h S u p e r v i s e d C l a s s i f i c a t i o n En gli sh T D T 5 ( 2 ) E n g l i s h P a t t e r n M a t c h i n g C r o s s- li n g u a l Ty pe A (3) M T + E n g l i s h S u p e r v i s e d C l a s s i f i c a t i o n Ch ine se T D T 5 (4) M T + E n g l i s h P a t t e r n M a t c h i n g Ty pe B (5) Q u e r y T r a n s l a t i o n +C hin ese Su per vis ed C l a s s i f i c a t i o n +A ns we r Tr an sla tio n Table 1: Monolingual and Crosslingual Baseline Slot Filling Pipelines 3.3.2 Monolingual Slot Filling We applied a state-of-the-art bilingual slot ﬁlling system (Chen et al., 2010) to process bilingual comparable corpora.",
                    "sid": 60,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This baseline system includes a supervised ACE IE pipeline and a bottom-up pattern matching pipeline.",
                    "sid": 61,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The IE pipeline includes relation extraction and event extraction based on maximum entropy models that incorporate diverse lexical, syntactic, semantic and ontological knowledge.",
                    "sid": 62,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extracted ACE relations and events are then mapped to KBP slot ﬁlls.",
                    "sid": 63,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In pattern matching, we extract and rank patterns based on a distant supervision approach (Mintz et al., 2009) Chinese Query Chinese Texts Machine Translation Query Translation that uses entity attribut e pairs from Wikiped ia Infoboxe s and Freebase (Bollack er et al., 2008).",
                    "sid": 64,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We set a low threshol d to include more answer Chinese Slot Filling Supervised Classification English Texts English Query candidates, and then a series of ﬁltering steps to reﬁne and improve the overall pipeline results.",
                    "sid": 65,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ﬁltering steps include removing answers which have inappropriate entity types or English Slot Filling have inappropriate dependency paths to the en Answer Translation Pattern Matching Supervised Classification tities.",
                    "sid": 66,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3.3 Docu ment and Name Translation English Candidate Answers Figure 1: Overview of Baseline Crosslingual Slot Filling Pipelines 1 http://www.itl.nist.gov/iad/mig/tests/ace/ We use a statistical, phrase-based MT system (Zens and Ney, 2004) to translate Chinese documents into English for Type A Approaches.",
                    "sid": 67,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best translation is computed by using a weighted log-linear combination of various statistical models: an n-gram language model, a phrase translation model and a word-based lex icon model.",
                    "sid": 68,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The latter two models are used in source-to-target and target-to-source directions.",
                    "sid": 69,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The model scaling factors are optimized with respect to the BLEU score similar to (Och, 2003).",
                    "sid": 70,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training data includes 200 million running words in each language.",
                    "sid": 71,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The total language model training data consists of about 600 million running words.",
                    "sid": 72,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We applied various name mining approaches from comparable corpora and parallel corpora, as described in (Ji et al., 2009) to extract and translate names in queries and answers in Type B approaches.",
                    "sid": 73,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The accuracy of name translation is about 88%.",
                    "sid": 74,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For those names not covered by these pairs, we relied on Google Translate 2 to obtain results.",
                    "sid": 75,
                    "ssid": 36,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "analysis of baseline pipelines. ",
            "number": "4",
            "sents": [
                {
                    "text": "In this section we analyze the coverage (Section 4.1) and precision (Section 4.2) results of the baseline pipelines.",
                    "sid": 76,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then illustrate the potential for global validation from comparable corpora through a series of examples.",
                    "sid": 77,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Coverage Analysis: Toward.",
                    "sid": 78,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Information Fusion Table 2 summarizes the Precision (P), Recall (R) and F-measure (F) of baseline pipelines and the union of their individual results.",
                    "sid": 79,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2: Baseline Pipeline Results 2 http://translate.google.com/ Although crosslingual pipelines used a much smaller corpus than monolingual pipelines, they extracted comparable number of correct answers (66 vs. 81) with a slightly better precision.",
                    "sid": 80,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, the crosslingual pipeline (5) performs even better than monolingual pipeline (2), especially on the employment slots.",
                    "sid": 81,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, 96.35% of the correct answers for Chinesespeciﬁc person queries (e.g. “Tang Jiaxuan”) were extracted from Chinese data.",
                    "sid": 82,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even for those facts discovered from English data, they are about quite general slots such as “title” and “employee of ”.",
                    "sid": 83,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, Chinese data covers more diverse biographical slots such as “family members” and “schools attended”.",
                    "sid": 84,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared to the union of Type A approaches (pipelines (3)+(4)), Pipeline (5) returned many more correct answers with higher precision.",
                    "sid": 85,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main reason is that Type A approaches suﬀer from MT errors.",
                    "sid": 86,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, MT mistakenly translated the query name “Celine Dion” into “Clinton” and thus English slot ﬁlling components failed to identify any answers.",
                    "sid": 87,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One can hypothesize that slot ﬁlling on MT output can be improved by retraining extraction components directly from MT output.",
                    "sid": 88,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, our experiments of learning patterns from MT output showed negative impact, mainly because MT errors were too diverse to generalize.",
                    "sid": 89,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other cases even though slot ﬁlling produced correct results, MT still failed to translate the answer names correctly.",
                    "sid": 90,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, English slot ﬁlling successfully found a potential answer for “org:founded by” of the query “Microsoft” from the following MT output: “The third largest of the Microsoft common founder Alan Doss , aged 50, and net assets of US 22 bil lion.”; however, the answer string “Paul Al len” was mistakenly translated into “Alan Doss”.",
                    "sid": 91,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MT is not so crucial for “per:title” slot because it does not require translation of contexts.",
                    "sid": 92,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To summarize, 59% of the missing errors were due to text, query or answer translation errors and 20% were due to slot ﬁlling errors.",
                    "sid": 93,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, the union of (3)+(4)+(5) still contain more correct answers.",
                    "sid": 94,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These baseline pipelines were developed from a diverse set of algorithms, and typically showed strengths in speciﬁc slots.",
                    "sid": 95,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general we can conclude that monolingual and crosslingual pipelines are complementary.",
                    "sid": 96,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Combining the responses from all baseline pipelines, we can get similar number of correct answers compared to one single human annota- tor.",
                    "sid": 97,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Precision Analysis: Toward Global.",
                    "sid": 98,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Validation The spurious errors from baseline crosslingual slot ﬁlling pipelines reveal both the shortcomings of the MT system and extraction across languages.",
                    "sid": 99,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows the distribution of spurious errors.",
                    "sid": 100,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pi pe lin e S p u r i o u s E r r o r s Di str ib uti on T yp e A C o nt e nt T ra ns la ti o n + E x t r a c t i o n 8 5 % Q u e r y T r a n sl at i o n 1 3 % A ns w er Tr an sl ati on 2 % T y pe B W or d Se g m en tat io n 3 4 % R el ati on E xt ra cti on 3 3 % C o r e f e r e n c e 1 7 % S e m a n t i c T y p e 1 3 % S l o t T y p e 3 % Table 3: Distribution of Spurious Errors Table 3 indicates a majority (85%) of spurious errors from Type A pipelines were due to applying monolingual slot ﬁlling methods to MT output which preserves Chinese structure.",
                    "sid": 101,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As demonstrated in previous work (e.g.",
                    "sid": 102,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Par- ton and McKeown, 2010; Ji et al., 2009)), we also found that many (14.6%) errors were caused by the low quality of name translation for queries and answers.For example, “麦克金蒂/McGinty” was mis takenly translated into the query name “Kim Jongil”, which led to many incorrect answerssuch as “The British Royal joint military re search institute” for “per:employee of ”.",
                    "sid": 103,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, the spurious errors from Type Bpipelines were more diverse.",
                    "sid": 104,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chinese IE components severely suﬀered from word segmen tation errors (34%), which were then directly propagated into Chinese document retrieval and slot ﬁlling.",
                    "sid": 105,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many segmentation errors occurred with out-of-vocabulary names, especially person names and nested organization names.",
                    "sid": 106,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the name “姚明宝/Yao Mingbao” was mistakenly segmented into two words “姚明/Yao Ming” and “宝/bao”, and thus the document was mistakenly retrieved for the query ‘Yao Ming”.",
                    "sid": 107,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In many cases (33%) Chinese relation and event extraction components failed to capture Chinesespeciﬁc structures due to the limited size of training corpora.",
                    "sid": 108,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, from the context “应邀担任陈水扁经济顾问的萧万 长/Xiao Wan-chang, who were invited to become the economics consultant for Chen Shui bian”, Chinese slot ﬁlling system mistakenly extracted “consultant” as a ”per:title” answer for the query “Chen Shuibian” using a common pattern “<query><title>”.",
                    "sid": 109,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "13% of errors were caused due to invalid semantic types for certain slots.",
                    "sid": 110,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, many metaphoric titles such as “tough guy” don’t match the deﬁnition of “per:title” in the annotation guideline “employment or membership position”.",
                    "sid": 111,
                    "ssid": 36,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "global validation. ",
            "number": "5",
            "sents": [
                {
                    "text": "Based on the above motivations we propose to incorporate global evidence from a very large collection of comparable documents to reﬁne local decisions.",
                    "sid": 112,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The central idea is to over- generate candidate answers from multiple weak baselines to ensure high upper-bound of recall, and then conduct eﬀective global validation to ﬁlter spurious errors while keeping good answers in order to enhance precision.",
                    "sid": 113,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Supervised Rescoring.",
                    "sid": 114,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ideally, we want to choose a validation model which can pick out important features in a context wider than that used by baseline pipelines.",
                    "sid": 115,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Merging individual systems to form the union of answers can be eﬀective, but Table 2 shows that simple union of all pipelines produced worse F- measure than the best pipeline.",
                    "sid": 116,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we exploit the reranking paradigm, commonly used in information retrieval, to conduct global validation.",
                    "sid": 117,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By modeling the empirical distribution of labeled training data, statistical models are used to identify the strengths and weaknesses (e.g. high and low precision slots) of individual systems, and rescore answers accordingly.",
                    "sid": 118,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specially, we develop a supervised Maximum Entropy (MaxEnt) based model to rescore the answers from the pipelines, selecting only the highest-scoring answers.",
                    "sid": 119,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rescorer was trained (using cross- validation) on varying subsets of the features.",
                    "sid": 120,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The threshold at which an answer is deemed to be true is chosen to maximize the F-Measure on the training set.",
                    "sid": 121,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Validation Features.",
                    "sid": 122,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 4 describes the validation features used for rescoring, where q is the query, q’ the Chinese translation of q, t the slot type, a the candidate answer, a’ the Chinese form of a, s the context sentence and d is the context document supporting a. The feature set beneﬁts from multiple dimensions of crosslingual slot ﬁlling.",
                    "sid": 123,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These features were applied to both languages wherever annotation resources were available.",
                    "sid": 124,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the KBP slot ﬁlling task, slots are often dependent on each other, so we can improve the results by improving the “coherence” of the story (i.e. consistency among all generated answers - query proﬁles).",
                    "sid": 125,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use feature f2 to check whether the same answer was generated for conﬂicting slots, such as per:parents and per:children.",
                    "sid": 126,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared to traditional QA tasks, slot ﬁlling is a more ﬁnegrained task in which diﬀerent slots are expected to obtain semantically diﬀerent answers.",
                    "sid": 127,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we explored semantic constraints in both local and global contexts.",
                    "sid": 128,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, we utilized bilingual name gazetteers from ACE training corpora, Google n-grams (Ji and Lin, 2009) and the geonames website 3 to encode features f6, f8 and f9; The org:top members/employees slot requires a system to distinguish whether a person member/ employee is in the top position, thus we encoded f10 for this purpose.",
                    "sid": 129,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The knowledge used in our baseline pipelines is relatively static – it is not updated during the 3 http://www.geonames.org/statistics/ extraction process.",
                    "sid": 130,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Achieving high performance for cross-lingual slot ﬁlling requires that we take a broader view, one that looks outside a single document or a single language in order to exploit global knowledge.",
                    "sid": 131,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fortunately, as more and more large crosslingual comparable corpora are available, we can take advantage of information redundancy to validate answers.",
                    "sid": 132,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The basic intuition is that if a candidate answer a is correct, it should appear together with the query q repeatedly, in diﬀerent documents, or even in certain coreference links, relations and events.",
                    "sid": 133,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, “David Kel ly - scientist”, and “石原慎太郎/Shintaro Ishihara - 知事/governor ” pairs appear frequently in “title” coreference links in both English and Chinese corpora; “Elizabeth II ” is very often involved in an “employment” relation with “United Kingdom” in English corpora.",
                    "sid": 134,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, some incorrect answers with high global statistics can be ﬁltered out using these constraints.",
                    "sid": 135,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For exam ple, although the query “唐家璇/Tang Jiaxuan” appears frequently together with the candidate per:title answer “人员/personnel”, it is linked by few coreference links; in contrast, it’s coreferential with the correct title answer “国务委员/State Council member ” much more frequently.We processed cross-lingual comparable cor pora to extract coreference links, relations and events among mentions (names, nominals and time expressions etc.) and stored them in an external knowledge base.",
                    "sid": 136,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Any pair of <q, a>is then compared to the entries in this knowl edge base.",
                    "sid": 137,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used 157,708 documents from Chinese TDT5 and Gigaword to count Chinese global statistics, and 7,148,446 documents from DARPA GALE MT training corpora to count English global statistics, as shown in features f12 and f13.",
                    "sid": 138,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fact based global features f14, f15,f16 and f17, were calculated from 49,359 Chi nese and 280,513 English documents (annotated by the bilingual IE system in Section 3.3.2.",
                    "sid": 139,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "6",
            "sents": [
                {
                    "text": "In this section, we examine the overall performance of this method.",
                    "sid": 140,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then discuss the usefulness of the individual sets of features.",
                    "sid": 141,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In C h a r a c t e r i s t i c s D e s c r i p t i o n S c o p e D e p t h La ng ua ge G l o b a l ( C r o s s s y s t e m ) S h al lo w E n g li s h f1: fre que ncy of <q, a, t> that app ear s in all bas elin e out put s f2: nu mb er of con flic tin g slot typ es in whi ch ans wer a app ear s in all bas elin e out put s L o c a l S h al lo w E n g li s h f3: con jun ctio n of t and wh eth er a is a yea r ans wer f4: con jun ctio n of t and wh eth er a incl ude s nu mb ers or lett ers D e e p E n g li s h f5: con jun ctio n of pla ce t and wh eth er a is a cou ntr y na me f6: con jun ctio n of per :ori gin t and wh eth er a is a nati ona lity f7: if t=p er:t itle , wh eth er a is an acc ept abl e titl e f8: if t req uir es a na me ans wer , wh eth er a is a na me f9: wh eth er a has app rop riat e se ma ntic typ e G l o b a l ( W i t h i n - D o c u m e n t ) D e e p E n g li s h f10 : con jun ctio n of org :to p_ me mb ers/ em plo yee s and wh eth er the re is a high lev el titl e in s f11 : con jun ctio n of alte rna tive na me and wh eth er a is an acr ony m of q G l o b a l ( C r o s s d o c u m e n t i n c o m p a r a b l e c o r p o r a ) S h al lo w (St atis tics ) C hi n es e f12 : con diti ona l pro bab ilit y of q/q' and a/a' app ear in the sa me doc um ent E n g li s h f13 : con diti ona l pro bab ilit y of q/q' and a/a' app ear in the sa me sen ten ce D e e p ( F a c t b a s e d ) B o t h f14 : co occ urr enc e of q/q' and a/a' app ear in cor efe ren ce lin ks E n g li s h f15 : co occ urr enc e of q/q' and a/a' app ear in rela tio n/e ven t lin ks E n g li s h f16 : con diti ona l pro bab ilit y of q/q' and a/a' app ear in rela tio n/e ven t lin ks E n g li s h f17 : mu tual inf or mat ion of q/q' and a/a' app ear in rela tio n/e ven t lin ks Table 4: Validation Features for Crosslingual Slot Filling the following results, the baseline features are always used in addition to any other features.",
                    "sid": 142,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1 Overall Performance.",
                    "sid": 143,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of the data scarcity, tenfold cross- validation, across queries, was used to train and test the system.",
                    "sid": 144,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Quantitative results after combining answers from multiple pipelines are shown in Table 5.",
                    "sid": 145,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used two basic features, one is the slot type and the other is the entity type of the query (i.e. person or organization).",
                    "sid": 146,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This basic feature set is already successful in improving the precision of the pipelines, although this results in a number of correct answers being discarded as well.",
                    "sid": 147,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By adding the additional validation features described previously, both the f-score and precision of the models are improved.",
                    "sid": 148,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of the cross-lingual pipelines (3+4+5) the number of correct answers chosen is almost doubled while increasing the precision of the output.",
                    "sid": 149,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.2 Impact of Global Validation.",
                    "sid": 150,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A comparison of the beneﬁts of global versus local features are shown in Table 6, both of which dramatically improve scores over the baseline features.",
                    "sid": 151,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The global features are universally P i p e l i n e s F P R Basic Feat ures 1 + 2 3 + 4 + 5 1 + 2 + 3 + 4 + 5 0.",
                    "sid": 152,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "31 0.",
                    "sid": 153,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "26 0.",
                    "sid": 154,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "27 0.",
                    "sid": 155,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "31 0.",
                    "sid": 156,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "39 0.",
                    "sid": 157,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "29 0.",
                    "sid": 158,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "30 0.",
                    "sid": 159,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "20 0.",
                    "sid": 160,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "25 Full Fea ture s 1 + 2 3 + 4 + 5 1 + 2 + 3 + 4 + 5 0.",
                    "sid": 161,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "37 0.",
                    "sid": 162,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "36 0.",
                    "sid": 163,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "31 0.",
                    "sid": 164,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "30 0.",
                    "sid": 165,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "35 0.",
                    "sid": 166,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "28 0.",
                    "sid": 167,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "46 0.",
                    "sid": 168,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "37 0.",
                    "sid": 169,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "35 Table 5: Using Basic Features to Filter Answers more beneﬁcial than the local features, although the local features generate results with higher precision at the expense of the number of correct answers returned.",
                    "sid": 170,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The global features are especially useful for pipelines 3+4+5, where the performance using just these features reaches those of using all other features – this does not hold true for the monolingual pipelines however.",
                    "sid": 171,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.3 Impact of Fact-driven Deep.",
                    "sid": 172,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Knowledge The varying beneﬁt of fact-driven cross- document features and statistical cross- document features are shown in Table 7.",
                    "sid": 173,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P i p e l i n e s F P R Loca l Feat ures 1 + 2 3 + 4 + 5 1 + 2 + 3 + 4 + 5 0.",
                    "sid": 174,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "34 0.",
                    "sid": 175,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "29 0.",
                    "sid": 176,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "27 0.",
                    "sid": 177,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "35 0.",
                    "sid": 178,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "40 0.",
                    "sid": 179,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "32 0.",
                    "sid": 180,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "33 0.",
                    "sid": 181,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "22 0.",
                    "sid": 182,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "24 Glob al Featu res 1 + 2 3 + 4 + 5 1 + 2 + 3 + 4 + 5 0.",
                    "sid": 183,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "35 0.",
                    "sid": 184,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "37 0.",
                    "sid": 185,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "33 0.",
                    "sid": 186,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "30 0.",
                    "sid": 187,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "36 0.",
                    "sid": 188,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "29 0.",
                    "sid": 189,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "42 0.",
                    "sid": 190,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "38 0.",
                    "sid": 191,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "38 Table 6: The Beneﬁt of Global versus Local Features While both feature sets are beneﬁcial, the monolingual pipelines (1+2) beneﬁt more from statistical features while the cross-lingual pipelines (3+4+7) beneﬁt slightly more from the fact-based features.",
                    "sid": 192,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Despite this bias, the overall results when the features are used in all pipelines are very close with the fact-based features being slightly more useful overall.",
                    "sid": 193,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "P i p e l i n e s F P RFact Based Feature s 1 + 2 3 + 4 + 5 1 + 2 + 3 + 4 + 5 0.",
                    "sid": 194,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "33 0.",
                    "sid": 195,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "35 0.",
                    "sid": 196,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "30 0.",
                    "sid": 197,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "27 0.",
                    "sid": 198,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "43 0.",
                    "sid": 199,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "27 0.",
                    "sid": 200,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "42 0.",
                    "sid": 201,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "29 0.",
                    "sid": 202,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "34 Statisti cal Featur es 1 + 2 3 + 4 + 5 1 + 2 + 3 + 4 + 5 0.",
                    "sid": 203,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "37 0.",
                    "sid": 204,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "34 0.",
                    "sid": 205,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "29 0.",
                    "sid": 206,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "34 0.",
                    "sid": 207,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "35 0.",
                    "sid": 208,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "25 0.",
                    "sid": 209,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "40 0.",
                    "sid": 210,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "33 0.",
                    "sid": 211,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "34 Table 7: Fact vs. Statistical Cross-Doc Features Translation features were only beneﬁcial to pipelines 3, 4, and 5, and provided a slight increase in precision from 0.39 to 0.42, but provided no noticeable beneﬁt when used in conjunction with results from pipelines 1 and 2.",
                    "sid": 212,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because the answers where translation features would be most useful were already being selected by pipelines 1 and 2 using the baseline features.",
                    "sid": 213,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.4 Discussion.",
                    "sid": 214,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of any re-scoring, even with baseline features, provides large gains over the union of the baseline pipelines, removing large number of incorrect answers.",
                    "sid": 215,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of more sophis ticated features provided substantial gains over the baseline features.",
                    "sid": 216,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular, global features proved very eﬀective.",
                    "sid": 217,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further feature engineering to address the remaining errors and the dropped correct answer would likely provide increasing gains in performance.",
                    "sid": 218,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, two human annotators, independently, conducted the same task on the same data, with a second pass of adjudication.",
                    "sid": 219,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The F- scores of inter-annotator agreement were 52.0% for the ﬁrst pass and 73.2% for the second pass.",
                    "sid": 220,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This indicates that slot ﬁlling remains a challenging task for both systems and human annotators—only one monolingual system exceeded 30% F-score in the KBP2010 evaluation.",
                    "sid": 221,
                    "ssid": 82,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion and future work. ",
            "number": "7",
            "sents": [
                {
                    "text": "Crosslingual slot ﬁlling is a challenging task due to limited performance in two separate areas: information extraction and machine translation.",
                    "sid": 222,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Various methods of combining techniques from these two areas provided weak yet complementary baseline pipelines.",
                    "sid": 223,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We proposed an eﬀective approach to integrate these baselines and enhance their performance using wider and deeper knowledge from comparable corpora.",
                    "sid": 224,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ﬁnal system based on cross-lingual comparable corpora outperformed monolingual pipelines on much larger monolingual corpora.",
                    "sid": 225,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The intuition behind our approach is that over-generation of candidate answers from weak baselines provides a potentially strong recall upper-bound.",
                    "sid": 226,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining enhancement becomes simpler: ﬁltering errors.",
                    "sid": 227,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our experiments also suggest that our rescoring models tend to over-ﬁt due to small amount of training data.",
                    "sid": 228,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Manual annotation and assessment are quite costly, motivating future work in active learning and semi-supervised learning methods.",
                    "sid": 229,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we plan to apply our results as feedback to improve MT performance on facts using query and answer-driven language model adaptation.",
                    "sid": 230,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have demonstrated our approach on EnglishChinese pair, but the framework is language- independent; ultimately we would like to extend the task to extracting information from more languages.",
                    "sid": 231,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This work was supported by the U.S. NSF CAREER Award under Grant IIS0953149 and PSCCUNY Research Program.",
                    "sid": 232,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Any opinions, ﬁndings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reﬂect the views of the National Science Foundation.",
                    "sid": 233,
                    "ssid": 12,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}