{
    "ID": "W11-1101",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper proposes a novel application of a supervised topic model to do entity relation detection (ERD).",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We adapt Maximum Entropy Discriminant Latent Dirichlet Allocation (MEDLDA) with mixed membership for relation detection.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ERD task is reformulated to fit into the topic modeling framework.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach combines the benefits of both, maximum-likelihood estimation (MLE) and max-margin estimation (MME), and the mixed membership formulation enables the system to incorporate heterogeneous features.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We incorporate different features into the system and perform experiments on the ACE 2005 corpus.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach achieves better overall performance for precision, recall and Fmeasure metrics as compared to SVM-based and LLDA-based models.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Entity relation detection (ERD) aims at finding relations between pairs of Named Entities (NEs) in text.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Availability of annotated corpora (NIST, 2003; Doddington et al., 2004) and introduction of shared tasks (e.g.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Farkas et al., 2010; Carreras and Ma`rquez, 2005)) has spurred a large amount of research in this field in recent times.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Researchers have used supervised and semi-supervised approaches (Hasegawa et al., 2004; Mintz et al., 2009; Jiang, 2009), and explored rich features (Kambhatla, 2004), kernel design (Culotta and Sorensen, 2004; Zhou et al., 2005; Bunescu and Mooney, 2005; Qian et al., 2008) and inference algorithms (Chan and Roth, 2011), to detect predefined relations between NEs.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, we explore if and how the latent semantics of the text can help in detecting entity relations.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this, we adapt the Latent Dirichlet Allocation (LDA) approach to solve the ERD task.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, we present a ERD system based on Maximum Entropy Discriminant Latent Dirichlet Allocation (MEDLDA).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MEDLDA (Zhu et al., 2009), is an extension of Latent Dirichlet Allocation (LDA) that combines capability of capturing latent semantics with the discriminative capabilities of SVM.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are a number of challenges in employing the LDA framework for ERD.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Latent Dirichlet Allocation and its supervised extensions such as Labeled LDA (LLDA) (Ramage et al., 2009) and supervised LDA (sLDA) (Blei and McAuliffe, 2008) are powerful generative models that capture the underlying semantics of texts.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, they have trouble discovering marginal classes and easily employing rich feature sets, both of which are important for ERD.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We overcome the first drawback by employing a MEDLDA framework, which integrates maximum likelihood estimation (MLE) and maximum margin estimation (MME).",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, it is a combination of sLDA and support vector machines (SVMs).",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, in order to employ rich and heterogeneous features we introduce a separate exponential family distribution for each feature, similar to (Shan et al., 2009), into our MEDLDA model.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We formulate the relation detection task within the topic model framework as follows.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pairs of NE mentions1 and the text between them is considered 1 Adopting the terminology used in the Automatic Context Extraction (ACE) program (NIST, 2003), specific NE instances are called mentions.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "as mini-document.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each mini-document has a relation type (analogous to the response variable in the supervised topic model).",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The topic model infers the topic (relation type) distribution of the mini- documents.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The supervised topic model discovers a latent topic representation of the mini-documents and a response parameter distribution.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The topic representation is discovered with observed response variables during training.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During testing, the topic distribution of each mini-document can form a prediction of the relation types.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We carry out experiments to measure the effectiveness of our approach and compare it to SVM- based and LLDA-based models, as well as to a previous work using the same corpora.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also measure and analyze the effectiveness of incorporating different features in our model relative to other models.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach exhibits better overall precision, recall and Fmeasure than baseline systems.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also find that the MEDLDA-based approach shows consistent capability for incorporation and improvement due to a variety of heterogeneous features.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of the paper is organized as follows.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describe the proposed model in Section 2 and the features that we explore in this work in Section 3.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 describes the data, experiments, results and analyses.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We discuss the related work in Section 5 before concluding in Section 6.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "medlda for relation detection. ",
            "number": "2",
            "sents": [
                {
                    "text": "MEDLDA is an extension of LDA proposed by Zhu, Ahmed and Xing (2009).",
                    "sid": 37,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LDA is itself unsupervised and the results are often hard to interpret.",
                    "sid": 38,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, with the addition of supervised information (such as response variables), the resulting topic models have much better predictive power for classification and regression.",
                    "sid": 39,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our work, we use relation annotations from the ACE (ACE, 2000 2005) corpus to provide the supervision.",
                    "sid": 40,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NE pairs within a sentence, and the text between them are considered as a mini-document.",
                    "sid": 41,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each mini-document is assumed to be composed of a set of topics.",
                    "sid": 42,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The topic model trained with these mini-documents given their relation type label can generate topics biased toward relation types.",
                    "sid": 43,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the trained topic model will have good predictive power on relation types.",
                    "sid": 44,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first describe the MEDLDA model from (Zhu et al., 2009) and then describe how we adapt it for relation detection using mixed membership extensions.",
                    "sid": 45,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 MEDLDA.",
                    "sid": 46,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1: MEDLDA The MEDLDA model described in (Zhu et al., 2009) is illustrated in Figure 12.",
                    "sid": 47,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, α is a k-dimensional parameter of a Dirichlet distribution, β1:k are the parameters for k component distribution over the words.",
                    "sid": 48,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each component refers to a topic.",
                    "sid": 49,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a collection of documents D, each document w1:N is generated from a sequence of topics z1:N . θ is a k-dimensional topic distribution variable, which is sampled from a Dirichlet distribution Dir(α).",
                    "sid": 50,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Like common LDAs, MEDLDA uses independence assumption for a finite set of random variables z1, ..., zn which are independent and identically distributed, conditioned on the parameter θ.",
                    "sid": 51,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Like sLDA, MEDLDA is a supervised model.",
                    "sid": 52,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A response variable Y connected to each document is added for incorporating supervised side information.",
                    "sid": 53,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The supervised side information is expected to make MEDLDA topic discoveries more inter- pretable.",
                    "sid": 54,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Zhu, Ahmed and Xing’s (2009) MEDLDA model can be used in both regression and classification.",
                    "sid": 55,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Concretely, Y is drawn from η1:c, a c k- dimensional vector which can be derived from suitable statistical model.",
                    "sid": 56,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our work, c is the number of relation types.",
                    "sid": 57,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the plate diagram for MEDLDA is quite similar to sLDA (Blei and McAuliffe, 2008).",
                    "sid": 58,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But there is a difference – sLDA focuses on building regression models, and thus the response variable Y in sLDA is generated by a normal distribution.",
                    "sid": 59,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on the plate diagram, the joint distribution of latent and observable variables for our MEDLDA 2 (Zhu et al., 2009) do not have this plate digram in their paper; rather, we create this illustration from the description of their model.",
                    "sid": 60,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "based relation detection is given by p(θ, z, w, y|α, β1:k , η1:c) kN . The generative process for each document this model is as follows: D N 1.",
                    "sid": 61,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sample a component proportion θd ∼ = n p(θd|α) × ( n p(zdn|θd)p(wdn|zdn, β1:k )) Dirichlet(α), d=1 n=1 × p(yd|zd1: dN , η1:c) (1) 2.",
                    "sid": 62,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For.",
                    "sid": 63,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "each feat ure like wor d, partof spe ech, nam ed entit y in the doc um ent, Another important difference from sLDA lies in the fact that MEDLDA does joint learning with both MME and MLE.",
                    "sid": 64,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The joint learning is done in two stages, unsupervised topic discovery and multi-class classification (we refer the reader to (Zhu et al., 2009) for details).",
                    "sid": 65,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During training, EM algorithms are utilized to infer the posterior distribution of the hidden variables θ, z and η.",
                    "sid": 66,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In testing, the trained models are used to predict relation types y. 2.2 Mixed Membership MEDLDA.",
                    "sid": 67,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although the MEDLDA model described above can be applied to the relation detection and classification task, a few modifications are necessary before it can be effective in predicting relation types.",
                    "sid": 68,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mainly, a Figure 2: Mixed Membership MEDLDA limitation of LDA or other existing topic models is the difficulty in incorporating rich features.",
                    "sid": 69,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because LDA is designed to handle data points with homogeneous features such as words.",
                    "sid": 70,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But for relation detection, like many other NLP tasks, it is important to have the flexibility of incorporating part- of-speech tags, named entities, grammatical dependencies and other linguistic features.",
                    "sid": 71,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We overcome this limitation by introducing a separate exponential family distribution for each feature similar to (Shan et al., 2009).",
                    "sid": 72,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, our MEDLDA-based relation detection model is really a mixed-member Bayesian network.",
                    "sid": 73,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 illustrates our model with this extension.",
                    "sid": 74,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 is very similar to Figure 1; the only difference is that the topic component number k is now (a) For n ∈ {1, ..., N}, sample zdn = i ∼ Discrete(θd) (b) For n ∈ {1,...,N}, sample wdn ∼ P (wdn|βd )",
                    "sid": 75,
                    "ssid": 39,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "sample\t\t the\trelation\ttype\t\tlabel. ",
            "number": "3",
            "sents": [
                {
                    "text": "from a softmax(z¯,η) where yd T sof tmax( exp(ηh z¯) ) h=1 exp(ηT z¯) In the sampling, index i is the number of the topic component which ranges from 1 : k. P (wdn|βd ) in 2(b) is an exponential family distribution where i is from 1...k. Note that now we have βd rather than only βd since we have drawn separate distributions for each word (or feature) n. Now, our MEDLDA-based relation-detection model can integrate diverse features of different types or the same features with different parameters.",
                    "sid": 76,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following the generative process, parameter estimation and inferences can be made with either Gibbs sampling or variational methods.",
                    "sid": 77,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use variational methods since we adapt MEDLDA package3 to mixed-membership MEDLDA and train relation detection models.",
                    "sid": 78,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Relation Detection.",
                    "sid": 79,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the generative process, inference and parameter estimation in place, we are ready to perform relation detection.",
                    "sid": 80,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first step is to perform variational inference given the testing instances.",
                    "sid": 81,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In classification, we estimate the probability of the relation type given topics and the response pa rameters, i.e. p(yd|zd1:dN , η1:c−1).",
                    "sid": 82,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With variational approximation, we can derive the prediction rule as F (y, z1:N , η) = ηT f (y, z¯) where f (y, z¯) is a feature vector.",
                    "sid": 83,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now, SVM can be used to derive the 3 this package is downloaded from http://www.cs.cmu.edu/˜junzhu/medlda.htm prediction rule.",
                    "sid": 84,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The final prediction can be generalized exactly the same as Zhu, Ahmed and Xing (Zhu et al., 2009): yˆ = argmaxy E[ηT f (y, Z¯)|α, β] (2) 3 Features.",
                    "sid": 85,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We explore the effectiveness of incorporating features into our systems as well as the baselines.",
                    "sid": 86,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this, we construct feature sets similar to Jiang and Zhai (2007) and Zhou (2005).",
                    "sid": 87,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Three kinds of features are employed: 1.",
                    "sid": 88,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BOW The Bag of Words (BOW) feature cap-.",
                    "sid": 89,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tures all the words in our mini-document.",
                    "sid": 90,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It comprises of the words of the two NE mentions and the words between them.",
                    "sid": 91,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.",
                    "sid": 92,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SYN The SYN features are constructed to cap-.",
                    "sid": 93,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ture syntactic, semantic and structural information of the mini-document.",
                    "sid": 94,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They include features such as HM1 (the head word of the first mention), HM2 (the head word of the second mention), ET1, ET2, M1 and M2 (Entity types and mention types of the two mentions involved), #MB (number of other mentions in between the two mentions), #WB (number of words in between the two mentions).",
                    "sid": 95,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 96,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "COMP The COMP features are composite fea-.",
                    "sid": 97,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tures that are similar to SYN, but they additionally capture language order and dependencies between the features mentioned above.",
                    "sid": 98,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These include features such as HM1HM2 (combining head word of mention 1 and head word of mention 2) , ET12 (combinations of mention entity type), ML12 (combination of mention levels), M1InM2 or M2InM1 (flag indicating whether M2/M1 is included in M1/M2).",
                    "sid": 99,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main intuitions behind employing composite features, COMP, are as follows.",
                    "sid": 100,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, they capture the ordering information.",
                    "sid": 101,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ordering of words are not captured by BOW.",
                    "sid": 102,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, BOW features assume exchangeability.",
                    "sid": 103,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This works for models based on random or seeded sampling (e.g. LDA) – as long as words sampled are associated with a topic, the hidden topics of the documents can be discovered.",
                    "sid": 104,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of ERD, this assumption might work with symmetric relations.",
                    "sid": 105,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, when the relations are asymmetric, ordering information is important.",
                    "sid": 106,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Composite features such as HM1HM2 encodes what mention head word precedes the other.",
                    "sid": 107,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, features such as M1InM2 or M2InM1 capture token dependencies.",
                    "sid": 108,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides exchangeability, LDA-based models also assume that words are conditionally independent.",
                    "sid": 109,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, the system cannot capture the knowledge that some mentions may be included in other mentions.",
                    "sid": 110,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By constructing features such as M1InM2 or M2InM1, we encode the dependency information explicitly.",
                    "sid": 111,
                    "ssid": 36,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "4",
            "sents": [
                {
                    "text": "As MEDLDA is a combination of maximum margin principle with maximum likelihood estimation for topic modes, we compare it with two baseline systems.",
                    "sid": 112,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first, SVM, uses only the maximum margin principle, while the second, LLDA, uses only maximum likelihood estimation for topic modeling.",
                    "sid": 113,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Data.",
                    "sid": 114,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the ACE corpus (Phase 2, 2005) for evaluation.",
                    "sid": 115,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ACE corpus has annotations for both entities and relations.",
                    "sid": 116,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus has six major relations types, 23 subtypes and 7 entity types.",
                    "sid": 117,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this work, we focus only on the six high-level relation types listed in Table 1.",
                    "sid": 118,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the the 6 major types, we have an additional category, no relation (NO-REL), that exists between entities that are not related.",
                    "sid": 119,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The data for our experiments consists of pairs of NEs from a sentence, and the gold standard annotation of their relation type (or NO-REL).",
                    "sid": 120,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All relations in the ACE corpus are intrasentential and hence we do not create NE pairs that cross sentence boundaries.",
                    "sid": 121,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, almost all positive instances are within two mentions of each other.",
                    "sid": 122,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, we create NE pairs for only those NEs that have at most 2 intervening NEs in between.",
                    "sid": 123,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This gives us a total of 38,342 relation instances of which 32,640 are negative instances (NO-REL) and 5702 are positive relation instances belonging to one of the 6 categories.",
                    "sid": 124,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Experimental Setup.",
                    "sid": 125,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use 80% of the instances for training and 20% for testing.",
                    "sid": 126,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The topic numbers and the penalty parameter of the cost function C are first determined M aj or Ty pe D efi nit io n Ex a m pl e A R T art ifa ct Us er, ow ne r, inv en tor or m an uf ac tur er th e m ak er s of th e K ur sk G EN A F F citi ze n, re sid en t, rel igi on , et hn icit y an d or ga ni za tion lo ca tio n U. S. C o m pa ni es O RG A F F (O rg aff ili ati on ) e m pl oy m en t, fo un de r, o w ne rs hi p, s p o rts af fil ia ti o n, in v e st or s h ar e h ol d er st u d e nt al u m ni a n d m e m b e r s hi p Th e C E O of Si e m en s PA RT W H O L E ge og ra phi cal , su bsi dia ry an d so on a br an ch of U. S ba nk P E R S O C ( p e r s o n s o c i a l ) bu sin es s, fa mi ly an d las tin g pe rs on al rel ati on sh ip a sp ok es ma n for th e se na tor P H Y S (p hy si ca l) loc at ed or ne ar a mi lit ar y ba se in G er m an y Table 1: Relation types for ACE 05 corpus for each of the models (wherever applicable) using the training data.",
                    "sid": 127,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Best parameters are determined for the three conditions: 1) BOW features alone BOW, 2) BOW plus SYN features (PlusSYN) and 3) BOW plus SYN and COMP features (PlusCOMP).",
                    "sid": 128,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All systems achieved their overall best performance with PlusCOMP features (see Section 4.4 for a detailed analysis).",
                    "sid": 129,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2.1 MEDLDA The number of topics are determined using the equation 2K0 + K1 following Zhu, Ahmed and Xing (2009) and K1 = 2K0.",
                    "sid": 130,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "K0 is the number of topics per class and K1 is the number of topics shared by all relation types.",
                    "sid": 131,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The choice of topics is based on the intuition that the shared component K1 should use all class labels to model common latent structure while non-overlapping components should model specific characteristics data from each class.",
                    "sid": 132,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The ratio of topics is based on the understanding that shared topics may be more than topics of each class.",
                    "sid": 133,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The specific numbers do not produce much variation in the final results.",
                    "sid": 134,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We experimented with the following number of topics: 20, 40, 70, 80, 90, 100, 110.",
                    "sid": 135,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "BOW, PlusSYN, and PlusCOMP configura-.",
                    "sid": 136,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tions obtain the best performance for 90 topics, 80 topics, and 70 topics respectively.",
                    "sid": 137,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since SVMs are employed in the MEDLDA implementation, we need to determine the penalty parameter of the cost function, C. We used 5 fold cross- validation to locate the parameter C. The best values for C are 25, 28, 30 respectively for BOW, PlusSYN and PlusCOMP configurations.",
                    "sid": 138,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used a linear kernel as it is the most commonly used kernel for text classification tasks.",
                    "sid": 139,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since MEDLDA is run by sampling, the result may be different each time.",
                    "sid": 140,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We ran it 5 times for each setting and took the average as the final results.",
                    "sid": 141,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2.2 LLDA and SVM The setting of topics for LLDA is similar to MEDLDA.",
                    "sid": 142,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As LLDA is also run by sampling, we ran it 5 times for each setting and took the average as the final results.",
                    "sid": 143,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In SVMlight, a grid search tool is provided to locate the the best value for parameter C. The best C for all three conditions was found to be 1.",
                    "sid": 144,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All other settings for the two models are similar to those of MEDLDA.",
                    "sid": 145,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Results.",
                    "sid": 146,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Pr ec % R ec % F % S V M 5 3 . 2 3 5.",
                    "sid": 147,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 40 .3 L L D A 2 8 . 3 5 1.",
                    "sid": 148,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 36 .6 M E D L D A 5 7 . 8 5 3.",
                    "sid": 149,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 55 .4 Table 2: Overall performance of the 3 systems We present the results of the three systems built using PlusCOMP, as all systems achieved their best overall performance using these features.",
                    "sid": 150,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 reports the precision, recall and Fmeasure of the three systems averaged across all 7 categories (the best numbers for each metric are highlighted in bold).",
                    "sid": 151,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here we see that MEDLDA outperforms LLDA and L a b e l s S V M L L D A MED LDA Pr e % R ec % F % Pr e % R ec % F % Pr e % R ec % F % A R T 3 0 8 1 4 1 . 5 3 3 3 4 9 3 6 4 1 G E N A F F 5 3 4 8 5 0 3 3 2 6 4 0 3 9 4 0 O R G A F F 5 5 3 5 4 3 5 9 5 8 5 9 5 3 5 9 5 6 PA RT W H O L E 3 9 0 8 1 4 3 1 8 2 4 5 4 4 5 2 4 8 P E R S O C 5 0 1 7 2 5 7 9 2 1 3 7 3 7 6 7 5 P H Y S 5 5 3 5 4 3 2 6 4 7 3 3 5 6 1 9 2 9 N O R E L 9 0 9 5 9 3 7 0 1 7 2 7 8 9 9 1 9 0 Table 3: Multi-class Classification Results with PlusCOMP for SVM, LLDA and MEDLDA for the six ACE 05 categories and NO-REL SVM across all metrics.",
                    "sid": 152,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, there is a 15 percentage point improvement in Fmeasure over the best performing baseline.",
                    "sid": 153,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This result indicates that our approach of combining topic model with max- margin learning is effective for relation detection.",
                    "sid": 154,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Now, looking at the results for each individual relationship category (see Table 3; the best numbers for each category and metric are highlighted in bold) we see that the Fmeasure for MEDLDA is better than that for SVM for 4 out of the 6 ACE relation types; and better than the Fmeasure obtained by LLDA for all relation types except ORGAFF.",
                    "sid": 155,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Specifically, comparing with the best performing baseline, MEDLDA produces a Fmeasure improvement 27 percentage points for ART, 3 percentage points for PART-WHOLE and 50 percentage points for PER-SOC.",
                    "sid": 156,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, for four of the six ACE relation types, MEDLDA achieves the best precision.",
                    "sid": 157,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even in the cases where MEDLDA is not the best performer for a relation category, its performance is not very poor (unlike, for example, SVM for PART- WHOLE and LLDA for ART, respectively).",
                    "sid": 158,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Interestingly, the NO-REL category reveals a sharp contrast in the performance of SVM and LLDA.",
                    "sid": 159,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "NO-REL is a difficult, catchall category that is a mixture of data with diverse distributions.",
                    "sid": 160,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a category where maximum-margin learning is more effective than maximum-likelihood estimation.",
                    "sid": 161,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice that MEDLDA achieves performance close to SVM for this category.",
                    "sid": 162,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is because, even though both LLDA and MEDLDA model hidden topics and then employ discovered hidden topics to predict relation types, MEDLDA does joint inference of MLE and MME. This joint inference helps to improve the detection of NO-REL.",
                    "sid": 163,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we also compare our system’s results (using PlusCOMP features) with the results of previous research on the same corpus (Khayyamian et al., 2009).",
                    "sid": 164,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They use similar experimental settings: every pair of entities within a sentence is regarded to involve a negative relation instance unless it is annotated as positive in the corpus.",
                    "sid": 165,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A similar filter (they use a distance filter) is used to sift out unrelated negative instances.",
                    "sid": 166,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their train/test ratio of data split is also the same as ours.",
                    "sid": 167,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Khayyamian, Mirroshandel and Abolhassani (2009) employ state-of-art kernel methods developed by Collins and Duffy (2002) and only report Fmeasures over the six ACE relation types.",
                    "sid": 168,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For clarity, we reproduce their results in Table 4 and repeat MEDLDA Fmeasures from Table 3 in the last column.",
                    "sid": 169,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last row (Overall) reports the macro-averages computed over all relation types for each system.",
                    "sid": 170,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here we see that overall, MEDLDA outperforms all kernels.",
                    "sid": 171,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MEDLDA also performs better than the best kernel for four of the six relation types.",
                    "sid": 172,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.4 Analysis.",
                    "sid": 173,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As mentioned previously, all three systems achieved their overall best performance with PlusCOMP features.",
                    "sid": 174,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we analyze if informative features are consistently useful and if the systems can harness the informative features consistently across all relation types.",
                    "sid": 175,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figures 3, 4 and 5 illustrate the F- measures for SVM, LLDA and MEDLDA respectively for the three conditions: BOW, PlusSYN and PlusCOMP.",
                    "sid": 176,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "L a b e l s C D’ 01 A A P A A P D T S A A PD 0 T S A A PD 01 M E D L D A A R T % 5 1 4 9 5 0 4 8 4 7 4 1 G E N A F F % 9 1 0 1 2 1 1 1 1 4 0 O R G A F F % 4 3 4 3 4 3 4 3 4 5 5 6 P A RT W H O LE % 3 0 2 8 2 9 3 0 2 8 4 8 P E R S O C % 6 2 5 8 7 0 6 3 7 3 7 5 P H Y S % 3 2 3 6 2 9 3 3 3 3 2 9 O v e r a l l ( A v g ) 3 8 3 7 3 9 3 8 4 0 4 8 Table 4: F-measures for every kernel in (Khayyamian et al., 2009) and MEDLDA Figure 3: SVM Fmeausres for 3 feature conditions Figure 4: LLDA Fmeausres for 3 feature conditions Figure 5: MEDLDA Fmeausres for 3 feature conditions Let us first look at the best systems (based on Fmeasure) for each of the six ACE relation types in Table 3, and look at what feature set pro duces the best result for that system and relation.",
                    "sid": 177,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MEDLDA is the best performer for ART, PART- WHOLE and PER-SOC in Table 3.",
                    "sid": 178,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 5 reveals that MEDLDA’s best performance for these relation types are obtained using PlusCOMP features.",
                    "sid": 179,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly SVM obtains the best Fmeasure for GENAFF and PHYS relations and Figure 3 shows that SVM achieves its best performance for these categories using PlusCOMP.",
                    "sid": 180,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also see a similar trend with LLDA and the ORGAFF relation type.",
                    "sid": 181,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These results corroborate intuition from previous research that informative features are important for relation type recognition.",
                    "sid": 182,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The only exception to this is the performance of SVM for NO-REL.",
                    "sid": 183,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not surprising, as the features we use are focused on determining true relation types and NO-REL is a mixture of all cases (and features) where relations do not exist.",
                    "sid": 184,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further analysis of the figures reveal that even though there is a general trend towards better performance with addition of more informative features, not all systems show consistent improvements across all relation types with the addition of composite features.",
                    "sid": 185,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, some systems get degraded performance due to feature addition.",
                    "sid": 186,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in Figure 3, we see that the SVM with PlusCOMP features is outperformed by SVM with PlusSYN for ART and SVM with BOW for NO-REL.",
                    "sid": 187,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The gains from features are also inconsistent in the case of LLDA (Figure 4).",
                    "sid": 188,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the LLDA system with PlusSYN features always improves over the one using BOW, the performance drops considerably when using PlusCOMP features for ART and GENAFF.",
                    "sid": 189,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, MEDLDA (see Figure 5) shows more consistent improvement for all relation types with the addition of more complex features.",
                    "sid": 190,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, the gains are more substantial.",
                    "sid": 191,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is encouraging and opens up avenues for further exploration.",
                    "sid": 192,
                    "ssid": 81,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "5",
            "sents": [
                {
                    "text": "Previous research has explored various methods and features for relationship detection and mining.",
                    "sid": 193,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Kernel methods have been popularly used for relation detection.",
                    "sid": 194,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some examples are are dependency tree kernels (Culotta and Sorensen, 2004), shortest dependency path kernels (Bunescu and Mooney, 2005), and more recently, convolution tree kernels (Zhao and Grishman, 2005; Zhang et al., 2006) context-sensitive convolution tree kernels (Zhou et al., 2007) and dynamic syntax tree kernels (Qian et al., 2008).",
                    "sid": 195,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Kernel methods for relation extraction focus on representing and capturing the structured information of the text between the entities.",
                    "sid": 196,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our MEDLDA model, instead of computing distances between subtrees, we sample topics based on their distributions.",
                    "sid": 197,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sampling is not only on the (mini) document level, but also on the word level or on the syntactic or semantic level.",
                    "sid": 198,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our model focuses on addressing the underlying semantics more directly than typical kernel-based methods.",
                    "sid": 199,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Chan and Roth (2011) employ constraints using an integer linear programming (ILP) framework.",
                    "sid": 200,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using this, they apply rich linguistic and knowledge- based constraints based on coreference annotations, a hierarchy of relations, syntacto-semantic structure, and knowledge from Wikipedia.",
                    "sid": 201,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our work, we focus on capturing the latent semantics of the text between the NEs.",
                    "sid": 202,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A variety of features have been explored for ERD in previous research (Zhou et al., 2005; Zhou et al., 2008; Jiang and Zhai, 2007; Miller et al., 2000).",
                    "sid": 203,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic features such as POS tags and dependency path between entities; semantic features such as Word-Net relations, semantic parse trees and types of NEs; and structural features such as which entity came first in the sentence have been found useful for ERD.",
                    "sid": 204,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We too observe the utility of informative features for this task.",
                    "sid": 205,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, exploration of the feature space is not the main focus of this work.",
                    "sid": 206,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rather, our focus is on whether the models are capable of incorporating rich features.",
                    "sid": 207,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A fuller exploration of rich heterogeneous features is the focus of our future work.",
                    "sid": 208,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A closely related task is that of relation mining and discovery, where unsupervised, semi- supervised approaches have been effectively employed (Hasegawa et al., 2004; Mintz et al., 2009; Jiang, 2009).",
                    "sid": 209,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, Hasegawa et al.",
                    "sid": 210,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) use clustering and entity type information, while Mintz et al.",
                    "sid": 211,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009) employ distant supervision.",
                    "sid": 212,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our ERD task is different from these as we focus on classifying the relation types into predefined relation types in the ACE05 corpus.",
                    "sid": 213,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Topic models have been applied previously for a number of NLP tasks (e.g.",
                    "sid": 214,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Lin et al., 2006; Titov and McDonald, 2008).",
                    "sid": 215,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LDAs have also been employed to reduce feature dimensions in relation detection systems (Hachey, 2006).",
                    "sid": 216,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, to the best of our knowledge, this is the first work to make use of topic models to perform relation detection.",
                    "sid": 217,
                    "ssid": 25,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion and future work. ",
            "number": "6",
            "sents": [
                {
                    "text": "In this work, we presented a system for entity relation detection based on mixed-membership MEDLDA.",
                    "sid": 218,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach was motivated by the idea that combination of max margin and maximum likelihood can help to improve relation detection task.",
                    "sid": 219,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this, we adapted the existing work on MEDLDA and mixed membership models and formulated ERD as a topic detection task.",
                    "sid": 220,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To the best of our knowledge, this is the first work to make full use of topic models for relation detection.",
                    "sid": 221,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our experiments show that the proposed approach achieves better overall performance than SVM- based and LLDA-based approaches across all metrics.",
                    "sid": 222,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also experimented with different features and the effectiveness of the different models for harnessing these features.",
                    "sid": 223,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our analysis show that our MEDLDA-based approach is able to effectively and consistently incorporate informative features.",
                    "sid": 224,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a model that incorporates maximum- likelihood, maximum-margin and mixed membership learning, MEDLDA has the potential of incorporating rich kernel functions or conditional topic random fields (CTRF) (Zhu and Xing, 2010).",
                    "sid": 225,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are some of the promising directions for our future exploration.",
                    "sid": 226,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}