{
    "ID": "W12-0304",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "In this research we explore the possibility of using a large n-gram corpus (Google Books) to derive lexical transition probabilities from the frequency of word n-grams and then use them to check and suggest corrections in a target text without the need for grammar rules.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We conduct several experiments in Spanish, although our conclusions also reach other languages since the procedure is corpus-driven.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The paper reports on experiments involving different types of grammar errors, which are conducted to test different grammar-checking procedures, namely, spotting possible errors, deciding between different lexical possibilities and filling-in the blanks in a text.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "This paper discusses a series of early experiments on a methodology for the detection and correction of grammatical errors based on co-occurrence statistics using an extensive corpus of n-grams (Google Books, compiled by Michel et al., 2011).",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We start from two complementary assumptions: on the one hand, books are published accurately, that is to say, they usually go through different phases of revision and correction with high standards and thus a large proportion of these texts can be used as a reference corpus for inferring the grammar rules of a language.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, we hypothesise that with a sufficiently large corpus a high percentage of the information about these rules can be extracted with word n-grams.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, although there are still many grammatical errors that cannot be detected with this method, there is also another important group which can be identified and corrected successfully, as we will see in Section 4.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Grammatical errors are the most difficult and complex type of language errors, because grammar is made up of a very extensive number of rules and exceptions.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, when grammar is observed in actual texts, the panorama becomes far more complicated, as the number of exceptions grows and the variety and complexity of syntactical structures increase to an extent that is not predicted by theoretical studies of grammar.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Grammar errors are extremely important, and the majority of them cannot be considered to be performance-based because it is the meaning of the text and therefore, the success or failure of communication, that is compromised.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To our knowledge, no grammar book or dictionary has yet provided a solution to all the problems a person may have when he or she writes and tries to follow the grammar rules of language.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Doubts that arise during the writing process are not always clearly associated to a lexical unit, or the writer is not able to detect such an association, and this makes it difficult to find the solution using a reference book.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In recent years, some advances have been made in the automatic detection of grammar mistakes (see Section 2).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Effective rule-based methods have been reported, but at the cost of a very time- consuming task and with an inherent lack of flexibility.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, statistical methods are easier and faster to implement, as well as being more flexible and adaptable.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiment we will describe in the following sections is the first part of a more extensive study.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most probably, the logical step to follow in order to continue such a study will be a hybrid approach, based on both 27 Proceedings of the EACL 2012 Workshop on Computational Linguistics and Writing, pages 27–34, Avignon, France, April 23, 2012.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2012 Association for Computational Linguistics statistics and rules.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, this paper aims to contribute to the statistical approach applied to grammar checking.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Google Books N-gram Corpus is a database of n-grams of sequences of up to 5 words and records the frequency distribution of each unit in each year from 1500 onwards.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bulk of the corpus, however, starts from 1970, and that is the year we took as a starting point for the material that we used to compile our reference corpus.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idea of using this database as a grammar checker is to analyse an input text and detect any sequence of words that cannot be found in the n-gram database (which only contains n-grams with frequency equal to or greater than 40) and, eventually, to replace a unit in the text with one that makes a frequent n-gram.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More specifically, we conduct four types of operations: accepting a text and spotting possible errors; inflecting a lemma into the appropriate form in a given context; filling-in the blanks in a text; and selecting, from a number of options, the most probable word form for a given context.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to evaluate the algorithm, we applied it to solve exercises from a Spanish grammar book and also tested the detection of errors in a corpus of real errors made by second language learners.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The paper is organised as follows: we first offer a brief description of related work, and then explain our methodology for each of the experiments.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the next section, we show the evaluation of the results in comparison to the Microsoft Word grammar checker and, finally, we draw some conclusions and discuss lines of future work.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Rule-based grammar checking started in the proach needs mechanisms to take into account errors within a rigid system of rules, and thus different strategies were implemented to gain flexibility (Weischedel and Black, 1980; Douglas and Dale, 1992; Schneider and McCoy, 1998 and others).",
                    "sid": 27,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bolt (1992) and Kohut and Gorman (1995) evaluated several grammar checkers available at the time and concluded that, in general, none of the proposed strategies achieved high percentages of success.",
                    "sid": 28,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are reasons to believe that the limitations of rule-based methods could be overcome with statistical or knowledge-poor approaches, which started to be used for natural language processing in the late 1980s and 1990s.",
                    "sid": 29,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Atwell (1987) was among the first to use a statistical and knowledge-poor approach to detect grammatical errors in POS-tagging.",
                    "sid": 30,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other studies, such as those by Knight and Chandler (1994) or Han et al.",
                    "sid": 31,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006), for instance, proved more successful than rule-based systems in the task of detecting article-related errors.",
                    "sid": 32,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are also other studies (Yarowsky, 1994; Golding, 1995 or Golding and Roth, 1996) that report the application of decision lists and Bayesian classifiers for spell checking; however, these models cannot be applied to grammar error detection.",
                    "sid": 33,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Burstein et al.",
                    "sid": 34,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004) present an idea similar to the present paper, since they use n-grams for grammar checking.",
                    "sid": 35,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In their case, however, the model is much more complicated since it uses a machine learning approach trained on a corpus of correct English and using POS-tags bigrams as features apart from word bi- grams.",
                    "sid": 36,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, they use a series of statistical association measures instead of using plain frequency.",
                    "sid": 37,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other proposals of a similar nature are those 1980s and crystallised in the implementation of which use the web as a corpus (More´ et al., different tools: papers by MacDonald (1983), Heidorn et al.",
                    "sid": 38,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1982) or Richardson and Braden- Harder (1988) describe some of them (see Lea- cock et al., 2010, for a state of the art related to studies focused on language learning).",
                    "sid": 39,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach has continued to be used until recently (see Arppe, 2000; Johannessen et al., 2002; and many others) and is the basis of the work related with the popular grammar checker in Microsoft Word (different aspects of the tool are described in Dolan et al., 1993; Jensen et al., 1993; Gamon et al., 1997 and Heidorn, 2000:181207, among others).",
                    "sid": 40,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The knowledge-rich ap 2004; Yin et al., 2008; Whitelaw et al., 2009), although the majority of these authors also apply different degrees of processing of the input text, such as lemmatisation, POS-tagging and chunk- ing.",
                    "sid": 41,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whitelaw et al.",
                    "sid": 42,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009), working on spell checking, are among the few who disregard explicit linguistic knowledge.",
                    "sid": 43,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sjo¨ bergh (2009) attempted a similar approach for grammar checking in Swedish, but with modest results.",
                    "sid": 44,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nazar (in press) reports on an experiment where corpus statistics are used to solve a German-language multiple choice exam, the result being a score similar to that of a native speaker.",
                    "sid": 45,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sys tem does not use any kind of explicit knowledge of German grammar or vocabulary: answers are found by simply querying a search engine and selecting the most frequent combination of words.",
                    "sid": 46,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The present paper is a continuation and extension of that idea, now with a specific application to the practical problem of checking the grammar of texts in Spanish.",
                    "sid": 47,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In spite of decades of work on the subject of grammar-checking algorithms, as summarised in the previous lines, the general experience with commercial grammar checkers is still disappointing, the most serious problem being that in the vast majority of cases errors in the analysed texts are left undetected.",
                    "sid": 48,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We believe that, in this context, a very simple grammar checker based on corpus statistics could prove to be helpful, at least as a complement to the standard procedures.",
                    "sid": 49,
                    "ssid": 23,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "methodology. ",
            "number": "3",
            "sents": [
                {
                    "text": "In essence, the idea for this experiment is rather simple.",
                    "sid": 50,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all the operations, we contrast the sequences of words as they are found in an input text with those recorded in Google’s database.",
                    "sid": 51,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the error detection phase, the algorithm will flag as an error any sequence of two words that is not found in the database, unless either of the two words is not found individually in the database, in which case the sequence is ignored.",
                    "sid": 52,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idea is that in a correction phase the algorithm will output a ranked list of suggestions to replace each detected error in order to make the text match the n- grams of the database.",
                    "sid": 53,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following subsections offer a detailed description of the methodology of each experiment.",
                    "sid": 54,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the evaluation, we tested whether the algorithm could solve grammar exercises from a textbook (Montol´ıo, 2000), which is one of the most widely used Spanish textbooks for academic writing for native speakers, covering various topics such as pronouns, determiners, prepositions, verb tenses, and so on.",
                    "sid": 55,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, for error detection we used a corpus of L2 learners (Lozano, 2009).",
                    "sid": 56,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Error Detection.",
                    "sid": 57,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Error detection is, logically, the first phase of a grammar checking algorithm and, in practice, would be followed by some correction operation, such as those described in 3.2 to 3.4.",
                    "sid": 58,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the error detection procedure, the algorithm accepts an input sentence or text and retrieves the frequency of all word types (of forms as they appear in the text and not the lemmata) as well as all the different bigrams as sequences of word forms, excluding punctuation signs.",
                    "sid": 59,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The output of this process is the same text with two different types of flags indicating, on the one hand, that a particular word is not found or is not frequent enough and, on the other hand, that a bigram is not frequent.",
                    "sid": 60,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The frequency threshold can be an arbitrary parameter, which would measure the “sensitivity” of the grammar checker.",
                    "sid": 61,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As already mentioned, the minimum frequency of Google n-grams is 40.",
                    "sid": 62,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the corpus is very large, there are a large number of proper nouns, even names that are unusual in Spanish.",
                    "sid": 63,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in the sentence En 1988 Jack Nicholson, Helen Hunt y Kim Basinger.",
                    "sid": 64,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "recibieron sendos Oscar (‘In 1988 Jack Nicholson, Helen Hunt and Kim Basinger each received one Oscar’), bigrams such as y Kim or, of course, others like Jack Nicholson are considered frequent by the system because these actors are famous in the Spanish context, but this is not the case for the bigram Mart´ın Fiz, belonging to another sentence, which is considered infrequent and treated as an error (false positive), because the name of this Spanish athlete does not appear with sufficient frequency.",
                    "sid": 65,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Future versions will address this issue.",
                    "sid": 66,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Multiple Choice Exercises.",
                    "sid": 67,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this scenario, the algorithm is fed with a sentence or text which has a missing word and a series of possibilities from which to decide the most appropriate one for that particular context.",
                    "sid": 68,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, given an input sentence such as El coche se precipito´ por *un,una* pendiente (‘The car plunged down a slope’), the algorithm has to choose the correct option between un and una (i.e., the masculine and feminine forms of the indefinite article).",
                    "sid": 69,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Confronted with this input data, the algorithm composes different trigrams with each possibility and one word immediately to the left and right of the target position.",
                    "sid": 70,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, in this case, one of the trigrams would be por un pendiente and, similarly, the other would be por una pendiente.",
                    "sid": 71,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in 3.1., the selection procedure is based on a frequency comparison of the trigrams in the n-gram database, which in this case favours the first option, which is the correct one.",
                    "sid": 72,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In case the trigram is not found in the database, there are two back-off operations, consisting in separating each trigram into two bigrams, with the first and second position in one case and the second and third in the other.",
                    "sid": 73,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The selected option will be the one with the two bigrams that, added together, have the highest frequency.",
                    "sid": 74,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Inflection.",
                    "sid": 75,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, the exercise consists in selecting the appropriate word form of a given lemma in a given context.",
                    "sid": 76,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, for instance, in another exercise from Montol´ıo’s book, No le *satisfacer* en absoluto el acuerdo al que llegaron con sus socios alemanes (‘[He/She] is not at all satisfied with the agreement reached with [his/her] German partners’), the algorithm has to select the correct verbal inflection of the lemma satisfacer.",
                    "sid": 77,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This operation is similar to the previous one, the only difference being that in this case we use a lexical database of Spanish that allows us to obtain all the inflected forms of a given lemma.",
                    "sid": 78,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Word 2007 with the same dataset.",
                    "sid": 79,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first column of the table we divide the errors into different types as classified in Montol´ıo’s book.",
                    "sid": 80,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performance figures are represented as usual in information retrieval (for details, see Manning et al., 2008): the columns represent the numbers of true positives (t p), which are those errors that were effectively detected by each system; false negatives ( f n) referring to errors that were not detected, and false positives ( f p), consisting in those cases that were correct, but which the system wrongly flagged as errors.",
                    "sid": 81,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These values allowed us to define precision (P) as t p/(t p + f p), recall (R) as t p/(t p + f n) and F 1 as 2.P.R/(P + R).",
                    "sid": 82,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The algorithm detects (with a success rate of 80.59%), for example, verbs with an incorrect morphology, such as *apreto (instead of aprieto, ‘I press’).",
                    "sid": 83,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, the system also makes more interesting detections, such as the incorrect selection of the verb tense, which requires information provided by the context: Si os vuelve athis case, then, the algorithm searches for the tri molestar, no *volved a hablar con e´l (‘If [he] gram le * en, where * is defined as all the inflectional paradigm of the lemma.",
                    "sid": 84,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.4 Fill-in the blanks.",
                    "sid": 85,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The operation of filling-in the blank spaces in a sentence is another typical grammar exercise.",
                    "sid": 86,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, the algorithm accepts an input sentence such as Los asuntos * ma´ s preocupan a la sociedad son los relacionados con la econom´ıa (‘The issues of greatest concern to society are those related to the economy’), from the same source, and suggests a list of candidates.",
                    "sid": 87,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As in the previous cases, the algorithm will search for a trigram such as asuntos * ma´ s, where the * wild- card in this case means any word, or more precisely, the most frequent word in that position.",
                    "sid": 88,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of the previous example, which is an exercise about relative pronouns, the most frequent word in the corpus and the correct option is que.",
                    "sid": 89,
                    "ssid": 40,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results and evaluation. ",
            "number": "4",
            "sents": [
                {
                    "text": "4.1 Result of error detection.",
                    "sid": 90,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of our experiments are summarised in Table 1, where we distinguish between different types of grammar errors and correction operations.",
                    "sid": 91,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The table also offers a comparison of the performance of the algorithm against Microsoft bothers you again, do not talk to him again’).",
                    "sid": 92,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this sentence, the correct tense for the second verb is volva´ is, as the imperative in negative sentences is made with the subjunctive.",
                    "sid": 93,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the same way, it is possible to detect incorrect uses of the adjective sendos (‘for each other’), which cannot be put after the noun, among other particular constraints: combinations such as *los sendos actores (‘both actors’) or *han cerrado filiales sendas (‘they have closed both subsidiaries’) are marked as incorrect by the system.",
                    "sid": 94,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to try to balance the bias inherent to a grammar textbook, we decided to replicate the experiment with real errors.",
                    "sid": 95,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The decision to extract exercises from a grammar book was based on the idea that this book would contain a diverse sample of the most typical mistakes, and in this sense it is representative.",
                    "sid": 96,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But as the examples given by the authors are invented, they are often uncommon and unnatural, and of course this frequently has a negative effect on performance.",
                    "sid": 97,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We thus repeated the experiment using sentences from the CEDEL2 corpus (Lozano, 2009), which is a corpus of essays in Spanish written by non-native speakers with different levels of proficiency.",
                    "sid": 98,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this experiment, we only used essays written by students classified as “very advanced”.",
                    "sid": 99,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We extracted 65 sentences, each containing one error.",
                    "sid": 100,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "T h i s E x p e r i m e n t W o r d 2 0 0 7 Typ e of err or t p f n f p % P % R % F1 t p f n fp % P % R % F1 ger un d ve rb m or p h ol o gy n u m er al s gr a m m ati ca l nu m be r pr e p os iti o ns adj ecti ve “se nd os” v a r i o u s t o t a l 9 5 4 4 1 0 2 5 5 5 5 16 2 8 1 7 9 8 4 0 0 5 2 13 4 9 1 3 7 1 1 7 1 5 2 10 0 5 0 80.",
                    "sid": 101,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "59 36.",
                    "sid": 102,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "36 90.",
                    "sid": 103,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "90 59.",
                    "sid": 104,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "52 83.",
                    "sid": 105,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "33 51.",
                    "sid": 106,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "40 61.",
                    "sid": 107,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "83 52.",
                    "sid": 108,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "94 76.",
                    "sid": 109,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "05 30.",
                    "sid": 110,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "76 55.",
                    "sid": 111,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "55 38.",
                    "sid": 112,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "46 10 0 51.",
                    "sid": 113,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "40 54.",
                    "sid": 114,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "72 51.",
                    "sid": 115,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "42 78.",
                    "sid": 116,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "25 33.",
                    "sid": 117,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "32 68.",
                    "sid": 118,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "95 46.",
                    "sid": 119,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "72 90.",
                    "sid": 120,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "90 51.",
                    "sid": 121,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "40 58.",
                    "sid": 122,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "05 9 6 0 6 1 0 1 3 1 3 3 13 2 8 1 1 7 8 5 2 4 7 4 16 4 1 3 0 1 0 0 10 15 9 0 95.",
                    "sid": 123,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "23 1 0 0 90.",
                    "sid": 124,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "90 1 0 0 1 0 0 76.",
                    "sid": 125,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "74 89.",
                    "sid": 126,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "79 52.",
                    "sid": 127,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "94 84.",
                    "sid": 128,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "50 46.",
                    "sid": 129,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "15 55.",
                    "sid": 130,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "55 2 0 2 0 30.",
                    "sid": 131,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "84 44.",
                    "sid": 132,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "59 66.",
                    "sid": 133,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "66 89.",
                    "sid": 134,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "54 63.",
                    "sid": 135,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "15 68.",
                    "sid": 136,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "95 33.",
                    "sid": 137,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "33 33.",
                    "sid": 138,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "33 43.",
                    "sid": 139,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "99 59.",
                    "sid": 140,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "58 Table 1: Summary of the results obtained by our algorithm in comparison to Word 2007 Since the idea was to check grammar, we only selected material that was orthographically correct, any minor typos being corrected beforehand.",
                    "sid": 141,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In comparison with the mistakes dealt with in the grammar book, the kind of grammatical problems that students make are of course very different.",
                    "sid": 142,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most frequent type of errors in this sample were gender agreement (typical in students with English as L1), lexical errors, prepositions and others such as problems with pronouns or with transitive verbs, among others.",
                    "sid": 143,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results of this second experiment are sum- marised in Table 2.",
                    "sid": 144,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Again, we compare performance against Word 2007 on the same dataset.",
                    "sid": 145,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of this experiment, lexical errors and gender agreement show the best performance because these phenomena appear at the bigram level, as in *Despue´s del boda (‘after the wedding’) which should be feminine (de la boda), or *una tranv´ıa ele´ctrica (‘electric tram’) which should be masculine (un tranv´ıa).",
                    "sid": 146,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But there are other cases where the error involves elements that are separated from each other by long distances and of course will not be solved with the type of strategy we are discussing, as in the case of *un pa´ıs donde el estilo de vida es avanzada (‘a country with an advanced lifestyle’), where the adjective avanzada is wrongly put in feminine when it should be masculine (avanzado), because it modifies a masculine noun estilo.",
                    "sid": 147,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, results of the detection phase are far from perfect but at least comparable to those achieved by Word in these categories.",
                    "sid": 148,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main difference between the performance of the two algorithms is that ours tends to flag a much larger number of errors, incurring in many false positives and severely degrading performance.",
                    "sid": 149,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The behaviour of Word is the opposite, it tends to flag fewer errors, thus leaving many errors undetected.",
                    "sid": 150,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be argued that, in a task like this, it is preferable to have false positives rather than false neg atives, because the difficult part of producing a text is to find the errors.",
                    "sid": 151,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, a system that produces many false positives will lose the confidence of the user.",
                    "sid": 152,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In any case, more important than a difference in precision is the fact that both systems tend to detect very different types of errors, which reinforces the idea that statistical algorithms could be a useful complement to a rule- based system.",
                    "sid": 153,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Result of multiple choice exercise.",
                    "sid": 154,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of the multiple choice exercise in the book are shown in Table 3.",
                    "sid": 155,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Again, we compared performance with that achieved by Word.",
                    "sid": 156,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to make this program solve a multiple choice exercise we submitted the different possibilities for each sentence and checked whether it was able to detect errors in the wrong sentences and leave the correct ones unflagged.",
                    "sid": 157,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results in this case are similar in general to those reported in Section 4.1.",
                    "sid": 158,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of a correct trial is with the fragment *el,la* ge´nesis del problema (‘the genesis of the problem’), where the option selected by the algorithm is la ge´nesis (feminine gender).",
                    "sid": 159,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, it is not capable of giving the correct answer when the context is very general, such as in *los,las* pen- dientes son uno de los complementos ma´ s vendi- dos como regalo (‘Earrings are one of the accessories most frequently sold as a gift’), in which the words to choose from are at the beginning of the sentence and they are followed by son (‘they are’), which comes from ser, perhaps the most frequent and polysemous Spanish verb.",
                    "sid": 160,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The correct answer is los (masculine article), but the system offers the incorrect las (feminine) because of the polysemy of the word, since las pendientes also exist, but means ‘the slopes’ or even ‘the ones pending’.",
                    "sid": 161,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This Experiment W o r d 2 0 0 7 Typ e of err or tp fn fp % P % R % F1 tp fn fp % P % R % F1 gen der agr ee me nt l e x i c a l s e l e c t i o n p r e p o s i t i o n s v a r i o u s tot al 9 16 2 4 31 6 10 11 7 34 3 4 2 5 17 7 5 8 0 5 0 44.",
                    "sid": 162,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "44 64.",
                    "sid": 163,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "58 6 0 61.",
                    "sid": 164,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "53 15.",
                    "sid": 165,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "38 36.",
                    "sid": 166,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "36 47.",
                    "sid": 167,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "69 66.",
                    "sid": 168,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "66 69.",
                    "sid": 169,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "56 23.",
                    "sid": 170,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "52 39.",
                    "sid": 171,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "99 54.",
                    "sid": 172,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "86 7 4 0 3 14 8 22 13 8 51 0 0 0 3 3 1 0 0 1 0 0 0 5 0 82.",
                    "sid": 173,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "35 46.",
                    "sid": 174,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "66 15.",
                    "sid": 175,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "38 0 27.",
                    "sid": 176,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "27 21.",
                    "sid": 177,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "53 63 .6 3 26 .6 6 0 35 .2 9 34 .1 4 Table 2: Replication of the experiment with a corpus of non-native speakers (CEDEL2, Lozano, 2009) Tri als This Experim ent Word 2007 Typ e of err or Co rre ct % P Co rre ct % P adv erb s ge nre con fusi on DO -IO 9 1 0 4 8 7 2 88.",
                    "sid": 178,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "89 70.",
                    "sid": 179,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "00 50.",
                    "sid": 180,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "00 5 3 2 55.",
                    "sid": 181,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "55 3 0 5 0 Table 3: Solution of the multiple choice exercise 4.3 Result of inflection exercise.",
                    "sid": 182,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results in the case of the inflection exercise are summarised in Table 4.",
                    "sid": 183,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When giving verb forms, results are correct in 66.67% of the cases.",
                    "sid": 184,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, in the case of La mayor´ıa de la gente *creer* que...",
                    "sid": 185,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(‘The majority of people think that...’), the correct answer is cree, among other possibilities such as creen (plural) or cre´ıa (past).",
                    "sid": 186,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But results are generally unsuccessful (22.22%) when choosing the correct tense, such as in the case of Si el problema me *atan˜ er* a m´ı, ya hubiera hecho algo para remediarlo (‘If the problem was of my concern, I would have already done something to solve it’).",
                    "sid": 187,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this example, the correct verb tense is atan˜ era or atan˜ ese, both of which are forms for the third person past subjunctive used in conditional clauses, but the system gives atan˜ e, a correct form for the verb atan˜ er that, nevertheless, cannot be used in this sentence.",
                    "sid": 188,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As it can be seen, the problem is extremely difficult for a statistical procedure (there are around 60 verb forms in Spanish), and this may explain why the results of this type of exercise were more disappointing.",
                    "sid": 189,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typ e of err or Tri als Co rre ct % P ver b nu mb er ver b ten se 9 9 6 2 66.",
                    "sid": 190,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "67 22.",
                    "sid": 191,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "22 Table 4: Results of the inflection exercise 4.4 Result of filling-in the blanks.",
                    "sid": 192,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When asked to restore a missing word in a sentence, the algorithm is capable of offering the correct answer in cases such as El abogado * defendio´ al peligroso asesino...",
                    "sid": 193,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(‘The lawyer -who defended the dangerous murderer...’), where the missing word is que.",
                    "sid": 194,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other cases were not solved correctly, as the fragment * a´ cida manzana (‘the acid apple’), because the bigram la a´ cida is much less frequent than lluvia a´ cida, ‘acid rain’, the wrong candidate proposed by the system.",
                    "sid": 195,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results of this exercise are summarised in Table 5.",
                    "sid": 196,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typ e of err or Tri als Co rre ct % P arti cle s pro no un s 7 7 4 3 57.",
                    "sid": 197,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "14 42.",
                    "sid": 198,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "86 Table 5: Results of the fill-in-the-blank exercise",
                    "sid": 199,
                    "ssid": 110,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions and future work. ",
            "number": "5",
            "sents": [
                {
                    "text": "In the previous sections we have outlined a first experiment in the detection of different types of grammar errors.",
                    "sid": 200,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In summary, the algorithm is able to detect difficult mistakes such as *in- formes conteniendo (instead of informes que con- ten´ıan ‘reports that contained’: a wrong use of the gerund) or *ma´ scaras antigases (instead of ma´ scaras antiga´ s ‘gas masks’, an irregular plural), which are errors that were not detected by MS Word.",
                    "sid": 201,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the difficulties we found is that, despite the fact that the corpus used is probably the most extensive corpus ever compiled, there are bigrams that are not present in it.",
                    "sid": 202,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not surprising, since one of the functions of linguistic competence is the capacity to represent and make comprehensible strings of words which have never been produced before.",
                    "sid": 203,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another problem is that frequency is not always useful for detecting mistakes, because the norm can be very separated from real use.",
                    "sid": 204,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of this is that, in one of the error detection exercises, the system considers that the participle fre´ıdos (‘fried’) is incorrect because it is not in the corpus, but the participle is actually correct, even when the majority of speakers think that only the irregular form (frito) is normative.",
                    "sid": 205,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The opposite is also true: some incorrect structures are very frequently used and many speakers perceive them as correct, such as ayer noche instead of ayer por la noche (‘last night’), or some very common Gallicisms such as *medidas a tomar instead of medidas por tomar ‘measures to be taken’, or *asunto a discutir (‘matter to discuss’) which should be asunto para discutir.",
                    "sid": 206,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several ideas have been put forward to address these difficulties in future improvements to this ingleses (the British), indios (indians) and so on.",
                    "sid": 207,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such a line of study could produce interesting results and greatly improve the rate of success of our grammar checker.",
                    "sid": 208,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This research has been made possible thanks to funding from the Spanish Ministry of Science and Innovation, project: “Agrupacio´ n sema´ntica y relaciones lexicolo´ gicas en el diccionario”, lead researcher J. DeCesaris (HUM200907588/FILO); APLE: “Procesos de actualizacio´ n del le´xico del espan˜ ol a partir de la prensa”, 20102012, lead researcher: M. research, such as the use of trigrams and longer T. Cabre´ (FFI200912188-C0501/FILO) and n-grams instead of only bigrams for error detection.",
                    "sid": 209,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "POS-tagging and proper noun detection are also essential.",
                    "sid": 210,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another possibility is to complement the corpus with different Spanish corpora, including press articles and other sources.",
                    "sid": 211,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are also planning to repeat the experiment with a new version of the n-gram database this time not as plain word forms but as classes of objects such that the corpus will have greater power of generalisation.",
                    "sid": 212,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following another line of research that we have already started (Nazar and Renau, in preparation), we will produce clusters of words according to their distributional similarity, which will result in a sort of Spanish taxonomy.",
                    "sid": 213,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be accomplished because all the words that represent, say, the category of vehicles are, in general, very similar as regards their distribution.",
                    "sid": 214,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once we have organised the lexicon of the corpus into categories, we will replace those words by the name of the category they belong to, for instance, PERSON, NUMBER, VEHICLE, COUNTRY, ORGANISATION, BEVERAGE, ANIMAL, PLANT and so on.",
                    "sid": 215,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By doing this, the Google n-gram corpus will be useful to represent a much more diverse variety of n-grams than those it actually contains.",
                    "sid": 216,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The implications of this idea go far beyond the particular field of grammar checking and include the study of collocations and of predicate-argument structures in general.",
                    "sid": 217,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We could ask, for instance, which are the most typical agents of the Spanish verb disparar (to shoot).",
                    "sid": 218,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Searching for the trigram los * dispararon in the database, we can learn, for instance, that those agents can be soldados (soldiers), espan˜ oles (Spaniards), guardias (guards), polic´ıas (policemen), can˜ ones (cannons), militares (the military), Fundacio´ n Comillas in relation with the project “Diccionario de aprendizaje del espan˜ ol como lengua extranjera”.",
                    "sid": 219,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The authors would like to thank the anonymous reviewers for their helpful comments, Cristo´ bal Lozano for providing the non-native speaker corpus CEDEL2, Mark Andrews for proofreading, the team of the CIBER HPC Platform of Universitat Pompeu Fabra (Silvina Re and Milton Hoz) and the people that compiled and decided to share the Google Books N-gram corpus with the rest of the community (Michel et al., 2010).",
                    "sid": 220,
                    "ssid": 21,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}