{
    "ID": "W12-3311",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper presents an open and flexible methodological framework for the automatic acquisition of multiword expressions (MWEs) from monolingual textual corpora.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This research is motivated by the importance of MWEs for NLP applications.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After briefly presenting the modules of the framework, the paper reports extrinsic evaluation results considering two applications: computer-aided lexicography and statistical machine translation.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both applications can benefit from automatic MWE acquisition and the expressions acquired automatically from corpora can both speed up and improve their quality.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The promising results of previous and ongoing experiments encourage further investigation about the optimal way to integrate MWE treatment into these and many other applications.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "Multiword expressions (MWEs) range over linguistic constructions such as idioms (to pay an arm and a leg), fixed phrases (rock ’n’ roll) and noun compounds (dry ice).",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is no unique and widely accepted definition for the term multiword expression.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It can be an “arbitrary and recurrent word combination” (Smadja, 1993) or “a syntactic and semantic unit whose exact and unambiguous meaning or connotation cannot be derived directly from the meaning or connotation of its components” (Choueka, 1988) or simply an “idiosyncratic interpretation that crosses word boundaries (or spaces)” (Sag et al., 2002).",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MWEs lie in the fuzzy zone between lexicon and syntax, thus constituting a real challenge for NLP systems.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, they are very pervasive, occurring frequently in everyday language as well as in specialised communications.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some common properties of MWEs are:1 1 These are not binary yes/no flags, but values in a continuum going from flexible word combinations to prototypical fixed expressions.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SRC I paid my poor parents a visit MT J’ai payé mes pauvres parents une visite REF J’ai rendu visite à mes pauvres parents SRC Students pay an arm and a leg to park on campus MT Les étudiants paient un bras et une jambe pour se garer sur le campus REF Les étudiants paient les yeux de la tête pour se garer sur le campus SRC It shares the translation-invariance and homogeneity properties with the central moment MT Il partage la traductioninvariance et propriétés d’homogénéité avec le moment central REF Il partage les propriétés d’invariance par translation et d’homogénéité avec le moment central Table 1: Examples of SMT errors due to MWEs.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Arbitrariness: sometimes valid constructions are not acceptable because people do not use them.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Smadja (1993, p. 143–144) illustrates this by presenting 8 different ways of referring to the Dow Jones index, among which only 4 are used.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Institutionalisation: MWEs are recurrent, as they correspond to conventional ways of saying things.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Jackendoff (1997) estimates that they compose half of the entries of a speaker’s lexicon, and Sag et al.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2002) point out that this may be an underestimate if we consider domain-specific MWEs.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Limited semantic variability: MWEs do not undergo the same semantic compositionality rules as ordinary word combinations.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is expressed in terms of (i) non-compositionality, as the meaning of the whole expression often cannot be directly inferred from the meaning of the parts composing it, (ii) non-substitutability, as it is not possible to replace part of an MWE by a related (synonym/equivalent) word or construction, and (iii) no word-for- word translation.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "61 Proceedings of the 2012 Student Research Workshop, pages 61–66, Jeju, Republic of Korea, 814 July 2012.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2012 Association for Computational Linguistics • Limited syntactic variability: standard grammatical rules do not apply to MWEs.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This can be expressed in terms of (i) lexicalisation, as one cannot list all MWEs in the lexicon (undergeneration) nor include them all in the grammar (overgeneration) and (ii) extragrammaticality, as MWEs are unpredictable and seem “weird” for a second language learner who only knows general rules.2 • Heterogeneity: MWEs are hard to define because they encompass a large amount of phenomena.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, NLP applications cannot use a unified approach and need to rely on some typology3 . In this paper, I adopt the definition by Calzolari et al.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2002), who define MWEs as: different but related phenomena [which] can be described as a sequence4 of words that acts as a single unit at some level of linguistic analysis.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This generic and intentionally vague definition can be narrowed down according to the application needs.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, for the statistical machine translation (MT) system5 used in the examples shown in Table 1, an MWE is any sequence of words which, when not translated as a unit, generates errors: ungrammatical or unnatural verbal constructions (sentence 1), awkward literal translations of idioms (sentence 2) and problems of lexical choice and word order in specialised texts (sentence 3).",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These examples illustrate the importance of correctly dealing with MWEs in MT applications and, more generally, MWEs can speed up and help remove ambiguities in many current NLP applications, for example: • Lexicography: Church and Hanks (1990) used a lexicographic environment as their evaluation scenario, comparing manual and intuitive research with the automatic association ratio they proposed.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Word sense disambiguation: MWEs tend to be less polysemous than simple words.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finlayson and Kulkarni (2011) exemplify that the word world has 9 senses in Wordnet 1.6, record has 14, but world record has only 1.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• POS tagging and parsing: recent work in parsing and POS tagging indicates that MWEs can help remove syntactic ambiguities (Seretan, 2008).",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Information retrieval: when MWEs like pop star are indexed as a unit, the accuracy of the system improves on multiword queries (Acosta et al., 2011).",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "examples of mwes that breach standard grammatical rules include. ",
            "number": "2",
            "sents": [
                {
                    "text": "kingdom come and by and large.",
                    "sid": 32,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 For example, Smadja (1993) classifies them according to syntactic function while Sag et al.",
                    "sid": 33,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2002) classify them according to flexibility.",
                    "sid": 34,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Thesis contributions.",
                    "sid": 35,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Despite the importance of MWEs in several applications, they are often neglected in the design and construction of real-life systems.",
                    "sid": 36,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In 1993, Smadja pointed out that “. . . although disambiguation was originally considered as a performance task, the collocations retrieved have not been used for any specific computational task.” Most of the recent and current research in the MWE community still focuses on MWE acquisition instead of integration of automatically acquired or manually compiled resources into applications.",
                    "sid": 37,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main contribution of my thesis is that it represents a step toward the integration of automatically extracted MWEs into real-life applications.",
                    "sid": 38,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Concretely, my contributions can be classified in two categories: first, I propose a unified, open and flexible methodological framework (§ 3) for automatic MWE acquisition from corpora; and second, I am performing an intrinsic and extrinsic evaluation of MWE acquisition (§ 4), dissecting the influence of the different types of resources employed in the acquisition on the quality of the MWEs.",
                    "sid": 39,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results of ongoing experiments are interesting but further work is needed to better understand the contributions of MWEs to the systems (§ 5).",
                    "sid": 40,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Methodological Framework To date, there is no agreement on whether there is a single best method for MWE acquisition, or whether a different subset of methods works better for a given MWE type.",
                    "sid": 41,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most of recent work on MWE treatment focuses on candidate extraction from preprocessed text (Seretan, 2008) and on the automatic filtering and ranking through association measures (Evert, 2004; Pecina, 2010), but few authors provide a whole picture of the MWE treatment pipeline.",
                    "sid": 42,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the advantages of the framework I propose is that it models the whole acquisition process with modular tasks that can be chained in several ways, each task having multiple available techniques.",
                    "sid": 43,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, it is highly customisable and allows for a large number of parameters to be tuned according to the target MWE types.",
                    "sid": 44,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, the techniques I have developed do not depend on a fixed length of candidate expression nor on adjacency assumptions, as the words in an expression might occur several words away.",
                    "sid": 45,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thanks to this flexibility, this methodology can be easily applied to virtually any language, MWE type and domain, not strictly depending on a given formalism or tool6 . Intuitively, for a given language, if some preprocessing tools like POS taggers and/or parsers are available, the results will be much better than running the methods on raw text.",
                    "sid": 46,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But since such tools are not available for all languages, the methodology was conceived to be applicable even in the absence of preprocessing.",
                    "sid": 47,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 Although they define MWEs as “sequences”, assuming contiguity,.",
                    "sid": 48,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "we assume “sets” of words for greater generality.",
                    "sid": 49,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Automatic translations (MT) by Google (http://translate.",
                    "sid": 50,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "google.com/) on 2012/02/18.",
                    "sid": 51,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Reference (REF) by native speaker.",
                    "sid": 52,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 However, it is designed to deal with languages that use spaces to.",
                    "sid": 53,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "separate words.",
                    "sid": 54,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, when working with Chinese, Japanese, or even with German compounds, some additional preprocessing is required.",
                    "sid": 55,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evaluation of MWE Acquisition Published results comparing MWE extraction techniques usually evaluate them on small controlled data sets using objective measures such as precision, recall and mean average preci raw corpus PREPROCESSING * POS tagging * Lemmatisation preprocessed corpus sion (Schone and Jurafsky, 2001; Pearce, 2002; Evert and Krenn, 2005).",
                    "sid": 56,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the one hand, the results of intrinsic evaluation are often vague or inconclusive: although they shed some light on the optimal parameters for the given scenario, they are hard to generalise and cannot be directly applied to other configurations.",
                    "sid": 57,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The quality of acquired MWEs as measured by objective criteria depends on the language, domain and type of the target construction, on corpus size and genre, on already available resources7 , on the applied filters, preprocessing steps, etc. On the other hand, extrinsic evaluation consists of inserting acquired MWEs into a real NLP application and evaluating the impact of this new data on the overall perfor web as corpus ﬁltering patterns * Dependency parsing INDEXING CANDIDATE EXTRACTION * n-grams * POS sequences (multilevel RegExp) * syntax CANDIDATE FILTERING * Counting * Statistical features * Filters: - Stopwords - Patterns - Thresholds * Ranking and croping VALIDATION * Sampling * Human annotation * Comparison with indexed corpus MWE candidates Filtered candidates extraction patterns mance of the system.",
                    "sid": 58,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, it may be easier to aska human annotator to evaluate the output of an MT sys MWE gold standard Validated Contributive dictionary management tem than to ask whether a sequence of words constitutes an MWE.",
                    "sid": 59,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, another original contribution of my thesis is application-oriented extrinsic evaluation of MWE acquisition model LEARNING candidates NLP acquisition on two study cases: computer-aided lexicography and statistical machine translation.",
                    "sid": 60,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "My goal is to investigate (1) how much the MWEs impact on the application and (2) what is (are) the best way(s) of integrating them in the complex pipeline of the target application.",
                    "sid": 61,
                    "ssid": 30,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "mwe extraction. ",
            "number": "3",
            "sents": [
                {
                    "text": "Among early work on developing methods for MWE identification, there is that of Smadja (1993).",
                    "sid": 62,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "He proposed and developed a tool called Xtract, aimed at general-purpose collocation extraction from text using a combination of n-grams and a mutual information measure.",
                    "sid": 63,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On general-purpose texts, Xtract has a precision of around 80%.",
                    "sid": 64,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since then, many advances have been made, either looking at MWEs in general (Dias, 2003), or focusing on specific MWE types, such as collocations, phrasal verbs and compound nouns.",
                    "sid": 65,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A popular type-independent approach to MWE identification is to use statistical association measures, which have been applied to the task with varying degrees of success (Evert and Krenn, 2005).",
                    "sid": 66,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the advantages of this approach is that it is language independent.",
                    "sid": 67,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is particularly important since although work on MWEs in several languages has been reported, e.g. Dias (2003) for Portuguese and Evert and Krenn (2005) for German, work on English still seems to predominate.",
                    "sid": 68,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I propose a new framework called mwetoolkit, described in Figure 1, which integrates multiple techniques and covers the whole pipeline of MWE acquisition.",
                    "sid": 69,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One can preprocess a raw monolingual corpus, if tools are application Figure 1: Framework for MWE acquisition from corpora available for the target language, enriching it with POS tags, lemmas and dependency syntax.",
                    "sid": 70,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, based on expert linguistic knowledge, intuition, empiric observation and/or examples, one defines multilevel patterns in a formalism similar to regular expressions to describe the target MWEs.",
                    "sid": 71,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The application of these patterns on an indexed corpus generates a list of candidate MWEs.",
                    "sid": 72,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For filtering, a plethora of methods is available, ranging from simple frequency thresholds to stopword lists and sophisticated association measures.",
                    "sid": 73,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the resulting filtered candidates are either directly injected into an NLP application or further manually validated before application.",
                    "sid": 74,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An alternative use for the validated candidates is to train a machine learning model which can be applied on new corpora in order to automatically identify and extract MWEs based on the characteristics of the previously acquired ones.",
                    "sid": 75,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For further details, please refer to the website of the framework8 and to previous publications (Ramisch et al., 2010a; Ramisch et al., 2010b).",
                    "sid": 76,
                    "ssid": 15,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "application-oriented evaluation. ",
            "number": "4",
            "sents": [
                {
                    "text": "In this section, I present summarised results of extrinsic quantitative and qualitative evaluation of the framework for MWE acquisition propose in § 3.",
                    "sid": 77,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The target applications are computer-aided lexicography (§ 4.1) and statistical machine translation (§ 4.2).",
                    "sid": 78,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 It is useless to acquire MWEs already present in the dictionary..",
                    "sid": 79,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "8 http://mwetoolkit.sf.net La ng ua ge Ty pe C o r p u s ( w o r d s ) Ca nd id at es Fi na l M W Es P u b l i c a t i o n E n g li s h P V E u r o p a r l ( 1 3 M ) 5 . 3 K 8 7 5 (R a mi sc h et al. , 20 12 ) F r e n c h N C E u r o p a r l ( 1 4 . 5 M ) 1 0 4 K 3 , 7 4 6 (R a mi sc h et al. , 20 12 ) G r e e k N C E u r o p a r l ( 2 6 M ) 2 5 K 8 1 5 (Li na rd aki et al., 20 10 ) Po rtu gu es e C P PLN BR FU LL (2 9 M) 4 0 7 K 7 7 3 ( D u r a n e t a l. , 2 0 1 1 ) Table 2: MWE acquisition applied to lexicography 4.1 Computer-aided Lexicography.",
                    "sid": 80,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this evaluation, I collaborated with colleagues who are experienced linguists and lexicographers, in order to create new lexical resources containing MWEs.",
                    "sid": 81,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The languages of the resources are English, French, Greek and Portuguese.",
                    "sid": 82,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 summarises the outcomes of each evaluation.",
                    "sid": 83,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The created data sets are freely available.9 , 10 We extracted English phrasal verbs (PVs) from the English portion of the Europarl corpus11 . We considered a PV as being formed by a verb (except to be and to have) followed by a prepositional particle12 not further than 5 words after it13 This resulted in 5,302 phrasal verb candidates occurring more than once in the corpus, from which 875 were automatically identified as true PVs and the others are currently under manual validation.",
                    "sid": 84,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Analogously, the French noun compounds (NCs) were extracted from Europarl using the following pattern: a noun followed by either an adjective or a prepositional complement14 . After filtering out candidates that occur once in the corpus, we obtained 3,746 MWE candidates and part of the remaining candidates will be manually analysed in the future.",
                    "sid": 85,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For Greek, in particular, considerable work has been done to study the linguistic properties of MWEs, but computational approaches are still limited (Fotopoulou et al., 2008).",
                    "sid": 86,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, we extracted from the POS-tagged Greek part of the Europarl corpus words matching the following patterns: adjective-noun, noun-noun, noun-determiner-noun, noun-preposition- noun, preposition-noun-noun, noun-adjective-noun and noun-conjunction-noun.",
                    "sid": 87,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The candidates were counted in two corpora and annotated with four association measures, and the top 150 according to each measure where annotated by three native speakers, that is, each annotator judged around 1,200 candidates and in the end the annotations were joined, creating a lexicon with 815 Greek nominal MWEs.",
                    "sid": 88,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "9 http://multiword.sourceforge.net/PHITE.php?",
                    "sid": 89,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sitesig=FILES&page=FILES_20_Data_Sets 10 http://www.inf.ufrgs.br/~ceramisch/?page= downloads/mwecompare 11 http://statmt.org/europarl 12 up, off, down, back, away, in, on.",
                    "sid": 90,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "13 Even though the particle might occur further than 5 positions away,.",
                    "sid": 91,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the goal of the work with Portuguese complex predicates (CPs) was to perform a qualitative analysis of these constructions.",
                    "sid": 92,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we POS- tagged the PLNBR-FULL corpus15 and extracted sequences of words matching the patterns: verb- [determiner]-noun-preposition, verb-preposition-noun, verb-[preposition/determiner]-adverb and verb-adjective.",
                    "sid": 93,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extraction process resulted in a list of 407,014 candidates which were further filtered using statistical association measures.",
                    "sid": 94,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, an expert human annotator manually validated 12,545 candidates from which 699 were annotated as compositional verbal expressions and 74 as idiomatic verbal expressions.",
                    "sid": 95,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Afterwards, a fine-grained analysis of each extraction pattern was conducted with the goal of finding correlations between syntactic flexibility and semantic properties such as compositionality.",
                    "sid": 96,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Statistical Machine Translation (SMT).",
                    "sid": 97,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Incorporating even simple treatments for MWEs in SMT systems can improve translation quality.",
                    "sid": 98,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, Carpuat and Diab (2010) adopt two complementary strategies for integrating MWEs: a static strategy of single-tokenisation that treats MWEs as word-with- spaces and a dynamic strategy that adds a count for the number of MWEs in the source phrase.",
                    "sid": 99,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They found that both strategies result in improvement of translation quality, which suggests that SMT phrases alone do not model all MWE information.",
                    "sid": 100,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Morin and Daille (2010) obtained an improvement of 33% in the French–Japanese translation of MWEs with a morphologically-based compositional method for backing-off when there is not enough data in a dictionary to translate a MWE (e.g. chronic fatigue syndrome decomposed as [chronic fatigue] [syndrome], [chronic] [fatigue syndrome] or [chronic] [fatigue] [syndrome]).",
                    "sid": 101,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For translating from and to morphologically rich languages like German, where a compound is in fact a single token formed through concatenation, Stymne (2011) splits the compound into its single word components prior to translation and then applies some post-processing, like the reordering or merging of the components, after translation.",
                    "sid": 102,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "She obtains improvements in BLEU from 21.63 to 22.12 in English–Swedish and from 19.31 to 19.73 in English–German.",
                    "sid": 103,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "such cases are sufficiently rare to be ignored in this experiment.",
                    "sid": 104,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "14 Prepositions de, à and en followed by optionally determined noun..",
                    "sid": 105,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "15 www.nilc.icmc.usp.br/plnbr Ba sel ine 0.",
                    "sid": 106,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 3 0 . 3 6 0 . 1 1 TO K 0.",
                    "sid": 107,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 5 0 . 2 9 0 . 1 6 PV ? 0.",
                    "sid": 108,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 0 0 . 3 9 0 . 1 1 PA RT 0.",
                    "sid": 109,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 3 0 . 3 6 0 . 1 1 VE RB 0.",
                    "sid": 110,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 3 0 . 3 6 0 . 1 1 BI LE X 0.",
                    "sid": 111,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 0 0 . 2 9 0 . 2 0 Table 3: Evaluation of translation of phrasal verbs in test set.",
                    "sid": 112,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the current experiments, a standard non factored phrase-based SMT system was built using the open- source Moses toolkit with parameters similar to those of the baseline system for the 2011 WMT campaign.",
                    "sid": 113,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "16 . For training, we used the English–Portuguese Europarl v6 (EP) corpus, with 1.7M sentences and around 50M words.",
                    "sid": 114,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training data contains the first 200K sentences tokenized and lowercased, resulting in 152,235 parallel sentences and around 3.1M words.",
                    "sid": 115,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The whole Portuguese corpus was used as training data for 5-gram language model built with SRILM.",
                    "sid": 116,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Phrasal verbs were automatically identified using the jMWE tool and a dictionary of PVs.",
                    "sid": 117,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compared the following five strategies for the integration of automatically identified phrasal verbs in the system: • TOK: before translation, rearrange the verb and the particle in a joint configuration and transform them into a single token with underscore (e.g. call him up into call_up him).",
                    "sid": 118,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• PV?: add a binary feature to each bi-phrase indicating whether a source phrasal verb has been detected in it or not.",
                    "sid": 119,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• PART: replace the particle by the one most frequently used with the target verb, using a web-based language model with a symmetric windows of 1 to 5 words around the particle.",
                    "sid": 120,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• VERB: modify the form of the Portuguese verb (gerund or infinitive), according to the form detected on the English side.",
                    "sid": 121,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• BILEX (or bilingual lexicon): augment the phrase table of the baseline system with 179,133 new bilingual phrases from an English–Portuguese phrasal verb lexicon.",
                    "sid": 122,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 shows the preliminary results of a human evaluation performed on a test set of 100 sentences.",
                    "sid": 123,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sentences were inspected and we verified that, while some translations improve with the integration strategies, others are degraded.",
                    "sid": 124,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No absolute improvement was observed, but we believe that this is due to the fact that our evaluation needs to consider more fine-grained classes of 16 www.statmt.org/wmt11/baseline.html set.",
                    "sid": 125,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, we would need to annotate more data in order to obtain more representative results.",
                    "sid": 126,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These hypotheses motivate us to continue our investigation in order to obtain a deeper understanding the impact of each integration strategy on each step of the SMT system.",
                    "sid": 127,
                    "ssid": 51,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "future experiments and perspectives. ",
            "number": "5",
            "sents": [
                {
                    "text": "In this paper, I described an open framework for the automatic acquisition of MWEs from corpora.",
                    "sid": 128,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What distinguishes it from related work is that it provides an integrated environment covering the whole acquisition pipeline.",
                    "sid": 129,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each module, there are multiple available techniques which are flexible, portable and can be combined in several ways.",
                    "sid": 130,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The usefulness of the framework is then presented in terms of extrinsic application-based evaluation.",
                    "sid": 131,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I presented summarised results of ongoing experiments in computer-aided lexicography and in SMT.",
                    "sid": 132,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although our results are promising, the experimentson SMT need further investigation.",
                    "sid": 133,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I am currently apply ing syntax-based identification and analysing word alignment and translation table entries for a set of prototypical MWEs, in order to obtain a better understanding of the impact of each integration strategy on the system.",
                    "sid": 134,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, I would like to pursue previous experiments on bilingual MWE acquisition from parallel and comparable resources.",
                    "sid": 135,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, I would like to experiment on MWE simplification (e.g. replacing a multiword verb like go back by its simplex form regress) as preprocessing for SMT, in order to improve translation quality by making the source language look more like the target language.As these improvements depend in the MT paradigm, I would also like to evaluate strategies for the integration of verbal MWEs in expert MT systems.",
                    "sid": 136,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In spite of a large amount of work in the area, the treatment of MWEs in NLP applications is still an open and challenging problem.",
                    "sid": 137,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is not surprising, given their complex and heterogeneous behaviour (Sag et al., 2002).",
                    "sid": 138,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the beginning of the 2000’s, Schone and Juraf- sky (2001) asked whether the identification of MWEs was a solved problem, and the answer that paper gave was ’no, it is not’.",
                    "sid": 139,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The MWE workshop series have shown that this is still the case, listing several challenges in MWE treatment like lexical representation and application-oriented evaluation.",
                    "sid": 140,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, I believe that my thesis will be a significant step toward the full integration of MWE treatment in NLP applications, but there is still a long road to go.",
                    "sid": 141,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "This work was partly funded by the CAMELEON project (CAPES–COFECUB 70711) and by a Ph.D. grant from the French Ministry for Higher Education and Research.",
                    "sid": 142,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I would Boitet, as well as the colleagues who contributed to this work: Evita Linardaki, Valia Kordoni, Magali Sanchez Duran and Vi- tor De Araujo.",
                    "sid": 143,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}