{
    "ID": "W12-3144",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper describes the phrase-based SMT systems developed for our participation in the WMT12 Shared Translation Task.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Translations for English↔German and English↔French were generated using a phrase-based translation system which is extended by additional models such as bilingual, fine-grained part-of-speech (POS) and automatic cluster language models and discriminative word lexica.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we explicitly handle out-of-vocabulary (OOV) words in German, if we have translations for other morphological forms of the same stem.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we extended the POS-based reordering approach to also use information from syntactic trees.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "In this paper, we describe our systems for the NAACL 2012 Seventh Workshop on Statistical Machine Translation.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We participated in the Shared Translation Task and submitted translations for English↔German and English↔French.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use a phrase-based decoder that can use lattices as input and developed several models that extend the standard log-linear model combination of phrase-based MT. In addition to the POS-based reordering model used in past years, for GermanEnglish we extended it to also use rules learned using syntax trees.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation model was extended by the bilingual language model and a discriminative word lexicon using a maximum entropy classifier.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the French-English and English-French translation systems, we also used phrase table adaptation to avoid overestimation of the probabilities of the huge, but noisy Giga corpus.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the GermanEnglish system, we tried to learn translations for OOV words by exploring different morphological forms of the OOVs with the same lemma.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we combined different language models in the log-linear model.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used word- based language models trained on different parts of the training corpus as well as POS-based language models using fine-grained POS information and language models trained on automatic word clusters.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The paper is organized as follows: The next section gives a detailed description of our systems including all the models.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation results for all directions are presented afterwards and we close with a conclusion.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "system description. ",
            "number": "2",
            "sents": [
                {
                    "text": "For the French↔English systems the phrase table is based on a GIZA++ word alignment, while the systems for German↔English use a discriminative word alignment as described in Niehues and Vogel (2008).",
                    "sid": 15,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The language models are 4-gram SRI language models using KneserNey smoothing trained by the SRILM Toolkit (Stolcke, 2002).",
                    "sid": 16,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The problem of word reordering is addressed with POS-based and tree-based reordering models as described in Section 2.3.",
                    "sid": 17,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The POS tags used in the reordering model are obtained using the TreeTagger (Schmid, 1994).",
                    "sid": 18,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The syntactic parse trees are generated using the Stanford Parser (Rafferty and Manning, 2008).",
                    "sid": 19,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An in-house phrase-based decoder (Vogel, 2003) is used to perform translation.",
                    "sid": 20,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Optimization with 349 Proceedings of the 7th Workshop on Statistical Machine Translation, pages 349–355, Montre´al, Canada, June 78, 2012.",
                    "sid": 21,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2012 Association for Computational Linguistics regard to the BLEU score is done using Minimum Error Rate Training as described in Venugopal et al.",
                    "sid": 22,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2005).",
                    "sid": 23,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During decoding only the top 10 translation options for every source phrase are considered.",
                    "sid": 24,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Data.",
                    "sid": 25,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our translation models were trained on the EPPS and News Commentary (NC) corpora.",
                    "sid": 26,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the additional available data for French and English (i.e. UN and Giga corpora) were exploited in the corresponding systems.",
                    "sid": 27,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The systems were tuned with the news-test2011 data, while news-test2011 was used for testing in all our systems.",
                    "sid": 28,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We trained language models for each language on the monolingual part of the training corpora as well as the News Shuffle and the Gigaword (version 4) corpora.",
                    "sid": 29,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The discriminative word alignment model was trained on 500 hand-aligned sentences selected from the EPPS corpus.",
                    "sid": 30,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Preprocessing.",
                    "sid": 31,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training data is preprocessed prior to training the system.",
                    "sid": 32,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This includes normalizing special symbols, smart-casing the first word of each sentence and removing long sentences and sentences with length mismatch.",
                    "sid": 33,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the German parts of the training corpus, in order to obtain a homogenous spelling, we use the hunspell1 lexicon to map words written according to old German spelling rules to new German spelling rules.",
                    "sid": 34,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to reduce the OOV problem of German compound words, Compound splitting as described in Koehn and Knight (2003) is applied to the German part of the corpus for the German-to-English system.",
                    "sid": 35,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Giga corpus received a special preprocessing by removing noisy pairs using an SVM classifier as described in Mediani et al.",
                    "sid": 36,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011).",
                    "sid": 37,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The SVM classifier training and test sets consist of randomly selected sentence pairs from the corpora of EPPS, NC, tuning, and test sets.",
                    "sid": 38,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Giving at the end around 16 million sentence pairs.",
                    "sid": 39,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Word Reordering.",
                    "sid": 40,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast to modeling the reordering by a distance- based reordering model and/or a lexicalized distor 1 http://hunspell.sourceforge.net/ tion model, we use a different approach that relies on POS sequences.",
                    "sid": 41,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By abstracting from surface words to POS, we expect to model the reordering more accurately.",
                    "sid": 42,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For German-to-English, we additionally apply reordering rules learned from syntactic parse trees.",
                    "sid": 43,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3.1 POS-based Reordering Model In order to build the POS-based reordering model, we first learn probabilistic rules from the POS tags of the training corpus and the alignment.",
                    "sid": 44,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Continuous reordering rules are extracted as described in Rottmann and Vogel (2007) to model short-range re- orderings.",
                    "sid": 45,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When translating between German and English, we apply a modified reordering model with non-continuous rules to cover also long-range re- orderings (Niehues and Kolss, 2009).",
                    "sid": 46,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3.2 Tree-based Reordering Model Word order is quite different between German and English.",
                    "sid": 47,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And during translation especially verbs or verb particles need to be shifted over a long distance in a sentence.",
                    "sid": 48,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using discontinuous POS rules already improves the translation tremendously.",
                    "sid": 49,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we apply a tree-based reordering model for the GermanEnglish translation.",
                    "sid": 50,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Syntactic parse trees provide information about the words in a sentence that form constituents and should therefore be treated as inseparable units by the reordering model.",
                    "sid": 51,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the tree-based reordering model, syntactic parse trees are generated for the whole training corpus.",
                    "sid": 52,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then the word alignment between the source and target language part of the corpus is used to learn rules on how to reorder the constituents in a German source sentence to make it matches the English target sentence word order better.",
                    "sid": 53,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to apply the rules to the source text, POS tags and a parse tree are generated for each sentence.",
                    "sid": 54,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then the POS- based and tree-based reordering rules are applied.",
                    "sid": 55,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The original order of words as well as the reordered sentence variants generated by the rules are encoded in a word lattice.",
                    "sid": 56,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lattice is then used as input to the decoder.",
                    "sid": 57,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the test sentences, the reordering based on POS and trees allows us to change the word order in the source sentence so that the sentence can be translated more easily.",
                    "sid": 58,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we build reordering lattices for all training sentences and then extract phrase pairs from the monotone source path as well as from the reordered paths.",
                    "sid": 59,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4 Translation Models.",
                    "sid": 60,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the models used in the baseline system described above, we conducted experiments including additional models that enhance translation quality by introducing alternative or additional information into the translation modeling process.",
                    "sid": 61,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4.1 Phrase table adaptation Since the Giga corpus is huge, but noisy, it is advantageous to also use the translation probabilities of the phrase pair extracted only from the more reliable EPPS and News commentary corpus.",
                    "sid": 62,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we build two phrase tables for the French↔English system.",
                    "sid": 63,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One trained on all data and the other only trained on the EPPS and News commentary corpus.",
                    "sid": 64,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two models are then combined using a log-linear combination to achieve the adaptation towards the cleaner corpora as described in (Niehues et al., 2010).",
                    "sid": 65,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The newly created translation model uses the four scores from the general model as well as the two smoothed relative frequencies of both directions from the smaller, but cleaner model.",
                    "sid": 66,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a phrase pair does not occur in the in- domain part, a default score is used instead of a relative frequency.",
                    "sid": 67,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our case, we used the lowest probability.",
                    "sid": 68,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4.2 Bilingual Language Model In phrase-based systems the source sentence is segmented by the decoder according to the best combination of phrases that maximize the translation and language model scores.",
                    "sid": 69,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This segmentation into phrases leads to the loss of context information at the phrase boundaries.",
                    "sid": 70,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although more target side context is available to the language model, source side context would also be valuable for the decoder when searching for the best translation hypothesis.",
                    "sid": 71,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To make also source language context available we use a bilingual language model, in which each token consists of a target word and all source words it is aligned to.",
                    "sid": 72,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The bilingual tokens enter the translation process as an additional target factor and the bilingual language model is applied to the additional factor like a normal language model.",
                    "sid": 73,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For more details see Niehues et al.",
                    "sid": 74,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011).",
                    "sid": 75,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4.3 Discriminative Word Lexica Mauser et al.",
                    "sid": 76,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009) have shown that the use of discriminative word lexica (DWL) can improve the translation quality.",
                    "sid": 77,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For every target word, they trained a maximum entropy model to determine whether this target word should be in the translated sentence or not using one feature per one source word.",
                    "sid": 78,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When applying DWL in our experiments, we would like to have the same conditions for the training and test case.",
                    "sid": 79,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this we would need to change the score of the feature only if a new word is added to the hypothesis.",
                    "sid": 80,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a word is added the second time, we do not want to change the feature value.",
                    "sid": 81,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to keep track of this, additional bookkeeping would be required.",
                    "sid": 82,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also the other models in our translation system will prevent us from using a word too often.",
                    "sid": 83,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we ignore this problem and can calculate the score for every phrase pair before starting with the translation.",
                    "sid": 84,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This leads to the following definition of the model: J p(e|f ) = n p(ej |f ) (1) j=1 In this definition, p(ej |f ) is calculated using a maximum likelihood classifier.",
                    "sid": 85,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each classifier is trained independently on the parallel training data.",
                    "sid": 86,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All sentences pairs where the target word e occurs in the target sentence are used as positive examples.",
                    "sid": 87,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We could now use all other sentences as negative examples.",
                    "sid": 88,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But in many of these sentences, we would anyway not generate the target word, since there is no phrase pair that translates any of the source words into the target word.",
                    "sid": 89,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we build a target vocabulary for every training sentence.",
                    "sid": 90,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This vocabulary consists of all target side words of phrase pairs matching a source phrase in the source part of the training sentence.",
                    "sid": 91,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we use all sentence pairs where e is in the target vocabulary but not in the target sentences as negative examples.",
                    "sid": 92,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This has shown to have a postive influence on the translation quality (Mediani et al., 2011) and also reduces training time.",
                    "sid": 93,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4.4 Quasi-Morphological Operations for OOV words Since German is a highly inflected language, there will be always some word forms of a given Ger Figure 1: Quasi-morphological operations man lemma that did not occur in the training data.",
                    "sid": 94,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to be able to also translate unseen word forms, we try to learn quasi-morphological operations that change the lexical entry of a known word form to the unknown word form.",
                    "sid": 95,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These have shown to be beneficial in Niehues and Waibel (2011) using Wikipedia2 titles.",
                    "sid": 96,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idea is illustrated in Figure 1.",
                    "sid": 97,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we look at the data, our system is able to translate a German word Kamin (engl.",
                    "sid": 98,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "chimney), but not the dative plural form Kaminen.",
                    "sid": 99,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To address this problem, we try to automatically learn rules how words can be modified.",
                    "sid": 100,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we look at the example, we would like the system to learn the following rule.",
                    "sid": 101,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If an “en” is appended to a German word, as it is done when creating the dative plural form of Kaminen, we need to add an “s” to the end of the English word in order to perform the same morphological word transformation.",
                    "sid": 102,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use only rules where the ending of the word has at most 3 letters.",
                    "sid": 103,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Depending on the POS, number, gender or case of the involved words, the same operation on the source side does not necessarily correspond to the same operation on the target side.",
                    "sid": 104,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To account for this ambiguity, we rank the different target operation using the following four features and use the best ranked one.",
                    "sid": 105,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Firstly, we should not generate target words that do not exist.",
                    "sid": 106,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we have an advantage that we can use monolingual data to determine whether the word exists.",
                    "sid": 107,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, a target operation that often coincides with a given source operation should be better than one that is rarely used together with the source operation.",
                    "sid": 108,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We therefore look at pairs of entries in the lexicon and count in how many of them the source operation can be applied to the source side and the target operation can be applied to the target side.",
                    "sid": 109,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then use only operations that occur at least ten times.",
                    "sid": 110,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, 2 http://www.wikipedia.org/ we use the ending of the source and target word to determine which pair of operations should be used.",
                    "sid": 111,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Integration We only use the proposed method for OOVs and do not try to improve translations of words that the baseline system already covers.",
                    "sid": 112,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We look for phrase pairs, for which a source operation ops exists that changes one of the source words f1 into the OOV word f2.",
                    "sid": 113,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since we need to apply a target operation to one word on the target side of the phrase pair, we only consider phrase pairs where f1 is aligned to one of the target words of the phrase containing e1.",
                    "sid": 114,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If a target operation exists given f1 and ops, we select the one with the highest rank.",
                    "sid": 115,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we generate a new phrase pair by applying ops to f1 and opt to e1 keeping the original scores from the phrase pairs, since the original and synthesized phrase pair are not directly competing anyway.",
                    "sid": 116,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We do not add several phrase pairs generated by different operations, since we would then need to add the features used for ranking the operations into the MERT.",
                    "sid": 117,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is problematic, since the operations were only used for very few words and therefore a good estimation of the weights is not possible.",
                    "sid": 118,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.5 Language Models.",
                    "sid": 119,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 4-gram language models generated by the SRILM toolkit are used as the main language models for all of our systems.",
                    "sid": 120,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For English-French and French-English systems, we use a good quality corpus as in-domain data to train in-domain language models.",
                    "sid": 121,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, we apply the POS and cluster language models in different systems.",
                    "sid": 122,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All language models are integrated into the translation system by a log-linear combination and received optimal weights during tuning by the MERT.",
                    "sid": 123,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.5.1 POS Language Models The POS language model is trained on the POS sequences of the target language.",
                    "sid": 124,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this evaluation, the POS language model is applied for the EnglishGerman system.",
                    "sid": 125,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We expect that having additional information in form of probabilities of POS sequences should help especially in case of the rich morphology of German.",
                    "sid": 126,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The POS tags are generated with the RFTagger (Schmid and Laws, 2008) for German, which produces fine-grained tags that include person, gender and case information.",
                    "sid": 127,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use a 9-gram language model on the News Shuffle corpus and the German side of all parallel corpora.",
                    "sid": 128,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More details and discussions about the POS BLEU score of 22.31 on the test data.",
                    "sid": 129,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the last two systems, we did not perform new optimization runs.",
                    "sid": 130,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "language model can be found in Herrmann et al.",
                    "sid": 131,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2011).",
                    "sid": 132,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.5.2 Cluster Language Models The cluster language model follows a similar idea as the POS language model.",
                    "sid": 133,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since there is a data sparsity problem when we substitute words with the word classes, it is possible to make use of larger context information.",
                    "sid": 134,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the POS language model, POS tags are the word classes.",
                    "sid": 135,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, we generated word classes in a different way.",
                    "sid": 136,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we cluster the words in the corpus using the MKCLS algorithm (Och, 1999) given a number of classes.",
                    "sid": 137,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, we replace the words in the corpus by their cluster IDs.",
                    "sid": 138,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we train an n-gram language model on this corpus consisting of cluster IDs.",
                    "sid": 139,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generally, all cluster language models used in our systems are 5-gram.",
                    "sid": 140,
                    "ssid": 126,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results. ",
            "number": "3",
            "sents": [
                {
                    "text": "Using the models described above we performed several experiments leading finally to the systems used for generating the translations submitted to the workshop.",
                    "sid": 141,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following sections describe the experiments for the individual language pairs and show the translation results.",
                    "sid": 142,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are reported as case-sensitive BLEU scores (Papineni et al., 2002) on one reference translation.",
                    "sid": 143,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 GermanEnglish.",
                    "sid": 144,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments for the GermanEnglish translation system are summarized in Table 1.",
                    "sid": 145,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Baseline system uses POS-based reordering, discriminative word alignment and a language model trained on the News Shuffle corpus.",
                    "sid": 146,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By adding lattice phrase extraction small improvements of the translation quality could be gained.",
                    "sid": 147,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further improvements could be gained by adding a language model trained on the Gigaword corpus and adding a bilingual and cluster-based language model.",
                    "sid": 148,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used 50 word classes and trained a 5- gram language model.",
                    "sid": 149,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Afterwards, the translation quality was improved by also using a discriminative word lexicon.",
                    "sid": 150,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the best system was achieved by using Tree-based reordering and using special treatment for the OOVs.",
                    "sid": 151,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This system generates a System Dev Test Baseline 23.64 21.32 + Lattice Phrase Extraction 23.76 21.36 + Gigaward Language Model 24.01 21.73 + Bilingual LM 24.19 21.91 + Cluster LM 24.16 22.09 + DWL 24.19 22.19 + Tree-based Reordering - 22.26 + OOV22.31 Table 1: Translation results for GermanEnglish 3.2 EnglishGerman.",
                    "sid": 152,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The EnglishGerman baseline system uses also POS-based reordering, discriminative word alignment and a language model based on EPPS, NC and News Shuffle.",
                    "sid": 153,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A small gain could be achieved by the POS-based language model and the bilingual language model.",
                    "sid": 154,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further gain was achieved by using also a cluster-based language model.",
                    "sid": 155,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this language model, we use 100 word classes and trained a 5-gram language model.",
                    "sid": 156,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the best system uses the discriminative word lexicon.",
                    "sid": 157,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "System Dev Test Baseline 17.06 15.57 + POSLM 17.27 15.63 + Bilingual LM 17.40 15.78 + Cluster LM 17.77 16.06 + DWL 17.75 16.28 Table 2: Translation results for EnglishGerman 3.3 English-French.",
                    "sid": 158,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 summarizes how our English-French system evolved.",
                    "sid": 159,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline system here was trained on the EPPS, NC, and UN corpora, while the language model was trained on all the French part of the parallel corpora (including the Giga corpus).",
                    "sid": 160,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also uses short-range reordering trained on EPPS and NC.",
                    "sid": 161,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This system had a BLEU score of around 26.7.",
                    "sid": 162,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Giga parallel data turned out to be quite beneficial for this task.",
                    "sid": 163,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It improves the scores by more than 1 BLEU point.",
                    "sid": 164,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More importantly, additional language models boosted the system quality: around 1.8 points.",
                    "sid": 165,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, three language models were log-linearly combined: In addition to the aforementioned, two additional language models were trained on the monolingual sets (one for News and one for Gigaword).",
                    "sid": 166,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We could get an improvement of around 0.2 by retraining the reordering rules on EPPS and NC only, but using Giza alignment from the whole data.",
                    "sid": 167,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adapting the translation model by using EPPS and NC as in-domain data improves the BLEU score by only 0.1.",
                    "sid": 168,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This small improvement might be due to the fact that the news domain is very broad and that the Giga corpus has already been carefully cleaned and filtered.",
                    "sid": 169,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, using a bilingual language model enhances the BLEU score by almost 0.3.",
                    "sid": 170,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, incorporating a cluster language model adds an additional 0.1 to the score.",
                    "sid": 171,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This leads to a system with 30.58.",
                    "sid": 172,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "provide improvement in our system.",
                    "sid": 173,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second largest improvement came from the domain adaptation that includes an in-domain language model and adaptations to the phrase extraction.",
                    "sid": 174,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The BLEU score has improved about 1 BLEU in total.",
                    "sid": 175,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The in- domain data we used here are parallel EPPS and NC corpus.",
                    "sid": 176,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further gains were obtained by augmenting the system with a bilingual language model adding around 0.2 BLEU to the previous score.",
                    "sid": 177,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The submitted system was obtained by adding the cluster 5-gram language model trained on the News Shuffle corpus with 100 clusters and thus giving 30.25 as the final score.",
                    "sid": 178,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "System Dev Test Baseline 25.81 27.15 + Indomain LM 26.17 27.91 + PT Adaptation 26.33 28.11 + Big LMs 28.90 29.82 + Bilingual LM 29.14 30.09 + Cluster LM 29.31 30.25 Table 3: Translation results for English-French 3.4 French-English.",
                    "sid": 179,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The development of our system for the French- English direction is summarized in Table 4.",
                    "sid": 180,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline system for this direction was trained on the EPPS, NC, UN and Giga parallel corpora, while the language model was trained on the French part of the parallel training corpora.",
                    "sid": 181,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline system includes the POS-based reordering model with short- range rules.",
                    "sid": 182,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The largest improvement of 1.7 BLEU score was achieved by the integration of the bigger language models which are trained on the English version of News Shuffle and the Gigaword corpus (v4).",
                    "sid": 183,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We did not add the language models from the monolingual English version of EPPS and NC data, since the experiments have shown that they did not Table 4: Translation results for French-English",
                    "sid": 184,
                    "ssid": 44,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "4",
            "sents": [
                {
                    "text": "We have presented the systems for our participation in the WMT 2012 Evaluation for English↔German and English↔French.",
                    "sid": 185,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all systems we could improve by using a class-based language model.",
                    "sid": 186,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, the translation quality could be improved by using a discriminative word lexicon.",
                    "sid": 187,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we trained a maximum entropy classifier for every target word.",
                    "sid": 188,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For English↔French, adapting the phrase table helps to avoid using wrong parts of the noisy Giga corpus.",
                    "sid": 189,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the German-to-English system, we could improve the translation quality additionally by using a tree-based reordering model and by special handling of OOV words.",
                    "sid": 190,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the inverse direction we could improve the translation quality by using a 9-gram language model trained on the fine-grained POS tags.",
                    "sid": 191,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This work was realized as part of the Quaero Pro- gramme, funded by OSEO, French State agency for innovation.",
                    "sid": 192,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}