{
    "ID": "W12-1616",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "In this work we study the effectiveness ofspeaker adaptation for dialogue act recognition in multiparty meetings.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we analyzeidiosyncracy in dialogue verbal acts by qualitatively studying the differences and conflictsamong speakers and by quantitively comparing speaker-specific models.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on theseobservations, we propose a new approach fordialogue act recognition based on reweighteddomain adaptation which effectively balancethe influence of speaker specific and otherspeakers’ data.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our experiments on a real-world meeting dataset show that with evenonly 200 speaker-specific annotated dialogueacts, the performances on dialogue act recognition are significantly improved when compared to several baseline algorithms.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To ourknowledge, this work is the first 1 to tackle thispromising research direction of speaker adaptation for dialogue act recogntion.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "By representing a higher level intention of utterancesduring human conversation, dialogue act labels arebeing used to enrich the information provided byspoken words (Stolcke et al., 2000).",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dialogue actrecognition is a preliminary step towards deep dialogue understanding.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It plays a key role in the design of dialogue systems.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides, Fernandez et al.(2008) find certain dialogue acts are important cuesfor detecting decisions in Multi-party dialogue.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In 1This paper is an extended version of a poster presented atSemDial 2011, with new experiments and deeper analysis.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Ranganath et al.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009), dialogue acts are used asimportant features for flirt detection.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Automatic dialogue act recognition is still an active research topic.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The conventional approach is totrain one generic classifier using a large corpus ofannotated utterances.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One aspect that makes it sochallenging is that people can express the same idea(or speech act) using a very different set of spokenwords.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even more, people can mean different thingswith the exact same spoken words.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These idiosyncratic differences in dialogue acts make the learningof generic classifiers extremely challenging.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Luckily, in many applications such as face-to-face meetings or tele-immersion, we have access to archivesof previous interactions with the same participants.From these archives, a small subset of spoken utterances can be efficiently annotated.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As we will latershow in our experiments, even a small number of annotated utterances can make a significant difference.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper, we propose a new approach fordialogue act recognition based on reweighted domain adaptation which effectively balance the influence of speaker specific and other speakers’ data.By treating each speaker as one domain, we pointout the connection between training speaker specific dialogue act classifier and supervised domainadaptation problem.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We analyze idiosyncracy indialogue verbal acts by qualitatively studying thedifferences and conflicts among speakers and byquantitively comparing speaker-specific models.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Wepresent an extensive set of experiments studying theeffect of speaker adaptation on dialogue act recogntion in multi-party meetings using the ICSIMRDAdataset (Shriberg, 2004).",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "118 The following section presents related work on dialogue act recognition and domain adaptation.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 describes the ICSIMRDA (Shriberg, 2004)dataset which is used in all our experiments.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 analyze idiosyncracy in dialogue acts, bothqualitatively and quantitatively.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 5 explains our reweighting-based speaker adaptation algorithm.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 6 contains all experiments to provethe applicability of speaker adaptation to dialogueact recognition.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, inspired by the promisingresults, Section 8 describes some future directions.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "previous work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Automatic dialogue act recognition has been an important problem in the past decades.",
                    "sid": 29,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different dialogue act labeling standards and datasets have beenprovided, including Switchboard-DAMSL (Stolckeet al., 2000), ICSIMRDA (Shriberg, 2004) andAMI (Carletta, 2007).",
                    "sid": 30,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Stolcke et al (2000) is oneof the first work using machine learning technique(HMM) to automatically segment and recognize dialogue acts.",
                    "sid": 31,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rangarajan et al.",
                    "sid": 32,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009) demonstratedwell-designed prosodic n-gram features are veryhelpful for Dialogue Act recognition in MaximumEntropy model.",
                    "sid": 33,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And Ang et al (2005) exploredjoint segmentation and dialogue act classification forspeech from ICSI.",
                    "sid": 34,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Domain adaptation is a popular problem in natural language processing community due to the sparsity of labeled data.",
                    "sid": 35,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Jiang (Jiang, 2007) breaksthe analysis of domain adaptation problem into dis-tributional differences in instances and classification functions between source and target data.",
                    "sid": 36,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "InDaume’s work (2007) several domain adaptation algorithms are described.",
                    "sid": 37,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our speaker adaptation algorithm is inspired by the reweighting-based adaptation algorithm introduced in this paper.",
                    "sid": 38,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recently, dialogue act adaptation has been gettinga lot of attention.",
                    "sid": 39,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tur et al.",
                    "sid": 40,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006) successfully useSwitchboardDAMSL to help dialogue act recognition in ICSIMRDA.",
                    "sid": 41,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Promising results have beenobtained by using a regression model to combine themodel weights obtained by training on Switchboard-DAMSL and ICSIMRDA respectively.",
                    "sid": 42,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Followingthe work by Tur et al.",
                    "sid": 43,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006), Guz et al.",
                    "sid": 44,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009) further studied the effectiveness of dialogue act domainadaptation in cascaded dialogue act segmentation and recognition system, their results prove adaptation in the intermediate step (segmentation) are alsovery helpful for the final output (recognition).",
                    "sid": 45,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Jeonget al (2009) use semi-supervised boosting algorithmto leverage labeled data from Switchboard-DAMSLand ICSIMRDA to help dialogue act recognition inemail and forums.",
                    "sid": 46,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Margolis et.al (2010) use a structural correspondence learning technique to adapt dialogue act recognition on automatic translated Spanish genre with the help of Switchboard-DAMSL andICSIMRDA.",
                    "sid": 47,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Kolar et al.",
                    "sid": 48,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) explores the difference among speakers for dialogue act segmentation in ICSIMRDA dataset.",
                    "sid": 49,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar to the approachtaken in Tur et al.",
                    "sid": 50,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2006), adaptation is performedthrough the combination of generic speaker independent Language Model and other speakers’ Language Model.",
                    "sid": 51,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Significant improvements have beenobtained for most of the selected speakers.",
                    "sid": 52,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All these previous papers focused on adapting dialogue act models between domains and did notaddress the person-specific adaptation.",
                    "sid": 53,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The onlyexception was Kolar et al.",
                    "sid": 54,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) who exploredspeaker-specific dialogue act segmentation.",
                    "sid": 55,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To ourknowledge, this paper is the first work to analyze theeffectiveness of speaker adaptation for dialogue actrecognition.",
                    "sid": 56,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "icsi-mrda corpus. ",
            "number": "3",
            "sents": [
                {
                    "text": "Different Dialogue Act labeling standards anddatasets have been provided in recent years, including Switchboard-DAMSL (Stolcke et al., 2000),ICSIMRDA (Shriberg, 2004) and AMI (Carletta,2007).",
                    "sid": 57,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ICSIMRDA is the dataset for our experiments because many of its meetings contain thesame speakers, thus making it more suitable for ourspeaker adaptation study.",
                    "sid": 58,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The tagset in ICSIMRDAis adapted from DAMSL standard (damsl, 1997) byallowing multiple tags per dialogue act.",
                    "sid": 59,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each dialogue act in ICSIMRDA has one general tag andmultiple specific tags.",
                    "sid": 60,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ICSIMRDA consists of 75 meetings, eachroughly an hour long.",
                    "sid": 61,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are five categories ofmeetings (three of which we are actively using inour experiments) : Bed is about the discussion ofnatural language processing and neural theories oflanguage, Bmr is for the discussion on ICSI meetingcorpus, Bro is on speech recognition topics and Bns 119 ID Tag Type Nb.",
                    "sid": 62,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Meetings Nb.",
                    "sid": 63,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DAs1 mn015 Bed 15 62282 me010 Bed 11 53093 me013 Bmr 25 97534 mn017 Bmr 15 40595 fe016 Bmr 18 55006 me018 Bro 20 42637 me013 Bro 22 11928 Table 1: The 7 speakers from ICSIMRDA dataset usedin our experiments.",
                    "sid": 64,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The table lists: the Speaker ID, original speaker tag, the type of meeting selected for thisspeaker, the number of meetings this speaker participatedand the total number of dialogue acts by this speaker.",
                    "sid": 65,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "is about network and architecture.",
                    "sid": 66,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last categoryis varies which contains all other topics.",
                    "sid": 67,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From these 75 meetings, there are 53 uniquespeakers in total, and an average of about 6 speakersper meeting.",
                    "sid": 68,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 speakers2 having more than 4, 000dialogue acts are selected for our adaptation experiments.",
                    "sid": 69,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 shows the details of our 7 selectedspeakers.",
                    "sid": 70,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the word transcriptions, we created an extended list of linguistic features per utterance.",
                    "sid": 71,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the 7 selected speakers, we computed 14653 unigram features, 158884 bigram features and 400025 trigram features.",
                    "sid": 72,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following the work of Shriberg et al.",
                    "sid": 73,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2004), weuse the 5 general tags in our experiments: • Disruption indicates the current Dialogue Actis interrupted.",
                    "sid": 74,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Back Channel are utterances which are notmade directly by a speaker as a response anddo not function in a way that elicits a responseeither.",
                    "sid": 75,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Floor Mechanism are dialogue acts for grabbing or maintaining the floor.",
                    "sid": 76,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Question is for eliciting listener feed back.• And finally, unless an utterance is completely indecipherable or else can be further describedby a general tag, then its default status is Statement.",
                    "sid": 77,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our dataset consisted of 47040 dialogue acts.",
                    "sid": 78,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thedistribution of Dialogue Act is shown in Table 2.",
                    "sid": 79,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2speaker me013 is split into me013Bmr and me013Bro toavoid the difference introduced by meeting types.",
                    "sid": 80,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tag proportionDisruption 14.73% Back Channel 10.20%Floor Mechanism 12.40% Question 7.20%Statement 55.46% Table 2: Distribution of dialogue acts in our dataset.",
                    "sid": 81,
                    "ssid": 25,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "idiosyncrasy in dialogue acts. ",
            "number": "4",
            "sents": [
                {
                    "text": "Our goal is to create a dialogue act recognition algorithm that can adapt to specific speakers.",
                    "sid": 82,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Someimportant questions must be studied before creating such algorithm.",
                    "sid": 83,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first obvious one is: dospeakers really differ in their choice of words andassociated dialogue acts?",
                    "sid": 84,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Do we really see a variability on how people express their dialogue intent?",
                    "sid": 85,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If the answers are yes, then we will expectthat learning a dialogue act recognizer from speaker-specific utterances should always outperform a recognizer learned from someone else data.",
                    "sid": 86,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4.1presents a comparative experiment addressing thesequestions.",
                    "sid": 87,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To better understand the results from this comparative experiment, we also performed a qualitative analysis presented in Section 4.2 where welook more closely at the differences between speakers.",
                    "sid": 88,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These two qualitative and quantitative analysisare building block for our adaptation algorithm presented in Section 5.",
                    "sid": 89,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Speaker-Specific Recognizers.",
                    "sid": 90,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An important assumption when performing speakeradaptation (or more generally domain adaptation)is that data coming from the same speaker shouldbe similar than data coming from another person.In other words, a recognizer trained on a speakershould perform better (when tested on the same person) than a recognizer trained on another speaker.We designed an experiment to test this hypothesis.",
                    "sid": 91,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We learned 7 speaker-specific recognizers, onefor each speaker (see Table 1).",
                    "sid": 92,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then tested allthese recognizers on new utterances from the same7 speakers.",
                    "sid": 93,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We looked the recognition performancewhen (1) the recognizer was trained on the sameperson and (2) when the recognizer was trained ona different person.",
                    "sid": 94,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This experiments quantitatively 120 Figure 1: Effect of same-speaker data on dialogue actrecognition.",
                    "sid": 95,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compare two approaches: (1) when arecognizer is trained on the same person and tested onnew utterances from the same person, and (2) when therecognizer was trained on another speaker (same test set).We vary the amount of training data to be 200, 500,1000, 1500 and 2000 dialogue acts.",
                    "sid": 96,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all cases, usingspeaker-specific recognizer outperforms recognizer fromother speakers.",
                    "sid": 97,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "analyze the the difference among speakers.",
                    "sid": 98,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experimental methodology used in this experiment isthe same as the other experiments described in thispaper (see Section 6).",
                    "sid": 99,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the Maximum Entropy model(MaxEnt) for all dialogue act recognizers (Ratnaparkhi, 1996).",
                    "sid": 100,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Please refer to Section 6.2for more details about the experimental methodology.",
                    "sid": 101,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 compares the average performanceswhen testing on the same speaker or on some otherspeaker.",
                    "sid": 102,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We vary the number of training data foreach speaker to be 200, 500, 1000, 1500 and 2000dialogue acts.",
                    "sid": 103,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For all five cases, the recognizerstrained on the same speaker outperforms the average performance when using a recognizer from another person.",
                    "sid": 104,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus speaker specific dialogue actsadaptation fits the assumption of domain adaptationproblems.",
                    "sid": 105,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Speakers Differences.",
                    "sid": 106,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To better understand the problem, we look moreclosely at the differences among speakers and theiruse of dialogue acts.",
                    "sid": 107,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We analyze the probleminduced by speaker idiosyncrasy in dialogue acts.During our qualitative analysis of the ICSIMRDAdataset, we identified three major differences explaining the performances observed in the previous sections: dialogue act conflicts, word distributionand dialogue act label distribution.",
                    "sid": 108,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We describethese three differences with some examples: Conflicts: These differences happen when twospeakers intended to express different meaningswhile speaking the exact same utterance.",
                    "sid": 109,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To exam-plify these conflicts, we computed mutual information between a specific utterance and all dialogue actlabels.",
                    "sid": 110,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We find interesting examples where for ex-emple the word right is the most important cue fordialogue act question when spoken by me013Bmr,while right is also an important cue for dialogue actback-channel for speaker me010-Bed.",
                    "sid": 111,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These examples suggest that conflicts exist among speakers andsimply trying to learn one generic model may notbe able to handle these conflicts.",
                    "sid": 112,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The generic modelwill learn what most people mean with this utterance, which may be the wrong prediction for ourspecific speaker.",
                    "sid": 113,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word distribution: People have their own vocabulary.",
                    "sid": 114,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although many words are the same, how often one person use each word will vary.",
                    "sid": 115,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although wemay not have direct conflict here, the problem canalso be serious.",
                    "sid": 116,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The learning algorithm may misleadingly focus on optimizing the weights for certainwords which are not important(e.g., words that occur more often in other speakers’ dialogue acts thanhis/her own) while underestimating the importantwords for this speaker.",
                    "sid": 117,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This observation suggeststhat our adaptation should take into account worddistribution.",
                    "sid": 118,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Label Distribution: Another interesting observation is to look at the distribution of dialogue act labels for different speakers.",
                    "sid": 119,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 shows the average distribution over all 7 speakers.",
                    "sid": 120,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When lookingmore closely at each speaker, we find some interesting differences.",
                    "sid": 121,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, speaker 1 made statements 61% of the time while speaker 4 made 49% ofthe time.",
                    "sid": 122,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While this difference may not look significant, these changes can definitely affect the recognition performance.",
                    "sid": 123,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So the adaptation model shouldalso take into account the dialogue act label distribution.",
                    "sid": 124,
                    "ssid": 43,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "reweighted speaker adaptation. ",
            "number": "5",
            "sents": [
                {
                    "text": "Based on the observations described in the previoussections, we implement a simple reweighting-based 121 domain adaptation algorithm mentioned in (Daume,2007) based on Maximum Entropy model (MaxEnt)(Ratnaparkhi, 1996).",
                    "sid": 125,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MaxEnt model is a popularand efficient discriminative model which can effectively accommodate large numbers of features.",
                    "sid": 126,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Allthe unigram, bigram and trigram features are usedas input to the maxEnt model, the output is the dialogue act label.",
                    "sid": 127,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "MaxEnt model maximizes the logconditional likelihood of all samples: Loss = N?1 log(p(yn|xn)) (1) where N is the number of samples for the trainingdata.",
                    "sid": 128,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "xn represents the feature of the nth sample andyn is the label.",
                    "sid": 129,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The conditional likelihood is definedas p(y|x) = exp(?i ?ifi(x, y))/Z(x) (2) where Z(x) is the normalization factor and fi(x, y)are the n-gram features described in Section 3.",
                    "sid": 130,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When applied to our problem of speaker adaptation, the reweighting adaptation model can be formally defined as Loss = wS?",
                    "sid": 131,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "n=1 log(p(yn|xn))+O? m=1 log(p(ym|xm))(3) where S is the number of labeled speaker-specificdialogue acts, O is the number for other speakers’labeled dialogue acts.",
                    "sid": 132,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each speaker, we trainone speaker-specific classifier by varying the distribution of training data.",
                    "sid": 133,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We reweight the importanceof speaker specific dialogue acts versus other speakers’ labeled dialogue acts in the training data.",
                    "sid": 134,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Theoptimal weight parameter w is automatically estimated through validation.",
                    "sid": 135,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is worth mentioning a specific instance of thereweighting adaptation algorithm.",
                    "sid": 136,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When w is set to1, the reweighting adaptation algorithm is equivalentto simply training a MaxEnt model by putting thespeaker-specific and generic data samples togetheras training data.",
                    "sid": 137,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, we will compare the reweighting adaptation approach with thissimpler approach, referred as constant adaptation.",
                    "sid": 138,
                    "ssid": 14,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments. ",
            "number": "6",
            "sents": [
                {
                    "text": "Our goal is to get one model specifically adaptedfor each speaker.",
                    "sid": 139,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first describes 4 different approaches to be compared in the experiments, andsection 6.2 explains our experimental methodology.",
                    "sid": 140,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1 4 ApproachesIn these experiments, we compare our approach,called reweighted adaptation, with three moreconventional approaches: speaker-specific only,Generic and Constant adaptation.",
                    "sid": 141,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Speaker Specific Only For this approach, wetrain the dialogue act recognizer using trainingsentences from the same speaker used duringtesting.",
                    "sid": 142,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Generic In this case, we train the dialogue actrecognizer using utterances from all speakersother than the speaker used during testing.",
                    "sid": 143,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Constant Adaptation For this approach, wetrain the dialogue act recognizer using allspeakers, including the speaker who will laterbe used for testing.",
                    "sid": 144,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All utterances have thesame weight in this case.",
                    "sid": 145,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Reweighted Adaptation This is our proposedapproach.",
                    "sid": 146,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As described in Section 5, we trainour dialogue act recognizer using all speakersbut reweight the utterances from the speakerwho will later be used for testing.",
                    "sid": 147,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.2 MethodologyIn all the following experiments we use MaxEntmodels as defined in Section 5.",
                    "sid": 148,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "L2 regularizationis used for MaxEnt to avoid overfitting.",
                    "sid": 149,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The optimalregularization parameter was automatically selectedduring validation.",
                    "sid": 150,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following regularization parameters were used: 0.01, 0.1, 1, 10 , 100, 1000 and0 (no regularization).",
                    "sid": 151,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the unigram, bigram andtrigram features are used in the maxEnt model.",
                    "sid": 152,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thelabels are the five dialogue act tags described in Section 3..",
                    "sid": 153,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All experiments were performed using holdouttesting and holdout validation.",
                    "sid": 154,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both validationand test sets consisted of 1000 dialogue acts.",
                    "sid": 155,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thetraining sets contained only utterances from meetings that were not in the validation set of test set.",
                    "sid": 156,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "122 Train Data 200 500 1000 1500 2000Speaker-specific Only 64.07 65.99 68.51 69.99 71.06Constant adaptation model 76.81 76.96 77.00 77.23 77.53Our reweighted adaptation model 78.17 78.29 78.67 78.74 78.47 Table 3: Average results among all 7 speakers when trainwith different combinations of speaker specific data andother speakers’ data.",
                    "sid": 157,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of speaker specific datais varied from 200, 500, 1000, 1500 to 2000.",
                    "sid": 158,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In many of our experiments, we analyzed the effect of training set size on the recognition performance.",
                    "sid": 159,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The speaker-specific data size varied from200, 500, 1000, 1500 and 2000 dialogue acts respectively.",
                    "sid": 160,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When training our reweighting adaptation algorithm described in Section 5, we used the following weights: 10, 30, 50, 75, and 100.",
                    "sid": 161,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The optimalweight factor was selected automatically during validation.",
                    "sid": 162,
                    "ssid": 24,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results. ",
            "number": "7",
            "sents": [
                {
                    "text": "In this section we present our approaches to studythe importance of speaker adaptation for dialogueact recognition.",
                    "sid": 163,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All following results are calculatedbased on the overall tag accuracies.",
                    "sid": 164,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We designedthree series of experiments for this study:• Generic Recognizer (Section 7.1)• Sparsity in speaker-specific data (Section 7.2)• Effectiveness of Constant Adaptation (Sec tion 7.3) • Performance of the reweighting algorithm(Section 7.4) 7.1 Generic RecognizerThe first result we get is on average, for each speakerwhen we use all other speaker’s data for training,then test on speaker- specific test data.",
                    "sid": 165,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of this generic recognizer is 76.76% is thebaseline we try to improve when adding speaker-specific data into consideration.",
                    "sid": 166,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.",
                    "sid": 167,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3The performance of our generic model is comparable to theresults from Ang et al (2005) when you take into considerationthat we used only 47,040 dialogue acts in our experiments (i.e.,dialogue acts from our 7 speakers) which is a small fractioncompared with Ang et al (2005) . 7.2 Sparsity of speaker-specific data.",
                    "sid": 168,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A second result is the performance when only using speaker-specific data.",
                    "sid": 169,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The row Speaker SpecificOnly in Table 3 shows the average results amongall speakers when for each speaker, we train using only data from the same speaker.",
                    "sid": 170,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The numberof speaker-specific training data we tried are 200,500, 1000, 1500, and 2000 respectively.",
                    "sid": 171,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Even with2000 speaker-specific dialogue acts for training, thebest accuracy is 71.06% which is lower than 76.76%when using generic recognizer.",
                    "sid": 172,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the challengein getting 2000 speaker-specific annotated dialogueacts, we are looking at a different approach wherewe need less speaker-specific data.",
                    "sid": 173,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.3 Results of Constant Adaptation.",
                    "sid": 174,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most straightforward way to combine otherspeakers’ data is to directly add them with speaker-specific data as train.",
                    "sid": 175,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We refer to this approachas constant adaptation.",
                    "sid": 176,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The row Constant Adaptation in Table 3 shows the average results amongall speakers when for each speaker, we combinethe speaker-specific data directly with the all otherspeaker’s data.",
                    "sid": 177,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our experiments, we varied theamount of speaker-specific data included to be 200,500, 1000, 1500, and 2000 respectively.",
                    "sid": 178,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For all7 speakers, the performance can always been improved by including speaker-specific data with allother speakers’ data for training.",
                    "sid": 179,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, themore speaker specific data added, the better performance we get.",
                    "sid": 180,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.4 Results of Reweighting Algorithm.",
                    "sid": 181,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, in this section we describe the results fora simple adaptation algorithm based on reweighting, as described in Section 5.",
                    "sid": 182,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following the samemethodology as previous experiments, we vary theamount of speaker-specific data to be 200, 500,1000, 1500 and 2000.",
                    "sid": 183,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best reweighting factor isselected through validation on speaker-specific validation data described in section 6.2.",
                    "sid": 184,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results ofall 7 speakers from Reweighting algorithm when wevary the amount of speaker-specific data are shownin Figure 3.We analyze the influence of the weighting factoron our speaker adaptation by plotting the recognition performance for different weights.",
                    "sid": 185,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 4 il 123 Figure 2: The average results among all 7 speakers whentrain with different combinations of speaker specific dataand other speakers’ data are displayed.",
                    "sid": 186,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In both Constantadaptation and Reweighted adaptation models the number of speaker specific data are varied from 200, 500,1000, 1500 to 2000.",
                    "sid": 187,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In Generic model, only all otherspeakers’ data are used for training data.",
                    "sid": 188,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3: Reweighting algorithm for all 7 IndividualSpeakers when varying the amount of training data to be0, 200, 500, 1000, 1500 and 2000.",
                    "sid": 189,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "lustrates the influence of the weight factor on threespeaker adaptation cases: None, 500 and 2000.",
                    "sid": 190,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inthis case, None represent the Constant Adaptation.We observe the following trend: with more speaker-specific data, the optimal reweighting factor is alsolower.",
                    "sid": 191,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This confirms that our reweighting algorithmfinds the right balance between speaker-specific dataand generic data.",
                    "sid": 192,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 and the row Reweighted Adaptationfrom Table 3 shows the effectiveness of reweighting algorithm.",
                    "sid": 193,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results shows that even this simple algorithm can efficiently balance the influenceof speaker specific data and other speakers’ data and 0 20 40 60 80 1000.765 0.77 0.775 0.78 0.785 0.79 None5002000 Figure 4: Average results of Reweighting among all 7speakers when the amount of speaker specific data is 0,500, 2000 give significantly improved results.",
                    "sid": 194,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And most surprisingly, even with only 200 speaker specific datathe reweighting algorithm can give very promisingresults.",
                    "sid": 195,
                    "ssid": 33,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "8",
            "sents": [
                {
                    "text": "In this work we analyze the effectiveness of speakeradaptation for dialogue act recognition.",
                    "sid": 196,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A simplereweighting algorithm is shown to give promisingimprovement on several baseline algorithms evenwith only 200 speaker-specific dialogue acts.",
                    "sid": 197,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thispaper is a first step toward automatic adaptation fordialogue act recognition.",
                    "sid": 198,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inspired by the promisingresults from the simple reweighting algorithm, weplan to evaluate other domain adaptation techniquessuch as Daume’s feature-based approach (2007).",
                    "sid": 199,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Itwill also be interesting to consider the unlabeleddata from each speaker when performing dialogueact recognition.",
                    "sid": 200,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "This material is based upon work supported bythe National Science Foundation under Grant No.1118018 and the U.S. Army Research, Development, and Engineering Command (RDECOM).",
                    "sid": 201,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thecontent does not necessarily reflect the position orthe policy of the Government, and no official endorsement should be inferred.",
                    "sid": 202,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "124",
                    "sid": 203,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}