{
    "ID": "W12-1011",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "X2 in another 1 ; furthermore, the part-of-speech We introduce a corpus of classical Chinese poems that has been word segmented and tagged with parts-of- speech (POS).",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the ill-defined concept of a ‘word’ in Chinese, previous Chinese corpora suffer from a lack of standardization in word segmentation, resulting in inconsistencies in POS tags, therefore hindering interoperability among corpora.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We address this problem with nested POS tags, which accommodates different theories of wordhood and facilitates research objectives requiring annotations of the ‘word’ at different levels of granularity.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "There has been much effort in enriching text corpora with linguistic information, such as parts-of-speech (Francis and Kučera, 1982) and syntactic structures (Marcus et al., 1993).",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The past decade has seen the development of Chinese corpora, mostly for Modern Chinese (McEnery & Xiao, 2004; Xue et al., 2005), but also a few for pre-modern, or “classical”, Chinese (Wei et al. 97; Huang et al. 2006; Hu & McLaughlin 2007).",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One common design issue for any corpus of Chinese, whether modern or classical, is word segmentation.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yet, no segmentation standard has emerged in the computational linguistics research community.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, two adjacent characters X1X2 may be considered a single word in one corpus, but treated as two distinct words X1 and (POS) tag assigned to X1X2 in the first corpus may differ from the tag for X1 and the tag for X2 in the second.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These inconsistencies have made it difficult to compare, combine or exploit Chinese corpora.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This paper addresses this problem by proposing a new method for word segmentation and POS tagging for Chinese and applying it on a corpus of classical Chinese poems.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "research objective. ",
            "number": "2",
            "sents": [
                {
                    "text": "A Chinese character may either function as a word by itself, or combine with its neighbor(s) to form a multi-character word.",
                    "sid": 11,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the goal of part-of-speech (POS) tagging is to assign one tag to each word, a prerequisite step is word segmentation, i.e., drawing word boundaries within a string of Chinese characters.",
                    "sid": 12,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The general test for ‘wordhood’ is whether “the meaning of the whole is compositional of its parts”; in other words, X1X2 forms one word when the meaning of the characters X1X2 does not equal to the meaning of X1 plus the meaning of X2 (Feng, 1998).",
                    "sid": 13,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the string 沙門 sha men ‘Buddhist monk’.",
                    "sid": 14,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a transliteration from Sanskrit, it bears no semantic relation with its constituent characters 沙 sha ‘sand’ and 門 men ‘door’.",
                    "sid": 15,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two characters therefore form one word.",
                    "sid": 16,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the point of view of corpus development, word segmentation has two consequences.",
                    "sid": 17,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, it defines the smallest unit for POS analysis.",
                    "sid": 18,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It would be meaningless to analyze the POS of the individual characters as, 1 This phenomenon can be compared with what is often.",
                    "sid": 19,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "known as multiword expressions (Sag et al., 2002) in other languages.",
                    "sid": 20,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "75 Proceedings of the 6th EACL Workshop on Language Technology for Cultural Heritage, Social Sciences, and Humanities, pages 75–84, Avignon, France, 24 April 2012.",
                    "sid": 21,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2012 Association for Computational Linguistics say, 沙/NN and 門/NN (see Table 1 for the list of POS tags used in this paper).",
                    "sid": 22,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, the two characters sha and men together should be assigned one POS tag, 沙門/NN.",
                    "sid": 23,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, word segmentation sets boundaries for automatic word retrieval.",
                    "sid": 24,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A simple string search for “sha men” on a non-segmented corpus might yield spurious matches, where sha is the last character of the preceding word, and men is the first character of the following one.",
                    "sid": 25,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In a word study on 本 覺 ben jue ‘original enlightenment’ (Lancaster, 2010), based on a non-segmented corpus of the Chinese Buddhist Canon, the author needed to manually examine each of the 763 occurrences of the string ben jue in order to determine which of them are in fact the word in question, rather than accidental collocations of the two characters.",
                    "sid": 26,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word boundaries resulting from word segmentation would have removed these ambiguities, expedited the search and enabled this kind of word studies to be performed on much larger scales.",
                    "sid": 27,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is not yet a scholarly consensus on a precise definition of ‘wordhood’ in Classical Chinese (Feng, 1998).",
                    "sid": 28,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Inevitably, then, treatment of word segmentation varies widely from corpus to corpus.",
                    "sid": 29,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some did not perform word segmentation (Huang et al. 2006); others adopted their own principles (Wei et al. 1997; Hu & McLaughlin 2007).",
                    "sid": 30,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lack of standardization not only hinders corpus interoperability, but also makes it difficult for any single corpus to cater to users with different assumptions about wordhood or different research objectives.",
                    "sid": 31,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What is regarded as one word for a user may be two words in the eyes of another.",
                    "sid": 32,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider two alternative analyses of the string 黃河 huang he ‘Yellow River’ in two research tasks.",
                    "sid": 33,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For retrieval of geographical references in a text, it should ideally be tagged as one single proper noun, 黃河/NR; to study parallelisms in poetry, however, it is better to be tagged as two separate words, 黃 /JJ huang ‘yellow’ followed by 河/NN he ‘river’, in order not to obscure the crucial POS sequence ‘adjective-noun’ that signals parallelism in a couplet.",
                    "sid": 34,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To settle on any particular word segmentation criterion, then, is to risk omitting useful information.",
                    "sid": 35,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are not qualified to lay down any definitive criterion for word segmentation; rather, we advocate a theory-neutral approach through nested POS tags: characters are analyzed individually whenever possible, but annotated with hierarchical tags to recognize possible word boundaries.",
                    "sid": 36,
                    "ssid": 26,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "previous work. ",
            "number": "3",
            "sents": [
                {
                    "text": "In this section, we summarize previous practices in Chinese word segmentation (section 3.1) and part-of-speech tagging (section 3.2), then describe existing frameworks of multi-level tagging (section 3.3).",
                    "sid": 37,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Word segmentation.",
                    "sid": 38,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As mentioned in Section 2, a common test for word segmentation is “compositionality of meaning”.",
                    "sid": 39,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While there are clear-cut cases like sha men, many cases fall in the grey area.",
                    "sid": 40,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Indeed, even native speakers can agree on word boundaries in modern Chinese only about 76% of the time (Sproat et al., 1996).",
                    "sid": 41,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is not surprising, then, that a myriad of guidelines for word segmentation have been proposed for various corpora of Modern Chinese (Liu et al., 1994; Chinese Knowledge Information Processing Group, 1996; Yu et al., 1998; Xia 2000; Sproat and Emerson, 2003).",
                    "sid": 42,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the rest of this section, we first review the approaches taken in three classical Chinese corpora, developed respectively at Jiaotong University (Huang et al., 2006), University of Sheffield (Hu et al., 2005) and the Academia Sinica (Wei et al., 1997).",
                    "sid": 43,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then describe in more detail a modern Chinese corpus, the Penn Chinese Treebank (Xue et al., 2005).",
                    "sid": 44,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Corpus at Jiaotong University.",
                    "sid": 45,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This treebank consists of 1000 sentences of preTsin classical Chinese.",
                    "sid": 46,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No word segmentation was performed.",
                    "sid": 47,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the one hand, this decision may be supported by the fact that “in general the syllable, written with a single character, and the word correspond in Classical Chinese” (Pulleyblank, 1995).",
                    "sid": 48,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, there are nonetheless a non- negligible number of strings for which it makes little sense to analyze their constituent characters.",
                    "sid": 49,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These include not only transliterations of foreign loanwords such as sha men, but also bound morphemes 2 and reduplications 3 (Pulleyblank, 1995).",
                    "sid": 50,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lack of segmentation in this corpus also leads to the lack of word boundaries to support word retrieval.",
                    "sid": 51,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 E.g., 然 ran, a suffix forming expressive adverbs such as 卒然 cu ran ‘abruptly’ 3 E.g., 須 xu ‘wait’, which, via partial reduplication, derives 須臾 xu yu ‘a moment’ Academia Sinica Ancient Chinese Corpus.",
                    "sid": 52,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With more than 500K characters, this is the largest word-segmented and POS-tagged corpus of classical Chinese.",
                    "sid": 53,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the annotation process, a character is presumed to be a word in its own right; it is combined with other characters to form a word if they fall into one of the following categories: parallel and subordinating compounds; bisyllabic words; reduplications; and proper nouns.",
                    "sid": 54,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two of these categories, namely, bisyllabic words and reduplications, are retained in our word segmentation criteria (see section 4.1).",
                    "sid": 55,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Proper nouns, as well as parallel and subordinating compounds, however, are treated differently (see section 4.2).",
                    "sid": 56,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sheffield Corpus of Chinese.",
                    "sid": 57,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This corpus has more than 109K characters of archaic Chinese and 147K characters of medieval Chinese.",
                    "sid": 58,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word segmentation was performed by hand.",
                    "sid": 59,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their criteria for word segmentation, unfortunately, do not seem to be publicly available.",
                    "sid": 60,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Penn Chinese Treebank.",
                    "sid": 61,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This widely used treebank of modern Chinese boasts an extensively documented word segmentation procedure (Xia, 2000), which rests on six principles.",
                    "sid": 62,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We follow their principle that complex internal structures should be segmented when possible (see section 4.2).",
                    "sid": 63,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also retain a second principle that a bound morpheme forms a word with its neighbor4, although morphemes in Classical Chinese are nearly always free forms (Feng, 1998).",
                    "sid": 64,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A third criterion is the number of syllables.",
                    "sid": 65,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider a noun phrase N1N2 where the first noun (N1) modifies the second (N2).",
                    "sid": 66,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This noun phrase is considered one word if N2 consists of one character, but two words if N2 has two or more characters.",
                    "sid": 67,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the string 北京大 學 bei jing da xue ‘Peking University’ is segmented as two words bei jing ‘Peking’ and da xue ‘university’, since ‘university’ is made up of two characters; however, a similar string 北京市 bei jing shi ‘Beijing City’ is one word, since ‘city’ consists of just one character shi.",
                    "sid": 68,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the dominance of monosyllabic words in classical Chinese, a direct application of this principle would have resulted in a large number of multi-character words in our corpus.",
                    "sid": 69,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, there are three linguistic tests.",
                    "sid": 70,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The “semantic compositionality” test has already been outlined in section 2 and is not repeated here.",
                    "sid": 71,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The “insertion test” asks whether another ren ‘person’ in the word 本人 ben ren ‘oneself’ morpheme can be inserted between two characters X1 and X2; if so, then X1X2 is unlikely to be a word.",
                    "sid": 72,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The “XP-substitution test” asks if a morpheme can be replaced by a phrase of the same type; if not, then it is likely to be part of a word.",
                    "sid": 73,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Performing these tests requires intuition and familiarity with the language.",
                    "sid": 74,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since no human is a native speaker of classical Chinese, we found it difficult to objectively and reliably apply these tests.",
                    "sid": 75,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, we strive to accommodate different views of wordhood in our corpus.",
                    "sid": 76,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Part-of-Speech Tagging.",
                    "sid": 77,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following word segmentation, each word is assigned a part-of-speech (POS) tag.",
                    "sid": 78,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Most POS tagsets cover the major word categories, such as nouns, verbs, and adjectives; they differ in the more fine-grained distinctions within these categories.",
                    "sid": 79,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For examples, verbs may be further subdivided into transitive and intransitive; nouns may be further distinguished as common, proper or temporal; and so on.",
                    "sid": 80,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general, a larger tagset provides more precise information, but may result in lower inter-annotator agreement, and hence reduced reliability.",
                    "sid": 81,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Classical Chinese does not have inflectional morphology; this makes POS tags even more informative, but also makes inter-annotator agreement more challenging.",
                    "sid": 82,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As with other languages, the POS tagset is tailored to fit one’s research objective, as reflected in the wide- ranging levels of granularity in different corpora, from 21 tags in (Huang et al., 2006), 26 in the Peking University corpus (Yu et al., 2002), 46 in the Academia Sinica Balanced Corpus (Chen et al., 1996), to 111 in the Sheffield Corpus of Chinese (Hu et al., 2005).",
                    "sid": 83,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our tagset is based on that of the Penn Chinese Treebank, which lies towards the lower end of this spectrum, with 33 tags.",
                    "sid": 84,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Multi-level Tagging.",
                    "sid": 85,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In principle, any text span may be annotated at an arbitrary number of levels using, for example, standoff annotation.",
                    "sid": 86,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In practice, most effort has concentrated on identifying named entities, such as (Doddington et al., 2004).",
                    "sid": 87,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While our corpus does specify word boundaries of multi-character proper nouns, it tackles all other forms of compounds in general (section 4.2).",
                    "sid": 88,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Turning to the Chinese language in particular, we are by no means the first to point out inconsistencies in word segmentation and POS tags among different corpora.",
                    "sid": 89,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Annotators of the Penn Chinese Treebank, among others, also recognized this issue (Xia, 2000).",
                    "sid": 90,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a remedy, a two-level annotation method is used on a number of grammatical constructions.",
                    "sid": 91,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Suppose it is uncertain whether X1 and X2 should be considered two separate words or one word.",
                    "sid": 92,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Under this method, X1 and X2 are first tagged individually (say, as pos1 and pos2), then tagged as a whole (say, as pos), and finally grouped together with a pair of brackets, resulting in the final form (X1/pos1 X2/pos2)/pos.",
                    "sid": 93,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, rather than simply tagging the string 走上來 zou shang lai ‘walk up’ as one verb 走上來/VV, the three-character word is further segmented internally as 走 zou ‘walk’ and 上來 shang lai ‘come up’, hence ( 走 /VV 上來/VV)/VV.",
                    "sid": 94,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method makes the interpretation more flexible: those who consider zou shang lai to be one word can simply ignore the details inside the brackets; others who view zou and shang lai as stand- alones can discard the brackets and retain their individual analyses.",
                    "sid": 95,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This device is used in the Penn Chinese Treebank on only a narrow range of constructions to ensure compatibility with the Chinese Knowledge Information Processing Group (1996) and with (Liu et al., 1994).",
                    "sid": 96,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, it is generalized in our corpus as nested tags of arbitrary depth, and used systematically and extensively to mark alternate word boundaries.",
                    "sid": 97,
                    "ssid": 61,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "corpus design. ",
            "number": "4",
            "sents": [
                {
                    "text": "This section describes our corpus at two levels, first the ‘strings without internal structures’ (section 4.1), which may be combined to form ‘strings with internal structures’ (section 4.2) and marked with nested brackets and tags.",
                    "sid": 98,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Strings without internal structures.",
                    "sid": 99,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lowest annotation layer marks the boundaries of what will be referred to as ‘strings without internal structures’.",
                    "sid": 100,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are roughly equivalent to ‘words’ in existing Chinese corpora.",
                    "sid": 101,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Segmentation criteria.",
                    "sid": 102,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following the practice of the Academia Sinica Ancient Chinese Corpus, each character is initially presumed to be a monosyllabic word.",
                    "sid": 103,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The annotator may then decide that it forms a multi-character word with its neighbor(s) under one of the categories listed in Table 2.",
                    "sid": 104,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This set of categories represents a more stringent segmentation criterion than those in most existing corpora, such that the number of multi-character words is relatively small in our target text (see section 6).",
                    "sid": 105,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1: Part-of-speech tags of the Penn Chinese Treebank that are referenced in this paper.",
                    "sid": 106,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Please see (Xia, 2000) for the full list.",
                    "sid": 107,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2: Categories of multi-character words that are considered ‘strings without internal structures’ (see Section 4.1).",
                    "sid": 108,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each category is illustrated with one example from our corpus.",
                    "sid": 109,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Part-of-speech tagging.",
                    "sid": 110,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar to the principle adopted by the Penn Chinese Treebank, POS tags are assigned not according to the meaning of the word, but to syntactic distribution (Xia, 2000), i.e. the role the word plays in the sentence.",
                    "sid": 111,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compared to modern Chinese, it is a much more frequent phenomenon in the classical language for a word to function as different parts-of-speech in different contexts.",
                    "sid": 112,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, it is not uncommon for nouns to be used as verbs or adverbs, and verbs as adverbs (Pulleyblank, 1995).",
                    "sid": 113,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider two nouns 鐘 zhong ‘bell’ and 雲 yun ‘cloud’.",
                    "sid": 114,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The former is used as a verb ‘to ring’ in the verse 深山何處 鐘 /VV ‘where in the deep mountain [is it] ringing’; the latter serves as an adverb ‘in the manner of clouds’ in the verse 倏忽 雲 /AD 散 ‘quickly disperses like clouds’.",
                    "sid": 115,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are therefore tagged as a verb (VV) and an adverb (AD).",
                    "sid": 116,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Likewise, when the verb 盡 jin ‘exhaust’ has an adverbial sense ‘completely’, such as in 送君 盡/AD 惆悵 ‘saying farewell to you, I am utterly sad’, it is tagged as such.",
                    "sid": 117,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We largely adopted the tagset of the Penn Chinese Treebank.",
                    "sid": 118,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the standard most familiar to the computational linguistics community, their tagset has been used in annotating a large volume of modern Chinese texts, offering us the possibility of leveraging existing modern Chinese annotations as training data as we seek automatic methods to expand our corpus.",
                    "sid": 119,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the most part, the Penn tagset can be adopted for classical Chinese in a straightforward manner.",
                    "sid": 120,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the tag PN (pronoun) is used, instead of the modern Chinese pronouns 我 wo ‘I’ and 你 ni ‘you’, for the classical equivalents 吾 wu ‘I’ and 爾 er ‘you’.",
                    "sid": 121,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, the tag SP (sentence-final particles) is applied, rather than to the modern Chinese particles 吧 ba or 呀 a, to their classical counterparts 耳 er and 也 ye.",
                    "sid": 122,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other cases, we have identified roughly equivalent word classes in classical Chinese.",
                    "sid": 123,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To illustrate, although the classical language has no prepositions in the modern sense, the P (preposition) tag is retained for words known as coverbs (Pulleyblank, 1995).",
                    "sid": 124,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A few tags specific to modern Chinese are discarded; these include DER, DEV, and FW (see Table 1).",
                    "sid": 125,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Strings with internal structures.",
                    "sid": 126,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since our criteria for ‘strings without internal structures’ are intentionally strict, they disqualify many multi-character strings that may fail the “semantic compositionality” test and are therefore commonly deemed words.",
                    "sid": 127,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These include proper names with analyzable structures, as well as parallel or subordinating compounds, which are considered ‘strings with internal structures’ in our corpus, and are annotated with nested tags.",
                    "sid": 128,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "C at eg or y E x a m p l e Parall el compo unds Si mi lar m ea ni ng 君 王 jun wa ng ‘ki ng’ = 君 jun ‘rul er’ + 王 wa ng ‘ki ng’ (君 /N N 王/ NN )/N N R el at ed m ea ni ng 骨 肉 gu rou ‘ki n’ = 骨 gu ‘bo ne’ + 肉 rou ‘fle sh’ (骨 /N N 肉/ NN )/N N O pp os ite m ea ni ng 是 非 shi fei ‘ru mo rs’ = 是 shi ‘rig ht’ + 非 fei ‘wr ong ’ (是 /JJ 非/ JJ)/ NN Subor dinati ng compo unds Verb ob jec t 識 事 shi shi ‘ex peri enc e’ = 識 shi ‘un der sta nd’ + 事 shi ‘aff airs ’ (識 /V V 事/ NN )/N N Su bj ect ve rb 日 落 ri luo ‘su nse t’ = 日 ri ‘su n’ + 落 luo ‘de sce nd’ (日 /N N 落/ VV )/N N A dj ec tiv al m od ifi er 少 年 sha o nia n ‘yo uth ’ = 少 sha o ‘fe w’ + 年 nia n ‘ye ar (少 /JJ 年/ NN )/N N N ou n m od ifi er 家 食 jia shi ‘ho use hol d foo d’ = 家 jia ‘ho use ’ + 食 shi ‘fo od’ (家 /N N 食/ NN )/N N Table 3: Categories of multi-character words that are considered ‘strings with internal structures’ (see Section 4.2).",
                    "sid": 129,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each category is illustrated with an example from our corpus.",
                    "sid": 130,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both the individual characters and the compound they form receive a POS tag.",
                    "sid": 131,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Segmentation criteria.",
                    "sid": 132,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All parallel and subordinating compounds are considered to be ‘strings with internal structures’.",
                    "sid": 133,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A parallel compound is a two-character noun, verb and adjective “in which neither member dominates the other” (Packard, 1998) and it refers to one meaning despite having two characters.",
                    "sid": 134,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the noun compound 骨肉 gu rou, formed from from 骨 gu ‘bone’ and 肉 rou ‘flesh’, means simply ‘kin’ rather than ‘bone and flesh’.",
                    "sid": 135,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In practice, in our corpus, two characters are considered to be a parallel compound when they are of the same POS, and have similar, related, or opposite meaning, as shown in Table 3.",
                    "sid": 136,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The individual characters are ‘strings without.",
                    "sid": 137,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "internal structure’ and receive their own POS tags, while the compound also receives its own tag.",
                    "sid": 138,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subordinating compounds refer to those where “one member (the modifier) is subordinate to and modifies the other (the head)” (Packard, 1998).",
                    "sid": 139,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the compound 少年 shao nian is made up of an adjective 少 shao ‘few’ modifying a noun 年 nian ‘year’, but together has the specialized meaning ‘youth’.",
                    "sid": 140,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our corpus, two characters are considered to form a subordinating compound when they have the verb-object or subject-verb relationship, or a modifier-head relationship, including adjectival modifiers and noun modifiers.",
                    "sid": 141,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Proper names can also have internal structures, whenever the grammatical structure of their constituent characters may be discerned.",
                    "sid": 142,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most common such proper names in our corpus are geographical names, such as 黃河 huang he ‘Yellow River’, where the adjective huang ‘yellow’ modifies the noun he ‘river’.",
                    "sid": 143,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another frequent type is personal names with titles, such as 始興公 shi xing gong ‘Duke Shixing’, where one noun modifies another.",
                    "sid": 144,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our definition of ‘strings with internal structures’ is deliberately broad.",
                    "sid": 145,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, some of these strings would not be considered to be a word or compound by all or even most linguists.",
                    "sid": 146,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many verb-object combinations, for example, may well fail the ‘semantic compositionality’ test.",
                    "sid": 147,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is intentional: rather than searching for the perfect segmentation policy that suits everyone 5 , the nested annotations allow the user to decide which level of tags is suitable for the research objective at hand.",
                    "sid": 148,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Part-of-speech tagging.",
                    "sid": 149,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The nested annotations of ‘strings with internal structures’ not only mark the possible word boundaries, but also assign a POS tag at every level, since that tag is not always predictable from the tags of the constituent characters.",
                    "sid": 150,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the verse in Table 4.",
                    "sid": 151,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are two possible segmentations for the string 晚來 wan lai.",
                    "sid": 152,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As two separate words, wan ‘evening’ and lai ‘come’ form a clause meaning ‘as the evening comes’; the",
                    "sid": 153,
                    "ssid": 56,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the verb-object combination, for example, is “among the. ",
            "number": "5",
            "sents": [
                {
                    "text": "hardest cases for the word definition” (Xia, 2000).",
                    "sid": 154,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "whole verse may be translated ‘the weather turns chilly as the evening comes’.",
                    "sid": 155,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alternatively, they can be taken as a two-character word, i.e., simply a temporal noun 晚來/NT wan lai ‘evening’.",
                    "sid": 156,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, the proper translation would be ‘the weather turns chilly at evening’.",
                    "sid": 157,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Notice that the tag NT (temporal noun) cannot be predicted from the tags at the lower level, NN (noun) and VV (verb).",
                    "sid": 158,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further, these nested tags indicate alternatives for future syntactic analysis.",
                    "sid": 159,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In dependency grammar, for instance, the adjectival verb qiu ‘chilly’ would be the head of the verb lai, which is the verb in the subordinate clause; in the second interpretation, however, it would be the head of a temporal modifier, wan lai ‘evening’.",
                    "sid": 160,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "天 氣 晚 來 秋 tia n q i w a n l a i q i u ‘weat her’ ‘n ig ht ’ ‘c o m e’ ‘c hi ll y’ N N N N V V J J N T Table 4: POS annotations of an example sentence with a string, wan lai ‘evening’, that has internal structure.",
                    "sid": 161,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "See Section 4.2 for two possible translations, and Table 1 for the meaning of the POS tags.",
                    "sid": 162,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Verse 1 獨 樹 臨 關 門 d u shu lin guan men ‘o nly ’ ‘tree’ ‘upon’ ‘pass’ ‘entran ce’ J J NN VV NN N N ‘a lone tree watches the entrance of the pass’ Verse 2 黃 河 向 天 外 huang he Xiang tian w a i ‘yello w’ ‘river’ ‘face’ ‘sky’ ‘ou tsid e’ J J NN VV NN L C N R ‘The Yellow River faces the outer sky’ Table 5: POS annotations of a couplet, i.e., a pair of two verses, in a classical Chinese poem.",
                    "sid": 163,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "See Table 1 for the meaning of the POS tags.",
                    "sid": 164,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One significant benefit of nested annotation, especially in classical Chinese poetry, is the preservation of the underlying parallelism.",
                    "sid": 165,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Two consecutive verses, called a couplet, always have the same number of characters.",
                    "sid": 166,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, two characters at the same position in the two verses often have the same or related POS.",
                    "sid": 167,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider the couplet in Table 5.",
                    "sid": 168,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first two characters of each verse, 獨樹 du shu ‘lone tree’ and 黃河 huang he ‘Yellow River’, respectively, are parallel; both are noun phrases formed by a noun modified by the preceding adjective.",
                    "sid": 169,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In most existing corpora, huang he would be simply considered one word and assigned one tag, namely, a proper noun 黃河/NR.",
                    "sid": 170,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This treatment would, first of all, result in one verse having four words and the other five, making it difficult to analyze character correspondences.",
                    "sid": 171,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It also obscures the parallelism between the noun phrases du shu and huang he: both are JJNN, i.e. ‘adjective-noun’.",
                    "sid": 172,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, our corpus annotates huang he as a string with internal structures ( 黃/JJ 河/NN)/NR, as shown in Table 5.",
                    "sid": 173,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its outer tag (NR) preserves the meaning and.",
                    "sid": 174,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "boundary of the whole proper noun huang he, facilitating word searches; the inner tags support automatic identification of parallel structures.",
                    "sid": 175,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In all examples above of ‘strings with internal structures’, the nested annotations have only a depth of one.",
                    "sid": 176,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In theory, the depth can be arbitrary, although in practice, it rarely exceeds two.",
                    "sid": 177,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example is the string 細柳營 xi liu ying ‘Little Willow military camp’.",
                    "sid": 178,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the coarsest level, the three characters may be considered to form one proper noun, referring to a camp at the ancient Chinese capital.",
                    "sid": 179,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The string obviously has ‘internal structures’, composed of 營 ying ‘military camp’ and its location, the place name 細柳 xi liu ‘Xiliu’.",
                    "sid": 180,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, this place name has an evocative meaning, ‘little willow’, made up of the adjective xi ‘little’ and the noun liu ‘willow’.",
                    "sid": 181,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As shown in Table 6, this analysis results in a three-level, nested annotation (( 細/JJ 柳/NN)/NR 營/NN)/NR.",
                    "sid": 182,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, these three characters are the last characters in the second verse of a couplet.",
                    "sid": 183,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6 also shows the annotations for the corresponding characters in the first verse, 新豐 市 xin feng shi ‘Xinfeng city’.",
                    "sid": 184,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Taken together, the annotations reveal the perfect symmetry of both noun phrases at every level of analysis.",
                    "sid": 185,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5 Data.",
                    "sid": 186,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among the various literary genres, poetry enjoys perhaps the most elevated status in the classical Chinese tradition.",
                    "sid": 187,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Tang Dynasty is considered the golden age of shi, one of the five subgenres of Chinese poetry.",
                    "sid": 188,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Complete Shi Poetry of the Tang (Peng, 1960), originally compiled in 1705, consists of nearly 50,000 poems by more than two thousand poets.",
                    "sid": 189,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our method of word segmentation and POS tagging has been applied to the complete works by two Chinese poets in the 8th century CE, Wang Wei and Meng Haoran.",
                    "sid": 190,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Wang is considered one of the three most prominent Tang poets; Meng is often associated with Wang due to the similarity of his poems in style and content.",
                    "sid": 191,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Altogether, our corpus consists of about 32,000 characters in 521 poems.",
                    "sid": 192,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Noun Phrase in Verse 2 細 柳 營 x i l i u y i n g ‘li ttl e’ ‘ w il l o w ’ ‘ c a m p ’ ‘ L itt le W ill o w c a m p’ J J N N N N N R N R Noun Phrase in Verse 1 新 豐 市 x i n f e n g s h i ‘ n e w ’ ‘ab un da nc e’ ‘ c i t y ’ ‘Cit y of Ne w Abu nda nce’ J J N N N N N R N R Table 6: Part-of-speech annotations of the three- character strings 細柳營 xi liu ying ‘Little Willow military camp’ and 新豐市 xin feng shi ‘Xinfeng city’.",
                    "sid": 193,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both are ‘strings with internal structures’, with nested structures that perfectly match at all three levels.",
                    "sid": 194,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are the noun phrases that end both verses in the couplet 忽過 新豐市, 還歸細柳營.",
                    "sid": 195,
                    "ssid": 42,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "evaluation. ",
            "number": "6",
            "sents": [
                {
                    "text": "Two research assistants, both of whom hold a Bachelor’s degree in Chinese, have completed the annotations.",
                    "sid": 196,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To estimate inter-annotator agreement, the two annotators independently performed word segmentation and POS tagging on a 1,057-character portion of the poems of Wang.",
                    "sid": 197,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We measured their agreement on word segmentation, POS tags for ‘strings without internal structures’, and those for ‘strings with internal structures’.",
                    "sid": 198,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word segmentation.",
                    "sid": 199,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This task refers to decisions on boundaries between ‘strings without internal structure’ (section 4.1).",
                    "sid": 200,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the rather stringent criteria, it is not surprising that only about 6.5% of the words in our texts contain more than one character.",
                    "sid": 201,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among these, 75% consists of two characters.",
                    "sid": 202,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Disagreement rate on the presence of word boundary between characters was only 1.7%.",
                    "sid": 203,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No comparable figure has been reported for classical Chinese word segmentation, but this rate compares favorably with past attempts for modern Chinese, e.g., an average of 76% inter- human agreement rate in (Sproat et al., 1996).",
                    "sid": 204,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This may be explained by the relatively small number of types of strings (see Table 2) that are considered to be multi-character words in our corpus.",
                    "sid": 205,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "POS tagging on strings without internal structures.",
                    "sid": 206,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We now consider the POS tags assigned at the lowest level, i.e. those assigned to strings without internal structures.",
                    "sid": 207,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After discarding characters with disputed word segmentation boundaries, the disagreement rate on POS tags was 4.9%.",
                    "sid": 208,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Three main areas of disagreement emerged.",
                    "sid": 209,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One category is the confusion between verbs and adverbs, when the annotators do not agree on whether a verb has an adverbial force and should therefore be tagged as AD rather than VV.",
                    "sid": 210,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the word 紆 yu ‘bow’ normally functions as a verb, but can also be used adverbially when referring to an attitude, ‘respectfully’, which is implied by bowing.",
                    "sid": 211,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When used in collocation with the word 顧 gu ‘visit’ in the verse 伏檻紆三顧 fu jian yu san gu, it can therefore mean ‘prostrated on the threshold and respectfully (AD) paid visits three times’ or ‘prostrated on the threshold and bowed (VV) and paid visits three time’.",
                    "sid": 212,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A second category is the confusion between measure word and a noun.",
                    "sid": 213,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The noun 簞 dan ‘bowl’ can collocate with the noun 食 shi ‘food’.",
                    "sid": 214,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Taken together, dan shi can either mean ‘a bowl of food’ where dan is a measure word (M), or it can simply mean a specific kind of meal, in which case dan is a noun modifier (NN).",
                    "sid": 215,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both interpretations have been supported by commentators.",
                    "sid": 216,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The third is the confusion between adjective (JJ) and noun (NN), when the word in question modifies a noun that immediately follows.",
                    "sid": 217,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, for the noun phrase 命服 ming fu ‘uniform with rank devices’, it is clear that the first character 命 ming ‘profession’ modifies the second character 服 fu ‘clothes’.",
                    "sid": 218,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The annotators did not agree, however, on whether ming is a noun modifier or an adjectival modifier.",
                    "sid": 219,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the Penn Chinese Treebank POS guidelines (Xia, 2000), this question is resolved with the linguistic test: if the word is JJ, then it cannot be the head of a noun phrase.",
                    "sid": 220,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In practice, this test is difficult to apply for non-native speakers of a language.",
                    "sid": 221,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The annotator would have to decide whether he can compose a “good” classical Chinese that uses the word has an NP head.",
                    "sid": 222,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "POS tagging on strings with internal structures.",
                    "sid": 223,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thirdly, we turn our attention to POS tags assigned at the higher levels of the nested structure.",
                    "sid": 224,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Of the ‘strings with internal structures’, about 73% consist of two characters; those longer than two characters are mostly proper names.",
                    "sid": 225,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We measured inter-human agreement for the nested bracketing by taking each annotator in turn as ‘gold’, and calculated the precision and recall of the other.",
                    "sid": 226,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The average precision was 83.5%; the average recall also worked out to 83.5%.",
                    "sid": 227,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A significant source of error was disagreement over whether several characters form a proper name, and should therefore be bracketed and assigned the tag NR; these often involve knowledge of Chinese history and geography.",
                    "sid": 228,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the remaining cases of discrepancies, the vast majority are direct consequences of differences in POS tagging.",
                    "sid": 229,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Lastly, among the strings with internal structures that have received identical bracketing, there was almost complete agreement between the annotators regarding their POS tags, except in a few isolated cases.",
                    "sid": 230,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7 Conclusion We have a described a novel method of word segmentation and POS tagging, tailored for the classical Chinese language, and designed to support interoperability between corpora.",
                    "sid": 231,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This method has been applied on about 32,000 characters, drawn from two well-known poets from the 8th century CE.",
                    "sid": 232,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpus aspires to contribute to two areas of scholarly enquiry.",
                    "sid": 233,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, it is expected to facilitate classical Chinese word studies by automating word retrieval (e.g., (Lancaster, 2010)), and will support investigations in other areas of classical Chinese philology, such as semantic and metaphorical coherence (Zhu & Cui, 2010), by supplying syntactic evidence.",
                    "sid": 234,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, it is intended to serve as training data for automatic POS taggers, to automate the analysis of the vast and growing digital collections of classical Chinese texts.",
                    "sid": 235,
                    "ssid": 40,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "We thank Tin Ho Chan, Yin Hei Kong and Cheuk Ho Wan for their assistance in annotating this corpus.",
                    "sid": 236,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This work was supported by a Strategic Research Grant (#7002549) from City University of Hong Kong.",
                    "sid": 237,
                    "ssid": 42,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}