{
    "ID": "W12-6211",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper presents an application of finite- state transducers to the domain of medicine.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The objective is to assign disease codes to each Diagnostic Term in the medical records generated by the Basque Health Hospital System.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a starting point, a set of manually coded medical records were collected in order to code new medical records on the basis of this set of positive samples.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since the texts are written in natural language by doctors, the same Diagnostic Term might show alternative forms.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Hence, trying to code a new medical record by exact matching the samples in the set is not always feasible due to sparsity of data.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In an attempt to increase the coverage of the data, our work centered on applying a set of finite-state transducers that helped the matching process between the positive samples and a set of new entries.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, these transducers allowed not only exact matching but also approximate matching.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While there are related works in languages such as English, this work presents the first results on automatic assignment of disease codes to medical records written in Spanish.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "During the last years an exponential increase in the number of electronic documents in the medical domain has occurred.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The automatic processing of these documents allows to retrieve information, helping the health professionals in their work.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are different sort of valuable data that help to exploit medical information.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our framework lays on the classification of Medical Records (MRs) according to a standard.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our context, the MRs produced in a hospital have to be classified with respect to the World Health Organization’s 9th Revision of the International Classification of Diseases1 (ICD9).",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ICD9 is designed for the classification of morbidity and mortality information and for the indexing of hospital records by disease and procedure.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The already classified MRs are stored in a database that serves for further classification purposes.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each MR consists of two pieces of information: Diagnostic Terms (DTs): one or more terms that describe the diseases corresponding to the MR. Body-text: a description of the patient’s details, antecedents, symptoms, adverse effects, methods of administration of medicines etc. Even though the DTs are within a limited domain, their description is not subject to a standard.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Doctors express the DTs in natural language with their own style and different degrees of precision.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Usually, a given concept might be expressed by alternative DTs with variations due to modifiers, abbreviations, acronyms, dates, names, misspellings or style.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a typical problem that arises in natural language processing due to the fact that doctors focus on the patients and not so much on the writing of the MR. On account of this, there is ample variability in the presentation of the DTs.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consequently, it is not a straightforward task to get the corresponding ICD- codes.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, the task is by far more complex than a standard dictionary lookup.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 http://www.cdc.gov/nchs/icd/icd9.htm The Basque Health Hospital System is concerned with the automatization of this ICD-code assignment task.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So far, the hospital processes the daily produced documents in the following sequence: 1.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Automatic: exact match of the DTs in a set of.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "manually coded samples.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "semi-automatic: through semantic match,. ",
            "number": "2",
            "sents": [
                {
                    "text": "ranking the DTs by means of machine-learning techniques.",
                    "sid": 26,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This stage requires that experts select amongst the ranked choices.",
                    "sid": 27,
                    "ssid": 2,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "manual: the documents that were not matched. ",
            "number": "3",
            "sents": [
                {
                    "text": "in the previous two stages are examined by professional coders assigning the codes manually.",
                    "sid": 28,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The goal of this paper is to bypass the variability associated to natural language descriptions in an attempt to maximize the proportion of automatically assigned codes, as the Hospital System aims to expand the use of the automatic codification of MRs to more hospitals.",
                    "sid": 29,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "According to experts, even an increase of 1% in exact match would represent a significant improvement allowing to gain time and resources.",
                    "sid": 30,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Related work can be found in the literature.",
                    "sid": 31,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For instance, Pestian et al.",
                    "sid": 32,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2007) reported on a shared task involving the assignment of ICD-codes to radiology reports written in English from a reduced set of 45 codes.",
                    "sid": 33,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In general it implied the examination of the full MR (including body-text).",
                    "sid": 34,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our case, the number of ICD-codes is above 1,000, although we restrict ourselves to exact and approximate match over the diagnoses.",
                    "sid": 35,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Farkas and Szarvas (2008) used machine learning for the automatic assignment of ICD9 codes.",
                    "sid": 36,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their results showed that handcrafted systems could be reproduced by replacing several laborious steps in their construction with machine learning models.",
                    "sid": 37,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tsuruoka et al.",
                    "sid": 38,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2008) presented a system that tried to normalize different variants of the terms contained in a medical dictionary, automatically getting normalizing rules for genes, proteins, chemicals and diseases in English.",
                    "sid": 39,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The contribution of this work is: i) to collect manually coded MRs in Spanish; ii) to approximate transduction with finite-state (FS) models for automatic MR coding and, iii) to assess the performance of the proposed FS transduction approaches.",
                    "sid": 40,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 Approximate transduction.",
                    "sid": 41,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As it was previously mentioned, there are variations regarding the DT descriptions due to style, miss- spells, etc. Table 1 shows several pairs of DT and ICD-codes within the collected samples that illustrate some of those variations.",
                    "sid": 42,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1: Examples of DTs and their ICD-codes.",
                    "sid": 43,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are differences in the use of uppercase/lower case; omissions of accents; use of both standard and nonstandard abbreviations (e.g. ca.",
                    "sid": 44,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "for both ca´ ncer and adenocarcinoma); punctuation marks (incidental use of full-stop as commas, etc.); omission of prepositions (see rows 1 and 2); equivalence between Roman and Arabic numerals (rows 5 and 6).",
                    "sid": 45,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to these variations, our problem can be defined as an approximate lookup in a dictionary.",
                    "sid": 46,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Finite-state models.",
                    "sid": 47,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Foma toolkit was used to build the FS machines and code the evaluation sets.",
                    "sid": 48,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Foma (Hulden, 2009) is a freely available2 toolkit that allows to both build and parse FS automata and transducers.",
                    "sid": 49,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Foma offers a versatile layout that supports imports/exports from/to other tools such as: Xerox XFST (Beesley and Karttunen, 2003), AT&T (Mehryar Mohri and Riley, 2003), OpenFST (Riley et al., 2009).",
                    "sid": 50,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are, as well, outstanding alternatives such as HFST (Linde´n et al., 2010).",
                    "sid": 51,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Refer to (YliJyra¨ et al., 2006) for a thorough inventory on FS resources.",
                    "sid": 52,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The FS models in Figure 1 perform the conversions necessary to carry out a soft match between the dictionary entries and their variants.",
                    "sid": 53,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• First, we define the transducer Accents that takes into account the correspondences between standard letters and their versions using accent text marks.",
                    "sid": 54,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 http://code.google.com/p/foma d e f i n e Ac ce nt s [a :´a |e :´e |i:´ ı| o:´ o| u:´ u |.",
                    "sid": 55,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "]; d e f i n e Ca se [a :A |b :B |c :C |d :D |e :E |f: F| ...",
                    "sid": 56,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "]; d e f i n e Sp ac es [.",
                    "sid": 57,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "| \".\"] , . # .; d e f i n e P un ct ua tio n [\" .\" |\" \"| \" \"] :[ \".",
                    "sid": 58,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "\"|\" \"| \" \"] ; defi ne Plurals [..]",
                    "sid": 59,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "-> ([s|es]) || [.#.",
                    "sid": 60,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "| \".\" | \" \"]; d e f i n e Pl ur al sI [s|es ] (->) \"\" || [.#.",
                    "sid": 61,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "| \".\" | \",\"| \" \"]; d e f i n e Pr ep s [..]",
                    "sid": 62,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(->) [de |del |con |por ] || \" \" ; d e f i n e Di se as e [enf|e nf.|en ferme dad]:[ enf|e nf.|en ferme dad]; d e f i n e Alt C a [tumo r|ca|c a.|car cinom a|ade nocar cinom a|c´an cer]; d e f i n e Ta gN or m Ca AltCa :AltC a; d e f i n e Al tIz q [izqui erdo| izqui erda| izq|iz q.|izq da|iz qda.| izqdo |izqd o.|izd a|izd a.|izd o|izd o.]; d e f i n e Ta gN or mI zq AltIz q:AltI zq; Figure 1: A simplified version in Foma source code of the regular expressions and transducers used to bypass several sources of distortion within the DTs in order to parse variations of unseen input DTs.",
                    "sid": 63,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• The expression Case matches uppercase and lowercase versions of the DTs.",
                    "sid": 64,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• There is a set of transducers (Spaces, Punctuation, Plurals and PluralsI) that deal with the addition or deletion of spaces and separators (as full-stop, comma, and hyphen) between words or at the end of the DT.",
                    "sid": 65,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Prepositions.",
                    "sid": 66,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many DTs can be differentiated by the use or absence of prepositions, although they correspond to the same ICD-code.",
                    "sid": 67,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For that reason, we designed a transducer that inserts or deletes the prepositions from a reduced set that were identified by inspection of the training set.",
                    "sid": 68,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, expressions as ”Adenocarcinoma prostata” and ”Adenocarcinoma de prostata” can be mapped to each other.",
                    "sid": 69,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Tag Normalization of synonyms, variants and abbreviations.",
                    "sid": 70,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The examination of the DTs in the training set revealed that there were several terms used indistinctly, including synonyms and different kinds of variants (masculine and feminine) and abbreviations.",
                    "sid": 71,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, the words adenocarcinoma, adenoca., carcinoma, ca, ca.",
                    "sid": 72,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and cancer serve to name the same disease.",
                    "sid": 73,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are also multiple variants of left/right, indicating the location of an illness, that do not affect the assignment of the ICD-code (e.g. izquierdo, izq., izda.).",
                    "sid": 74,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, all the FS transducers were composed into a single machine that served to overcome all the sources of distortion together.",
                    "sid": 75,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 Experimental results.",
                    "sid": 76,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To begin with, coded MRs produced in the hospital throughout 12 months were collected summing up a total of 8,020 MRs as described in Table 2.",
                    "sid": 77,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that there are ambiguities in our data-set since there are 3,313 different DTs that have resulted in 3,407 (DT, ICD-code) different pairs (as shown in Table 2).",
                    "sid": 78,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, the same DT was not always assigned the same ICD-code.",
                    "sid": 79,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2: The data-set of (DT, ICD-code) pairs.",
                    "sid": 80,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Next, the data-set was shuffled and divided into 3 disjoint sets for training, development and test purposes as shown in Table 3.",
                    "sid": 81,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "tr ai n d e v te st e nt ri es 6, 02 0 1, 00 0 1, 00 0 dif fer en t e nt ri es 2, 82 5 7 3 4 7 2 8 Table 3: The data-set shuffled and divided into 3 sets Using the set of mappings derived from the training set we performed the experiments on the development set.",
                    "sid": 82,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After several rounds of tuning the system, the resulting system was applied to the test set.",
                    "sid": 83,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "PERC ENTA GE OF UNCL ASSIF IED DTs T R AI N E V AL S E T ex act m at ch + ca se in s. + p u n ct . + pl ur al s + pr ep s. + tag n or m . tr ai n d ev 3 0 . 6 2 7 . 0 2 5 . 2 2 4 . 4 2 3 . 9 2 3 . 2 tr ai n te st 2 9 . 8 2 6 . 7 2 5 . 1 2 4 . 8 2 4 . 3 2 3 . 2 tr ai n + d ev te st 2 7 . 7 2 4 . 5 2 3 . 0 2 2 . 9 2 2 . 5 2 1 . 4 Table 4: Performance of different FS machines in terms of the percentage of unclassified entries.",
                    "sid": 84,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All the classified entries were correctly classified, yielding, as a result, a precision of 100%.",
                    "sid": 85,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given a DT, the goal is to find its corresponding ICD-code despite the variations.",
                    "sid": 86,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Different FS approaches (described in Section 2.1) were proposed to bypass particular sources of noise in the DT.",
                    "sid": 87,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their performance was assessed by means of the percentage of unclassified DTs, as summarized in Table 4.",
                    "sid": 88,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that the lower the number of unclassified DTs the better the performance.",
                    "sid": 89,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In each of the three rows of Table 4 the results of different experimental setups are shown: in the first two rows the training set was used to build the models and either the development or the test set was evaluated in their turn; in the third row, both the training and the development sets were used to build the model and the test set was evaluated.",
                    "sid": 90,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The impact of adding progressively the FS machines built to tackle particular sources of noise is shown by columns.",
                    "sid": 91,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, the results of the last column represent the performance of the transducer allowing exact-match search together with case-insensitive search, bypassing punctuation marks, allowing plurals, bypassing prepositions and allowing tag-normalization.",
                    "sid": 92,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The composition of each transducer outperforms the previous result, yielding an improvement on the test of 6 absolute points over the exact-match baseline, from 27.7% to 21.4%.",
                    "sid": 93,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As it can be derived from the first column of Table 4 the test set contributed to the training+development set with %27.7 of new DTs.",
                    "sid": 94,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall, the FSMs progressively improved the results for the three series of experiments carried out in more than 6%.",
                    "sid": 95,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, less and less DTs are left unclassified.",
                    "sid": 96,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In other words, the FS machines tackling different sources of errors contribute to assign ICD-codes to previously unassigned DTs.",
                    "sid": 97,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A manual inspection over the results associated to the evaluation of the development set (focus on the first row of Table 4) showed that all the DTs were correctly classified according to the training data.",
                    "sid": 98,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Overall, the resulting transducer was unable to classify 232 DTs out of 1,000 (see last column in first row).",
                    "sid": 99,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among the unclassified DTs, 10 out of 232 were due to misspellings: e.g. cic atriz (instead of cicatriz), desprendimineot (instead of desprendimiento).",
                    "sid": 100,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact, spelling correction reported improvements in related tasks (Patrick et al., 2010).",
                    "sid": 101,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining DTs showed wider variations in their forms, as unexpected degree of specificity (e.g. named entities), spurious dates or numbers.",
                    "sid": 102,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 Conclusions Medical records in Spanish were collected yielding a data set of 8,020 DT and ICD-code pairs.",
                    "sid": 103,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While there are a number of references dealing with English medical records, there are few for Spanish.",
                    "sid": 104,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The goal of this work was to build a system that given a DT it would find its corresponding ICD- code as in a standard key-value dictionary.",
                    "sid": 105,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Yet, the DTs are far from being standard since they contain a number of variations.",
                    "sid": 106,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We proposed the use of several FS models to bypass different variants and allow to provide ICD-codes even when the exact DT was not found.",
                    "sid": 107,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each source of variations was tackled with a specific transducer based on handwritten rules.",
                    "sid": 108,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The composition of each machine improved the performance of the system gradually, leading to an improvement up to 6% in accuracy, from 27.7% unclassified DTs with the exact-match baseline to 21.4% with the tag-normalization transducer.",
                    "sid": 109,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Future work will focus on the unclassified DTs.",
                    "sid": 110,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Together with FS models, other strategies shall be explored.",
                    "sid": 111,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Machine-learning strategies in the field of information retrieval might help to make the most of the piece of information that was here discarded (i.e. the body-text).",
                    "sid": 112,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All in all, regardless of the approach, the command in this MR classification context is to get an accuracy of 100%, possibly through the interactive inference framework (Toselli et al., 2011).",
                    "sid": 113,
                    "ssid": 86,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgments",
            "number": "",
            "sents": [
                {
                    "text": "Authors would like to thank the Hospital GaldakaoUsansolo for their contributions and support, in particular to Javier Yetano, responsible of the Clinical Documentation Service.",
                    "sid": 114,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This research was supported by the Department of Industry of the Basque Government (IT34410, S- PE11UN114, GIC10/158 IT37510), the University of the Basque Country (GIU09/19) and the Spanish Ministry of Science and Innovation (MICINN, TIN201020218).",
                    "sid": 115,
                    "ssid": 88,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}