{
    "ID": "W12-3205",
    "sections": [
        {
            "text": "why bother with discourse?. ",
            "number": "1",
            "sents": [
                {
                    "text": "Research in Natural Language Processing (NLP) has long benefitted from the fact that text can often be treated as simply a bag of words or a bag of sentences.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But not always: Position often matters — e.g., It is well-known that the first one or two sentences in a news report usually comprise its best ex- tractive summary.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Order often matters – e.g., very different events are conveyed depending on how clauses and sentences are ordered.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) a. I said the magic words, and a genie appeared.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "b. A genie appeared, and I said the magic words.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adjacency often matters — e.g., attributed material may span a sequence of adjacent sentences, and contrasts are visible through sentence juxtaposition.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Context always matters — e.g., All languages achieve economy through minimal expressions that can only convey intended meaning when understood in context.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Position, order, adjacency and context are intrinsic features of discourse, and research on discourse processing attempts to solve the challenges posed by context-bound expressions and the discourse structures that give rise, when linearized, to position, order and adjacency.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But challenges are not why Language Technology (LT) researchers should care about discourse: Rather, discourse can enable LT to overcome known obstacles to better performance.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider automated summarization and machine translation: Humans regularly judge output quality in terms that include referential clarity and coherence.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Systems can only improve here by paying attention to discourse — i.e., to linguistic features above the level of n- grams and single sentences.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(In fact, we predict that as soon as cheap — i.e., non-manual – methods are found for reliably assessing these features — for example, using proxies like those suggested in (Pitler et al., 2010) — they will supplant, or at least complement today’s common metrics, Bleu and Rouge that say little about what matters to human text understanding (CallisonBurch et al., 2006).)",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Consider also work on automated text simplification: One way that human editors simplify text is by re-expressing a long complex sentence as a discourse sequence of simple sentences.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Researchers should be able to automate this through understanding the various ways that information is conveyed in discourse.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other examples of LT applications already benefitting from recognizing and applying discourse-level information include automated assessment of student essays (Burstein and Chodorow,2010); summarization (Thione et al., 2004), infor 42 Proceedings of the ACL2012 Special Workshop on Rediscovering 50 Years of Discoveries, pages 42–54, Jeju, Republic of Korea, 10 July 2012.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2012 Association for Computational Linguistics Eales et al., 2008; Maslennikov and Chua, 2007), and more recently, statistical machine translation (Foster et al., 2010).",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These are described in more detail in (Webber et al., 2012).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our aim here then, on this occasion of ACL’s 50th Annual Meeting, is to briefly describe the evolution of computational approaches to discourse structure, reflect on where the field currently stands, and what new challenges it faces in trying to deliver on its promised benefit to Language Technology.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "background. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Early Methods.",
                    "sid": 19,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The challenges mentioned above are not new.",
                    "sid": 20,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Question-Answering systems like LUNAR (Woods, 1968; Woods, 1978) couldn’t answer successive questions without resolving context-bound expressions such as pronouns: (2) What is the concentration of silicon in breccias?",
                    "sid": 21,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "breccia1, parts per million) breccia2, parts per million) . . .",
                    "sid": 22,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": ") What is it in volcanics?",
                    "sid": 23,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Woods, 1978) Early systems for human interaction with animated agents, including SHRDLU (Winograd, 1973) and HOMER (Vere and Bickmore, 1990), faced the same challenge.",
                    "sid": 24,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "And early message understanding systems couldn’t extract relevant information (like when a sighted submarine submerged – “went sinker”) without recognizing relations implicit in the structure of a message, as in (3) VISUAL SIGHTING OF PERISCOPE FOLLOWED BY ATTACK WITH ASROC AND TORPEDO.",
                    "sid": 25,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "WENT SINKER.",
                    "sid": 26,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "LOOSEFOOT 722/723 CONTINUE SEARCH.",
                    "sid": 27,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Palmer et al., 1993) The same was true of early systems for processing narrative text (under the rubric story understanding).",
                    "sid": 28,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They took on the problem of recognizing events that had probably happened but hadn’t been mentioned in the text, given the sequence of events that had been (Lehnert, 1977; Rumelhart, 1975; Schank and Abelson, 1977; Mandler, 1984).",
                    "sid": 29,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since these early systems never saw more than a handful of examples, they could successfully employ straightforward, but ad hoc methods to handle ample, LUNAR used a single 10-position ring buffer to store discourse entities associated with both the user’s and the system’s referring expressions, resolving pronouns by looking back through the buffer for an appropriate entity and overwriting previous buffer entries when the buffer was full.",
                    "sid": 30,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The next wave of work in computational discourse processing sought greater generality through stronger theoretical grounding, appealing to then- current theories of discourse such as Centering Theory (Grosz et al., 1986; Grosz et al., 1995), used as a basis for anaphor resolution (Brennan et al., 1987; Walker et al., 1997; Tetreault, 2001) and text generation (Kibble and Power, 2000), Rhetorical Structure Theory (Mann and Thompson, 1988), used as a basis for text generation (Moore, 1995) and document summarization (Marcu, 2000b), and Grosz and Sidner’s theory of discourse based on intentions (Grosz and Sidner, 1986a) and shared plans (Grosz and Sidner, 1990), used in developing animated agents (Johnson and Rickel, 2000).",
                    "sid": 31,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Issues related to fully characterizing centering are explored in great detail in (Kehler, 1997) and (Poesio et al., 2004).",
                    "sid": 32,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The approaches considered during this period never saw more than a few handfuls of examples.",
                    "sid": 33,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But, as has been clear from developments in PoS- tagging, Named Entity Recognition and parsing, Language Technology demands approaches that can deal with whatever data are given them.",
                    "sid": 34,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So subsequent work in computational discourse processing has similarly pursued robustness through the use of data-driven approaches that are usually able to capture the most common forms of any phenomenon (ie, the 80% at the high end of the Zipfian distribution), while giving up on the long tail.",
                    "sid": 35,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is described in Section 3.",
                    "sid": 36,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Early Assumptions.",
                    "sid": 37,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While early work focussed on the correct assumption that much was implicit in text and had to be inferred from the explicit sequence of sentences that constituted a text, work during the next period focussed on the underlying structure of discourse and its consequences.",
                    "sid": 38,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More specificaly, it assumed that the sequence of sentences constituting the text were covered by a single tree structure, similar to the single tree structure of phrases and clauses covering the condition s3 s1 condition s2 motivation s1 s2 motivations3 ilarly, Knott et al.",
                    "sid": 39,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2001), looking at transcriptions of museum tours, argued that each resembled a linear sequence of trees, with one or more topic-based connections between their root nodes — again, not (a) (b) Figure 1: Proposed discourse structures for Ex.",
                    "sid": 40,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4: (a) In terms of informational relations; (b) in terms of intentional relations words in a sentence.",
                    "sid": 41,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At issue though was the nature of the structure.",
                    "sid": 42,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One issue concerned the nature of the relation between parent and child nodes in a discourse tree, and/or the relation between siblings.",
                    "sid": 43,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While Rhetorical Structure Theory (Mann and Thompson, 1988) posited a single discourse relation holding between any two discourse units (i.e., units projecting to adjacent text spans), Moore and Pollack (1992) gave an example of a simple discourse (Ex.",
                    "sid": 44,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4) in which different choices about the discourse relation holding between pairs of units, implied different and non- isomorphic structures.",
                    "sid": 45,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4) Come home by 5:00.",
                    "sid": 46,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "s1 Then we can go to the hardware store before it closes.",
                    "sid": 47,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "s2 That way we can finish the bookshelves tonight.",
                    "sid": 48,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "s3 Example 4 could be analysed purely in terms of information-based discourse relations, in which s1 specified the CONDITION under which s2 held, which in turn specified the CONDITION under which s3 held.",
                    "sid": 49,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This would make s1 subordinate to s2, which in turn would be subordinate to s3, as in Figure 1a.",
                    "sid": 50,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alternatively, Example 4 could be analysed purely in terms of intention-based (pragmatic) relations, in which s2 would be MOTIVATION for s1, while s3 would be MOTIVATION for s2.",
                    "sid": 51,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This would make s3 subordinate to s2, which in turn would be subordinate to s1, as in Figure 1b.",
                    "sid": 52,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In short, the choice of relation was not merely a matter of labels, but had structural implications as well.",
                    "sid": 53,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another issue during this period concerned the nature of discourse structure: Was it really a tree?",
                    "sid": 54,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sibun (1992), looking at people’s descriptions of the layout of their house or apartment, argued that they resembled different ways of linearizing a graph of the rooms and their connectivity through doors and a single covering tree structure.",
                    "sid": 55,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Wiebe (1993), looking at simple examples such as (5) The car was finally coming toward him.",
                    "sid": 56,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "s1 He finished his diagnostic tests, s2 feeling relief.",
                    "sid": 57,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "s3 But then the car started to turn right.",
                    "sid": 58,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "s4 pointed multiple lexical items explicitly relating a clause to multiple other clauses.",
                    "sid": 59,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, but would relate s4 to s3 via a CONTRAST relation, while then would relate s4 to s2 via a temporal SUCCESSION relation.",
                    "sid": 60,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most well-known of work from this period is that of Mann and Thompson (1988), Grosz and Sidner (1986b), Moore and Moser (1996), Polanyi and van den Berg (1996), and Asher and Lascarides (2003).1 The way out of these problems was also a way to achieve the robustness required of any Language Technology, and that lay in the growing consensus towards the view that discourse does not have a single monolithic hierarchical structure.",
                    "sid": 61,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rather, different aspects of a discourse give rise to different structures, possibly with different formal properties (Stede, 2008; Stede, 2012; Webber et al., 2012).",
                    "sid": 62,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These different structures we describe in the next section, while the fact that this can’t be the end of the story, we take up in Section 4.",
                    "sid": 63,
                    "ssid": 45,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the situation today. ",
            "number": "3",
            "sents": [
                {
                    "text": "Recent years have seen progress to differing degrees on at least four different types of discourse structures: topic structure, functional structure, event structure, and a structure of coherence relations.",
                    "sid": 64,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First we say a bit about the structures, and then about the resources employed in recognizing and labelling them.",
                    "sid": 65,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Types of discourse structures.",
                    "sid": 66,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Topic structure and automated topic segmentation aims to break a discourse into a linear sequence of 1 For a historical account and assessent of work in automated anaphora resolution in this period and afterwards, we direct the reader to Strube (2007), Ng (2010) and Stede (2012).",
                    "sid": 67,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "topics such the geography of a country, followed by its history, its demographics, its economy, its legal structures, etc. Segmentation is usually done on a sentence-by-sentence basis, with segments not assumed to overlap.",
                    "sid": 68,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Methods for topic segmenation emply semantic, lexical and referential similarity or, more recently, language models (Bestgen, 2006; Chen et al., 2009; Choi et al., 2001; Eisenstein and Barzilay, 2008; Galley et al., 2003; Hearst, 1997; Malioutov and Barzilay, 2006; Purver et al., 2006; Purver, 2011).",
                    "sid": 69,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Functional structure and automated functional segmentation aims to identify sections within a discourse that serve different functions.",
                    "sid": 70,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These functions are genre-specific.",
                    "sid": 71,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of scientific journals, high-level sections generally include the Background (work that motivates the objectives of the work and/or the hypothesis or claim being tested), followed by its Methods, and Results, ending with a Discussion of the results or outcomes, along with conclusions to be drawn.",
                    "sid": 72,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finer- grained segments might include the advantage of a new method (method-new-advantage) or of an old method (method-old-advantage) or the disadvantage of one or the other (Liakata et al., 2010).",
                    "sid": 73,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Again, segmentation is usually done on a sentence- by-sentence basis, with sentences not assumed to fill more than one function.",
                    "sid": 74,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Methods for functional segmentation have employed specific cue words and phrases, as well as more general language models (Burstein et al., 2003; Chung, 2009; Guo et al., 2010; Kim et al., 2010; Lin et al., 2006; McKnight and Srinivasan, 2003; Ruch et al., 2007; Mizuta et al., 2006; Palau and Moens, 2009; Teufel and Moens, 2002; Teufel et al., 2009; Agarwal and Yu, 2009).",
                    "sid": 75,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The BIO approach to sequential classication (Beginning/Inside/Outside) used in Named Entity Recognition has also proved useful (Hirohata et al., 2008), recognizing that the way the start of a functional segement is signalled may differ from how it is continued.",
                    "sid": 76,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that topic segmentation and functional segmentation are still not always distinguished.",
                    "sid": 77,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in (Jurafsky and Martin, 2009), the term discourse segmentation is used to refer to any segmentation of a discourse into a “high-level” linear structure.",
                    "sid": 78,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, segmentation by function exploits different features (and in some cases, dif ferent methods) than segmentation by topic, so they are worth keeping distinct.",
                    "sid": 79,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Attention to event structure and the identification of events within a text is a more recent phenomena, after a hiatus of over twenty years.",
                    "sid": 80,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here we just point to work by (Bex and Verheij, 2010; Chambers and Jurafsky, 2008; Do et al., 2011; Finlayson, 2009).",
                    "sid": 81,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The automated identification of discourse relations aims to identify discourse relations such as CONDITION and MOTIVATION, as in Example 4, and CONTRAST and SUCCESSION, as in Example 5.",
                    "sid": 82,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These have also been called coherence relations or rhetorical relations.",
                    "sid": 83,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Methods used depend on whether or not a text is taken to be divisible into a covering sequence of a non-overlapping discourse units related to adjacent units by discourse relations as in Rhetorical Structure Theory (Mann and Thompson, 1988) or to both adjacent and non- adjacent units as in the Discourse GraphBank (Wolf and Gibson, 2005).",
                    "sid": 84,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If such a cover is assumed, methods involve parsing a text into units using lexical and punctuational cues, followed by labelling the relation holding between them (Marcu, 2000a; Marcu, 2000b; Wolf and Gibson, 2005).",
                    "sid": 85,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If text is not assumed to be divisible into discourse units, then methods involve finding evidence for discourse relations (including both explicit words and phrases, and clausal and sentential adjacency) and their arguments, and then labelling the sense of the identified relation (Elwell and Baldridge, 2008; Ghosh et al., 2011; Lin et al., 2010; Lin, 2012; Prasad et al., 2010a; Wellner, 2008; Wellner and Pustejovsky, 2007).",
                    "sid": 86,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.2 Resources for discourse structure.",
                    "sid": 87,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All automated systems for segmenting and labelling text are grounded in data — whether the data has informed the manual creation of rules or has been a source of features for an approach based on machine learning.",
                    "sid": 88,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of topic structure and high-level functional structure, there is now a substantial amount of data that is freely available.",
                    "sid": 89,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For other types of discourse structure, manual annotation has been required and, depending on the type of structure, different amounts are currently available.",
                    "sid": 90,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More specifically, work on topic structure and segmentation has been able to take advantage of the large, free, still-growing wikipedia, where articles on similar topics tend to show similar explicit segmentation into sub-topics.",
                    "sid": 91,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is certainly the case with the English wikipedia.",
                    "sid": 92,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If similar wikipedia evolving in other languages lack explicit segmentation, it may be that cross-lingual techniques may be able to project explicit segmentation from English- language articles.",
                    "sid": 93,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With respect to high-level functional structure, some work on automated segmentation has been able to exploit explicit author-provided indicators of structure, such as the author-structured abstracts now required by bio-medical journals indexed by MedLine.",
                    "sid": 94,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Researchers have used these explicitly structured abstracts to segment abstracts that lack explicit structure (Chung, 2009; Guo et al., 2010; Hirohata et al., 2008; Lin et al., 2006).",
                    "sid": 95,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For all other kinds of discourse structures, dedicated manual annotation has been required, both for segmentation and labelling, and many of these resources have been made available for other researchers.",
                    "sid": 96,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For fine-grained functional structure, there is the ART corpus (Liakata et al., 2010)2.",
                    "sid": 97,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For discourse relations annotated in the RST framework, there is the RST Discourse TreeBank of English text (Carlson et al., 2003), available through the Linguistic Data Consortium (LDC), as well as similarly annotated corpora in Spanish (da Cunha et al., 2011), Portugese (Pardo et al., 2008) and German (Stede, 2004).",
                    "sid": 98,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For discourse relations annotated in the lexically- grounded approach first described in (Webber and Joshi, 1998), there is the Penn Discourse TreeBank (Prasad et al., 2008) in English, as well as corpora in Modern Standard Arabic (AlSaif and Markert, 2010; AlSaif and Markert, 2011), Chinese (Xue, 2005; Zhou and Xue, 2012), Czech (Mladova´ et al., 2008), Danish (BuchKromann et al., 2009; BuchKromann and Korzen, 2010), Dutch (van der Vliet et al., 2011), Hindi (Oza et al., 2009), and Turkish (Zeyrek and Webber, 2008; Zeyrek et al., 2009; Zeyrek et al., 2010).",
                    "sid": 99,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also available are discourse- annotated journal articles in biomedicine (Prasad et al., 2011) and discourse-annotated dialogue (Tonelli et al., 2010).",
                    "sid": 100,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 http://www.aber.ac.uk/en/cs/research/cb/projects/art/art- corpus/",
                    "sid": 101,
                    "ssid": 38,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "new challenges. ",
            "number": "4",
            "sents": [
                {
                    "text": "Although the largely empirically-grounded, multi- structure view of discourse addresses some of the problems that previous computational approaches encountered, it also reveals new ones, while leaving some earlier problems still unaddressed.",
                    "sid": 102,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Evidence for discourse structures.",
                    "sid": 103,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first issue has to do with what should be taken as evidence for a particular discourse structure.",
                    "sid": 104,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While one could simply consider all features that can be computed reliably and just identify the most accurate predictors, this is both expensive and, in the end, unsatisfying.",
                    "sid": 105,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With topic structure, content words do seem to provide compelling evidence for segmentation, either using language models or semantic relatedness.",
                    "sid": 106,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, this might be improved through further evidence in the form of entity chains, as explored earlier in (Kan et al., 1998), but using today’s more accurate approaches to automated coreference recognition (Strube, 2007; Charniak and Elsner, 2009; Ng, 2010).",
                    "sid": 107,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Whatever the genre, evidence for function structure seems to come from the frequency and distribution of closed-class words, particular phrases (or phrase patterns), and in the case of speech, intonation.",
                    "sid": 108,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So, for example, Niekrasz (2012) shows that what he calls participant-relational features that indicate the participants relationships to the text provide convincing evidence for segmenting oral narrative by the type of narrative activity taking place.",
                    "sid": 109,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These features include the distribution and frequency of first and second person pronouns, tense, and intonation.",
                    "sid": 110,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But much work remains to be done in this area, in establishing what provides reliable evidence within a genre and what evidence might be stable across genres.",
                    "sid": 111,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evidence for discourse relations is what we have given significant thought to, as the Penn Discourse TreeBank (Prasad et al., 2008) and related corpora mentioned in Section 3.2 aim to ground each instance of a discourse relation in the evidence that supports it.",
                    "sid": 112,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The issue of evidence is especially important because none of these corpora has yet been completely annotated with discourse relations.",
                    "sid": 113,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Completing the annotation and developing robust automated segmentation techniques requires identifying what elements of the language provide evidence for coherence relations, and under what conditions.",
                    "sid": 114,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two main types of evidence for discourse relations in English are the presence of a discourse connective and sentence adjacency.",
                    "sid": 115,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discourse connectives annotated in the PDTB 2.0 come from a list of subordinating and coordinating conjunctions, and discourse adverbials — a subset of those identified by ForbesRiley et al (2006).",
                    "sid": 116,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subsequently, Prasad et al.",
                    "sid": 117,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010b) used CallisonBurch’s technique for identifying syntax-constrained paraphrases (CallisonBurch, 2008) to identify additional discourse connectives, some of which don’t appear in the PDTB corpus and some of which appear in the corpus but were not identified and annotated as discourse connectives.",
                    "sid": 118,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "English isn’t alone in lacking a complete list of discourse connectives: While German has the massive Hand- buch de deutschen Konnektoren (Pasch et al., 2003), even this resource has been found to be incomplete through clever application of automated tagging and word-alignment of parallel corpora (Versley, 2010).",
                    "sid": 119,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Evidence for discourse relations in the PDTB also comes from lexical or phrasal elements that are outside the initial set of conjunctions and discourse adverbials.",
                    "sid": 120,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This evidence has been called alternative lexicalization or AltLex (Prasad et al., 2010b), and includes (in English) clause-initial what’s more (Example 6) and that means (Example 7).",
                    "sid": 121,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(6) A search party soon found the unscathed aircraft in a forest clearing much too small to have allowed a conventional landing.",
                    "sid": 122,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What’s more, the seven mail personnel aboard were missing.",
                    "sid": 123,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[wsj 0550] (7) The two companies each produce market pulp, containerboard and white paper.",
                    "sid": 124,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That means goods could be manufactured closer to customers, saving shipping costs, he said.",
                    "sid": 125,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[wsj 0317] The discovery of these other forms of evidence3 raises the question of when it is that a word or phrase signals a discourse relation.",
                    "sid": 126,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, only 15 of the 33 tokens of that means in the PDTB were annotated as evidence of a discourse relation.",
                    "sid": 127,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the 3 which English is not alone in having, cf.",
                    "sid": 128,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Rysova, 2012) three paragraph-initial instances were left unannotated due to resource limitations (ie, no paragraph initial sentences were annotated unless they contained an explicit discourse connective), the majority were ignored because they followed an explicit connective.",
                    "sid": 129,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As Wiebe’s example (5) showed, there can be multiple explicit discourse connectives in a clause, each of which is evidence for a separate discourse relation (albeit possibly between the same arguments).",
                    "sid": 130,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All of these are annotated in the PDTB – eg, both but and then in (8) Congress would have 20 days to reject the package with a 50% majority, but then a President could veto that rejection.",
                    "sid": 131,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[wsj 1698] The question is whether an AltLex in the context of an explicit connective also provides evidence of a distinct discourse relation — for example, with the conjunction with But in (9) At a yearling sale, a buyer can go solo and get a horse for a few thousand dollars.",
                    "sid": 132,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But that means paying the horse’s maintenance; on average, it costs $25,000 a year to raise a horse.",
                    "sid": 133,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[wsj 1174] As noted above, the PDTB 2.0 also admits sentence adjacency as evidence for one, or even two, implicit discourse relations, as in (10) And some investors fault Mr. Spiegel’s life style; [Implicit = because, for instance] he earns millions of dollars a year and flies around in Columbia’s jet planes.",
                    "sid": 134,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[wsj 0179] Here, the implicit token of because is associated with a discourse relation labelled CONTINGENCY.CAUSE.REASON, while the implicit token of for instance is associated with one labelled EXPANSION.RESTATEMENT.SPECIFICATION.",
                    "sid": 135,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The question is whether sentence adjacency could also serve as evidence for a distinct discourse relation, even when there is also an explicit discourse adverbial, as in the following three instances of instead.",
                    "sid": 136,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, Ex.",
                    "sid": 137,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "11 can be paraphrased as And instead, Ex.",
                    "sid": 138,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "12 as But instead, and Ex.13 as So instead.",
                    "sid": 139,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(11) But many banks are turning away from strict price competition.",
                    "sid": 140,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, they are trying to vices into packages and targeting them to small segments of the population.",
                    "sid": 141,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[wsj 0085] (12) The tension was evident on Wednesday evening during Mr. Nixon’s final banquet toast, normally an opportunity for reciting platitudes about eternal friendship.",
                    "sid": 142,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, Mr. Nixon reminded his host, Chinese President Yang Shangkun, that Americans haven’t forgiven China’s leaders for the military assault of June 34 that killed hundreds, and perhaps thousands, of demonstrators.",
                    "sid": 143,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[wsj 0093] (13) Since stars are considerably more massive than planets, such wobbles are small and hard to see directly.",
                    "sid": 144,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, Dr Marcy and others like him look for changes that the wobbles cause in the wavelength of the light from the star.",
                    "sid": 145,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[The Economist, 10 November 2007] These examples suggest that the presence of an explicit connective should not, in all cases, be considered evidence for the absense of an implicit connective.",
                    "sid": 146,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once the set of explicit connectives have been identified that can co-occur with each other (including for example and for instance, as well as instead), automated parsers for coherence relations can be made to consider the presence of an implicit connective whenever one of these is seen.",
                    "sid": 147,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Variability in discourse annotation.",
                    "sid": 148,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another issue relates to variability in annotating discourse structure: Inter-annotator agreement can be very low in annotating pragmatic and discourse- related phenomena.",
                    "sid": 149,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While we will illustrate the point here in terms of annotating coherence relations, for other examples, the general point is illustrated in papers from the DGfS Workshop on Beyond Semantics4 and in an upcoming special issue of the journal Discourse and Dialogue devoted to the same topic.",
                    "sid": 150,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Penn Wall Street Journal corpus contains twenty-four (24) reports of errata in previously- appearing articles.",
                    "sid": 151,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Twenty-three (23) consist of a single pair of sentences, with no explicit discourse connective signalling the relation between them.5 4 http://www.linguistics.ruhruni-bochum.de/beyondsem/ 5 The other report contains three sentences, again with no explicit connectives.",
                    "sid": 152,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "rect statement – e.g.",
                    "sid": 153,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(14) VIACOM Inc.’s loss narrowed to $21.7 million in the third quarter from $56.9 million a year ago.",
                    "sid": 154,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thursday’s edition misstated the narrowing.",
                    "sid": 155,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[wsj 1747] In twenty of the errata (class C1), the correct statement is given in the first sentence and the error, in the second; In the other three (class C2), it is the other way around.",
                    "sid": 156,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One might think that the two sentences in the twenty C1 reports would be annotated as having the same discourse relation holding between them, and the same with the two sentences in the three C2 reports.",
                    "sid": 157,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But that is not the case: The twenty C1 reports presented to annotators at different times ended up being labelled with six different discourse relations.",
                    "sid": 158,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There was even variability in labelling the three members of the C2 class: They were labelled with one discourse relation, and one with a completely different one.",
                    "sid": 159,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What should one conclude from this variability?",
                    "sid": 160,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One possibility is that there is one right answer, and annotators just vary in their ability to identify it.",
                    "sid": 161,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This would mean it would be beneficial to have a large troop of annotators (so that the majority view could prevail).",
                    "sid": 162,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Another possibility is that there is more than one right answer, which would imply multi-label classification so that multiple labels could hold to different degrees.",
                    "sid": 163,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A third possibility reflects the view from Beyond Semantics that it is often very hard to transfer results from theoretical linguistics based on toy examples to naturally- occurring texts.",
                    "sid": 164,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, variability is a consequence of the still exploratory nature of much discourse annotation.",
                    "sid": 165,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the case of errata, while clearly some relation holds between the pair of sentences, it may actually not be any of those used in annotating the PDTB.",
                    "sid": 166,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, as Grosz and Sidner (1986b) argued several years ago, the sentences may only be related by their communicative intentions – one sentence intended to draw the reader’s attention to the specific error that was made (so that the reader knows what was misstated), the other intended to correct it.",
                    "sid": 167,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One might then take the sense annotation of discourse relations as still exploratory in the wide range of corpora being annotated with this information (cf.",
                    "sid": 168,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3.2).",
                    "sid": 169,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "structures Fortunately for approaches to automated discourse structure recognition, the lack of isomorphism between different discourse structures does not necessarily mean that they are completely independent.",
                    "sid": 170,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This belief that different aspects of discourse would be related, is what led Grosz and Sidner (1986b) to propose a theory that linked what they called the intentional structure of discourse, with its linguistic structure and with the reader or listener’s cognitive attentional structure.",
                    "sid": 171,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With respect to the different types of discourse structure considered here, (Lin, 2012) has considered the possibility of systematic relations between Teufel’s Argumentative Zone labelling of scientific texts in a corpus developed for her PhD thesis (Teufel, 1999) and PDTB-style discourse relations, both within and across sentences.",
                    "sid": 172,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is certainly worth additional study, for the value it can bring to automated methods of discourse structure recognition.",
                    "sid": 173,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.4 Intentional structure.",
                    "sid": 174,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When computational discourse processing turned to machine learning methods based on reliably- identifiable features, it abandoned (at least temporarily) the centrality of pragmatics and speaker intentions to discourse.",
                    "sid": 175,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "That is, there were few or no features that directly indicated or could serve as reliable proxies for what role speaker intended his/her utterance to play in the larger discourse.",
                    "sid": 176,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But both Niekrasz’ work on meeting segmentation (Section 4.1) and the discussion in Section 4.2 of errata and variability in their labelling draws new attention to this old question, and not just to Moore and Pol- lack’s observation (Section 3) that intentional and informational characterizations may confer different, non-isomorphic structures over a text.",
                    "sid": 177,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It may also be the case that neither structure may provide a complete cover: A new visit is warranted.",
                    "sid": 178,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.5 Discourse and inference.",
                    "sid": 179,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Not only were intentions abandoned in the move to data-intensive methods, so was inference and issues of how readers and listeners recover information that isn’t explicit.",
                    "sid": 180,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "What’s missing can be an from the restaurant script (Lehnert, 1977), where someone enters a restaurant, sits down at a table and gives their order to a waiter, where un- mentioned inter alia is an event in which the person becomes informed of what items the restaurant has to offer, say through being given a menu.",
                    "sid": 181,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Or it can be an unmentioned fact, such as that program trading involves the computer-executed trading of a basket of fifteen or more stocks.",
                    "sid": 182,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The latter explains the annotation of an implicit EXPANSION.RESTATEMENT.GENERALIZATION relation between the two sentences in (15) “You’re not going to stop the idea of trading a basket of stocks,” says Vanderbilt’s Prof. Stoll.",
                    "sid": 183,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "“Program trading is here to stay, and computers are here to stay, and we just need to understand it.” [wsj 0118] The problem here with inference is when labelling an implicit coherence relation requires inferred information about its arguments, those arguments may have quite different features than when all the information needed to label the relation is explicit.",
                    "sid": 184,
                    "ssid": 83,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "5",
            "sents": [
                {
                    "text": "There are still large challenges ahead for computational discourse modelling.",
                    "sid": 185,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But we are hopeful that greater openness to how information is conveyed through discourse, as well as richer modelling techniques developed for other problems, will allow needed progress to be made.",
                    "sid": 186,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we can improve system performance in recognizing the roles that utterances are meant to play in discourse in one genre, perhaps it will help us generalize and transport this intention recognition between genres.",
                    "sid": 187,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also hope for progress in finding more ways to take advantage of unannotated data in discourse research; in understanding more about inter-dependencies between features of different types of discourse structure; in continuing to carry out related computational discourse research and development in multiple languages and genres, so as to widen the access to the knowledge gained; and in exploiting discourse in Language Technology applications, including information extraction and SMT.",
                    "sid": 188,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}