{
    "ID": "W12-6212",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper presents the current status of development of a finite state transducer grammar for the verbal-chain transfer module in Matxin, a Rule Based Machine Translation system between Spanish and Basque.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Due to the distance between Spanish and Basque, the verbal-chain transfer is a very complex module in the overall system.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The grammar is compiled with foma, an open-source finite- state toolkit, and yields a translation execution time of 2000 verb chains/second.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "This paper presents the current status of development of an FST (Finite State Transducer) grammar we have developed for Matxin, a Machine Translation system between Spanish and Basque.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basque is a minority language isolate, and it is likely that an early form of this language was already present in Western Europe before the arrival of the IndoEuropean languages.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basque is a highly inflected language with free order of sentence constituents.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is an agglutinative language, with a rich flexional morphology.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basque is also a so-called ergativeabsolutive language where the subjects of intransitive verbs appear in the absolutive case (which is unmarked), and where the same case is used for the direct object of a transitive verb.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The subject of the transitive verb (that is, the agent) is marked differently, with the ergative case (in Basque by the suffix -k).",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The presence of this morpheme also triggers main and auxiliary verbal agreement.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Auxiliary verbs, or ‘periphrastic’ verbs, which accompany most main verbs, agree not only with the subject, but also with the direct object and the indirect object, if present.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Among European languages, this polypersonal system (multiple verb agreement) is rare, and found only in Basque, some Caucasian languages, and Hungarian.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The fact that Basque is both a morphologically rich and less-resourced language makes the use of statistical approaches for Machine Translation difficult and raises the need to develop a rule-based architecture which in the future could be combined with statistical techniques.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Matxin es-eu (SpanishBasque) MT engine is a classic transfer-based system comprising three main modules: analysis of the Spanish text (based on FreeLing, (Atserias et al., 2006)), transfer, and generation of the Basque target text.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the transfer process, lexical transfer is first carried out using a bilingual dictionary coded in the XML format of Apertium dictionary files (.dix) (Forcada et al., 2009), and compiled, using the FST library implemented in the Apertium project (the lt- toolbox library), into a finite-state transducer that can be processed very quickly.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Following this, structural transfer at the sentence level is performed, and some information is transferred from some chunks1 to others while some chunks may be deleted.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the structural trans 1 A chunk is a non-recursive phrase (noun phrase, prepositional phrase, verbal chain, etc.) which expresses a constituent (Abney, 1991; Civit, 2003).",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our system, chunks play a crucial part in simplifying the translation process, due to the fact that each module works only at a single level, either inside or between chunks.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "65 Proceedings of the 10th International Workshop on Finite State Methods and Natural Language Processing, pages 65–69, Donostia–San Sebastia´n, July 23–25, 2012.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2012 Association for Computational Linguistics fer at the verb chunk level is carried out.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbal chunk transfer is a very complex module because of the nature of Spanish and Basque auxiliary verb constructions, and is the main subject of this paper.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This verb chain transfer module is implemented as a series of ordered replacement rules (Beesley and Karttunen, 2003) using the foma finite-state toolkit (Hulden, 2009).",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In total, the system consists of 166 separate replacement rules that together perform the verb chunk translation.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In practice, the input is given to the first transducer, after which its output is passed to the second, and so forth, in a cascade.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each rule in the system is unambiguous in its output; that is, for each input in a particular step along the verb chain transfer, the transducers never produce multiple outputs (i.e. the transducers in question are functional).",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of the rules are joined together with composition, yielding a total of 55 separate transducers.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In principle, all the rules could be composed together into one monolithic transducer, but in practice the size of the composed transducer is too large to be feasible.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The choice to combine some transducers while leaving others separate is largely a memory/translation speed tradeoff.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "spanish and basque verb features and. ",
            "number": "2",
            "sents": [
                {
                    "text": "their translation In the following, we will illustrate some of the main issues in translating Spanish verb chains to Basque.",
                    "sid": 29,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since both languages make frequent use of auxiliary verb constructions, and since periphrastic verb constructions are frequent in Basque, transfer rules can get quite complex in their design.",
                    "sid": 30,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, in translating the phrase (Yo) compro (una manzana) (I) [PP1CSN00] buy [VMIP1S0] (an [DI0FS0] apple) [NCFS000] we can translate it using the imperfective participle form (erosten) of the verb erosi (to buy), and a transitive auxiliary (dut) which itself contains both subject agreement information (I: 1st sg.)",
                    "sid": 31,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "and number agreement with the object (an apple: 3rd sg.): (nik) (sagar bat) erosten dut.",
                    "sid": 32,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The participle carries information concerning meaning, aspect and tense, whereas the auxiliaries convey information about argument structure, tense and mood.",
                    "sid": 33,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 illustrates the central idea of the verb chunk transfer.",
                    "sid": 34,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the first four examples the form of the transitive auxiliary changes to express agreement with different ergative arguments (the subject of the clause), absolutive arguments (the direct object) and dative arguments (the indirect object).",
                    "sid": 35,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the fifth example the future participle is used.",
                    "sid": 36,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The last example shows the translation of a periphrastic construction, in which the the Spanish and the Basque word orders are completely different: this is reflected in the Spanish tengo que-construction (have to) which appears before the main verb, whereas in the Basque, the equivalent (behar) appears after the main verb (erosi).",
                    "sid": 37,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the fst grammar. ",
            "number": "3",
            "sents": [
                {
                    "text": "We carry out the verbal chunk transfer using finite- state transducers (Alegria et al., 2005).",
                    "sid": 38,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The grammar rules take as input the Spanish verbal chunk, perform a number of transformations on the input, and then create and output the verbal chunk for Basque.",
                    "sid": 39,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To illustrate the functioning of the grammar, let us consider the following example sentence in Spanish: “Un tribunal ha negado los derechos constitucionales a los presos polticos” (A court has denied constitutional rights to political prisoners).",
                    "sid": 40,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The correct translation into Basque given by the system for this example is as follows: Auzitegi batek eskubide konstituzionalak ukatu dizkie preso politikoei.",
                    "sid": 41,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 shows a detailed overview of how the whole transfer of the verbal chunk is performed for this par ticular example.",
                    "sid": 42,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, the input to the grammar is assumed to be a string containing (separated by the ’&’ symbol) the following information : • the morphological information (using EAGLES-style tags Leech and Wilson (1996)) for all nodes (separated by ’+’ symbol) in the Spanish verbal chunk (haber[VAIP3S0]+negar[VMP00SM]); • the morphological information of the subject ([sub3s]), the direct object ([obj3p]) and the indirect object ([iobj3p]); • the translation of the main verb in Basque (ukatu) and information about its transitivity Sp an is h se nt en ce E n gli sh Ba sq ue tr an sl ati o n (Y o) co m pr o (u na m an za na ) (I) bu y (a n ap pl e) (N ik) (s ag ar ba t) er ost en du t (Y o) co m pr o (m an za na s) (I) bu y (a pp les ) (N ik) (s ag arr ak ) er ost en dit ut (Tu ´ ) co m pr as (m an za na s) (Y ou ) bu y (a pp le s) (Z uk ) (s ag arr ak ) er ost en dit uz u (Y o) (te ) co m pr o (u na m an za na ) (I) bu y (y ou ) (a n ap pl e) (N ik) (z ur i) (s ag ar ba t) er ost en di zu t (Y o) co m pr are ´ (u na m an za na ) (I) wi ll bu y (a n ap pl e) (N ik) (s ag ar ba t) er osi ko du t (Y o) te ng o qu e co m pr ar (m an za na s) (I) m us t bu y (a pp le s) (N ik) (s ag arr ak ) er osi be ha r dit ut Table 1: Examples of translations A court has denied (the) rights constitutional to (the) prisoners political Un tribunal ha negado los derechos constitucionales a los presos políticos Subject Verb Object Indirect Object Input haber[VAIP3S0]+ negar[VMP00SM ] & [sub3s] [obj3p] [iobj3p] & ukatu [DIO] 1.",
                    "sid": 43,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Identification.",
                    "sid": 44,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of the schema [ SimpleVerbEsType -> ...",
                    "sid": 45,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SimpleVerbEuSchema ] haber[VAIP3S0]+negar[VMP00SM] & [sub3s] [obj3p] [iobj3p] & ukatu [DIO] SimpleVerb (main) AspectMain / Aux TenseMood Abs Dat Erg 2.",
                    "sid": 46,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Resolution.",
                    "sid": 47,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of the values Attrib.",
                    "sid": 48,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "-> Value || Context AspectM ain -> [perfPart] || ?* VAIP ?* SimpleVerb ?* _ Aux -> edun(aux) || ?* DIO ?* _ TenseMood -> [indPres] || ?* VAIP ?* _ Abs -> [abs3p] || ?* [obj3p] ?* edun(aux) ?* _ Dat -> [dat3p] || ?* [iobj3p] ?* _ Erg -> [erg3s] || ?* V???3S ?* edun(aux) ?* _ niega[VMIP3S0] & [sub3s] [obj3s] [dat3p] & ukatu [DIO] + SimpleVerb (main)[perfPart] / edun(aux) [indPres] [abs3p][dat3p][erg3s] 3.",
                    "sid": 49,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Elimination of.",
                    "sid": 50,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "source information Output ukatu(main)[perf Part] / edun(aux) [indPres] [abs3p][dat3p][e rg3s] uka +tu d +i +zki +e +Ø deny perf.",
                    "sid": 51,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ind. trans.",
                    "sid": 52,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3rdpl 3rdpl 3rdsg part.",
                    "sid": 53,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "pres.",
                    "sid": 54,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "aux.",
                    "sid": 55,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "abs.",
                    "sid": 56,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "dat.",
                    "sid": 57,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "erg.",
                    "sid": 58,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1: Example of the transfer of a verbal chunk.",
                    "sid": 59,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "([DIO]), indicating a ditransitive construction: haber[VAIP3S0]+negar[VMP00SM] & [sub3s][obj3p][iobj3p] & ukatu[DIO] The grammatical rules are organized into three groups according to the three main steps defined for translating verbal chunks: 1.",
                    "sid": 60,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Identification of the Basque verbal chunk.",
                    "sid": 61,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "schema corresponding to the source verbal chunk.",
                    "sid": 62,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are twelve rules which perform this task, each of which corresponds to one of the following verbal chunks in Spanish: non-conjugated verbs, simple non-periphrastic verbs as well as four different groups reserved for the periphrastic verbs.",
                    "sid": 63,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The verbal chunk of the example in figure 1 is a simple non-periphrastic one, and the rule that handles this particular case is as follows: [simpleVerbEsType -> ... simpleVerbEuSchema] When this rule matches the input string representing a simple non-periphrastic verbal chunk (simpleVerbEsType) it adds the corresponding Basque verbal chunk schema (simpleVerbEuSchema) to the end of the input string.",
                    "sid": 64,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "simpleVerbEsType is a complex automaton that has the definition of the Spanish simple verbs.",
                    "sid": 65,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "simpleVerbEuSchema is the type of the verbal chunk (SimpleVerb) and an automaton that contains as strings the pattern of elements (separated by the ’/’ symbol) that the corresponding Basque verb chunk will need to have (in this case, the main verb and the auxiliary verb): SimpleVerb (main) AspectMain / Aux TenseMood Abs Dat Erg 2.",
                    "sid": 66,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Resolution of the values for the attributes in the.",
                    "sid": 67,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Basque schema.",
                    "sid": 68,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A total of 150 replacement rules of this type have been written in the grammar.",
                    "sid": 69,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here are some rules that apply to the above example: [AspectMain -> [perfPart] || ?* VAIP ?* SimpleVerb ?* ] [Aux -> edun(aux) || ?* DIO ?* ] [Abs -> [abs3p] || ?* [obj3p] ?* edun(aux) ?* ] 3.",
                    "sid": 70,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Elimination of source-language information.",
                    "sid": 71,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4 rules in total).",
                    "sid": 72,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The output of the grammar for the example is: ukatu(main)[perfPart] / edun(aux)[indPres][abs3p][dat3p][erg3s ] The first node has the main verb (ukatu) with the perfective participle aspect, and the second one contains the auxiliary verb (edun) with all its morphological information: indicative present and argument structure.",
                    "sid": 73,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the output string, each of the elements contains the information needed by the subsequent syntactic generation and morphological generation phases.",
                    "sid": 74,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 Implementation When the verbal chunk transfer module was first developed, there did not exist any efficient open source tools for the construction of finite state transducers.",
                    "sid": 75,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the time, the XFST -toolkit (Beesley and Karttunen, 2003) was used to produce the earlier versions of the module: this included 25 separate transducers of moderate size, occupying 2,795 kB in total.",
                    "sid": 76,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The execution speed was roughly 250 verb chains per second.",
                    "sid": 77,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since Matxin was designed to be open source, we built a simple compiler that converted the XFST rules into regular expressions that could then be applied without FST technology, at the cost of execution speed.",
                    "sid": 78,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This verbal chunk transfer module read and applied these regular expressions at a speed of 50 verbal chunks per second.",
                    "sid": 79,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the work presented here, we have reimplemented and expanded the original rules written for XFST with the foma2 toolkit (Hulden, 2009).",
                    "sid": 80,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After adapting the grammar and compiling it, the 55 separate transducers occupy 607 kB and operate at roughly 2,000 complete verb chains per second.3 Passing the strings from one transducer to the next in the chain of 55 transducers in accomplished by the depth-first-search transducer chaining functionality available in the foma API.",
                    "sid": 81,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2 http://foma.sourceforge.net 3 On a 2.8MHz Intel Core 2 Duo..",
                    "sid": 82,
                    "ssid": 45,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}