{
    "ID": "W13-4047",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "A challenge in dialogue act recognition is the mapping from noisy user inputs to dialogue acts.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this paper we describe an approach for re-ranking dialogue act hypotheses based on Bayesian classifiers that incorporate dialogue history and Automatic Speech Recognition (ASR) N-best information.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We report results based on the Let’s Go dialogue corpora that show (1) that including ASR N-best information results in improved dialogue act recognition performance (+7% accuracy), and (2) that competitive results can be obtained from as early as the first system dialogue act, reducing the need to wait for subsequent system dialogue acts.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The primary challenge of a Dialogue Act Recogniser (DAR) is to find the correct mapping between a noisy user input and its true dialogue act.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In standard “slot-filling” dialogue systems a dialogue act is generally represented as DialogueActType(attribute-value pairs), see Section 3.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While a substantial body of research has investigated different types of models and methods for dialogue act recognition in spoken dialogue systems (see Section 2), here we focus on re-ranking the outputs of an existing DAR for evaluation purposes.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In practice the re-ranker should be part of the DAR itself.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We propose to use multiple Bayesian classifiers to re-rank an initial set of dialogue act hypotheses based on information from the dialogue history as well as ASR N-best lists.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In particular the latter type of information helps us to learn mappings between dialogue acts and common misrecognitions.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present experimental results based on the Let’s Go dialogue corpora which indicate that re-ranking hypotheses using ASR N-best information can lead to improved recognition.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we compare the recognition accuracy over time and find that high accuracy can be obtained with as little context as one system dialogue act, so that there is often no need to take a larger context into account.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "2",
            "sents": [
                {
                    "text": "Approaches to dialogue act recognition from spoken input have explored a wide range of methods.",
                    "sid": 12,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Stolcke et al., 2000) use HMMs for dialogue modelling, where sequences of observations correspond to sequences of dialogue act types.",
                    "sid": 13,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They also explore the performance with decision trees and neural networks and report their highest accuracy at 65% on the Switchboard corpus.",
                    "sid": 14,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Zimmermann et al., 2005) also use HMMs in a joint segmentation and classification model.",
                    "sid": 15,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Grau et al., 2004) use a combination of Naive Bayes and n-grams with different smoothing methods.",
                    "sid": 16,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Their best models achieve an accuracy of 66% on English Switchboard data and 89% on a Spanish corpus.",
                    "sid": 17,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Sridhar et al., 2009; Wright et al., 1999) both use a maximum entropy classifier with n- grams to classify dialogue acts using prosodic features.",
                    "sid": 18,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Sridhar et al., 2009) report an accuracy of up to 74% on Switchboard data and (Wright et al., 1999) report an accuracy of 69% on the DCIEM Maptask Corpus.",
                    "sid": 19,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Bohus and Rudnicky, 2006) maintain an N-best list of slot values using logistic regression.",
                    "sid": 20,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Surendran and Levow, 2006) use a combination of linear support vector machines (SVMs) and HMMs.",
                    "sid": 21,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They report an accuracy of 65.5% on the HCRC MapTask corpus and conclude that SVMs are well suited for sparse text and dense acoustic features.",
                    "sid": 22,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Gamba¨ck et al., 2011) use SVMs within an active learning framework.",
                    "sid": 23,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They show that while passive learning achieves an accuracy of 77.8% on Switchboard data, the active learner achieves up to 80.7%.",
                    "sid": 24,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Henderson et al., 2012) use SVMs for dialogue act recognition from ASR word confusion networks.",
                    "sid": 25,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "314 Proceedings of the SIGDIAL 2013 Conference, pages 314–318, Metz, France, 2224 August 2013.",
                    "sid": 26,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2013 Association for Computational Linguistics Following Components Figure 1: Pipeline architecture for dialogue act recognition and re-ranking component.",
                    "sid": 27,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, the input is a list of dialogue acts with confidence scores, and the output is the same list of dialogue acts but with recomputed confidence scores.",
                    "sid": 28,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A dialogue act is represented as DialogueActType(attribute-value pairs).",
                    "sid": 29,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Several authors have presented evidence in favour of Bayesian methods.",
                    "sid": 30,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Keizer and op den Akker, 2007) have shown that Bayesian DARs can outperform baseline classifiers such as decision trees.",
                    "sid": 31,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More generally, (Ng and Jordan, 2001) show that generative classifiers (e.g. Naive Bayes) reach their asymptotic error faster than discriminative ones.",
                    "sid": 32,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a consequence, generative classifiers are less data intensive than discriminative ones.",
                    "sid": 33,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, several authors have investigated dialogue belief tracking.",
                    "sid": 34,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While our approach is related to belief tracking, we focus here on spoken language understanding under uncertainty rather than estimating user goals.",
                    "sid": 35,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Williams, 2007; Thomson et al., 2008) use approximate inference to improve the scalability of Bayes nets for belief tracking and (Lison, 2012) presents work on improving their scalability through abstraction.",
                    "sid": 36,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Mehta et al., 2010) model user intentions through the use of probabilistic ontology trees.",
                    "sid": 37,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Bayes nets have also been applied to other dialogue-related tasks, such as surface realisation within dialogue (Dethlefs and Cuaya´huitl, 2011) or multi-modal dialogue act recognition (Cuaya´huitl and KruijffKorbayova´, 2011).",
                    "sid": 38,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the following, we will explore a dialogue act recognition technique based on multiple Bayesian classifiers and show that re-ranking with ASR N-best information can improve recognition performance.",
                    "sid": 39,
                    "ssid": 28,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "re-ranking dialogue acts using. ",
            "number": "3",
            "sents": [
                {
                    "text": "Multiple Bayesian Networks Figure 1 shows an illustration of our dialogue act re-ranker within a pipeline architecture.",
                    "sid": 40,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, processing begins with the user’s speech being interpreted by a speech recogniser, which produces a first N-best list of hypotheses.",
                    "sid": 41,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These hypotheses are subsequently passed on and interpreted by a dialogue act recogniser, which in our case is represented by the Let’s Go parser.",
                    "sid": 42,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parser produces a first set of dialogue act hypotheses, based on which our re-ranker becomes active.",
                    "sid": 43,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A full dialogue act in our scenario consists of three elements: dialogue act types, attributes (or slots), and slot values.",
                    "sid": 44,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example dialogue act is inform(from=Pittsburgh Downtown).",
                    "sid": 45,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The dialogue act re-ranker thus receives a list of hypotheses in the specified form (triples) from its preceding module (a DAR or in our case the Let’s Go parser) and its task is to generate confidence scores that approximate true label (i.e. the dialogue act really spoken by a user) as closely as possible.",
                    "sid": 46,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We address this task by using multiple Bayesian classifiers: one for classifying a dialogue act type, one for classifying a set of slots, and the rest for classifying slot values.",
                    "sid": 47,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of multiple classifiers is beneficial for scalability purposes; for example, assuming 10 dialogue act types, 10 slots, 10 values per slot, and no other dialogue context results in a joint distribution of 1011 parameters.",
                    "sid": 48,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since a typical dialogue system is required to model even larger joint distributions, our adopted approach is to factorize them into multiple independent Bayesian networks (with combined outputs).",
                    "sid": 49,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A multiple classifier system is a powerful solution to complex classification problems involving a large set of inputs and outputs.",
                    "sid": 50,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach not only decreases training time but has also been shown to increase the performance of classification (Tax et al., 2000).",
                    "sid": 51,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Bayesian Network (BN) models a joint probability distribution over a set of random variables and their dependencies, see (Bishop, 2006) for an introduction to BNs.",
                    "sid": 52,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our motivation for using multiple BNs is to incorporate a fairly rich dialogue context in terms of what the system and user said at lexical and semantic levels.",
                    "sid": 53,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In contrast, using a single BN for all slots with rich dialogue context faces scalability issues, especially for slots with large numbers of domain values, and is therefore not an attractive option.",
                    "sid": 54,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We denote our set of Bayesian classifiers as λ = {λdat, λatt, ..., λval(i)}, where BN λdat is used to rank dialogue act types, BN λatt is used to rank attributes, and the other BNs (λval(i)) are used to rank values for each slot i. The score of a user dialogue act (< d, a, v >) is computed as: 1 n P (d, a, v) = Z P (d|pad)P (a|paa)P (v|pav ), where d is a dialogue act type, a is an attribute (or slot), v is a slot value, pax is a parent random variable, and Z is a normalising constant.",
                    "sid": 55,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This implies that the score of a dialogue act is the product of probabilities of dialogue act type and slot-value pairs.",
                    "sid": 56,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For dialogue acts including multiple slot- value pairs, the product above can be extended accordingly.",
                    "sid": 57,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The best and highest ranked hypothesis (from space H) can be obtained according to: < d, a, v >∗= arg max <d,a,v>∈H P (d, a, v).",
                    "sid": 58,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2: Bayesian network for probabilistic reasoning of locations (variable “from desc”), which In the following, we describe our experimental setting.",
                    "sid": 59,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, the structure and parameters of our classifiers will be estimated from a corpus of spoken dialogues, and we will use the equations above for re-ranking user dialogue acts.",
                    "sid": 60,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we report results comparing Bayesian classifiers that make use of ASR N-best information and dialogue context against Bayesian classifiers that make predictions based on the dialogue context alone.",
                    "sid": 61,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "experiments and results. ",
            "number": "4",
            "sents": [
                {
                    "text": "4.1 Data.",
                    "sid": 62,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our experiments are based on the Let’s Go corpus (Raux et al., 2005).",
                    "sid": 63,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Let’s Go contains recorded interactions between a spoken dialogue system and human users who make enquiries about the bus schedule in Pittsburgh.",
                    "sid": 64,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Dialogues are driven by system-initiative and query the user sequentially for five slots: an optional bus route, a departure place, a destination, a desired travel date, and a desired travel time.",
                    "sid": 65,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each slot needs to be explicitly (or implicity) confirmed by the user.",
                    "sid": 66,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our analyses are based on a subset of this data set containing 779 dialogues with 7275 turns, collected in the Summer of 2010.",
                    "sid": 67,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From these dialogues, we used 70% for training our classifiers and the rest for testing (with 100 random splits).",
                    "sid": 68,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Briefly, this data set contains 12 system dialogue act types1, 11 user dialogue act types2, and 5 main slots with variations3.",
                    "sid": 69,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of slot values ranges between 1ack, cant help, example, expl conf, go back, hello, impl conf, more buses, request, restart, schedule, sorry.",
                    "sid": 70,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2affirm, bye, go back, inform, negate, next bus, prevbus, repeat, restart, silence, tellchoices.",
                    "sid": 71,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3date.absday, date.abmonth, date.day, date.relweek, from, route, time.ampm, time.arriveleave, time.hour, time.minute, time.rel, to.",
                    "sid": 72,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "incorporates ASR N-best information in the variable“from desc nbest” and dialogue history information in the remaining random variables.",
                    "sid": 73,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "102 and 103 so that the combination of all possible dialogue act types, attributes and values leads to large amounts of triplets.",
                    "sid": 74,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the majority of user inputs contain one user dialogue act, the average number of system dialogue acts per turn is 4.2.",
                    "sid": 75,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Note that for the user dialogue act types, we also model silence explicitly.",
                    "sid": 76,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is often not considered in dialogue act recognisers: since the ASR will always try to recognise something out of any input (even background noise), typical dialogue act recognisers will then try to map the ASR output onto a semantic interpretation.",
                    "sid": 77,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Bayesian Networks.",
                    "sid": 78,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We trained our Bayesian networks in a supervised learning manner and used 43 discrete features (or random variables) plus a class label (also discrete).",
                    "sid": 79,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The feature set is described by three main subsets: 25 system utterance-level binary features4 derived from the system dialogue act(s) in the last turn; 17 user-utterance-level binary features5 derived from (a) what the user heard prior to the current turn, or (b) what keywords the system recognised in its 4System utterance features: heardAck, heardCantHelp, heardExample, heardExplConf, heardGoBackDAT, heard- Hello, heardImplConf, heardMoreBuses, heardRequest, heardRestartDAT, heardSchedule, heardSorry, heardDate, heardFrom, heardRoute, heardTime, heardTo, heardNext, heardPrevious, heardGoBack, heardChoices, heardRestart, heardRepeat, heardDontKnow, lastSystemDialActType.",
                    "sid": 80,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5User utterance features: hasRoute, hasFrom, hasTo, has- Date, hasTime, hasYes, hasNo, hasNext, hasPrevious, has- GoBack, hasChoices, hasRestart, hasRepeat, hasDontKnow, hasBye, hasNothing, duration in secs.",
                    "sid": 81,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(values=0,1,2,3,4,>5).",
                    "sid": 82,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "list of speech recognition hypotheses; and 1 word- level non-binary feature (* nbest) corresponding to the slot values in the ASR N-best lists.",
                    "sid": 83,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 shows the Bayes net corresponding to the classifier used to rank location names.",
                    "sid": 84,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The random variable from desc is the class label, the random variable from desc nbest (marked with an asterisk) incorporates slot values from the ASR N-best lists, and the remaining variables model dialogue history context.",
                    "sid": 85,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The structure of our Bayesian classifiers were derived from the K2 algorithm6, and their parameters were derived from maximum likelihood estimation.",
                    "sid": 86,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we performed probabilistic inference using the Junction tree algorithm7.",
                    "sid": 87,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Based on these data and tools, we trained 14 Bayesian classifiers: one for scoring dialogue act types, one for scoring attributes (slots), and the rest for scoring slot values.",
                    "sid": 88,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Experimental Results.",
                    "sid": 89,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compared 7 different dialogue act recognisers in terms of classification accuracy.",
                    "sid": 90,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The comparison was made against gold standard data from a human-labelled corpus.",
                    "sid": 91,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Semi-Random) is a recogniser choosing a random dialogue act from the Let’s Go N-best parsing hypotheses.",
                    "sid": 92,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Inci) is our proposed approach considering a context of i system dialogue acts, and (Ceiling) is a recogniser choosing the correct dialogue act from the Let’s Go N-best parsing hypotheses.",
                    "sid": 93,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The latter was used as a gold standard from manual annotations, which reflects the proportion of correct labels in the N- best parsing hypotheses.",
                    "sid": 94,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also assessed the impact of ASR N-best information on probabilistic inference.",
                    "sid": 95,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To this end, we compared Bayes nets with a focus on the random variable “* nbest”, which in one case contains induced distributions from data and in the other case contains an equal distribution of slot values.",
                    "sid": 96,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our hypothesis is that the former setting will lead to better performance.",
                    "sid": 97,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 shows the classification accuracy of our dialogue act recognisers.",
                    "sid": 98,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first point to notice is that the incorporation of ASR N-best information makes an important difference.",
                    "sid": 99,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The performance of recogniser IncK (K being the number of system dialogue acts) is 66.9% without ASR N-best information and 73.9% with ASR N- best information (the difference is significant8 at 6www.cs.waikato.ac.nz/ml/weka/ 7www.cs.cmu.edu/˜javabayes/Home/ 8Based on a two-sided Wilcoxon Signed-Rank test.",
                    "sid": 100,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "90 85 80 75 70 65 60 55 50 45 40 Semi−Random Inc0 Inc1 Inc2 Inc3 IncK Ceiling D i a l o g u e A c t R e c o g n i s e r Figure 3: Bayesian dialogue act recognisers showing the impact of ASR N-best information.",
                    "sid": 101,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "p < 0.05).",
                    "sid": 102,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The latter represents a substantial improvement over the semi-random baseline (62.9%) and Lets Go dialogue act recognizer (69%), both significant at p < 0.05.",
                    "sid": 103,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A second point to notice isthat the differences between Inci (∀ i>0) recognis ers were not significant.",
                    "sid": 104,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We can say that the use of one system dialogue act as context is as competitive as using a larger set of system dialogue acts.",
                    "sid": 105,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This suggests that dialogue act recognition carried out at early stages (e.g. after the first dialogue act) in an utterance does not degrade recognition performance.",
                    "sid": 106,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The effect is possibly domain-specific and generalisations remain to be investigated.",
                    "sid": 107,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Generally, we were able to observe that more than half of the errors made by the Bayesian classifiers were due to noise in the environment and caused by the users themselves, which interfered with ASR results.",
                    "sid": 108,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Detecting when users do not convey dialogue acts to the system is therefore still a standing challenge for dialogue act recognition.",
                    "sid": 109,
                    "ssid": 48,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion and future work. ",
            "number": "5",
            "sents": [
                {
                    "text": "We have described a re-ranking approach for user dialogue act recognition.",
                    "sid": 110,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Multiple Bayesian classifiers are used to rank dialogue acts from a set of dialogue history features and ASR N-best information.",
                    "sid": 111,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Applying our approach to the Let’s Go data we found the following: (1) that including ASR N-best information results in improved dialogue act recognition performance; and (2) that competitive results can be obtained from as early as the first system dialogue act, reducing the need to include subsequent ones.",
                    "sid": 112,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Future work includes: (a) a comparison of our Bayesian classifiers with other probabilistic models and forms of training (for example by using semi-supervised learning), (b) training dialogue act recognisers in different (multi-modal and multi-task) domains, and (c) dealing with random variables that contain very large domain values.",
                    "sid": 113,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements. ",
            "number": "6",
            "sents": [
                {
                    "text": "This research was funded by the EC FP7 pro- gramme under grant agreement no. 287615 (PARLANCE) and no. 270019 (SPACEBOOK).",
                    "sid": 114,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sample Re-Ranked User Inputs User input: “forty six d” N-Best List of Dialogue Acts Let’s Go Score Bayesian Score inform(route=46a) 3.33E4 1.9236763E6 inform(route=46b) 1.0E6 1.5243509E16 inform(route=46d) 0.096107 7.030841E4 inform(route=46k) 0.843685 4.9941495E10 silence() NA 0 User input: “um jefferson hills to mckeesport” N-Best List of Dialogue Acts Let’s Go Score Bayesian Score inform(from=mill street) 7.8E4 3.5998527E16 inform(from=mission street) 0.015577 3.5998527E16 inform(from=osceola street) 0.0037 3.5998527E16 inform(from=robinson township) 0.007292 3.5998527E16 inform(from=sheraden station) 0.001815 3.1346254E8 inform(from=brushton) 2.45E4 3.5998527E16 inform(from=jefferson) 0.128727 0.0054255757 inform(from=mckeesport) 0.31030 2.6209198E4 silence() NA 0",
                    "sid": 115,
                    "ssid": 2,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}