{
    "ID": "W13-2211",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper describes TU¨ B˙ITAK-B˙ILGEM statistical machine translation (SMT) systems submitted to the Eighth Workshop on Statistical Machine Translation (WMT) shared translation task for GermanEnglish language pair in both directions.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We implement phrase-based SMT systems with standard parameters.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We present the results of using a big tuning data and the effect of averaging tuning weights of different seeds.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, we performed a linguistically motivated compound splitting in the German- to-English SMT system.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "TU¨ B˙ITAK-B˙ILGEM participated for the first time in the WMT’13 shared translation task for the GermanEnglish language pairs in both directions.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We implemented a phrase-based SMT system by using the entire available training data.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the German-to-English SMT system, we performed a linguistically motivated compound splitting.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We tested different language model (LM) combinations by using the parallel data, monolingual data, and Gigaword v4.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In each step, we tuned systems with five different tune seeds and used the average of tuning weights in the final system.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We tuned our systems on a big tuning set which is generated from the last years’ (2008, 2009, 2010, and 2012) development sets.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The rest of the paper describes the details of our systems.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "german-english. ",
            "number": "2",
            "sents": [
                {
                    "text": "2.1 Baseline.",
                    "sid": 12,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All available data was tokenized, truecased, and the maximum number of tokens were fixed to 70 for the translation model.",
                    "sid": 13,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Moses open SMT toolkit (Koehn et al., 2007) was used with MGIZA++ (Gao and Vogel, 2008) with the standard alignment heuristic grow-diag-final (Och and Ney, 2003) for word alignments.",
                    "sid": 14,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Good-Turing smoothing was used for phrase extraction.",
                    "sid": 15,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Systems were tuned on newstest2012 with MERT (Och, 2003) and tested on newstest2011.",
                    "sid": 16,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4- gram language models (LMs) were trained on the target side of the parallel text and the monolingual data by using SRILM (Stolcke, 2002) toolkit with KneserNey smoothing (Kneser and Ney, 1995) and then binarized by using KenLM toolkit (Heafield, 2011).",
                    "sid": 17,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At each step, systems were tuned with five different seeds with lattice- samples.",
                    "sid": 18,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Minimum Bayes risk decoding (Kumar and Byrne, 2004) and -drop-unknown parameters were used during the decoding.",
                    "sid": 19,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This configuration is common for all of the experiments decribed in this paper unless stated otherwise.",
                    "sid": 20,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1 shows the number of sentences used in system training after the clean-corpus process.",
                    "sid": 21,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Data Number of sentences Europarl 1908574 News-Commentary 177712 Commoncrawl 726458 Table 1: Parallel Corpus.",
                    "sid": 22,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We trained two baseline systems in order to assess the effects of this year’s new parallel data, commoncrawl.",
                    "sid": 23,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first trained an SMT system by using only the training data from the previous WMT shared translation tasks that is europarl and news-commentary (Baseline1).",
                    "sid": 24,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the second baseline, we also included the new parallel data commoncrawl only in the translation model (Base- line2).",
                    "sid": 25,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we included commoncrawl corpus both to the translation model and the language model (Baseline3).",
                    "sid": 26,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2 compares the baseline results.",
                    "sid": 27,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For all 109 Proceedings of the Eighth Workshop on Statistical Machine Translation, pages 109–113, Sofia, Bulgaria, August 89, 2013 Qc 2013 Association for Computational Linguistics experiments throughout the paper, we present the minimum and the maximum BLEU scores obtained after five different tunes.",
                    "sid": 28,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As seen in the table, the addition of the commoncrawl corpus re- sultedin a 1.1 BLEU (Papineni et al., 2002) points improvement (on average) on the test set.",
                    "sid": 29,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although Baseline2 is slightly better than Baseline3, we used Baseline3 and kept commoncrawl corpus in LMs for further experiments.",
                    "sid": 30,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "System newstest12 newstest11 Baseline1 20.58|20.74 19.14|19.29 Baseline2 21.37|21.58 20.16|20.46 Baseline3 21.28|21.58 20.22|20.49 Table 2: Baseline Results.",
                    "sid": 31,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Bayesian Alignment.",
                    "sid": 32,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the original IBM models (Brown et al., 1993), word translation probabilities are treated as model parameters and the expectation-maximization (EM) algorithm is used to obtain the maximum- likelihood estimates of the parameters and the resulting distributions on alignments.",
                    "sid": 33,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, EM provides a point-estimate, not a distribution, for the parameters.",
                    "sid": 34,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Bayesian alignment on the other hand takes into account all values of the model parameters by treating them as multinomial-distributed random variables with Dirichlet priors and integrating over all possible values.",
                    "sid": 35,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A Bayesian approach to word alignment inference in IBM Models is shown to result in significantly less “garbage collection” and a much more compact alignment dictionary.",
                    "sid": 36,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, the Bayesian word alignment has better translation performances and obtains significant BLEU improvements over EM on various language pairs, data sizes, and experimental settings (Mermer et al., 2013).",
                    "sid": 37,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We compared the translation performance of word alignments obtained via Bayesian inference to those obtained via EM algorithm.",
                    "sid": 38,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used a a Gibbs sampler for fully Bayesian inference in HMM alignment model, integrating over all possible parameter values in finding the alignment distribution by using Baseline3 word alignments for initialization.",
                    "sid": 39,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 compares the Bayesian alignment to the EM alignment.",
                    "sid": 40,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results show a slight increase in the development set newstest12 but a decrease of 0.1 BLEU points on average in the test set newstest11.",
                    "sid": 41,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "System newstest12 newstest11 Baseline3 21.28|21.58 20.22|20.49 Gibbs Sampling 21.36|21.59 19.98|20.40 Table 3: Bayesian Alignment Results.",
                    "sid": 42,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.3 Development Data in Training.",
                    "sid": 43,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Development data from the previous years (i.e. newstest08, newstest09, newstest10), though being a small set of corpus (7K sentences), is in-domain data and can positively affect the translation system.",
                    "sid": 44,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to make use of this data, we experimented two methods: i) adding the development data in the translation model as described in this section and ii) using it as a big tuning set for tuning the parameters more efficiently as explained in the next section.",
                    "sid": 45,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar to including the commoncrawl corpus, we first add the development data both to the training and language models by concatenating it to the biggest corpus europarl (DD(tm+lm)) and then we removed this corpus from the language models (DD(tm)).",
                    "sid": 46,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Results in Table 4 show that including the development data both the tranining and language model increases the performance in development set but decreases the performance in the test set.",
                    "sid": 47,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Including the data only in the translation model shows a very slight improvement in the test set.",
                    "sid": 48,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "System newstest12 newstest11 Baseline3 21.28|21.58 20.22|20.49 DD(tm+lm) 21.28|21.65 20.00|20.49 DD(tm) 21.23|21.52 20.26|20.49 Table 4: Development Sets Results.",
                    "sid": 49,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.4 Tuning with a Big Development Data.",
                    "sid": 50,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The second method of making use of the development data is to concatenate it to the tuning set.",
                    "sid": 51,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a baseline, we tuned the system with newstest12 as mentioned in Section 2.1.",
                    "sid": 52,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, we concatenated the development data of the previous years with the newstest12 and built a big tuning set.",
                    "sid": 53,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we obtained a tuning set of 10K sentences.",
                    "sid": 54,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We excluded the newstest11 as an internal test set to see the relative improvements of different systems.",
                    "sid": 55,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 5 shows the results of using a big tuning set.",
                    "sid": 56,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Tuning the system with a big tuning set resulted in a 0.13 BLEU points improvement.",
                    "sid": 57,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "System newstest12 newstest11 newstest12 21.28|21.58 20.22|20.49 Big Tune 20.93|21.19 20.32|20.58 Table 5: Tuning Results.",
                    "sid": 58,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.5 Effects of Different Language Models.",
                    "sid": 59,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this set of experiments, we tested the effects of different combinations of parallel and monolingual data as language models.",
                    "sid": 60,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As the baseline, we trained three LMs, one from each parallel corpus as europarl, news-commentary, and commoncrawl and one LM from the monolingual data news- shuffled (Baseline3).",
                    "sid": 61,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We then trained two LMs, one from the whole parallel data and one from the monolingual data (2LMs).",
                    "sid": 62,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 6 shows that using whole parallel corpora as one LM performs better than individual corpus LMs and results in 0.1 BLEU points improvement on the baseline.",
                    "sid": 63,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fi-.",
                    "sid": 64,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "nally, we trained Gigaword v4 (LDC2009T13) as a third LM (3LMs) which gives a 0.16 BLEU points improvement over the 2LMs.",
                    "sid": 65,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sy ste m newstest12 newstest11 Ba sel in e3 21.28|21.58 20.22|20.49 2L M s 21.46|21.70 20.28|20.57 3L M s 21.78|21.93 20.54|20.68 Table 6: Language Model Results.",
                    "sid": 66,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.6 German Preprocessing.",
                    "sid": 67,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In German, compounding is very common.",
                    "sid": 68,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From the machine translation point of view, compounds increase the vocabulary size with high number of the singletons in the training data and hence decrease the word alignment quality.",
                    "sid": 69,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, high number of out-of-vocabulary (OOV) words in tuning and test sets results in several German words left as untranslated.",
                    "sid": 70,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A well-known solution to this problem is compound splitting.",
                    "sid": 71,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similarly, having different word forms for a source side lemma for the same target lemma causes the lexical redundancy in translation.",
                    "sid": 72,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This redundancy results in unnecessary large phrase translation tables that overload the decoder, as a separate phrase translation entry has to be kept for each word form.",
                    "sid": 73,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, German definite determiner could be marked in sixteen different ways according to the possible combinations of genders, case and number, which are fused in six different tokens (e.g., der, das, die, den, dem, des).",
                    "sid": 74,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Except for the plural and genitive cases, all these forms are translated to the same English word “the”.",
                    "sid": 75,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the German preprocessing, we aimed both normalizing lexical redundancy and splitting German compounds with corpus driven splitting algorithm based on Koehn and Knight (2003).",
                    "sid": 76,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used the same compound splitting and lexical redundancy normalization methods described in Allauzen et al.",
                    "sid": 77,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010) and Durgar ElKahlout and Yvon (2010) with minor in-house changes.",
                    "sid": 78,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used only “addition” (e.g., -s, -n, -en, -e, -es) and “truncation” (e.g., -e, -en, -n) affixes for compound splitting.",
                    "sid": 79,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We selected minimum candidate length to 8 and minimum split length to 4.",
                    "sid": 80,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By using the Treetagger (Schmid, 1994) output, we included linguistic information in compound splitting such as not splitting named entities and foreign words (CS1).",
                    "sid": 81,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also experimented adding # as a delimiter for the splitted words except the last word (e.g., Finanzkrisen is splitted as finanz# krisen) (CS2).",
                    "sid": 82,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On top of the compound splitting, we applied the lexical redundancy normalization (CS+Norm1).",
                    "sid": 83,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We lemmatized German articles, adjectives (only positive form), for some pronouns and for nouns in order to remove the lexical redundancy (e.g., Bildes as Bild) by using the fine- grained part-of-speech tags generated by RFTagger (Schmid and Laws, 2008).",
                    "sid": 84,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar to CS2, We tested the delimited version of normalized words (CS+Norm2).",
                    "sid": 85,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 7 shows the results of compound splitting and normalization methods.",
                    "sid": 86,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a result, normalization on top of compounding did not perform well.",
                    "sid": 87,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Besides, experiments showed that compound word decomposition is crucial and helps vastly to improve translation results 0.43 BLEU points on average over the best system described in Section 2.5.",
                    "sid": 88,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sy ste m newstest12 newstest11 3L M s 21.78|21.93 20.54|20.68 C S1 22.01|22.21 20.63|20.89 C S2 22.06|22.22 20.74|20.99 C S+ N or m 2 21.96|22.16 20.70|20.88 C S+ N or m 1 20.63|20.76 22.01|22.16 Table 7: Compound Splitting Results.",
                    "sid": 89,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.7 Average of Weights.",
                    "sid": 90,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As mentioned in Section 2.1, we performed tuning with five different seeds.",
                    "sid": 91,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We averaged the five tuning weights and directly applied these weights during the decoding.",
                    "sid": 92,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 8 shows that using the average of several tuning weights performs better than each individual tuning (0.2 BLEU points).",
                    "sid": 93,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, averaging the tuning weights of different seeds results in 0.2 BLEU points improvement.",
                    "sid": 94,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "System newstest12 newstest11 CS2 22.06|22.22 20.74|20.99 Avg.",
                    "sid": 95,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "of Weights 22.27 21.07 Table 8: Average of Weights Results.",
                    "sid": 96,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.8 Other parameters.",
                    "sid": 97,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the experiments described in the earlier sections, we removed the -drop-unknown parameter which gave us a 0.5 BLEU points improvement.",
                    "sid": 98,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also included the monotone-at- punctuation, -mp in decoding.",
                    "sid": 99,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We handled out- of-vocabulary (OOV) words by lemmatizing the OOV words.",
                    "sid": 100,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, we added all development data in training after fixing the parameter weights as described in Section 2.7.",
                    "sid": 101,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Although each of these changes increases the translation scores each gave less than 0.1 BLEU point improvement.",
                    "sid": 102,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 9 shows the results of the final system after including all of the approaches except the ones described in Section 2.2 and 2.3.",
                    "sid": 103,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sy ste m newstest12 newstest11 Fi na l Sy ste m 22.59|22.77 21.86|21.93 Av g. of W ei gh ts 22.66 22.00 + tu ne da ta in tra in −− 22.09 Table 9: German-to-English Final System Results.",
                    "sid": 104,
                    "ssid": 93,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "english-german. ",
            "number": "3",
            "sents": [
                {
                    "text": "For English-to-German translation system, the baseline setting is the same as described in Section 2.1.",
                    "sid": 105,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also added the items that showed positive improvement in the German to English SMT system such as using 2 LMs, tuning with five seeds and averaging tuning parameters, using -mp, and not using -drop-unknown.",
                    "sid": 106,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 10 shows the experimental results for English-to-German SMT systems.",
                    "sid": 107,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Similar to the German-to-English direction, tuning with a big development data outperforms the baseline 0.26 BLEU points (on average).",
                    "sid": 108,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 10: English to German Final System Results.",
                    "sid": 109,
                    "ssid": 5,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "final system and results. ",
            "number": "4",
            "sents": [
                {
                    "text": "Table 11 shows our official submission scores for GermanEnglish SMT systems submitted to the WMT’13.",
                    "sid": 110,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "System newstest13 DeEn 25.60 EnDe 19.28 Table 11: GermanEnglish Official Test Submission.",
                    "sid": 111,
                    "ssid": 2,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion. ",
            "number": "5",
            "sents": [
                {
                    "text": "In this paper, we described our submissions to WMT’13 Shared Translation Task for GermanEnglish language pairs.",
                    "sid": 112,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used phrase-based systems with a big tuning set which is a combination of the development sets from last four years.",
                    "sid": 113,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We tuned the systems on this big tuning set with five different tunes.",
                    "sid": 114,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We averaged these five tuning weights in the final system.",
                    "sid": 115,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We trained 4-gram language models one from parallel data and one from monolingual data.",
                    "sid": 116,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, we trained a 4-gram language model with Gigaword v4 for German-to-English direction.",
                    "sid": 117,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For German- to-English, we performed a different compound splitting method instead of the Moses splitter.",
                    "sid": 118,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We obtained a 1.7 BLEU point increase for German- to-English SMT system and a 0.5 BLEU point increase for English-to-German SMT system for the internal test set newstest2011.",
                    "sid": 119,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, we submitted our German-to-English SMT system with a BLEU score 25.6 and English-to-German SMT system with a BLEU score 19.3 for the official test set newstest2013.",
                    "sid": 120,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}