{
    "ID": "W13-2708",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "We develop a pipeline consisting of various text processing tools which is designed to assist political scientists in finding specific, complex concepts within large amounts of text.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our main focus is the interaction between the political scientists and the natural language processing groups to ensure a beneficial assistance for the political scientists and new application challenges for NLP.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is of particular importance to find a “common language” between the different disciplines.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we use an interactive web-interface which is easily usable by non-experts.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It interfaces an active learning algorithm which is complemented by the NLP pipeline to provide a rich feature selection.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Political scientists are thus enabled to use their own intuitions to find custom concepts.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "In this paper, we give examples of how NLP methods and tools can be used to provide support for complex tasks in political sciences.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many concepts of political science are complex and faceted; they tend to come in different linguistic realizations, often in complex ones; many concepts are not directly identifiable by means of (a small set of) individual lexical items, but require some interpretation.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many researchers in political sciences either work qualitatively on small amounts of data which precise results due to a rather unspecific search as well as semantically invalid or ambigious search words.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, large amounts of e.g. news texts are available, also over longer periods of time, such that e.g. tendencies over time can be derived.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The corpora we are currently working on contain ca.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "700,000 articles from British, Irish, German and Austrian newspapers, as well as (yet unexplored) material in French.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 1 depicts a simple example of a quantitative analysis.1 The example shows how often two terms, Friedensmission(‘peace operation’), and Auslandseinsatz(‘foreign intervention’) are used in the last two decades in newspaper texts about interventions and wars.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The long-term goal of the project is to provide similar analysis for complex concepts.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of a complex concept is the evocation of collective identities in political contexts, as indirect in the news.",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples for such collective identities are: the Europeans, the French, the Catholics.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The objective of the work we are going to discuss in this paper is to provide NLP methods and tools for assisting political scientists in the exploration of large data sets, with a view to both, a detailed qualitative analysis of text instances, and a quantitative overview of trends over time, at the level of corpora.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The examples discussed here have to do with (possibly multiple) collective identities.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Typical context of such identities tend to report communication, as direct or as indirect speech.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples of such contexts are given in 1.they interpret instance-wise, or, if they are in (1) Die Europa¨er wu¨ rden die Lu¨ cke fu¨ llen, terested in quantitative trends, they use comparatively simple tools, such as keyword-based search The Europeans would the gap fill, in corpora or text classification on the basis of terms only; this latter approach may lead to im 1 The figure shows a screenshot of our web-based prototype.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "55 Proceedings of the 7th Workshop on Language Technology for Cultural Heritage, Social Sciences, and Humanities, pages 55–64, Sofia, Bulgaria, August 8 2013.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Qc 2013 Association for Computational Linguistics Figure 1: The screenshot of our web-based system shows a simple quantitative analysis of the frequency of two terms in news articles over time.",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While in the 90s the term Friedensmission (peace operation) was predominant a reverse tendency can be observed since 2001 with Auslandseinsatz (foreign intervention) being now frequently used.",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "sagte Ru¨ he.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "lated to the infrastructural standards in use in the said Ru¨ he.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CLARIN communit y. In section 4, we exemplify ,,The Europeans would fill the gap, Ru¨ he said.” The tool support is meant to be semiautomatic, as the automatic tools propose candidates that need to be validated or refused by the political scientists.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We combine a chain of corpus processing tools with classifier-based tools, e.g. for topic classifiers, commentary/report classifiers, etc., make the tools interoperable to ensure flexible data exchange and multiple usage scenarios, and we embed the tool collection under a web (service) - based user interface.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remainder of this paper is structured as follows.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In section 2, we present an outline of the architecture of our tool collection, and we motivate the architecture.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 presents examples of implemented modules, both from corpus processing and search and retrieval of instances of complex concepts.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also show how our tools are re the intended use of the methods with case studies about steps necessary for identifying evocation: being able to separate reports from comments, and strategies for identifying indirect speech.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 6 is devoted to a conclusion and to the discussion of future work.",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "project goals. ",
            "number": "2",
            "sents": [
                {
                    "text": "A collaboration between political scientists and computational linguists necessarily involves finding a common language in order to agree on the precise objectives of a project.",
                    "sid": 33,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, social scientists use the term codebook for manual annotations of text, similar to annotation schemes or guidelines in NLP.",
                    "sid": 34,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Both disciplines share methodologies of interactive text analysis which combine term based search, manual annotation and learning-based annotation of large amounts of data.",
                    "sid": 35,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this section, we give a brief summary of the goals from the perspective of each of the two disciplines, and then describe the text corpus that is used in the project.",
                    "sid": 36,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 3 will describe our approach to devising a system architecture that serves to realize the goals.",
                    "sid": 37,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Social Science Research Issue.",
                    "sid": 38,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Given the complexity of the underlying research issues (cf.",
                    "sid": 39,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 1) and the methodological tradition of manual text coding by very well-trained annotators in the social science and particular in political science, our project does not aim at any fully-automatic solution for empirical issues in political science.",
                    "sid": 40,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead, the goal is to provide as much assistance to the human text analyst as possible, by means of a workbench that integrates many tasks that otherwise would have to be carried out with different software tools (e.g., corpus preprocessing, KWIC searches, statistics).",
                    "sid": 41,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our project, the human analyst is concerned specifically with manifestations of collective identities in newspaper texts on issues of war and military interventions: who are the actors in political crisis management or conflict?",
                    "sid": 42,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "How is this perspective of responsible actors characterized in different newspapers (with different political orientation; in different countries)?",
                    "sid": 43,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The analyst wants to find documents that contain facets of such constellations, which requires search techniques involving concepts on different levels of abstraction, ranging from specific words or named entities (which may appear with different names in different texts) to event types (which may be realized with different verb-argument configurations).",
                    "sid": 44,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus the text corpus should be enriched with information relevant to such queries, and the workbench shall provide a comfortable interface for building such queries.",
                    "sid": 45,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, various types and (possibly concurrent) layers of human annotations have to complement the automatic analysis, and the manual annotation would benefit from automatic control of code- book2 compliance and the convergence of coding decisions.",
                    "sid": 46,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Natural Language Processing Research.",
                    "sid": 47,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Issue Large collections of text provide an excellent opportunity for computational linguists to scale their methods.",
                    "sid": 48,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the scenario of a project like ours, this automatic analysis components have to be combined with manual annotation or interactive intervention of the human analyst.",
                    "sid": 49,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to this principled challenge, there may be more mundane issues resulting from processing corpora whose origin stretches over many years.",
                    "sid": 50,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our case, the data collection phase coincided with a spelling reform in German-speaking countries.",
                    "sid": 51,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Many aspects of spelling changed twice (in 1996 and in 2006), and thus it is the responsibility of the NLP branch of the project to provide an abstraction over such changes and to enable today’s users to run a homogeneous search over the texts using only the current spelling.",
                    "sid": 52,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While this might be less important for generic web search applications, it is of great importance for our project, where the overall objective is a combination of quantitative and qualitative text analysis.",
                    "sid": 53,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our processing chain, we first need to harmonize the data formats so that the processing tools operate on a common format.",
                    "sid": 54,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Rather than defining these from scratch, we aim at compatibility with the standardization efforts of CLARIN3 and DARIAH4, two large language technology infrastructure projects in Europe that in particular target eHumanities applications.",
                    "sid": 55,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the objectives is to provide advanced tools to discover, explore, exploit, annotate, analyse or combine textual resources.",
                    "sid": 56,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the next section we give more details about how we interact which the CLARIN-D infrastructure (Boehlke et al., 2013).",
                    "sid": 57,
                    "ssid": 25,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "architecture. ",
            "number": "3",
            "sents": [
                {
                    "text": "The main goal is to provide a web-based user- interface to the social scientist to avoid any software installation.",
                    "sid": 58,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2 presents the workflow of the different processing steps in this project.",
                    "sid": 59,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first part considers format issues that occur if documents from different sources are used.",
                    "sid": 60,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The main challenge is to recognize metadata correctly.",
                    "sid": 61,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Date and source name are two types of metadata which are required for analyses in the social sciences.",
                    "sid": 62,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But also the separation of document content (text) and metadata is important to ensure that only real content is processed with the NLP methods.",
                    "sid": 63,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are stored in a repository which uses a relational database as a back-end.",
                    "sid": 64,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All further modules are used to add more annotations to the textual data.",
                    "sid": 65,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First a complex linguistic pro becomes especially challenging, because standard 3 http://www.clarin.eu/ 2 or, in NLP terms: annotation scheme.",
                    "sid": 66,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4 http://www.dariah.eu/ cessing chain is used to provide state-of-the-art corpus linguistic annotations (see Section 3.2 for details).",
                    "sid": 67,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then, to ensure that statistics over occurrence counts of words, word combinations and constructions are valid and not blurred by the multiple presence of texts or text passages in the corpus, we filter duplicates.",
                    "sid": 68,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Duplicates can occur if our document set contains the same document twice or if two documents are very similar, e.g. they differ in only one sentence.",
                    "sid": 69,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Raw documents Import Exploration Workbench Duplicate filter sentation.",
                    "sid": 70,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The conversion tools account for different file encodings and convert input files to Unicode (UTF8).",
                    "sid": 71,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We currently work on newspaper articles wrapped with metadata.",
                    "sid": 72,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Text mining components read out those metadata and identify text content in the documents.",
                    "sid": 73,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Metadata appear at varying positions and in diverse notations, e.g. for dates, indications of authors or newspaper sections.",
                    "sid": 74,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The components account for these variations and convert them to a consistent machine readable format.",
                    "sid": 75,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extracted metadata are appended to the XML representation.",
                    "sid": 76,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting XML is the starting point for further computational linguistic processing of the source documents.",
                    "sid": 77,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The workbench contains a tool to identify text duplicates and semi-duplicates via similarity measures of pairs of articles (Kantner et al., 2011).",
                    "sid": 78,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Repository: Metadata Structural data Textual data Linguistic analysis Sentence splitter Tokenizer Tagger Parser Coref NER Complex Concept Builder Topic filter Concept detectionWeb based Userinterface The method is based on a comparison of 5 grams, weighted by significance (tfidf measure (Salton and Buckley, 1988)).",
                    "sid": 79,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a pair of documents it yields a value on a “similarity scale” ranging from 0 to 1.",
                    "sid": 80,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Values at medium range (0.4 to 0.8) are considered semi duplicates.",
                    "sid": 81,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Data cleaning is important for the data-driven studies.",
                    "sid": 82,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Not only duplicate articles have a negative impact, also articles which are not of interest for the given topic have to be filtered out.",
                    "sid": 83,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There Figure 2: Overview of the complete processing chain.",
                    "sid": 84,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We split the workflow for the user into two parts: The first part is only used if the user imports new data into the repository.",
                    "sid": 85,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For that he can use the exploration workbench (Section 3.1).",
                    "sid": 86,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Secondly, all steps for analyzing the data are done with the Complex Concept Builder (Section 3.2).",
                    "sid": 87,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.1 Exploration Workbench.",
                    "sid": 88,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Formal corpus inhomogeneity (e.g. various data formats and inconsistent data structures) are a major issue for researchers working on text corpora.",
                    "sid": 89,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The web-based “Exploration Workbench” allows for the creation of a consistent corpus from various types of data and prepares data for further processing with computational linguistic tools.",
                    "sid": 90,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The workbench can interact with to existing computational linguistic infrastructure (e.g. CLARIN) and provides input for the repository also used by the Complex Concept Builder.",
                    "sid": 91,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The workbench converts several input formats(TXT, RTF, HTML) to a consistent XML repre are different approaches to classify articles into a range of predefined topics.",
                    "sid": 92,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the last years LDA (Blei et al., 2003; Niekler and Ja¨hnichen, 2012) is one of the most successful methods to find topics in articles.",
                    "sid": 93,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But for social scientists the categories typically used in LDA are not sufficient.",
                    "sid": 94,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We follow the idea of Dualist (Settles, 2011; Settles and Zhu, 2012) which is an interactive method for classification.",
                    "sid": 95,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The architecture of Dualist is based on MALLET (McCallum, 2002) which is easily integrable into our architecture.",
                    "sid": 96,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our goal is to design the correct feature to find relevant articles for a given topic.",
                    "sid": 97,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word features are not sufficient since we have to model more complex features (cf.",
                    "sid": 98,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2.1).",
                    "sid": 99,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The workbench is not exclusively geared to the data of the current project.",
                    "sid": 100,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We chose a modular setup of the tools of the workbench and provide user-modifiable templates for the extraction of various kinds of metadata, in order to keep the workbench adaptable to new data and to develop tools suitable for data beyond the scope of the current corpus.",
                    "sid": 101,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A central problem for political scientists who intend to work on large corpora is the linguistic variety in the expression of technical terms and complex concepts.",
                    "sid": 102,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An editorial or a politician cited in a news item can mobilize a collective identity which can be construed from e.g. regional or social affiliation, nationality or religion.",
                    "sid": 103,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A reasonable goal in the context of the search for collective identity evocation contexts is therefore to find all texts which (possibly) contain collective identities.",
                    "sid": 104,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, while we are training our interactive tools on a corpus on wars and military interventions the same collective identities might be expressed in different ways in a corpus i.e. on the Eurocrisis.",
                    "sid": 105,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "From a computational point of view, many different tools need to be joined to detect interesting texts.",
                    "sid": 106,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example application could be a case where a political scientist intends to extract newspaper articles that cite a politician who tries to rally support for his political party.",
                    "sid": 107,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to detect such text, we need a system to identify direct and indirect speech and a sentiment system to determine the orientation of the statement.",
                    "sid": 108,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These systems in turn need various kinds of preprocessing starting from tokenization over syntactic parsing up to coreference resolution.",
                    "sid": 109,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Complex Concept Builder is the collection of all these systems with the goal to assist the political scientists.",
                    "sid": 110,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "So far, the Complex Concept Builder implements tokenization (Schmid, 2009), lemmatisation (Schmid, 1995), part-of-speech tagging (Schmid and Laws, 2008), named entity detection (Faruqui and Pado´ , 2010), syntactical parsing (Bohnet, 2010), coreference analysis for German (Lappin and Leass, 1994; Stuckardt, 2001), relation extraction (Blessing et al., 2012) and sentiment analysis for English (Taboada et al., 2011).",
                    "sid": 111,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is important for a researcher of the humanities to be able to adapt existing classification systems according to his own needs.",
                    "sid": 112,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A common procedure in both, NLP and political sciences, is to annotate data.",
                    "sid": 113,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, one major goal of the project and the Complex Concept Builder is to provide machine learning systems with a wide range of possible features — including high level information like sentiment, text type, relations to other texts, etc. — that can be used by non-experts for semiautomatic annotation and text selection.",
                    "sid": 114,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Active learning is used to provide immediate results that of the Complex Concept Builder is especially important because new or adapted concepts that may be looked for can be found without further help of natural language processing experts.",
                    "sid": 115,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3.3 Implementation.",
                    "sid": 116,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We decided to use a web-based platform for our system since the social scientist needs no software installation and we are independent of the used operating system.",
                    "sid": 117,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Only a state-of-the-art web- browser is needed.",
                    "sid": 118,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the server side, we use a tomcat installation that interacts with our UIMA pipeline (Ferrucci and Lally, 2004).",
                    "sid": 119,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A HTML- rendering component designed in the project (and parametrizable) allows for a flexible presentation of the data.",
                    "sid": 120,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A major issue of our work is interaction.",
                    "sid": 121,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To solve this, we use JQuery and AJAX to dynamically interact between client- and server- side.",
                    "sid": 122,
                    "ssid": 65,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "case study. ",
            "number": "4",
            "sents": [
                {
                    "text": "In this section we explore the interaction between various subsystems and how they collaborate to find complex political concepts.",
                    "sid": 123,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following Section 4.1 describes the detection of direct and indirect speech and its evaluation follows in Section 4.2.",
                    "sid": 124,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4.3 is a general exploration of a few selected subsystems which require, or benefit from direct and indirect speech.",
                    "sid": 125,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, Section 4.4 discusses a specific usage scenario for indirect speech.",
                    "sid": 126,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 Identifying Indirect Speech.",
                    "sid": 127,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Complex Concept Builder provides analyses on different linguistic levels (currently morphosyntax, dependency syntax, named entities) of annotation.",
                    "sid": 128,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We exploit this knowledge to identify indirect speech along with a mentioned speaker.",
                    "sid": 129,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our indirect speech recognizer is based on three conditions: i) Consider all sentences that contain at least one word which is tagged as subjunctive (i.e. “*.SUBJ”) by the RFTagger.",
                    "sid": 130,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ii) This verb has to be a direct successor of another verb in the dependency tree.",
                    "sid": 131,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "iii) This verb needs to have a subject.",
                    "sid": 132,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 3 depicts the dependency parse tree of sentence 2.",
                    "sid": 133,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) Der Einsatz werde wegen der Risiken fu¨ r die unbewaffneten Beobachter ausgesetzt, teilte RFTags VFIN.Full.3.Sg.Past.Ind teilte informed OC SB speaker and the used verb of speech.",
                    "sid": 134,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We manually evaluated 200 extracted triples (sentence, speaker, verb of speech): The precision of our system is: 92.5% VFIN.Aux.3.Sg.Pres.Subj werde will be ausgesetzt stopped Missionschef head of mission Mood Mood am on Samstag Saturday mit . . Examples 2, 3 and 4 present good candidates which are helpful for further investigations on collective identities.",
                    "sid": 135,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In example 3 Cardinal Lehmann is a representative speaker of the Catholic community which is a collective identity.",
                    "sid": 136,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our extracted sentences accelerate the search for such candidates which amounts to looking manually for needles in Einsatz mission wegen , because of , Robert Robert a haystack.",
                    "sid": 137,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "example speaker verb of speech Der the R i s i k o r i s k s Figure 3: Dependency parse of a sentence that contains indirect speech (see Sentence 2).",
                    "sid": 138,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Missionschef Robert Mood am Samstag mit.",
                    "sid": 139,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The mission will be stopped because of the risks to the unarmed observers, informed Head of Mission Robert Mood on Saturday.",
                    "sid": 140,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The speaker of the indirect speech in Sentence 2 is correctly identified as Missionschef (Head of Mission) and the corresponding verb is teilte mit (from mitteilen) (to inform).",
                    "sid": 141,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The parsing-based analysis helps to identify the speaker of the citation which is a necessary information for the later interpretation of the citation.",
                    "sid": 142,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a further advantage, such an approach helps to minimize the need of lexical knowledge for the identification of indirect speech.",
                    "sid": 143,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our error analysis below will show that in some cases a lexicon can help to avoid false positives.",
                    "sid": 144,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A lexicon of verbs of communication can easily be boot- strapped by using our approach to identify candidates for the list of verbs which then restrict the classifier in order to achieve a higher precision.",
                    "sid": 145,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Indirect Speech Evaluation.",
                    "sid": 146,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For a first impression, we present a list of sentences which were automatically annotated as positive instances by our indirect speech detector.",
                    "sid": 147,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sentences were rated by political scientists.",
                    "sid": 148,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples 5 and 6 show problems of our first approach.",
                    "sid": 149,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this case, the speaker is not a person or an organisation, and the verb is not a verb of speech.",
                    "sid": 150,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(3) Ein Angriffskrieg jeder Art sei ” sit- tlich verwerflich ”, sagte der Vorsitzende der Bischoffskonferenz, Kardinal Karl Lehmann.",
                    "sid": 151,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Any kind of war of aggression is ”morally reprehensible,” said the chairman of the Bishops’ Conference, Cardinal Karl Lehmann.",
                    "sid": 152,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(4) Derartige Erkla¨rungen eines Staatschefs seien im Rahmen der internationalen Beziehungen inakzeptabel, sagte der UNGeneraldirektor Sergej Ordzhonikidse gestern in Genf.",
                    "sid": 153,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such statements of heads of states are unacceptable in the context of international relations, said UN General Director Sergei Ordzhonikidse in Geneva yesterday.",
                    "sid": 154,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(5) Wu¨ rden die Wahlen verschoben, tru¨ bte sich das gescho¨ nte Bild.",
                    "sid": 155,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Would the elections be postponed, the embellished image would tarnish.",
                    "sid": 156,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(6) Dies sei alles andere als einfach, ist aus Of- fizierskreisen zu ho¨ ren.",
                    "sid": 157,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is anything but simple, is to hear from military circles.",
                    "sid": 158,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "erzählen (tell) betonen (emphasize) werden (will) haben (have) schreiben (write) mitteilen (share) berichten (report) meinen (state) erklären (explain) sagen (say) most used speech verbs identities are mobilised by entities of political debate (i.e. persons, organisations, etc.); the detection of indirect speech is mandatory for any such analysis.",
                    "sid": 159,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.4 Comm entary/ Report Classif ication A useful distinction for political scientists dealing with newspaper articles is the distinction between articles that report objectively on events or back 0.00% 5.00% 10.00% 15.00% 20.00% 25.00% 30.00% 35.00% 40.00% grounds and editorials or press commentaries.",
                    "sid": 160,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first extracted opinionated and objective texts from DeReKo corpus (Stede, 2004; Kupietz Figure 4: 10 most used verbs (lemma) in indirect speech.",
                    "sid": 161,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Using Indirect Speech.",
                    "sid": 162,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Other modules benefit from the identification of indirect speech, as can be seen from Sentence 7.",
                    "sid": 163,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sentiment system assigns a negative polarity of −2.15 to the sentence.",
                    "sid": 164,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The nested sentiment sources, as described by (Wiebe et al., 2005), of this sentence require a) a direct speech with the speaker “Mazower” and b) an indirect speech with the speaker “no one” to be found.5 (7) ”There were serious arguments about what should happen to the Slavs and Poles in eastern Europe,” says Mazower, ”and how many of them should be sent to the camps and what proportion could be Germanised . . .",
                    "sid": 165,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "No one ever came out and directly said Hitler had got it wrong, but there was plenty of implied criticism through comparisons with the Roman empire.",
                    "sid": 166,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "[...]”6 A collective identity evoked in Sentence 7 is “the Germans”— although the term is not explicitly mentioned.",
                    "sid": 167,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This collective identity is de et al., 2010).",
                    "sid": 168,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some texts were removed in order to balance the corpus.",
                    "sid": 169,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The balanced corpus contains 2848 documents and has been split into a development and a training and test set.",
                    "sid": 170,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "570 documents were used for the manual creation of features.",
                    "sid": 171,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The remaining 2278 documents were used to train and evaluate classifiers using 10 fold cross-validation with the WEKA machine learning toolkit (Hall et al., 2009) and various classifiers (cf.",
                    "sid": 172,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 1).",
                    "sid": 173,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The challenge is that the newspaper articles from the training and evaluation corpus come from different newspapers and, of course, from different authors.",
                    "sid": 174,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Commentaries in the yellow press tend to have a very different style and vocabulary than commentaries from broadsheet press.",
                    "sid": 175,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, special attention needs to be paid to the independence of the classifier from different authors and different newspapers.",
                    "sid": 176,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this reason, we use handcrafted features tailored to this problem.",
                    "sid": 177,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In return, this means omitting surface-form features (i.e. words themselves).",
                    "sid": 178,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The support vector machine used the SMO algorithm (Platt and others, 1998) with a polynomial kernel K (x, y) =< x, y > e with e = 2.",
                    "sid": 179,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All other algorithms were used with default settings.",
                    "sid": 180,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "scribed as non-homogeneous in the citation and can be further explored manually by the political scientists.",
                    "sid": 181,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following are further applications of the precision recall f-score SVM 0.819 0.814 0.813 Naive Bayes 0.79 0.768 0.764 identified indirect speeches a) using the frequency of speeches per text as a feature for classification; e.g. a classification system for news re Multilayer Perceptron 0.796 0.795 0.794 ports/commentaries as described in Section 4.4 b) a project-goal is to find texts in which collective 5 The reported sentiment value for the whole sentence is applicable only to the direct speech.",
                    "sid": 182,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The indirect speech (i.e. “Hitler had got it wrong”) needs a more fine-grained polarity score.",
                    "sid": 183,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Since our Complex Concept Builder is very flexible, it is trivial to score each component separately.",
                    "sid": 184,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6 http://www.guardian.co.uk/education/2008/jul /01/academicexperts.highereducationprofile Table 1: Results of a 10-fold cross-validation for various machine learning algorithms.",
                    "sid": 185,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A qualitative evaluation shows that direct and indirect speech is a problem for the classifier.",
                    "sid": 186,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Opinions voiced via indirect speech should not lead to a classification as ‘Commentary’, but should be ignored.",
                    "sid": 187,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, the number of uses of direct and indirect speech by the author can provide insight into the intention of the author.",
                    "sid": 188,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A common way to voice one’s own opinion, without having to do so explicitly, is to use indirect speech that the author agrees with.",
                    "sid": 189,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, the number of direct and indirect speech uses will be added to the classifier.",
                    "sid": 190,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First experiments indicate that the inclusion of direct and indirect speech increase the performance of the classifier.",
                    "sid": 191,
                    "ssid": 69,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "related work. ",
            "number": "5",
            "sents": [
                {
                    "text": "Many approaches exist to assist social scientists in dealing with large scale data.",
                    "sid": 192,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We discuss some well-known ones and highlight differences to the approach described above.",
                    "sid": 193,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Europe Media Monitor (EMM) (Stein- berger et al., 2009) analyses large amounts of newspaper articles and assists anyone interested in news.",
                    "sid": 194,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It allows its users to search for specific topics and automatically clusters articles from different sources.",
                    "sid": 195,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a key concept of the EMM, because it collects about 100, 000 articles in approximately 50 languages per day and it is impossible to scan through these by hand.",
                    "sid": 196,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "EMM users are EU institutions, national institutions of the EU member states, international organisations and the public (Steinberger et al., 2009).",
                    "sid": 197,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The topic clusters provide insight into “hot” topics by simply counting the amount of articles per cluster or by measuring the amount of news on a specific topic with regards to its normal amount of news.",
                    "sid": 198,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Articles are also data-mined for geographical information, e.g. to update in which geographical region the article was written and where the topic is located.",
                    "sid": 199,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Social network information is gathered and visualised as well.",
                    "sid": 200,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Major differences between the EMM and our approach are the user group and the domain of the corpus.",
                    "sid": 201,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The complex concepts political scientists are interested in are much more nuanced than the concepts relevant for topic detection and the construction of social networks.",
                    "sid": 202,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, the EMM does not allow its users to look for their own concepts and issues, while this interactivity is a central contribution of our approach (cf.",
                    "sid": 203,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Sections 1, 2.1 and 3.2).",
                    "sid": 204,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The CLARIN-D project also provides a web- based platform to create NLP-chains.",
                    "sid": 205,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It is called WebLicht (Hinrichs et al., 2010), but in its current form, the tool is not immediately usable for social scientists as the separation of metadata and textual data and the encoding of the data is hard for non-experts.",
                    "sid": 206,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, WebLicht does not yet support the combination of manual and automatic annotation needed for text exploration in the social science.",
                    "sid": 207,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach is based on the webservices used by WebLicht.",
                    "sid": 208,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But in contrast to WebLicht, we provide two additional components that simplify the integration (exploration workbench) and the interpretation (complex concept builder) of the research data.",
                    "sid": 209,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The former is intended, in the medium term, to be made available in the CLARIN framework.",
                    "sid": 210,
                    "ssid": 19,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusion and outlook. ",
            "number": "6",
            "sents": [
                {
                    "text": "We developed and implemented a pipeline of various text processing tools which is designed to assist political scientists in finding specific, complex concepts within large amounts of text.",
                    "sid": 211,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our case studies showed that our approach can provide beneficial assistance for the research of political scientists as well as researcher from other social sciences and the humanities.",
                    "sid": 212,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A future aspect will be to find metrics to evaluate our pipeline.",
                    "sid": 213,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In recently started annotation experiments on topic classification Cohen’s kappa coefficient (Carletta, 1996) is mediocre.",
                    "sid": 214,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It may very well be possible that the complex concepts, like multiple collective identities, are intrinsically hard to detect, and the annotations cannot be improved substantially.",
                    "sid": 215,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extension of the NLP pipeline will be another major working area in the future.",
                    "sid": 216,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples are sentiment analysis for German, adding world knowledge about named entities (e.g. persons and events), identification of relations between entities.",
                    "sid": 217,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, all these systems need to be evaluated not only in terms of f-score, precision and recall, but also in terms of usability for the political scientists.",
                    "sid": 218,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This also includes a detailed investigation of various political science concepts and if they can be detected automatically or if natural language processing can help the political scientists to detect their concepts semi-automatically.",
                    "sid": 219,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The definition of such evaluation is an open research topic in itself.",
                    "sid": 220,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements",
            "number": "",
            "sents": [
                {
                    "text": "The research leading to these results has been done in the project eIdentity which is funded from the Federal Ministry of Education and Research (BMBF) under grant agreement 01UG1234.",
                    "sid": 221,
                    "ssid": 11,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}