{
    "ID": "W13-4011",
    "sections": [
        {
            "text": "objectives. ",
            "number": "1",
            "sents": [
                {
                    "text": "Conversational feedback is mostly performedthrough short utterances such as yeah, mh, okaynot produced by the main speaker but by one ofthe other participants of a conversation.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such utterances are among the most frequent in conversational data (Stolcke et al., 2000).",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They alsohave been described in psycho-linguistic modelsof communication as a crucial communicative toolfor achieving coordination or alignment in dialogue (Clark, 1996).",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The general objective of the project (ANRCoFee: Conversational Feedback)1(Pre´vot andBertrand, 2012) in which this work takes placeis to propose a fine grained model of theform/function relationship concerning feedbackbehaviors in conversation.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The present study isfirst exploration aiming at knowing better the distribution of these items in one of our corpus.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreprecisely, we would to verify how much inter-individual variability we will face in further studyand whether we can identify a structure in thisvariability (e.g speaker profiles).",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Second, we tried 1See the project website: http://cofee.hypotheses.org to check there some strong trends in terms of evolution of use of these items in the course of theconversation.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This later point was not conclusiveand is not developed in this paper.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some data-intensive works exist for English(Gravano et al., 2012), Japanese (Kamiya et al.,2010; Misu et al., 2011) or Swedish (Allwood etal., 1992; Cerrato, 2007; Neiberg et al., 2013) butnot on many other languages such as French forexample.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On French, the work of (Muller andPre´vot, 2003; Muller and Pre´vot, 2009) concerneda smaller scale (A hour corpus) and very specifictask.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Bertrand et al., 2007) was focussed on thefeedback inviting cues and also on a smaller scale(2 × 15 minutes).",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They showed that particularpitch contours and discursive markers play a systematic role as inviting-cues both for vocal andgestural back-channels.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The paper is structured as follow.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 2presents the conversational corpus used for thisstudy, then section 3 presents how this corpus hasbeen processed.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Section 4 is related to general figures for the feedback lexical items, followed bymore detailed information about inter-individualvariability (section 5).",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "the corpus. ",
            "number": "2",
            "sents": [
                {
                    "text": "The Corpus of Interactional Data (CID) (Bertrandet al., 2008; Blache et al., 2009)2 is an audio-videorecording of 8 hours of spontaneous French dialogues, 1 hour of recording per session.",
                    "sid": 16,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each dialogue involved two participants of the same gender.",
                    "sid": 17,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the following two topics of conversation was suggested to participants: conflicts intheir professional environment or unusual situations in which participants may have found themselves.",
                    "sid": 18,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It features a nearly free conversationalstyle with only a single theme proposed to the participants at the beginning of the experiment.",
                    "sid": 19,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This 2http://www.sldr.org/sldr000027/en 87 corpus is fully transcribed and forced-aligned atphone level.",
                    "sid": 20,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, it has been annotated withvarious linguistic information (Prosodic Phrasing,Discourse units, Syntactic tags, ...)",
                    "sid": 21,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Blache et al.,2010) which will allow us later to take advantageof these levels of analysis.",
                    "sid": 22,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Numerous studies have been carried out in prepared speech.",
                    "sid": 23,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, conversational speechrefers to a more informal activity, in which participants have constantly to manage and negotiateturn-taking, topic changes (among other things)without any preparation.",
                    "sid": 24,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a consequence, numerous phenomena appear such as hesitations, repeats, backchannels, etc. Phonetic phenomenasuch as nonstandard elision, reduction phenomena, truncated words, and more generally, nonstandard pronunciations are also very frequent.All these phenomena can impact on the phonetization, then on alignment.",
                    "sid": 25,
                    "ssid": 10,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "processing the corpus. ",
            "number": "3",
            "sents": [
                {
                    "text": "The transcription process is done following specific conventions derived from that of the GARS(BlancheBenveniste and Jeanjean, 1987).",
                    "sid": 26,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Theresult is what we call an enriched orthographictranscription (EOT), from which two derived transcriptions are generated automatically : the standard orthographic transcription (the list of orthographic tokens) and a specific transcription fromwhich the phonetic tokens are obtained to beused by the grapheme-phoneme converter.",
                    "sid": 27,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Fromthe phoneme sequence and the audio signal, thealigner outputs for each phoneme its time localization.",
                    "sid": 28,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This corpus has been processed with severalaligners.",
                    "sid": 29,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The first and main one (Brun et al., 2004)is HMM-based, it uses a set of 10 macro-classesof vowel (7 oral and 3 nasal), 2 semi-vowels and15 consonants.",
                    "sid": 30,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, from the time alignedphoneme sequence plus the EOT, the orthographictokens is time-aligned.",
                    "sid": 31,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The alignment for this paper is another version that has been carried out using SPPAS3 (Bigi,2012).",
                    "sid": 32,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "SPPAS is a tool to produce automatic annotations which include utterance, word, syllabic andphonemic segmentations from a recorded speechsound and its transcription.",
                    "sid": 33,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Alignment of items of the list given in (1) werethen manually verified.",
                    "sid": 34,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Largest errors were corrected to obtain reliable alignments.",
                    "sid": 35,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DM prononciations are the standard ones except3http://www.lplaix.fr/~bigi/sppas/ for a few cases.",
                    "sid": 36,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are only two items withnon standard cases that are over 2 occurrences:sampa: m.w.e.) that is an hybrid between mhand ouais, and sampa w.a.l.a, a reduction ofv.w.a.l.a voila`.",
                    "sid": 37,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The extraction themselves have been realizedby the authors with a Python script and all thestatistical analyses and plots have been producedwith R statistical analysis tool.",
                    "sid": 38,
                    "ssid": 13,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "descriptive statistics for the lexicalmarkers used in feedback. ",
            "number": "4",
            "sents": [
                {
                    "text": "All the lexical items of the list given in (1) wereautomatically extracted and categorized into twocategories: (i) Isolated items are items or sequenceof items surrounded by pauses of at least 200 msand not including any extra material than the itemsof this list ; (ii) Initial items (or sequence items)are located in front of some other items (but thereis no other material within the sequence).",
                    "sid": 39,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mostof these items also occur in final or even surrounded positions but we did not consider thesecases since they do are not clearly related to feedback.",
                    "sid": 40,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More precisely surrounded items are mostlyconsisting in breaks of disfluencies or genuinelyintegrated construction (e.g j’e´tais d’accord aveclui / I agreed with him).",
                    "sid": 41,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Final ones can play arole in eliciting feedback or sometimes bring somekind of closure at the end of the utterance (whathas been described as Pivot Ending in (Gravano etal., 2012)).",
                    "sid": 42,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(1) ah (ah), bon (well), ben (well), euh (err,uh), mh (mh), ouais (yeah), oui (yes), non(no), d’accord (agreed), OK (okay), voila`(that’s it, right) Strictly speaking, the list (1) is not exhaustive.However, other items are already in the thin partof the distribution’s tail.",
                    "sid": 43,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, some of theitems such as euh / err are not necessarily relatedto feedback.",
                    "sid": 44,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, by crossing lexical valueswith position we expect to get close enough thefull set of tokens involved in feedback.",
                    "sid": 45,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, initial euh not followed by a feedback relateditem will not be included in the final dataset.",
                    "sid": 46,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thisis also an objective of the present work to identifythese situations.",
                    "sid": 47,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The different markers exhibit very different figures with regard to their location as it can be seenin 1.",
                    "sid": 48,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While some are specialized in isolated feedback such as the continuer mh which is most of the 88 time backchanneled, others are found at the beginning of utterances such as euh, ah.",
                    "sid": 49,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The later makessense since euh is also a filled pause.",
                    "sid": 50,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "ah ah_ ouai s ah_ oui ben bon dacc ord eu h mh mh_ mh no n ou ais ou ais _oua is ou i voila 0 100 200 300 400 500 initialisolated Figure 1: Distribution of isolated vs. initial position for the most frequent lexical items In total 197 different combinations of the basic markers were identified.",
                    "sid": 51,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most frequentare the simple repetitions of items such as ouais(up to nine times) or mh.",
                    "sid": 52,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are also morecomplex structures as exhibited in (2) that seemto mix two kinds of items: base ones and modifiers (ah, euh).",
                    "sid": 53,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The base ones seem by defaultto carry general purpose communicative functionsas described in (Bunt, 2009; Bunt, 2012) while theothers can also be produced alone but are generallydealing specific dimension such as turn-taking, attitude expression or time management.",
                    "sid": 54,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2) a. ah ouais d’accord ok (ah yeah rightokay) b. voila` oui non (that’s it yes no) With regard to duration, the data is rather messyconcerning the very long items.",
                    "sid": 55,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are extremelengthening on these units.",
                    "sid": 56,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Aside that and the filleruh that exhibit a wide spread, the other items arenot produced with huge variations.",
                    "sid": 57,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Monosyllabicremain well centered around 150250 ms while di-syllabic and repeated items are distributed in the250500 ms range.",
                    "sid": 58,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is important for our nextstep in which automatic acoustic analysis of theseitems will be performed.",
                    "sid": 59,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "l l ll l l lll l l l l lllll ll ll l l l l l l l ll l l l ll ll l ll l l l l l lll l l l lll ll l lll l ll l ll ll lllll l l lll lll l l l l lll llllllll ll lll l llllllllll l l l l lllllll lll l l l lll ll l ll l l l ll l l ll ah ah_ ouai s ah_ oui ben bon dacc ord eu h mh mh_ mh no n ou ais ou ais _oua is ou i voila 0.0 0.5 1.0 1.5 2.0 Figure 2: Duration (in seconds) of each lexicaltype",
                    "sid": 60,
                    "ssid": 22,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "inter-individual variability. ",
            "number": "5",
            "sents": [
                {
                    "text": "Inter-individual variation is a big issue on the wayto the generalizability.",
                    "sid": 61,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We would like to understand some of the feedback producing profiles.Our intuitions coming from familiarity of the datais that there are strong variation but they correspond to a few different speaking styles.",
                    "sid": 62,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In future work, we would like to see in a second stepwhether we can identify and characterize thesestyles.",
                    "sid": 63,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "l 150 200 250 300 350 400 450 Figure 3: Number of feedback items per speakerFigure 3 illustrates the total figures of feedbackper speaker.",
                    "sid": 64,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As expected variation is huge, from132 to 425 but with in fact with few outliers witha nice batch of speaker in the 200300 range.The wider spread of the distribution in the highrange comes from two factors.",
                    "sid": 65,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First of all, thereare participants producing a high quantity of feed 89 back items.",
                    "sid": 66,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They produce a massive amount oflight backchannels (mh, ouais) compared to low-quantity feedback producers.",
                    "sid": 67,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The later also produce feedback during the long pauses of the mainspeaker but they produce much less overlappingbackchannels.",
                    "sid": 68,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This should be double checkedwith a specific measure (adding overlapping as afactor).",
                    "sid": 69,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, a second effect seems importantfor at least one speaker (the outlier): the amountto time holding the floor.",
                    "sid": 70,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In fact the speaker producing the most feedback did so because she wasrarely the main speaker.",
                    "sid": 71,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to get a global idea of the different usesof these items, Figure 5 represents the proportionof each item per speaker.",
                    "sid": 72,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As expected, the variation is important but one can spot some tendencies.For examples for the most frequent items, the rankseems to preserved across speakers.",
                    "sid": 73,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CID_ AB CID_ AC CID_ AG CID_ AP CID_ BX CID_ CM CID_ EB CID_ IM CID_ LJ CID_ LL CID_ MB CID_ MG CI D_M L CI D_NH CI D_SR CI D_YM voilaouiouais_ouaisouaisnonmh_mhmheuhdaccordbonbenah_ouiah_ouaisah 0.0 0.2 0.4 0.6 0.8 1.0 Figure 4: Distribution of the lexical items Based on their feedback profile (proportion ofuse of each items as illustrated in Figure 5), weattempted to cluster the participants as showed in5.",
                    "sid": 74,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While the lower parts of the dendrogram arehard to interpret the higher part matches well withthe impression acquired by listening to the corpus(no backchannels and rather formal feedback vs.lots of backchannels and very colloquial style).",
                    "sid": 75,
                    "ssid": 15,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "current and future work. ",
            "number": "6",
            "sents": [
                {
                    "text": "About this first batch of analyses, we will complete the analysis of the evolution during the conversation.",
                    "sid": 76,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "More precisely, we will go at theindividual level looking for time-based changes AB AG IM ML YM BX AP EB LJ NH CM SR AC MB LL MG 0.1 0.2 0.3 0.4 0.5 Dendrogram of diana(x = distSpForm) diana (*, \"NA\")distSpForm Hei ght Figure 5: Dendrogram of the participants clusterbased on their feedback profile in their profiles as well as looking at the pairsfor tracking potential convergence effect either interms of distribution of lexical marker types or intheir duration.",
                    "sid": 77,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In parallel to this work, we are launching independent prosodic and kinesic analyses of theforms, as well as a discourse analysis of the functions.",
                    "sid": 78,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover the work is being extended byadding two corpora in the study in order to allowfor a better situation generalisability: A FrenchMapTask; and a third corpus consisting in a lesscooperative situation.",
                    "sid": 79,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The idea is later to bringtogether the observations from the different levelsin order to propose a multidimensional model forfeedback in French dialogues.",
                    "sid": 80,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Those are steps toward more extensive studiesin the spirit of (Gravano et al., 2012) or (Neiberget al., 2013) on French language and in which wehope to address more directly the issue of discourse situation generalisability.",
                    "sid": 81,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}