{
    "ID": "W13-2210",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "This paper describes the phrase-based SMT systems developed for our participation in the WMT13 Shared Translation Task.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Translations for English↔German and English↔French were generated using a phrase-based translation system which is extended by additional models such as bilingual, fine-grained part-of- speech (POS) and automatic cluster language models and discriminative word lexica (DWL).",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we combined reordering models on different sentence abstraction levels.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "In this paper, we describe our systems for the ACL 2013 Eighth Workshop on Statistical Machine Translation.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We participated in the Shared Translation Task and submitted translations for English↔German and English↔French using a phrase-based decoder with lattice input.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The paper is organized as follows: the next section gives a detailed description of our systems including all the models.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation results for all directions are presented afterwards and we close with a conclusion.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "system description. ",
            "number": "2",
            "sents": [
                {
                    "text": "The phrase table is based on a GIZA++ word alignment for the French↔English systems.",
                    "sid": 8,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the German↔English systems we use a Discriminative Word Alignment (DWA) as described in Niehues and Vogel (2008).",
                    "sid": 9,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For every source phrase only the top 10 translation options are considered during decoding.",
                    "sid": 10,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The SRILM Toolkit (Stolcke, 2002) is used for training SRI language models using KneserNey smoothing.",
                    "sid": 11,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the word reordering between languages, we used POS-based reordering models as described in Section 4.",
                    "sid": 12,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to it, tree-based reordering model and lexicalized reordering were added for German↔English systems.",
                    "sid": 13,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An in-house phrase-based decoder (Vogel, 2003) is used to perform translation.",
                    "sid": 14,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The translation was optimized using Minimum Error Rate Training (MERT) as described in Venugopal et al.",
                    "sid": 15,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2005) towards better BLEU (Papineni et al., 2002) scores.",
                    "sid": 16,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.1 Data.",
                    "sid": 17,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The Europarl corpus (EPPS) and News Commentary (NC) corpus were used for training our translation models.",
                    "sid": 18,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We trained language models for each language on the monolingual part of the training corpora as well as the News Shuffle and the Gigaword corpora.",
                    "sid": 19,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The additional data such as web-crawled corpus, UN and Giga corpora were used after filtering.",
                    "sid": 20,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The filtering work for this data is discussed in Section 3.",
                    "sid": 21,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the German↔English systems we use the news-test2010 set for tuning, while the news- test2011 set is used for the French↔English systems.",
                    "sid": 22,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For testing, news-test2012 set was used for all systems.",
                    "sid": 23,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "2.2 Preprocessing.",
                    "sid": 24,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The training data is preprocessed prior to training the system.",
                    "sid": 25,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This includes normalizing special symbols, smart-casing the first word of each sentence and removing long sentences and sentence pairs with length mismatch.",
                    "sid": 26,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Compound splitting is applied to the German part of the corpus of the German→English system as described in Koehn and Knight (2003).",
                    "sid": 27,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "filtering of noisy pairs. ",
            "number": "3",
            "sents": [
                {
                    "text": "The filtering was applied on the corpora which are found to be noisy.",
                    "sid": 28,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Namely, the Giga English- French parallel corpus and the all the new web- crawled data . The operation was performed using 104 Proceedings of the Eighth Workshop on Statistical Machine Translation, pages 104–108, Sofia, Bulgaria, August 89, 2013 Qc 2013 Association for Computational Linguistics an SVM classifier as in our past systems (Medi- ani et al., 2011).",
                    "sid": 29,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each pair, the required lexica were extracted from Giza alignment of the corresponding EPPS and NC corpora.",
                    "sid": 30,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, for the web-crawled data, higher precision classifiers were trained by providing a larger number of negative examples to the classifier.",
                    "sid": 31,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "After filtering, we could still find English sentences in the other part of the corpus.",
                    "sid": 32,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Therefore, we performed a language identification (LID)- based filtering afterwards (performed only on the French-English corpora, in this participation).",
                    "sid": 33,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "word reordering. ",
            "number": "4",
            "sents": [
                {
                    "text": "Word reordering was modeled based on POS sequences.",
                    "sid": 34,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the German↔English system, reordering rules learned from syntactic parse trees were used in addition.",
                    "sid": 35,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.1 POS-based Reordering Model.",
                    "sid": 36,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to train the POS-based reordering model, probabilistic rules were learned based on the POS tags from the TreeTagger (Schmid and Laws, 2008) of the training corpus and the alignment.",
                    "sid": 37,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As described in Rottmann and Vogel (2007), continuous reordering rules are extracted.",
                    "sid": 38,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This modeling of short-range reorderings was extended so that it can cover also long-range reorderings with non- continuous rules (Niehues and Kolss, 2009), for German↔English systems.",
                    "sid": 39,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.2 Tree-based Reordering Model.",
                    "sid": 40,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition to the POS-based reordering, we apply a tree-based reordering model for the German↔English translation to better address the differences in word order between German and English.",
                    "sid": 41,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We use the Stanford Parser (Rafferty and Manning, 2008) to generate syntactic parse trees for the source side of the training corpus.",
                    "sid": 42,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we use the word alignment between source and target language to learn rules on how to reorder the constituents in a German source sentence to make it match the English target sentence word order better (Herrmann et al., 2013).",
                    "sid": 43,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The POS-based and tree-based reordering rules are applied to each input sentence.",
                    "sid": 44,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting reordered sentence variants as well as the original sentence order are encoded in a word lattice.",
                    "sid": 45,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lattice is then used as input to the decoder.",
                    "sid": 46,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "4.3 Lexicalized Reordering.",
                    "sid": 47,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The lexicalized reordering model stores the reordering probabilities for each phrase pair.",
                    "sid": 48,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Possible reordering orientations at the incoming and outgoing phrase boundaries are monotone, swap or discontinuous.",
                    "sid": 49,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With the POS- and tree-based reordering word lattices encode different reordering variants.",
                    "sid": 50,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to apply the lexicalized reordering model, we store the original position of each word in the lattice.",
                    "sid": 51,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At each phrase boundary at the end, the reordering orientation with respect to the original position of the words is checked.",
                    "sid": 52,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The probability for the respective orientation is included as an additional score.",
                    "sid": 53,
                    "ssid": 20,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "translation models. ",
            "number": "5",
            "sents": [
                {
                    "text": "In addition to the models used in the baseline system described above, we conducted experiments including additional models that enhance translation quality by introducing alternative or additional information into the translation modeling process.",
                    "sid": 54,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.1 Bilingual Language Model.",
                    "sid": 55,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "During the decoding the source sentence is segmented so that the best combination of phrases which maximizes the scores is available.",
                    "sid": 56,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "However, this causes some loss of context information at the phrase boundaries.",
                    "sid": 57,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to make bilingual context available, we use a bilingual language model (Niehues et al., 2011).",
                    "sid": 58,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the bilingual language model, each token consists of a target word and all source words it is aligned to.",
                    "sid": 59,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.2 Discriminative Word Lexicon.",
                    "sid": 60,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Mauser et al.",
                    "sid": 61,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2009) introduced the Discriminative Word Lexicon (DWL) into phrase-based machine translation.",
                    "sid": 62,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this approach, a maximum entropy model is used to determine the probability of using a target word in the translation.",
                    "sid": 63,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this evaluation, we used two extensions to this work as shown in (Niehues and Waibel, 2013).",
                    "sid": 64,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "First, we added additional features to model the order of the source words better.",
                    "sid": 65,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Instead of representing the source sentence as a bag-of-words, we used a bag-of-n-grams.",
                    "sid": 66,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We used n-grams up to the order of three and applied count filtering to the features for higher order n-grams.",
                    "sid": 67,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, we created the training examples differently in order to focus on addressing errors of the other models of the phrase-based translation system.",
                    "sid": 68,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We first translated the whole corpus with a baseline system.",
                    "sid": 69,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we only used the words that occur in the N-Best List and not in the reference as negative examples instead of using all words that do not occur in the reference.",
                    "sid": 70,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.3 Quasi-Morphological Operations.",
                    "sid": 71,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because of the inflected characteristic of the German language, we try to learn quasi- morphological operations that change the lexical entry of a known word form to the out-of- vocabulary (OOV) word form as described in Niehues and Waibel (2012).",
                    "sid": 72,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "5.4 Phrase Table Adaptation.",
                    "sid": 73,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the French↔English systems, we built two phrase tables; one trained with all data and the other trained only with the EPPS and NC corpora.",
                    "sid": 74,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is due to the fact that Giga corpus is big but noisy and EPPS and NC corpus are more reliable.",
                    "sid": 75,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two models are combined log-linearly to achieve the adaptation towards the cleaner corpora as described in Niehues et al.",
                    "sid": 76,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(2010).",
                    "sid": 77,
                    "ssid": 24,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "language models. ",
            "number": "6",
            "sents": [
                {
                    "text": "The 4-gram language models generated by the SRILM toolkit are used as the main language models for all of our systems.",
                    "sid": 78,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the English↔French systems, we use a good quality corpus as in-domain data to train in-domain language models.",
                    "sid": 79,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Additionally, we apply the POS and cluster language models in different systems.",
                    "sid": 80,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the German→English system, we build separate language models using each corpus and combine them linearly before the decoding by minimizing the perplexity.",
                    "sid": 81,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Language models are integrated into the translation system by a log-linear combination and receive optimal weights during tuning by the MERT.",
                    "sid": 82,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.1 POS Language Models.",
                    "sid": 83,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the English→German system, we use the POS language model, which is trained on the POS sequence of the target language.",
                    "sid": 84,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The POS tags are generated using the RFTagger (Schmid and Laws, 2008) for German.",
                    "sid": 85,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The RFTagger generates fine- grained tags which include person, gender, and case information.",
                    "sid": 86,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The language model is trained with up to 9-gram information, using the German side of the parallel EPPS and NC corpus, as well as the News Shuffle corpus.",
                    "sid": 87,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "6.2 Cluster Language Models.",
                    "sid": 88,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to use larger context information, we use a cluster language model for all our systems.",
                    "sid": 89,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cluster language model is based on the idea shown in Och (1999).",
                    "sid": 90,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using the MKCLS algorithm, we cluster the words in the corpus, given a number of classes.",
                    "sid": 91,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then words in the corpus are replaced with their cluster IDs.",
                    "sid": 92,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using these cluster IDs, we train n-gram language models as well as a phrase table with this additional factor of cluster ID. Our submitted systems have diversed range of the number of clusters as well as n-gram.",
                    "sid": 93,
                    "ssid": 16,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "results. ",
            "number": "7",
            "sents": [
                {
                    "text": "Using the models described above we performed several experiments leading finally to the systems used for generating the translations submitted to the workshop.",
                    "sid": 94,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are reported as case- sensitive BLEU scores on one reference translation.",
                    "sid": 95,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.1 German→English.",
                    "sid": 96,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The experiments for the German to English translation system are summarized in Table 1.",
                    "sid": 97,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline system uses POS-based reordering, DWA with lattice phrase extraction and language models trained on the News Shuffle corpus and Giga corpus separately.",
                    "sid": 98,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we added a 5-gram cluster LM trained with 1,000 word classes.",
                    "sid": 99,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By adding a language model using the filtered crawled data we gained 0.3 BLEU on the test set.",
                    "sid": 100,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For this we combined all language models linearly.",
                    "sid": 101,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The filtered crawled data was also used to generate a phrase table, which brought another improvement of 0.85 BLEU.",
                    "sid": 102,
                    "ssid": 9,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Applying tree-based reordering improved the BLEU score, and the performance had more gain by adding the extended DWL, namely using both bag-of-ngrams and n-best lists.",
                    "sid": 103,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "While lexicalized reordering gave us a slight gain, we added morphological operation and gained more improvements.",
                    "sid": 104,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "7.2 English→German.",
                    "sid": 105,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The English to German baseline system uses POS- based reordering and language models using parallel data (EPPS and NC) as shown in Table 2.",
                    "sid": 106,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Gradual gains were achieved by changing alignment from GIZA++ to DWA, adding a bilingual language model as well as a language model based on the POS tokens.",
                    "sid": 107,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A 9-gram cluster-based language model with 100 word classes gave us a System Dev Test in our best system.",
                    "sid": 108,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Baseline 24.15 22.79 + Cluster LM 24.18 22.84 System Dev Test + Cra wle d Dat a LM (C om b.)",
                    "sid": 109,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "24 .5 3 23 .1 4 B as eli ne 30 .3 3 29 .3 5 + Cra wle d Dat a PT 25 .3 8 23 .9 9 + Cr aw le d D at a 30 .5 9 29 .9 3 + Tre e Rul es 25 .8 0 24 .1 6 + Bil in gu al an d Cl us ter L M s 30 .6 7 30 .0 1 + Ext end ed D WL 25 .5 9 24 .5 4 + In Do m ai n PT A da pt ati on 31 .1 7 30 .1 6 + Lex ical ize d Re ord eri ng 26 .0 4 24 .5 5 + D W L 31 .0 7 30 .4 0 + Morphological Operation - 24.62 Table 1: Translation results for German→English small gain.",
                    "sid": 110,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Improving the reordering using lexialized reordering gave us gain on the optimization set.",
                    "sid": 111,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using DWL let us have more improvements on our test set.",
                    "sid": 112,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "By using the filtered crawled data, we gained a big improvement of 0.46 BLEU on the test set.",
                    "sid": 113,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Then we extended the DWL with bag of n-grams and n-best lists to achieve additional improvements.",
                    "sid": 114,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Finally, the best system includes lattices generated using tree rules.",
                    "sid": 115,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3: Translation results for French→English 7.4 English→French.",
                    "sid": 116,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the baseline system, EPPS, NC, Giga and News Shuffle corpora are used for language modeling.",
                    "sid": 117,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The big phrase tables tailored EPPC, NC and Giga data.",
                    "sid": 118,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The system also uses short-range reordering trained on EPPS and NC.",
                    "sid": 119,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adding parallel and filtered crawl data improves the system.",
                    "sid": 120,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It was further enhanced by the integration of a 4-gram bilingual language model.",
                    "sid": 121,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Moreover, the best configuration of 9-gram language model trained on 500 clusters of French texts gains 0.25 BLEU points improvement.",
                    "sid": 122,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We also conducted phrase-table adaptation from the general one into the domain covered by EPPS and NC data and it helps as well.",
                    "sid": 123,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The initial tryout with lexicalized reordering feature showed an improvement of 0.23 points on the development set, but a surprising reduction on the test set, thus we decided to take the system after adaptation as our best English→French system.",
                    "sid": 124,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 2: Translation results for English→German 7.3 French→English.",
                    "sid": 125,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Table 3 reports some remarkable improvements as we combined several techniques on the French→English direction.",
                    "sid": 126,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The baseline system was trained on parallel corpora such as EPPS, NC and Giga, while the language model was trained on the English part of those corpora plus News Shuffle.",
                    "sid": 127,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The newly presented web-crawled data helps to achieve almost 0.6 BLEU points more on test set.",
                    "sid": 128,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Adding bilingual language model and cluster language model does not show a significant impact.",
                    "sid": 129,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further gains were achieved by the adaptation of in-domain data into general-theme phrase table, bringing 0.15 BLEU better on the test set.",
                    "sid": 130,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "When we added the DWL feature, it notably improves the system by 0.25 BLEU points, resulting Table 4: Translation results for English→French",
                    "sid": 131,
                    "ssid": 38,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "conclusions. ",
            "number": "8",
            "sents": [
                {
                    "text": "We have presented the systems for our participation in the WMT 2013 Evaluation for English↔German and English↔French.",
                    "sid": 132,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All systems use a class-based language model as well as a bilingual language model.",
                    "sid": 133,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using a DWL with source context improved the translation quality of English↔German systems.",
                    "sid": 134,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also for these systems, we could improve even more with a tree-based reordering model.",
                    "sid": 135,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Special handling of OOV words improved German→English system, while for the inverse direction the language model with fine-grained POS tags was helpful.",
                    "sid": 136,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For English↔French, phrase table adaptation helps to avoid using wrong parts of the noisy Giga corpus.",
                    "sid": 137,
                    "ssid": 6,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "acknowledgements. ",
            "number": "9",
            "sents": [
                {
                    "text": "This work was partly achieved as part of the Quaero Programme, funded by OSEO, French State agency for innovation.",
                    "sid": 138,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The research leading to these results has received funding from the European Union Seventh Framework Pro- gramme (FP7/20072013) under grant agreement n◦ 287658.",
                    "sid": 139,
                    "ssid": 2,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}