{
    "ID": "W93-0111",
    "sections": [
        {
            "text": "abstract",
            "number": 0,
            "sents": [
                {
                    "text": "Bootstrap methods (unsupervised classification) that generate word classes without requiring pretagging have had notable success in the last few years.",
                    "sid": 1,
                    "ssid": 1,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The methods described here strengthen these approaches and produce excellentword classes from a 200,000 word corpus.",
                    "sid": 2,
                    "ssid": 2,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The method uses mutual information measures plus positional information from the words in the immediate context of a target word to compute similarities.",
                    "sid": 3,
                    "ssid": 3,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Using the similarities, classes are built using hierarchical agglomerative clustering.",
                    "sid": 4,
                    "ssid": 4,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the leaves of the classification tree, words are grouped by syntactic and semantic similarity.",
                    "sid": 5,
                    "ssid": 5,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Further up the tree,the classes are primarily syntactic.",
                    "sid": 6,
                    "ssid": 6,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once the initialclasses are found, they can be used to classifyambiguous words, i.e., part-of-speech tagging.",
                    "sid": 7,
                    "ssid": 7,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is done by expanding each context word of a target instance into a tightly defined class of similar words, a simsct.",
                    "sid": 8,
                    "ssid": 8,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The use of simsets is shown to increase the tagging accuracy from 83% to 92% for the forms &quot;cloned&quot; and &quot;deduced&quot;.",
                    "sid": 9,
                    "ssid": 9,
                    "kind_of_tag": "s"
                }
            ]
        },
        {
            "text": "introduction",
            "number": "1",
            "sents": [
                {
                    "text": "The identification of the syntactic class and the discovery of semantic information for words not contained in any online dictionary or thesaurus is an important and challenging * This material is based upon work supported by the National Science Foundation under Grant No.",
                    "sid": 10,
                    "ssid": 10,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In our approach, we take into account both the relative positions of the nearby context words as well as the m u t u a l information (Church & Hanks, 1990) associated with the occurrence of a particular context word.",
                    "sid": 11,
                    "ssid": 11,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The similarities computed from these measures of the context contain information about both syntactic and s e m a n t i c relations.",
                    "sid": 12,
                    "ssid": 12,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, high similarity values are obtained for the two s e m a n t i c a l l y similar nouns, DIR8814522.",
                    "sid": 13,
                    "ssid": 13,
                    "kind_of_tag": "s"
                },
                {
                    "text": "117 &quot;diameter&quot; and &quot;length&quot;,as well as for the two adjectives &quot;nonmotile&quot; and &quot;nonchemotactic&quot;.",
                    "sid": 14,
                    "ssid": 14,
                    "kind_of_tag": "s"
                },
                {
                    "text": "W e demonstrate the technique on three problems, all using a 200,000 word corpus composed of 1700 abstracts from a specialized field of biology: #1: Generating the full classificationtree for the 1,000 most frequent words (covering 80% of all word occurrences).",
                    "sid": 15,
                    "ssid": 15,
                    "kind_of_tag": "s"
                },
                {
                    "text": "#2: The classification of 138 occurrences of the -ed forms, &quot;cloned&quot; and &quot;deduced&quot; into four syntactic categories, including improvements by using expanded context information derived in #1.",
                    "sid": 16,
                    "ssid": 16,
                    "kind_of_tag": "s"
                },
                {
                    "text": "#3: The classificationof 100 words that only occur once in the entire corpus (hapax legomena), again using expanded contexts.",
                    "sid": 17,
                    "ssid": 17,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results described below were obtained using no pretagging or online dictionary,but the results compare favorably with methods that do.",
                    "sid": 18,
                    "ssid": 18,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results are discussed in terms of the semantic fields they delineate, the accuracy of the classificationsand the nature of the errors that occur.",
                    "sid": 19,
                    "ssid": 19,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results make it clear that this new technology is very promising and should be pursued vigorously.",
                    "sid": 20,
                    "ssid": 20,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The power of the approach appears to result from using a focused corpus, using detailed positional information, using mutual information measures and using a clustering method that updates the detailed context information when each new cluster is formed.",
                    "sid": 21,
                    "ssid": 21,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our approach was inspired by the fascinating results achieved by Finch and Chater at Edinburgh and the methods they used (Finch & Chater, 1992).",
                    "sid": 22,
                    "ssid": 22,
                    "kind_of_tag": "s"
                },
                {
                    "text": "THE CORPUS -- TECHNICAL, FOCUSED AND SMALL In the Biological Knowledge Laboratory we are pursuing a number of projects to analyze, store and retrieve biologicalresearch papers, including working with full text and graphics (Futrelle, Kakadiaris, Alexander, Carriero, Nikolakis & Futrelle, 1992; Gauch & Futrelle, 1993).",
                    "sid": 23,
                    "ssid": 23,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The work is focused on the biological field of bacterial chemotaxis.",
                    "sid": 24,
                    "ssid": 24,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A biologist has selected approximately 1,700 documents representing all the work done in this field since its inception in 1965.",
                    "sid": 25,
                    "ssid": 25,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our study uses the titlesfor all these documents plus all the abstracts available for them.",
                    "sid": 26,
                    "ssid": 26,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resulting corpus contains 227,408 words with 13,309 distinct word forms, including 5,833 words of frequency 1.",
                    "sid": 27,
                    "ssid": 27,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are 1,686 titles plus 8,530 sentences in the corpus.",
                    "sid": 28,
                    "ssid": 28,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The sentence identification algorithm requires two factors -- contiguous punctuation C.&quot;, &quot;!&quot;,or &quot;?&quot;) and capitalization of the following token.",
                    "sid": 29,
                    "ssid": 29,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To eliminate abbreviations, the token prior to the punctuation must not be a single capital letter and the capitalized token after the punctuation m a y not itselfbe followed by a contiguous &quot;.&quot;.",
                    "sid": 30,
                    "ssid": 30,
                    "kind_of_tag": "s"
                },
                {
                    "text": "An example of a sentence from the corpus is, &quot;$pre2$ $prel$ one of the open reading frames was translated into a protein with $pct$ amino acid identity to S. typhimurium Flil and $pct$ identity to the beta subunit of E. coli A T P synthase $posl$ $pos2$&quot; The positional items $pre... and $pos... have been added to furnish explicitcontext for sentence initial and sentence final constituents.",
                    "sid": 31,
                    "ssid": 31,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Numbers have been converted to three forms corresponding to integers,reals and percentages C$pct$ in the example above).",
                    "sid": 32,
                    "ssid": 32,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The machine-readable version of the corpus uses double quoted items to ease processing by Lisp, our language of choice.",
                    "sid": 33,
                    "ssid": 33,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The terminology we will use for describing words is as follows: • Target word : A word to be classified.",
                    "sid": 34,
                    "ssid": 34,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Context words : Appearing within some distance of a target word, &quot;The big ~ cat 9.a the mat...&quot;.",
                    "sid": 35,
                    "ssid": 35,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Word class: Any defined set of word forms or labeled instances.",
                    "sid": 36,
                    "ssid": 36,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Simset: A word class in which each item, an expansion word, has a similarity greater than some chosen cutoffto a single base word.",
                    "sid": 37,
                    "ssid": 37,
                    "kind_of_tag": "s"
                },
                {
                    "text": "• Labeled instances : Forms such as &quot;cloned48&quot; or &quot;cloned73VBN&quot;, that 118 would replace an occurrence of &quot;cloned&quot;.",
                    "sid": 38,
                    "ssid": 38,
                    "kind_of_tag": "s"
                },
                {
                    "text": "DESCRIBING QUANTIFYING In these experiments, the context of a target word is described by the preceding two context words and the following two context words, Figure 1.",
                    "sid": 39,
                    "ssid": 39,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each position is represented by a 150 element vector corresponding to the occurrence of the 150 highest frequency words in the corpus, giving a 600-dimensional vector describing the four-word context.",
                    "sid": 40,
                    "ssid": 40,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Initially, the counts from all instances of a target word form w are summed so t h a t the entry in the corresponding context word position in the vector is the sum of the occurrences of that context word in t h a t position for the corresponding target word form; it is the joint frequency of the context word.",
                    "sid": 41,
                    "ssid": 41,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, if the word the i m m e d i a t e l y precedes 10 occurrences of the word gene in the corpus then the element corresponding to the in the - 1 C context vector of gene is set to 10.",
                    "sid": 42,
                    "ssid": 42,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Subsequently, a 600-dimensional vector of mutual information values, MI, is computed from the frequencies as follows, AND WORD Ml(cw)= log 2 [ . NZ~ 1 + ].j ] This expresses the mutual information value for the context word c appearing with the target word w. The mutual information is large whenever a context word appears at a m u c h h i g h e r f r e q u e n c y , f c w , in the Word to be classified with context: -2C 119 neighborhood of a target word than would be predicted from the overall frequencies in the corpus, fc and fw.",
                    "sid": 43,
                    "ssid": 43,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The formula adds 1 to the frequency ratio, so that a 0 (zero) occurrence corresponds to 0 m u t u a l information.",
                    "sid": 44,
                    "ssid": 44,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A possibly better strategy (Church, Gale, Hanks & Hindle, 1991) is capable of generatingnegative m u t u a l information for the non occurrence or low-frequency occurrence of a very high-frequency word and has the form, Ml(cw) = log 2 • fN(~ . +I)'~ ~ / [ I#.",
                    "sid": 45,
                    "ssid": 45,
                    "kind_of_tag": "s"
                },
                {
                    "text": "J In any case, some smoothing is necessary to prevent the m u t u a l information from diverging when fcw= O. SIMILARITY, CLUSTERING AND CLASSIFICATION SPACE IN WORD When the mutual information vectors are computed for a number of words, they can be compared to see which words have similar contexts.",
                    "sid": 46,
                    "ssid": 46,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The comparison we chose is the inner product, or cosine measure, which can vary between -1.0 and +1.0 (Myaeng & Li, 1992).",
                    "sid": 47,
                    "ssid": 47,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Once this similarity is computed for all word pairs in a set, various techniques can be used to identify classes of similar words.",
                    "sid": 48,
                    "ssid": 48,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The method we chose is hierarchical agglomerative clustering (Jain & Dubes, 1988).",
                    "sid": 49,
                    "ssid": 49,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The two words with the highest similarity are first joined into a two-word cluster.",
                    "sid": 50,
                    "ssid": 50,
                    "kind_of_tag": "s"
                },
                {
                    "text": "-1C W +1C +2C F i g u r e 1.",
                    "sid": 51,
                    "ssid": 51,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 600-dimensional context vector around a target word W. Each subvecter describes the frequency and mutual information of the occurrences of the 150 highest frequency words, HFC, in the corpus.",
                    "sid": 52,
                    "ssid": 52,
                    "kind_of_tag": "s"
                },
                {
                    "text": "CONTI~TS A mutual information vector for the cluster is computed and the cluster and remaining words are again compared, choosing the most similar to join, and so on.",
                    "sid": 53,
                    "ssid": 53,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(To compute the new mutual information vector, the context frequencies in the vectors for the two words or clusters joined at each step are summed, element-wise.)",
                    "sid": 54,
                    "ssid": 54,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In this way, a binary tree is constructed with words at the leaves leading to a single root covering all words.",
                    "sid": 55,
                    "ssid": 55,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Each cluster, a node in the binary tree, is described by an integer denoting its position in the sequence of cluster formation, the total number of words, the similarity of the two children that make it up, and its m e m b e r words.",
                    "sid": 56,
                    "ssid": 56,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here, for example, are the first 15 clusters from the analysis described in Experiment #I in the next section, (0 2 0.73926157 is was) (1 2 0.6988309 were are) (Z 4 0.708@31 ( i s was) (were are)) (3 2 0.65726656 found shown) (4 Z 0.6216794 the a) (5 Z 0.5913143 s mM) (6 Z 0.59088105 coli typhimurium) (7 2 0.586728 galactose ribose) (8 2 0.58630705 method procedure) (9 2 0.58404166 K-12 K12) (10 2 0.5833811 required necessary) (11 3 0.5793458 rain (s raM)) (12 2 0.5750035 isolated constructed) (13 3 0.56909233 (found shown) used) (14 2 0.$6750214 c e l l s strains) (I5 3 0.5652546 mutants ( c e l l s strains)) In this sample it is clear that clusters are sometimes formed by the pairing of two individual words, sometimes by pairing one word and a previous cluster, and sometimes by combining two already formed clusters.",
                    "sid": 57,
                    "ssid": 57,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In normal tagging, a word is viewed as a member of one of a small number of classes.",
                    "sid": 58,
                    "ssid": 58,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In the classificationapproach we are using, there can be thousands of classes, from pairs of words up to the root node which contains all words in a single class.",
                    "sid": 59,
                    "ssid": 59,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus, every class generated is viewed extensionally, it is a structured collection of occurrences in the corpus, with their attendant frequencies and contexts.",
                    "sid": 60,
                    "ssid": 60,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classes so formed will reflect the particularword use in the corpus they are derived from.",
                    "sid": 61,
                    "ssid": 61,
                    "kind_of_tag": "s"
                },
                {
                    "text": "EXPERIMENT #1: CLASSIFICATION OF THE 1,000 HIGHEST FREQUENCY WORDS The first experiment classified the 1,000 highest frequency words in the corpus, producing 999 clusters (0998) during the process.",
                    "sid": 62,
                    "ssid": 62,
                    "kind_of_tag": "s"
                },
                {
                    "text": "$pre... and Spas... words were included in the context set, but not in the target set.",
                    "sid": 63,
                    "ssid": 63,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Near the leaves, words clustered by syntax (part of speech) and by semantics.",
                    "sid": 64,
                    "ssid": 64,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Later, larger clusters tended to contain words of the same syntactic class, but with less semantic homogeneity.",
                    "sid": 65,
                    "ssid": 65,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In each example below, the words listedare the entire contents of the cluster mentioned.",
                    "sid": 66,
                    "ssid": 66,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most striking property of the clusters produced was the classificationof words into coherent semantic fields.",
                    "sid": 67,
                    "ssid": 67,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Grefenstette has pointed out (Grefenstette, 1992) that the Deese antonyms, such as &quot;large&quot; and &quot;small&quot; or &quot;hot&quot; and &quot;cold&quot; show up commonly in these analyses.",
                    "sid": 68,
                    "ssid": 68,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Our methods discovered entire graded fields, rather than just pairs of opposites.",
                    "sid": 69,
                    "ssid": 69,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The following example shows a cluster of seventeen adjectives describing comparative quantity terms, cluster 756, similarity 0.28, decreased, effective, few, greater, high, higher, increased, large, less, low, lower, more, much, no, normal, reduced, short Note t h a t pairs such as &quot;high&quot; and &quot;higher&quot; and &quot;low&quot; and &quot;lower&quot; appear.",
                    "sid": 70,
                    "ssid": 70,
                    "kind_of_tag": "s"
                },
                {
                    "text": "&quot;No&quot;, meaning &quot;none&quot; in this collection, is located at one extreme.",
                    "sid": 71,
                    "ssid": 71,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The somewhat marginal item, &quot;effective&quot;, entered the cluster late, at cluster 704.",
                    "sid": 72,
                    "ssid": 72,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It appears in collocations, such as &quot;as.",
                    "sid": 73,
                    "ssid": 73,
                    "kind_of_tag": "s"
                },
                {
                    "text": "effective as&quot; and &quot;effective than&quot;, in which the other terms also appear.",
                    "sid": 74,
                    "ssid": 74,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparing the cluster to Roger's (Berrey, 1962) we find that all the items are in the Roget category Comparative Quantity except for &quot;effective&quot; and &quot;no&quot;.",
                    "sid": 75,
                    "ssid": 75,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The cluster item, &quot;large&quot; is not in this Roget category but the category does include &quot;big&quot;, &quot;huge&quot; and &quot;vast&quot;, so the omission is clearly an error in Roget's.",
                    "sid": 76,
                    "ssid": 76,
                    "kind_of_tag": "s"
                },
                {
                    "text": "With 120 this correction, 88% (15/17) of the items are in the single Roget category.",
                    "sid": 77,
                    "ssid": 77,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The classification of technical terms from genetics and biochemistry is of particular interest, because many of these terms do not appear in available dictionaries or thesauri.",
                    "sid": 78,
                    "ssid": 78,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cluster 374, similarity 0.37, contains these 18 items, che, cheA, cheB, cheR, cheY, cheZ, double, fla, flaA, t a B , flaE, H2, hag, mot, motB, tar, trg, tsr All of these are abbreviations for specific bacterial mutations, except for &quot;double&quot;.",
                    "sid": 79,
                    "ssid": 79,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Its appearance drives home the point that the classification depends entirely on usage.",
                    "sid": 80,
                    "ssid": 80,
                    "kind_of_tag": "s"
                },
                {
                    "text": "20 of the 30 occurrences of &quot;double&quot; precede the words &quot;mutant&quot; or &quot;mutants&quot;, as do most of the othermutation terms in this cluster.",
                    "sid": 81,
                    "ssid": 81,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Cluster 240, similarity 0.4 contains these termS, microscopy, electrophoresis, chromatography Each of these is a noun describing a common technique used in experiments in this domain.",
                    "sid": 82,
                    "ssid": 82,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The standard Linnean nomenclature of Genus followed by species, such as Escherichia coli, is reflected by cluster 414, which contains 22 species names, and cluster 510, which contains 9 genus n a m e s . In scientific research, the determination of causal factors and the discovery of essential elements is a major goal.",
                    "sid": 83,
                    "ssid": 83,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Here are six concepts in this semantic field comprising cluster 183, similarity 0.43, required, necessary, involved, responsible, essential, important These terms are used almost interchangeably in our corpus, b u t they don't f a r e as well in R o g e t ' s b e c a u s e of anthropocentric attachments to concepts such as fame, duty and legal liability.",
                    "sid": 84,
                    "ssid": 84,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discussion of Experiment #1 Given the limited context and modest sized corpus, the classification algorithm is bound to make mistakes, though a study of the text concordance will always tell us why the algorithm failed in any specific case.",
                    "sid": 85,
                    "ssid": 85,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, as the similarity drops to 0.24 at cluster 824 we see the adverb triple &quot;greatly&quot;, &quot;rapidly&quot; and &quot;almost&quot;.",
                    "sid": 86,
                    "ssid": 86,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is still acceptable, but by cluster 836 (similarity 0.24) we see the triple, &quot;them&quot;, &quot;ring&quot;, &quot;rings&quot;.",
                    "sid": 87,
                    "ssid": 87,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At the end there is only a single cluster, 998, which must include all words.",
                    "sid": 88,
                    "ssid": 88,
                    "kind_of_tag": "s"
                },
                {
                    "text": "It comes together stubbornly with a negative similarity of-0.51.",
                    "sid": 89,
                    "ssid": 89,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One problem encountered in this work was that the later, larger clusters have less coherence than we would hope for, identifying an i m p o r t a n t research issue.",
                    "sid": 90,
                    "ssid": 90,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experiment #1 took 20 hours to run on a Symbolics XL1200.",
                    "sid": 91,
                    "ssid": 91,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A fundamental problem is to devise decision procedures that will tell us which classes are semantically or syntactically homogeneous; procedures that tell us where to cut the tree.",
                    "sid": 92,
                    "ssid": 92,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The examples shown earlier broke down soon after, when words or clusters which in our judgment were weakly related began to be added.",
                    "sid": 93,
                    "ssid": 93,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We are exploring the numerous methods to refine clusters once formed as well as methods to validate clusters for homogeneity (Jain & Dubes, 1988).",
                    "sid": 94,
                    "ssid": 94,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are also resampling methods to validate clusters formed by top-down partitioning methods (Jain & Moreau, 1987).",
                    "sid": 95,
                    "ssid": 95,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All of these methods are computationally demanding b u t they can result in criteria for when to stop clustering.",
                    "sid": 96,
                    "ssid": 96,
                    "kind_of_tag": "s"
                },
                {
                    "text": "On the other hand, we mustn't assume that word relations are so simple that we can legitimately insist on finding neatly s e p a r a t e d clusters.",
                    "sid": 97,
                    "ssid": 97,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word relations m a y simply be too complex and graded for this ever to occur.",
                    "sid": 98,
                    "ssid": 98,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The semantic fields we discovered were not confined to synonyms.",
                    "sid": 99,
                    "ssid": 99,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To understand why this is the case, consider the sentences, &quot;The t e m p e r a t u r e is higher today.&quot; and, &quot;The temperature is lower today.&quot; There is no way to tell from the syntax which word to expect.",
                    "sid": 100,
                    "ssid": 100,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The choice is dependent on the situation in the world; it represents data from the world.",
                    "sid": 101,
                    "ssid": 101,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The 121 utterances are informative for just that reason.",
                    "sid": 102,
                    "ssid": 102,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Taking this reasoning a step further, information theory would suggest that for two contrasting words to be maximally informative, they should appear about equally often in discourse.",
                    "sid": 103,
                    "ssid": 103,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is born out in our corpus (fhigher=58, i~ower=46) and for the Brown corpus (fhigher=147, fiower=110).",
                    "sid": 104,
                    "ssid": 104,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The same relations are found for m a n y other contrasting pairs, with some bias towards &quot;positive&quot; terms.",
                    "sid": 105,
                    "ssid": 105,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The most extreme &quot;positive&quot; bias in our corpus is f p o s s i b l e = 8 8 , fimpossible=0; &quot;never say never&quot; seems to be the catchphrase here - - highly appropriate for the field of biology.",
                    "sid": 106,
                    "ssid": 106,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Some of the chemical term clusters that were generated are interesting because they contain class terms such as &quot;sugar&quot; and &quot;ion&quot; along with specific members of the classes (hyponyms), such as &quot;maltose&quot; and &quot;Na +''.",
                    "sid": 107,
                    "ssid": 107,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Comparing these in our K W I C concordance suggests that there m a y be methodical techniques for identifying some of these generalization hierarchies using machine learning (supervised classification)(Futrelle & Gauch, 1993).",
                    "sid": 108,
                    "ssid": 108,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For another discussion of attempts to generate generalization hierarchies, see (Myaeng & Li, 1992).",
                    "sid": 109,
                    "ssid": 109,
                    "kind_of_tag": "s"
                },
                {
                    "text": "As a corpus grows and new words appear, one way to classify them is to find their similarity to the N words for which context vectors have already been computed.",
                    "sid": 110,
                    "ssid": 110,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This requires N comparisons.",
                    "sid": 111,
                    "ssid": 111,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A more efficient method which would probably give the same result would be to successively compare the word to clusters in the tree, starting at the root.",
                    "sid": 112,
                    "ssid": 112,
                    "kind_of_tag": "s"
                },
                {
                    "text": "At each node, the child which is most similar to the unclassified word is followed.",
                    "sid": 113,
                    "ssid": 113,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a logarithmic search technique for finding the best matching class which takes only O(log2N) steps.",
                    "sid": 114,
                    "ssid": 114,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In such an approach, the hierarchical cluster is being used as a decision tree, which have been much studied in the machine learning literature (Quinlan, 1993).",
                    "sid": 115,
                    "ssid": 115,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is an alternate view of the classification approach as the unsupervised learning of a decision tree.",
                    "sid": 116,
                    "ssid": 116,
                    "kind_of_tag": "s"
                },
                {
                    "text": "EXPERIMENT #2: DISAMBIGUATION OF -ED FORMS The following experiment is interesting because it shows a specific use for the similarity computations.",
                    "sid": 117,
                    "ssid": 117,
                    "kind_of_tag": "s"
                },
                {
                    "text": "They are used here to i n c r e a s e t h e a c c u r a c y of t e r m disambiguation which means selecting the best tag or class for a potentially ambiguous word.",
                    "sid": 118,
                    "ssid": 118,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Again, this is a bootstrap method; no prior tagging is needed to construct the classes.",
                    "sid": 119,
                    "ssid": 119,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But if we do identify the tags for a few items by hand or by using a hand-tagged reference corpus, the tags for all the other items in a cluster can be assumed equal to the known items.",
                    "sid": 120,
                    "ssid": 120,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The passive voice is used almost exclusively in the corpus, with some use of the editorial &quot;We&quot;.",
                    "sid": 121,
                    "ssid": 121,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This results in a profusion of participles such as &quot;detected&quot;, &quot;sequenced&quot; and &quot;identified&quot;.",
                    "sid": 122,
                    "ssid": 122,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But such -ed forms can also be simple past tense forms or adjectives.",
                    "sid": 123,
                    "ssid": 123,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In addition, we identified their use in a postmodifying participle clause such as, &quot;... the value ~ from this measurement.&quot; Each one of the 88 instances of &quot;cloned&quot; and the 50 instances of &quot;deduced&quot; was hand tagged and given a unique ID. Then clustering was applied to the resulting collection, giving the result shown in Figure 2A.",
                    "sid": 124,
                    "ssid": 124,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Experiments #2 and #3 took about 15 minutes each to run.",
                    "sid": 125,
                    "ssid": 125,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The resultant clusters are somewhat complex.",
                    "sid": 126,
                    "ssid": 126,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There are four tags and we have shown the top four clusters, but two of the clusters contain adjectives exclusively.",
                    "sid": 127,
                    "ssid": 127,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The past participle and postmodifier occur together in the same cluster.",
                    "sid": 128,
                    "ssid": 128,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(We studied the children of cluster 4, hoping to find better separation, but they are no better.",
                    "sid": 129,
                    "ssid": 129,
                    "kind_of_tag": "s"
                },
                {
                    "text": ") The scoring metric we chose was to associate each cluster with the items that were in the majority in the node and score all other items as errors.",
                    "sid": 130,
                    "ssid": 130,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is a good approximation to a situation in which a &quot;gold standard&quot; is available to classify the clusters by independent means, such as comparing the clusters to items from a pretagged reference corpus.",
                    "sid": 131,
                    "ssid": 131,
                    "kind_of_tag": "s"
                },
                {
                    "text": "122 ,I 2 I i ] ,,VBO] ° JI JJ = Adjective VBD = Verb, past tense VBN : Verb, past participle VBNP = Participle in postmodifying clause 46 VBN.",
                    "sid": 132,
                    "ssid": 132,
                    "kind_of_tag": "s"
                },
                {
                    "text": "13 VBNP.",
                    "sid": 133,
                    "ssid": 133,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 VBD.",
                    "sid": 134,
                    "ssid": 134,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 JJ.",
                    "sid": 135,
                    "ssid": 135,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2A.",
                    "sid": 136,
                    "ssid": 136,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clustering of 88 occurrence of&quot;cloned&quot; and 50 occurrences of&quot;deduced&quot; into four syntactic categories.",
                    "sid": 137,
                    "ssid": 137,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The abbreviations, such as &quot;JJ&quot;, are based on (Francis & Kucera, 1982).",
                    "sid": 138,
                    "ssid": 138,
                    "kind_of_tag": "s"
                },
                {
                    "text": "There is a strong admixture of adjectives in cluster 2 and all the postmodifiers are confounded with the past participles in cluster 4.",
                    "sid": 139,
                    "ssid": 139,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The total number of errors (minority classes in a cluster) is 23 for a success rate of(13823)/138 = 83%.",
                    "sid": 140,
                    "ssid": 140,
                    "kind_of_tag": "s"
                },
                {
                    "text": "All minority m e m b e r s of a cluster are counted as errors.",
                    "sid": 141,
                    "ssid": 141,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This leads to the 83% error rate quoted in the figure caption.",
                    "sid": 142,
                    "ssid": 142,
                    "kind_of_tag": "s"
                },
                {
                    "text": "o f a base word a n d a s e q u e n c e o f expansion words.",
                    "sid": 143,
                    "ssid": 143,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The results shown in Figure 2 A can be improved as follows.",
                    "sid": 144,
                    "ssid": 144,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Because we are dealing with single occurrences, only one element, or possibly zero, in each of the four context word vectors is filled, with frequency 1.",
                    "sid": 145,
                    "ssid": 145,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The other 149 elements have frequency (and mutual information) 0.0.",
                    "sid": 146,
                    "ssid": 146,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These sparse vectors will therefore have littleor no overlap with vectors from other occurrences.",
                    "sid": 147,
                    "ssid": 147,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In order to try to improve the classification, we expanded the context values in an effort to produce more overlap, using the following strategy: W e proceed as ifthe corpus is far larger so that in addition to the actual context words already seen, there are m a n y occurrences of highly similar words in the same positions.",
                    "sid": 148,
                    "ssid": 148,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For each nonzero context in each set of 150, we expand it to an ordered class of similar words in the 150, picking words above a fixed similarity threshold (0.3 for the experiments reported here).",
                    "sid": 149,
                    "ssid": 149,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Such a class is called a simset, made up As an example of the expansion of context words via simsets, suppose that the occurrence of the frequency 1 word &quot;cheAcheB&quot; is immediately preceded by &quot;few&quot; and the occurrence of the frequency 1 word &quot;CheA/CheB&quot; is immediately preceded by &quot;less&quot;.",
                    "sid": 150,
                    "ssid": 150,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The -I C context vectors for each will have l's in different positions so there will be no overlap between them.",
                    "sid": 151,
                    "ssid": 151,
                    "kind_of_tag": "s"
                },
                {
                    "text": "If we expanded &quot;few&quot; into a large enough simset, the set would eventually contain, &quot;less&quot;, and vice-versa.",
                    "sid": 152,
                    "ssid": 152,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Barring that, each simset might contain a distinct c o m m o n word such as &quot;decreased&quot;.",
                    "sid": 153,
                    "ssid": 153,
                    "kind_of_tag": "s"
                },
                {
                    "text": "In either case, there would n o w be some overlap in the context vectors so that the similar use of &quot;cheAcheB&quot; and &quot;CheA/CheB&quot; could be detected.",
                    "sid": 154,
                    "ssid": 154,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The apparent frequency of each expansion word is based on its corpus frequency relative to the corpus frequency of the word being expanded.",
                    "sid": 155,
                    "ssid": 155,
                    "kind_of_tag": "s"
                },
                {
                    "text": "To expand a single context word instance ci appearing with frequency fik in the context of 1 or more occurrences of center word wk, choose all cj such that cj e {set of high-frequency context words} and the 123 I similarity S(ci,cj)_>St, a threshold value.",
                    "sid": 156,
                    "ssid": 156,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Set the apparent frequency of each expansion word cj to fjk = S(ci,cj)xfikx fj / fi , where fi and fj are the corpus frequencies of ci and cj.",
                    "sid": 157,
                    "ssid": 157,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Normalize the total frequency of the context word plus the apparent frequencies of the expansion words to fik.",
                    "sid": 158,
                    "ssid": 158,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For the example being discussed here, fik = 1, St=0.3 and the average number of expansion words was 6.",
                    "sid": 159,
                    "ssid": 159,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Recomputing the classification of the -ed forms with the expanded context words results in the improved classification shown in Figure 2B.",
                    "sid": 160,
                    "ssid": 160,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The number of classification errors is halved, yielding a success rate of 92%.",
                    "sid": 161,
                    "ssid": 161,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This is comparable in performance to many stochastic tagging algorithms.",
                    "sid": 162,
                    "ssid": 162,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Discussion o f Experiment #2This analysis is very similar to part-of speech tagging.",
                    "sid": 163,
                    "ssid": 163,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The simsets of only 6 items are far smaller than the part-of-speech categories conventionally used.",
                    "sid": 164,
                    "ssid": 164,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But since we use high frequency words, they represent a substantial portion of the instances.",
                    "sid": 165,
                    "ssid": 165,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Also, they have higher specificity than, say, Verb.",
                    "sid": 166,
                    "ssid": 166,
                    "kind_of_tag": "s"
                },
                {
                    "text": "M a n y taggers work sequentially and depend on the left context.",
                    "sid": 167,
                    "ssid": 167,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But some words are best 11 1 VBNP.",
                    "sid": 168,
                    "ssid": 168,
                    "kind_of_tag": "s"
                },
                {
                    "text": "I 124 classified by their right context.",
                    "sid": 169,
                    "ssid": 169,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We supply both.",
                    "sid": 170,
                    "ssid": 170,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clearly this small experiment did not reach the accuracy of the very best taggers, b u t it performed well.",
                    "sid": 171,
                    "ssid": 171,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This experiment has major ramifications for the future.",
                    "sid": 172,
                    "ssid": 172,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The initial classifications found merged all identical word forms together, both as targets and contexts.",
                    "sid": 173,
                    "ssid": 173,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But disambiguation techniques such as those in Experiment #2 can be used to differentially t a g word occurrences with some degree of accuracy.",
                    "sid": 174,
                    "ssid": 174,
                    "kind_of_tag": "s"
                },
                {
                    "text": "These newly classified items can in turn be used as new target and context items (if their frequencies are adequate) and the analysis can be repeated.",
                    "sid": 175,
                    "ssid": 175,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Iterating the method in this way should be able to refine the classes until a fixed point is reached at which no further improvement in classification occurs.",
                    "sid": 176,
                    "ssid": 176,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The major challenge in using this approach will be to keep it computationally tractable.",
                    "sid": 177,
                    "ssid": 177,
                    "kind_of_tag": "s"
                },
                {
                    "text": "This approach is similar in spirit to the iterative computational approaches of the Hidden Markov Models (Kupiec, 1989; Kupiec, 1992; Rabiner, 1989), though our zeroth order solution begins quite close to the desired result, so it should converge very close to a global optimum.",
                    "sid": 178,
                    "ssid": 178,
                    "kind_of_tag": "s"
                },
                {
                    "text": "l l VBNP 4 JJ.",
                    "sid": 179,
                    "ssid": 179,
                    "kind_of_tag": "s"
                },
                {
                    "text": "31 'I 9 VBD 46 VBN.",
                    "sid": 180,
                    "ssid": 180,
                    "kind_of_tag": "s"
                },
                {
                    "text": "3 JJ 1 JJ.",
                    "sid": 181,
                    "ssid": 181,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 VBD.",
                    "sid": 182,
                    "ssid": 182,
                    "kind_of_tag": "s"
                },
                {
                    "text": "1 VBNP.",
                    "sid": 183,
                    "ssid": 183,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Figure 2B.",
                    "sid": 184,
                    "ssid": 184,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Clustering of&quot;cloned&quot; and &quot;deduced&quot; after expansion of the context words.",
                    "sid": 185,
                    "ssid": 185,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The postmodifying form, not isolated before, is fairlywell isolated in its own subclass.",
                    "sid": 186,
                    "ssid": 186,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The total number of errors is reduced from 23 to 11, for a success rate of 92%.",
                    "sid": 187,
                    "ssid": 187,
                    "kind_of_tag": "s"
                },
                {
                    "text": "21 EXPERIMENT #3: CLASSIFICATION OF SINGLE WORD OCCURRENCES When classifying multiple instances of a single word form as we did in Experiment #2, there are numerous collocations that aid the classification.",
                    "sid": 188,
                    "ssid": 188,
                    "kind_of_tag": "s"
                },
                {
                    "text": "For example, 16 of the 50 occurrences of the word &quot;deduced&quot; occur in the phrase, &quot;of the ~ amino acid sequence&quot;.",
                    "sid": 189,
                    "ssid": 189,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But with words of frequency 1, we cannot rely on such similarities.",
                    "sid": 190,
                    "ssid": 190,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Nevertheless, we experimented with classifying 100 words of corpus f r e q u e n c y 1 with and w i t h o u t expanding the context words.",
                    "sid": 191,
                    "ssid": 191,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Though hand scoring the results is difficult, we estimate t h a t there were 8 reasonable pairs found initially and 26 pairs when expansion was used.",
                    "sid": 192,
                    "ssid": 192,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Examples of words t h a t paired well without expansion are &quot;overlaps&quot; and &quot;flank&quot; (due to a preceding &quot;which&quot;) and &quot;malB&quot; and &quot;cheAcheB&quot; (due to the context &quot;...the [malB, cheAcheB] region...&quot;).",
                    "sid": 193,
                    "ssid": 193,
                    "kind_of_tag": "s"
                },
                {
                    "text": "A f t e r expansion, pairs such as &quot;setting&quot;, &quot;resetting&quot; appeared (due in part to the expansion of the preceding &quot;as&quot; and &quot;to&quot; context words into simsets which both included &quot;with&quot;, &quot;in&quot; and &quot;by&quot;).",
                    "sid": 194,
                    "ssid": 194,
                    "kind_of_tag": "s"
                },
                {
                    "text": "D i s c u s s i o n of E x p e r i m e n t #3.",
                    "sid": 195,
                    "ssid": 195,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The amount of information available about frequency 1 words can vary from a lot to nothing at all, and most frequently tends to the latter, viz., &quot;John and Mary looked at the blork.&quot; N e v e r t h e l e s s , such words are prominent, 44% of our corpus' vocabulary.",
                    "sid": 196,
                    "ssid": 196,
                    "kind_of_tag": "s"
                },
                {
                    "text": "About half Of them are nontechnical and can therefore be analyzed from other corpora or online dictionaries.",
                    "sid": 197,
                    "ssid": 197,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Word morphology and Latinate morphology in particular, can be helpful.",
                    "sid": 198,
                    "ssid": 198,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Online chemical d a t a b a s e s , s u p p l e m e n t e d with rules for chemical nomenclature will clarify additional items, e . g . , &quot; 2 - e p o x y p r o p y l p h o s p h o n i c &quot; or &quot;phosphoglucomutasedeflcient&quot;.",
                    "sid": 199,
                    "ssid": 199,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Furthermore, there are naming conventions for genetic strains and m u t a n t s which aid recognition.",
                    "sid": 200,
                    "ssid": 200,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The combination of all these methods should lead to a reasonable accuracy in the classification of frequency 1 words.",
                    "sid": 201,
                    "ssid": 201,
                    "kind_of_tag": "s"
                },
                {
                    "text": "FURTHER DISCUSSION AND FUTURE DIRECTIONS Our corpus of 220,000 words is much smaller than ones of 40 million words (Finch & Chater, 1992) and certainly of 360 million (Brown, Della Pietra, deSousa, Lai & Mercer, 1992).",
                    "sid": 202,
                    "ssid": 202,
                    "kind_of_tag": "s"
                },
                {
                    "text": "But judging by the results we have presented, especially for the full 1,000 word clustering, our corpus appears to make up in specificity for what it lacks in size.",
                    "sid": 203,
                    "ssid": 203,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Extending this work beyond abstracts to full papers will be challenging because our corpus requires SGML markup to deal with Greek characters, superscripts and subscripts, etc.",
                    "sid": 204,
                    "ssid": 204,
                    "kind_of_tag": "s"
                },
                {
                    "text": "(Futrelle, Dunn, Ellis & Pescitelli, 1991).",
                    "sid": 205,
                    "ssid": 205,
                    "kind_of_tag": "s"
                },
                {
                    "text": "We have over 500,000 words from the bacterial chemotaxis research papers carefully marked up by hand in this way.",
                    "sid": 206,
                    "ssid": 206,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The characterization of context can obviously be e x t e n d e d to more context positions or words, and extensions of our w o r d - r o o t e d e x p a n s i o n t e c h n i q u e s are potentially very powerful, combining broad coverage with specificity in a &quot;tunable&quot; way.",
                    "sid": 207,
                    "ssid": 207,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Morphology can be added to the context vectors by using the ingenious suggestion of Brill to collect high-frequency tri-letter word endings (Brill & Marcus, 1992).",
                    "sid": 208,
                    "ssid": 208,
                    "kind_of_tag": "s"
                },
                {
                    "text": "One of the more subtle problems of the context specification is that it uses summed frequencies, so it may fail to retain important correlations.",
                    "sid": 209,
                    "ssid": 209,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Thus if only AB or CD sequences occurred, or only AD or CB sequences, they would lead to the same (summed) context vector.",
                    "sid": 210,
                    "ssid": 210,
                    "kind_of_tag": "s"
                },
                {
                    "text": "The only correlations faithfully retained are those with the target word.",
                    "sid": 211,
                    "ssid": 211,
                    "kind_of_tag": "s"
                },
                {
                    "text": "Characterizing context n-grams could help work around this problem, b u t is a nontrivial task.",
                    "sid": 212,
                    "ssid": 212,
                    "kind_of_tag": "s"
                }
            ]
        }
    ]
}